{"name":"International Conference on Environmental Science and Technology","series":"","short":"","website":"http://cest.gnest.org","content":"View(active tab) Edit Track Manage Assignments Decision Management Devel 14th International Conference on Environmental Science and Technology CEST2015, 3-5 September 2015, Rhodes, Greece Call for abstracts deadline has been extended to 10 January, 2015 Organised by: Global Network on Environmental Science and Technology (Global NEST) and University of the Aegean: Dept of Mathematics and Dept. of Environment The International Conference on Environmental Science and Technology is one of the worldwide leading environmental conferences. This biennial conference brings together engineers, scientists, researchers, students, managers and other professionals in order to address and discuss emerging environmental issues. The conference is supported by the multi-disciplinary Global NEST (Network of Environmental Science and Technology); an international scientific movement that has been successfully developing for the last 24 years with members from more than 60 countries. Global NEST is an international scientific movement focusing on innovative environmental issues. The success of this conference reflects the critical environmental topics that are discussed as well as the quality of the presented papers. All the papers that are selected for either oral or poster presentation undergo a review process. As a result of the improving quality of the papers in previous conferences, their proceedings have been included in databases, such as Science Citation Index (ISI) and SRCosmos. The following is a selection of topics for which the Scientific and Programme Committee is particularly seeking contributions. However, contributions for any topic in the field of Environmental Science and Technology will be considered. Advanced oxidation processes Air pollution Biomonitoring Clean energy and sustainability Climate change Corporate responsibility Dams and the environment Ecology and ecosystem management Emerging pollutants Environmental data analysis and modelling Environmental planning, management and policies for cities and regions Hydrology and water resources management Island Challenges - IWIC '15 Marine environment and coastal management Odour management Public health and the environment Soil contamination and remediation Solid waste management Sustainable tourism and the environment Water and energy footprint Water and wastewater management","date_start":"2015-09-05","date_end":"2015-09-07","important_dates":{"abstract":"","full":"2015-01-10","notification":"","final":""},"topics":["Life Sciences","Ecology","Water & Waste Treatment Reuse"],"location":{"virtual":"","full":["Rhodes","Greece"],"name":"","street":"","city":"Rhodes","state":"","ZIP":"","country":"Greece"},"organizers":["Global NEST"],"societies":[],"indexes":[],"emails":[]}