{"name":"2nd Annual Genetics in Forensics Congress","series":"","short":"","website":"http://www.forensicgenetics-congress.com/download-agenda","content":"Over 200 delegates representing internationally renowned research & academic institutions, forensic laboratories, government bodies and sequencing solution providers will be present. Over 40 case studies and presentations focused on future applications of next generation sequencing in forensics, DNA database construction, advances is tools and technologies for DNA profiling, DNA phenotyping and forensic anthropology case studies will be discussed Including four interactive streams: • Updates in Utilising NGS in Forensic Science • Interpretation, Database and Casework Hurdles: Overcoming Key Challenges in Forensic Genetics Research • Analysing Forensic Applications of DNA markers • Forensic Anthropology Case Studies 14 pre-scheduled one to one meetings, exhibition and informal networking opportunities Oxford Global Conferences are proud to present our highly anticipated 2nd Annual Genetics in Forensics Congress, taking place on the 14th and 15th of March 2017, London, UK. The conference programme consists of world-class keynote addresses, academic led presentations, as well as ample networking opportunities, creating an interactive platform for high-level scientific and business discussions. The forensics market is experiencing significant growth due to the advances in forensic technologies and increasing sophistication in criminal investigations. It has been reported that the forensic technologies and service market in the United States alone, is estimated to reach US$20.8 billion by 2020\\. At this conference, attendees will have the opportunity to hear the most exciting developments in this field throughout all processes, from the crime scene to court room. On day one of the conference, we will discuss state-of-the-art technologies for NGS and DNA profiling including STR, SNP and mtDNA profiling. The presentations will provide an in depth look into advances in next generation sequencing technologies and exploring various different platforms. Additionally, the conference will examine the use of NGS in exploring microRNA markers for body fluid identification which is an increasingly exciting and rapidly evolving field. DNA database construction, management and storage are other hot topic areas of debate, raising many concerns about possible violations of privacy and ethical considerations which this conference will explore. Day two of the congress will focus on forensic application of DNA markers including non-human DNA typing and dealing with degraded DNA samples. 2017’s event features one exciting new stream, focusing on forensic anthropology case studies. Our highly acknowledged speakers will be exploring key areas such as recovery and identification of human remains, genetic analysis, and estimation of age, gender and ancestral original, along with exciting presentations covering virtual forensic anthropology. For more information contact: g.alonso@oxfordglobal.co.uk","date_start":"2017-03-14","date_end":"2017-03-15","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Life Sciences","Other","Biological Engineering & bioinformatics"],"location":{"virtual":"","full":["london","United Kingdom"],"name":"","street":"","city":"london","state":"","ZIP":"","country":"United Kingdom"},"organizers":[""],"societies":[],"indexes":[],"emails":["g.alonso@oxfordglobal.co.uk"]}