{"name":"8th International Conference on Information Visualization Theory and Applications","series":"","short":"","website":"http://www.ivapp.visigrapp.org","content":"Venue: Porto, Portugal Event Date 27 February – 1 March, 2017 Regular Papers Paper Submission: September 22, 2016 Authors Notification: November 16, 2016 Camera Ready and Registration: December 5, 2016 Position Papers Paper Submission: November 3, 2016 Authors Notification: December 12, 2016 Camera Ready and Registration: December 22, 2016 Workshops Workshop Proposal: October 28, 2016 Special Sessions Special Session Proposal: November 16, 2016 Tutorials, Demos and Panels Proposals: December 22, 2016 Scope: The International Conference on Information Visualization Theory and Applications aims at becoming a major point of contact between researchers, engineers and practitioners in Information Visualization. The conference will be structured along several topics related to Information Visualization. IVAPP is part of VISIGRAPP, the 12th International Joint Conference on Computer Vision, Imaging and Computer Graphics Theory and Applications. Registration to IVAPP allows free access to all other VISIGRAPP conferences. CONFERENCE AREAS: Each of these topic areas is expanded below but the sub-topics list is not exhaustive. Papers may address one or more of the listed sub-topics, although authors should not feel limited by them. Unlisted but related sub-topics are also acceptable, provided they fit in one of the following main topic areas: 1\\. ABSTRACT DATA VISUALIZATION 2\\. GENERAL DATA VISUALIZATION 3\\. SPATIAL DATA VISUALIZATION AREA 1: ABSTRACT DATA VISUALIZATION - Visual Data Analysis and Knowledge Discovery - Visual Representation and Interaction - Data Management and Knowledge Representation - Mathematical Foundations of Interactive Visual Analysis - Display and Interaction Technology - Databases and visualization, Visual Data Mining - Graph Visualization - Interface and Interaction Techniques for Visualization - Internet, Web and Security Visualization - Software Visualization - Information Visualization - Visual Analytical Reasoning - Hardware-Assisted Visualization - High-dimensional Data and Dimensionality Reduction - Text and Document Visualization AREA 2: GENERAL DATA VISUALIZATION - Interactive Visual Interfaces for Visualization - Interpretation and Evaluation Methods - Knowledge-assisted Visualization - Large Data Visualization - Perception and Cognition in Visualization - Visualization Applications - Visualization Taxonomies and Models - Visualization Algorithms and Technologies - Visualization Tools and Systems for Simulation and Modeling - Time-dependent Visualization - Usability Studies and Visualization - Glyph-based Visualization - Collaborative Visualization - Coordinated and Multiple Views AREA 3: SPATIAL DATA VISUALIZATION - Biomedical Visualization and Applications - Flow Visualization - GPU-based Visualization - Image/Video Summarization and Visualization - Multi-field Visualization - Parallel Visualization - Uncertainty Visualization - Vector/Tensor Field Visualization - Virtual Environments and Data Visualization - Volume Visualization - Scientific Visualization KEYNOTE LECTURES IVAPP 2017 will have several invited keynote speakers, who are internationally recognized experts in their areas. Their names are not yet confirmed. CONFERENCE CHAIR Jose Braz, Escola Superior de Tecnologia de Setúbal, Portugal PROGRAM CO-CHAIRS Lars Linsen, Jacobs University, Bremen, Germany Alexandru Telea, University of Groningen, Netherlands PROGRAM COMMITTEE http://www.ivapp.visigrapp.org/ProgramCommittee.aspx IVAPP Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setúbal - Portugal Tel: +351 265 520 184 Fax: +351 265 520 186 e-mail: ivapp.secretariat@insticc.org Web: http://www.ivapp.visigrapp.org/","date_start":"2017-02-27","date_end":"2017-03-01","important_dates":{"abstract":"","full":"2016-09-22","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["ivapp.secretariat@insticc.org"]}