{"name":"International Conference on","series":"","short":"","website":"http://www.grfdt.com","content":"International Conference Global Migration: Rethinking Skills, Knowledge and Culture 26-27 November 2016 Organised by Global Research Forum on Diaspora and Transnationalism, New Delhi Globalization has brought about a new paradigm where socio-cultural, political, and economic landscapes get exposed to unexpected dynamics of challenges and change. It thus becomes a matter of both challenge and opportunity for the home and host countries. On the one hand, the economic changes over the past hundred years that includes close integration, opening of trade, ideas and information, have resulted in benefitting the industrially developed economies. On the other hand, for the developing economies, the challenges remain though of different level and kind. However, the changed circumstances globally also bring along opportunities for these states to help them overcome the challenges.The increased movement of people has resulted in theglobal development of new ideas, intercultural linkages, democratisation of global space etc. In this scenario, diaspora has emerged as an important player in the transnational sphere for both thehome and host countries. The actual process of engaging diaspora in the development process remains a challenge for the home countries. Policies result from a complex interplay of local and global conditions, including the role of lobby groups, socio-economic and political conditions of the country, level of institutional development, technological progress. This engagement process is also mediated by the social and cultural identities of the diaspora that are not just diverse but also contested. The challenge faced by the developing countries in this regard is very different from that of the industrially advanced states. About the Conference The conference will bring together scholars from diverse fields such as academic, civil society and policy from different countries. The conference intends to provide comparative perspectives in diaspora engagement. The papers will be published in a book by an international publisher. The conference will have more wider reach and try to represent as many countries possible so that both macro and micro perspectives and diversities of issues will be covered. There are several countries actively engaged in policies and working on a new paradigm of global engagement to tap resources in the globalised world ever increasing human mobility.The conference is conceived to address these issues, both conceptual as well as applied areas so as to give a wholistic approach to understand the issue. Guidelines for Submission of Abstracts All participants are required to submit a written abstract in .doc/x formats. Format: 1 inch margin, 1.5 line spacing, Times New Roman, 12 font File name: YOURNAME\\_INSTITUTION The document must contain; a) author(s), b) affiliation as you would like it to appear in programme, c) email address, d) Abstract e) up to 10 keywords. All abstracts will be peer reviewed and selected papers will be invited for final paper presentation. Please use plain text (Times Roman 12) and abstain from using footnotes and any special formatting, characters or emphasis (such as bold, italics or underline). If you do not receive a reply from us in a week you please send an query Abstracts or requests for further information should be sent to: internationalconference@grfdt.com Last date for Receiving Abstract: 30 June 2016","date_start":"2016-11-26","date_end":"2016-11-27","important_dates":{"abstract":"","full":"2016-06-30","notification":"","final":""},"topics":["Social Sciences","Sociology"],"location":{"virtual":"","full":["Delhi","India"],"name":"","street":"","city":"Delhi","state":"","ZIP":"","country":"India"},"organizers":["Global Research Forum on Diaspora and Transnationalism"],"societies":[],"indexes":[],"emails":["internationalconference@grfdt.com"]}