{"name":"13th International Conference on Web Information Systems and Technologies – WEBIST 2017","series":"","short":"","website":"http://www.webist.org","content":"Venue: Porto, Portugal Event date: 25 - 27 April, 2017 Regular Papers Paper Submission: November 23, 2016 Authors Notification: January 25, 2017 Camera Ready and Registration: February 8, 2017 Position Papers Paper Submission: January 12, 2017 Authors Notification: February 15, 2017 Camera Ready and Registration: March 1, 2017 Workshops Workshop Proposal: January 5, 2017 Paper Submission: January 19, 2017 Authors Notification: February 6, 2017 Camera Ready and Registration: February 20, 2017 Doctoral Consortium Paper Submission: February 21, 2017 Authors Notification: March 7, 2017 Camera Ready and Registration: March 17, 2017 Special Sessions Special Session Proposal: January 23, 2017 Tutorials, Demos and Panels Proposals: February 24, 2017 Open Communications Paper Submission: February 21, 2017 Authors Notification: March 7, 2017 Camera Ready and Registration: March 17, 2017 Scope: The purpose of the 13th International Conference on Web Information Systems and Technologies (WEBIST) is to bring together researchers, engineers and practitioners interested in the technological advances and business applications of web-based information systems. The conference has five main tracks, covering different aspects of Web Information Systems, namely Internet Technology, Web Interfaces and Applications, Society, e-Communities, e-Business, Web Intelligence and Mobile Information Systems. WEBIST 2017 will be held in conjunction with GISTAM 2017 and ICEIS 2017\\. Registration to WEBIST allows free access to the GISTAM and ICEIS conferences (as a non-speaker). Conference Areas: Each of these topic areas is expanded below but the sub-topics list is not exhaustive. Papers may address one or more of the listed sub-topics, although authors should not feel limited by them. Unlisted but related sub-topics are also acceptable, provided they fit in one of the following main topic areas: 1\\. INTERNET TECHNOLOGY 2\\. WEB INTERFACES 3\\. SERVICE BASED INFORMATION SYSTEMS 4\\. WEB INTELLIGENCE 5\\. MOBILE INFORMATION SYSTEMS AREA 1: INTERNET TECHNOLOGY - Distributed and Parallel Applications - Protocols and Standards - System Integration - Web Programming - Web Security and Privacy - Web Services and Web Engineering - XML and Data Management - Big Data Technologies and Applications - Searching and Browsing - Metrics and Performance - Web Tools and Languages - New Trends in Internet Technology - Application, Research project and Internet Technology AREA 2: WEB INTERFACES - Multimedia and User Interfaces - Personalized Web Sites and Services - Design of Web Interface - Web Interface and Adaptability according to context and/or profile - Web Interface and risk management - Web interface and formal languages - Usability and Ergonomics - User Modeling, Web Interface Modelling - Web Interface Requirements and Projects - Web Interface and Indicators, KPI - Web Interface, Web Intelligence, Big data - New trends in Web Interfaces - Web Interfaces and Applications AREA 3: SERVICE BASED INFORMATION SYSTEMS - B2B, B2C and C2C - Business Knowledge Management - Ethical and Legal Issues - Social Media Analytics - Social Networks and Organizational Culture - Web 2.0 and Social Networking Controls - Human Factors and Social Issues - Web-based Business Processes - Communities of Interest and Practice - Society, e-Business and e-Government - EA, SOA, services in TOGAF, interoperability - Services with Methodological Approaches, Quality, Metrics, BAM - Change management, Performance Improvement, Architecture Migration to SOA via Cloud Computing - Risk management and Service based IS - Web based Integration Technologies, Web Services, REST and CRUD services - Information Systems and SaaS, IaaS, PaaS, Cloud Computing - Adaptability and dynamic reconfiguration including Web based technologies - New Advances in Service based Technologies - Application, Research project and Service Based IS AREA 4: WEB INTELLIGENCE - Collective Intelligence - Computational Intelligence on the Web - Ontology Discovering, Modelling, Retrieving and the Semantic Web - New trends in Ontology management and the Semantic Web - Context, Adaptability and Web Intelligence - Social Web Intelligence - Semantic Web and BPM - Data Web Mining - Linked Data, Big Data - Cloud with Web Intelligence and Big data - Opinion Mining and Sentiment Analysis - Privacy, Confidentiality and Trust for Web Intelligence - Recommendation Systems - User-Centric Systems - Web Information Filtering and Retrieval - Web Intelligence and Agent Based Systems - New trends in Web Intelligence - Applications, Research Projects and Web Intelligence AREA 5: MOBILE INFORMATION SYSTEMS - App Development Methods - Context Awareness - Mobile APIs and Services - Mobile Commerce - Mobile Learning - Mobile Navigation and Assistance - Mobile Social Network Interaction - Interoperability - Mobile Web - Human Computer Interaction - Social and Mobile Information Systems - New trends in Mobile Information Systems - Application of Mobile Information Systems KEYNOTE SPEAKERS WEBIST 2017 will have several invited keynote speakers, who are internationally recognized experts in their areas. Their names are not yet confirmed. CONFERENCE CO-CHAIRS Karl-Heinz Krempels, RWTH Aachen University, Germany Valérie Monfort, LAMIH Valenciennes UMR CNRS 8201, France PROGRAM CO-CHAIRS Tim A. Majchrzak, University of Agder, Norway Paolo Traverso, Center for Information Technology - IRST (FBK-ICT), Italy WORKSHOPS CO-CHAIRS Julián Alberto García García, Web Engineering and Early Testing (IWT2, Ingeniería Web y Testing Temprano), Spain Laura García Borgoñon, ITAINNOVA Aragon Institute of Technology, Spain Francisco José Domínguez Mayo, University of Seville, Spain PROGRAM COMMITTEE http://www.webist.org/ProgramCommittee.aspx WEBIST Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setúbal – Portugal Tel: +351 265 520 185 Fax: +351 265 520 186 e-mail: webist.secretariat@insticc.org Web: http://www.webist.org/","date_start":"2017-04-25","date_end":"2017-04-27","important_dates":{"abstract":"","full":"2016-11-23","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["webist.secretariat@insticc.org"]}