{"name":"Marketing Automation","series":"","short":"","website":"https://www.ama.org/events-training/Training/Pages/Marketing-Automation---2016---Philadelphia,-PA.aspx","content":"Streamline and automate marketing tasks related to email, social media and other website actions to drive measurable bottom line results. If you don’t manage your adoption of marketing automation, it will manage you. Learn how to develop your own marketing automation strategy and automate your professional success. 10 Questions This Session Will Answer What are the foundational components of marketing automation? How can marketing automation make my job easier? How do I build a RFP for marketing automation? How do I quantify marketing automation success? What are the common pitfalls to avoid when rolling out a marketing automation plan? How do I staff for marketing automation? How will my problem statements change? How does marketing automation differ from B2B to B2C? How do I mitigate the risks surrounding marketing automation while being a change agent in my organization? How do I prepare my team for the cultural shift toward marketing automation?​ 5 Must-ask Questions When Hiring a Marketing Automation Pro ​ Recent Attendees Said “Our speaker, Maneeza, was absolutely fantastic. She was an extremely dynamic speaker - very knowledgeable, engaging, friendly, etc. The course allowed a better insight into the importance of marketing automation in the digital landscape of today and the future. Great course!” \"I would HIGHLY recommend this to anyone who wants to use marketing automation or has started to use automation.\" \"The instructor's credentials, personality, teaching methods; great exercises and discussion, along with the amazing group of attendees were what I liked most about the program.\"​ PRESENTER Maneeza Aminy, CEO of Marvel Marketers, will be leading this session. As an expert marketing automation and strategy consultant, she has worked with 250+ brands personally, including Google, RingCentral and Extreme Networks. Maneeza is also an adjunct professor of economics and has worked with SAAS and CRM for most of her career. While this session is designed for marketers in the first six months of adoption of ANY marketing automation platform, many executives, managers and business owners of current, mature adoptions will relate to one or more of these considerations. Join us to share winning or challenging strategies, and check out our resources, as well. - See more at: https://www.ama.org/events-training/Training/Pages/Marketing-Automation---2016---Philadelphia,-PA.aspx#sthash.roJT2i8m.dpuf","date_start":"2016-07-07","date_end":"2016-07-08","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Marketing/Social-Networking","Marketing & advertising"],"location":{"virtual":"","full":["Philadelphia","Pennsylvania","United States"],"name":"","street":"","city":"Philadelphia","state":"Pennsylvania","ZIP":"","country":"United States"},"organizers":["American Marketing Association"],"societies":[],"indexes":[],"emails":[]}