{"name":"3rd International Conference on Information and Communication Technologies for Ageing Well and e-Health – ICT4AWE 2017","series":"","short":"","website":"http://www.ict4ageingwell.org","content":"Venue: Porto, Portugal Event date: 28 - 29 April, 2017 Regular Papers Paper Submission: November 28, 2016 Authors Notification: January 30, 2017 Camera Ready and Registration: February 13, 2017 Position Papers Paper Submission: January 17, 2017 Authors Notification: February 20, 2017 Camera Ready and Registration: March 6, 2017 Workshops Workshop Proposal: January 10, 2017 Doctoral Consortium Paper Submission: February 24, 2017 Authors Notification: March 10, 2017 Camera Ready and Registration: March 22, 2017 Special Sessions Special Session Proposal: January 26, 2017 Tutorials, Demos and Panels Proposals: March 2, 2017 Open Communicationss Paper Submission: February 24, 2017 Authors Notification: March 10, 2017 Camera Ready and Registration: March 22, 2017 Scope: The International Conference on Information and Communication Technologies for Ageing Well and e-Health aims to be a meeting point for those that study and apply information and communication technologies for improving the quality of life of the elderly and for helping people stay healthy, independent and active at work or in their community along their whole life. ICT4AWE facilitates the exchange of information and dissemination of best practices, innovation and technical improvements in the fields of age-related health care, education, social coordination and ambient assisted living. From e-Health to intelligent systems, and ICT devices, this will be a point of interest for all those that work in research and development and in companies involved in promoting the well-being of aged people, by providing room for industrial presentations, demos and project descriptions. CONFERENCE AREAS: Each of these topic areas is expanded below but the sub-topics list is not exhaustive. Papers may address one or more of the listed sub-topics, although authors should not feel limited by them. Unlisted but related sub-topics are also acceptable, provided they fit in one of the following main topic areas: 1\\. AMBIENT ASSISTED LIVING 2\\. TELEMEDICINE AND E-HEALTH 3\\. MONITORING, ACCESSIBILITY AND HCI 4\\. INDEPENDENT LIVING AREA 1: AMBIENT ASSISTED LIVING - Ambient Intelligence - Smart Environments and Housing - Ubiquitous Computing - Multi-modal Interaction - Mobile Systems for AAL - Agent-based Interfaces - Knowledge Systems and Ontologies - Context Awareness and Adaptation - Collaboration Systems for AAL - Case Studies for AAL - Vital Signs and Wireless Body Networks - Cognitive Stimulation - Internet of Things for AAL AREA 2: TELEMEDICINE AND E-HEALTH - Electronic Health Records - Home Care Monitoring Systems - Mobile Collaboration Technologies - e-Health and Education - Interoperability and System Integration - Security and Privacy in e-Health - Data Analytics and Health - Decision Support Systems - Tele-Rehabilitation - Management of Telemedicine - Systems to Encourage Healthy Lifestyles - Case Studies in e-Health - Business Models for Telemedicine and e-Health - Diagnostic Support - Open Data and Health Information - Emergency and Alerts Handling AREA 3: MONITORING, ACCESSIBILITY AND HCI - Remote Monitoring - Systems Usability - Mobile Health Monitoring - Personalized Interfaces - Speech and Tactile Interfaces - Assistive Technology and Adaptive Systems - Web Content Accessibility - Pervasive Technologies - Wearable Technologies - Motion Detection - Virtual and Augmented Reality - Inclusive Design - Intelligent Companions - Socially Dependable Systems - Training Cogntive Abilities - Web and Mobile Interaction AREA 4: INDEPENDENT LIVING - Sensor Networks - Mobile Sensing - Smart Devices - Autonomy and Active Ageing - Robots for Eldercare - Signal Processing - Software Development - Robot Companions - Walking Assistive Devices - Service and Social Robotics - Healthcare Robotics - Interacting Robots at Home - Computer Vision - Self-fulfillment and Social Participation - Flexible Occupation and Volunteering - Service e-Marketpaces KEYNOTE SPEAKERS ICT4AWE 2017 will have several invited keynote speakers, who are internationally recognized experts in their areas. Their names are not yet confirmed. CONFERENCE CO-CHAIRS Leszek Maciaszek, Wroclaw University of Economics, Poland and Macquarie University, Sydney, Australia William Molloy, Centre for Gerontology and Rehabilitation, School of Medicine, UCC, Ireland PROGRAM CO-CHAIRS Carsten Röcker, Ostfestfalen-Lippe UAS and Fraunhofer IOSB-INA, Germany John O'Donoghue, Imperial College London, United Kingdom Martina Ziefle, RWTH-Aachen University, Germany LOCAL CHAIR Luis Azevedo, Anditec, Portugal PROGRAM COMMITTEE http://www.ict4ageingwell.org/ProgramCommittee.aspx ICT4AWE Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setúbal – Portugal Tel: +351 265 520 184 Fax: +351 265 520 186 e-mail: ict4ageingwell.secretariat@insticc.org Web: http://www.ict4ageingwell.org","date_start":"2017-04-28","date_end":"2017-04-29","important_dates":{"abstract":"","full":"2016-11-28","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["ict4ageingwell.secretariat@insticc.org"]}