{"name":"5th Annual International Conference on Journalism & Mass Communications (JMComm 2016)","series":"","short":"","website":" http://www.jmcomm.org","content":"\"JOURNALISM, MEDIA AND MASS COMMUNICATION IN THE AGE OF INFORMATION\" Mass media is seen in nearly every facet of our daily lives and technology is constantly altering the way we live. The technology boom that has been felt around the world has forever changed communication as we know it and has greatly impacted our personal and professional lives. Presently, the media as a vehicle of social change influence appearance, language, family, status, politics, and religion. Certain differences exist between information, entertainment, and communication in today's society, particularly in relation to mass media. These various media interactions have converged in our current society in a number of ways and have impacted social relations through the way we communicate with one another. Educational implications require an understanding of the complex world through interdisciplinary scholarship, critical viewing, new values, and an examination of the impact of the mass media. With all the new technology, digital tools and connectivity, one of the most interesting fallouts has been the intensification of social connections… connecting the world as a single place, and creating a greater awareness of opinion, bias, and raw news. The intersection of globalization, communication, and journalism defines an important and growing field of research, particularly concerning the public sphere and spaces for political discourse. Important dates: Extended Full Paper Submission Deadline : 30 June 2016 Final paper (Camera-Ready): 22 July 2016 Early Bird Registration: 29 July 2016 Late Registration Deadline : 19 August 2016 Conference Dates: 10 - 11 October 2016","date_start":"2016-10-10","date_end":"2016-10-11","important_dates":{"abstract":"","full":"2016-06-30","notification":"","final":""},"topics":["Physical Science & Math","Other"],"location":{"virtual":"","full":["Singapore","Singapore"],"name":"","street":"","city":"Singapore","state":"","ZIP":"","country":"Singapore"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}