{"name":"Summer School on Fuzzy Cognitive Maps","series":"","short":"","website":"www.fcmwizard.com/SummerSchool","content":"Summer School on Fuzzy Cognitive Maps Methods, Learning Algorithms and Software Tool for Modeling and Decision Making 4-8 July 2015 (5 days) Organized by Ass. Prof. Elpiniki Papageorgiou Dep. of Computer Science, University of Thessaly Lamia, Greece epapageorgiou@teiste.gr, epapageorg@cs.uth.gr www.epapageorgiou.com Place: City of Volos, DOMOTEL XENIA VOLOS, Greece http://www.domotel.gr/hotel/4/Xenia-Volos?lang=gr Course Title: Fuzzy Cognitive Maps: Methods, Learning Algorithms and Software Tools. Applications on case studies Course Leader: Prof. Elpiniki Papageorgiou, TEI of Central Greece, Lamia Main Lecturers: Dr. Elpiniki Papageorgiou and Gonzalo Nápoles Structure: 32h course; 5 days; approximately 6h/day Details of Summer School: Content This five-day Summer School deals with the principles, assumptions, models, learning algorithms, convergence issues, strengths, limitations, applications of Fuzzy Cognitive Maps (FCM) and new software tools for them. Fuzzy cognitive maps are fuzzy feedback dynamical systems for modeling causal knowledge. They were introduced by Bart Kosko in 1986 as an extension of cognitive maps. Cognitive maps are a set of nodes linked by directed and signed edges. The nodes represent concepts relevant to a given domain. The causal links between these concepts are represented by the edges which are oriented to show the direction of the influence and are signed to show a promoting or inhibitory effect. FCMs have emerged as tools for representing and studying the behavior of systems and people. By combining the main aspects of fuzzy logic, neural networks, expert systems, semantic networks, they have gained considerable research interest and are widely used to analyze causal complex systems. From an Artiﬁcial Intelligence perspective, FCMs are dynamic networks with learning capabilities, where in more and more data is available to model the problem, the system becomes better at adapting itself and reaching a solution. They gained momentum due to their dynamic characteristics and learning capabilities. These capabilities make them essential for modeling, analysis and decision making tasks as they improve the performance of these tasks. This summer school is dedicated to providing participants with deep insights on fundamentals, modeling methodologies, learning algorithms, optimization and convergence issues for fuzzy cognitive maps (FCMs), supplemented with hands on real case studies using the software tool of FCM Wizard. A diverse number of applications of FCMs in applied sciences and engineering will be investigated. Important News: The FCM software tool, called FCM WIZARD, will be fully presented in practice and the computer experiments will be based on it. A full version of FCM WIZARD will be given to the participants for investigating their problems. Participants will bring their own problems from different applications domains, and through the conducted experiments and software we will try to solve them providing valuable results, which in next will be invited to be published in a Special Issue organized by the Main Organizers. Details on the Special Issue will be announced soon. Credits Certificate of Attendance +Analytical Description of each course to be used for ECTS credit calculation Target audience The ideal number of participants is about 50\\. The summer school will host: a) young researchers who wish to achieve a thesis on the subject or to carry on a personal work which uses FCM or to in-depth their knowledge in this discipline in order to complete their training, and b) academics and scientists from research community that have an interest in using FCMs, either as a theoretical framework or as a methodology and tool for applied research, engineering, industrial applications, environmental management, medical decision support, computer science etc. Language The official language of the School is English. Unfortunately, we cannot provide any simultaneous translation. Registration Fees: 560 euro Registration includes attendance to the summer school, software tool, documents, lunches, dinners and a social activity. Registration fees include a free version of the new FCM tool, FCM WIZARD, which will be used for the practical computer exercises and for any real problems that attendees want to solve and make decision with this tool. See www.fcmwizard.com Bank transfer details Summer School on Fuzzy Cognitive Maps 2016 bank transfer details are available. Please make deposits at: Bank Account Details Please make deposits at: Holder: ELKE UTH – University of Thessaly Holder address: Argonauton and Filelinon, Volos, 38221, Greece IBAN: GR93 0140 3100 3100 0200 2020 898 SWIFT: GRBAGRAAXXX Bank name: Alpha Bank Bank address: Iasonos 60, Volos, Greece Please make sure following are clearly stated as the bank transfer reason/information • The number of the Summer School Program: CODE 5200 • The name of the Summer School: Summer School on Fuzzy Cognitive Maps 2016 • The name & surname of the delegate (NOT the name of the payer) Computer Exercises: The computer practice component of the Summer School has a number of very useful hands on real case studies. Hands on training includes: • FCM construction from experts and stakeholders, participants • FCM construction from historical data • Inference and Scenario analysis • Learning • Optimization • Convergence • Prediction • Classification • Clustering • Decision Support (medical, environmental, business, management etc) Website URL www.fcmwizard.com/SummerSchool/ For any queries please contact Elpiniki Papageorgiou, epapageorgiou@teiste.gr and e.i.papageorgiou75@gmail.com Expression of Interest Please send an email to Elpiniki Papageorgiou for expressing your interest to attend the Summer School on Fuzzy Cognitive Maps. Contact Details Dr. Elpiniki I. Papageorgiou Assistant Professor Technological Educational Institute of Central Greece Computer Engineering Department 3o Km Old National Road Lamia-Athens, TK 35100, Lamia, Greece Phone : (+30)22310 60255 web : http://www.epapageorgiou.com e-mail: epapageorgiou@teiste.gr, e.i.papageorgiou75@gmail.com Important Dates The FCM Summer School is a one-week event, taking place on 4th – 8th July, 2016\\. • Application submission opening: January 25th, 2016 • Deadline for Application: April 30th, 2016 • Acceptance of Application: May 8th, 2016 • Early registration deadline: April 30th, 2016 • Beginning of the summer school : July 4th, 2016","date_start":"2016-07-04","date_end":"2016-07-08","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Biological Engineering & bioinformatics"],"location":{"virtual":"","full":["Volos","Greece"],"name":"","street":"","city":"Volos","state":"","ZIP":"","country":"Greece"},"organizers":[""],"societies":[],"indexes":[],"emails":["epapageorgiou@teiste.gr","epapageorg@cs.uth.gr","e.i.papageorgiou75@gmail.com"]}