{"name":"Global Summit in Virology-2017","series":"","short":"","website":"http://bioleagues.com/conference/virology-meetings-malaysia","content":"BioLEAGUES welcomes all to the Global Submit of Virology (Virology 2017). This is coordinated by BioLEAGUES, that goes for uniting the researchers, specialists, Scientists in one place and understudies in every aspect of Virology and to give a worldwide discussions to the scattering of unique explorations, results, new thoughts and reasonable advancements which encounters and focuses on both hypothesis and practices. We are pleased to announce the commencement of the global summit on Virology which is going to be held in Kuala Lumpur, Malaysia on 13th March-15th March, 2017\\. We are heartily invites all the delegates in the summit. Global summit of Virology (Virolgy-2017) will bring together both junior and senior scientists, and will cover all aspects of virus research including basic, clinical, veterinary and plant virology. The Free and Hanseatic City of Kuala Lumpur ,Malaysia is a principal port and a centre of maritime and aviation industries, as well as a hub of commerce, media and science. Above all, Kuala Lumpur is a city of hospitality and openness, characterized by its extraordinary diversity and tolerance. The science, the planned special events, and the city itself will make Global summit of virology (Virology-2017) a highly stimulating and unforgettable international event that should not be missed. The Global summit of virology (virology-2017) program will include symposia, workshops, poster sessions, and special events on a wide range of topics in virology. We hope you can join us.","date_start":"2017-03-13","date_end":"2017-03-15","important_dates":{"abstract":"","full":"2017-02-28","notification":"","final":""},"topics":["Life Sciences","Other"],"location":{"virtual":"","full":["Kuala Lumpur","Malaysia","Malaysia"],"name":"","street":"","city":"Kuala Lumpur","state":"Malaysia","ZIP":"","country":"Malaysia"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}