{"name":"19th International Conference on Enterprise Information Systems – ICEIS 2017","series":"","short":"","website":"http://www.iceis.org","content":"Venue: Porto, Portugal Event date: 26 - 29 April, 2017 Regular Papers Paper Submission: November 30, 2016 Authors Notification: February 1, 2017 Camera Ready and Registration: February 15, 2017 Position Papers Paper Submission: January 19, 2017 Authors Notification: February 22, 2017 Camera Ready and Registration: March 8, 2017 Workshops Workshop Proposal: January 12, 2017 Doctoral Consortium Paper Submission: March 1, 2017 Authors Notification: March 14, 2017 Camera Ready and Registration: March 24, 2017 Special Sessions Special Session Proposal: January 30, 2017 Tutorials, Demos and Panels Proposals: March 6, 2017 Open Communicationss Paper Submission: March 1, 2017 Authors Notification: March 14, 2017 Camera Ready and Registration: March 24, 2017 Scope: The purpose of the 19th International Conference on Enterprise Information Systems (ICEIS) is to bring together researchers, engineers and practitioners interested in the advances and business applications of information systems. Six simultaneous tracks will be held, covering different aspects of Enterprise Information Systems Applications, including Enterprise Database Technology, Systems Integration, Artificial Intelligence, Decision Support Systems, Information Systems Analysis and Specification, Internet Computing, Electronic Commerce, Human Factors and Enterprise Architecture. CONFERENCE AREAS: Each of these topic areas is expanded below but the sub-topics list is not exhaustive. Papers may address one or more of the listed sub-topics, although authors should not feel limited by them. Unlisted but related sub-topics are also acceptable, provided they fit in one of the following main topic areas: 1\\. DATABASES AND INFORMATION SYSTEMS INTEGRATION 2\\. ARTIFICIAL INTELLIGENCE AND DECISION SUPPORT SYSTEMS 3\\. INFORMATION SYSTEMS ANALYSIS AND SPECIFICATION 4\\. SOFTWARE AGENTS AND INTERNET COMPUTING 5\\. HUMAN-COMPUTER INTERACTION 6\\. ENTERPRISE ARCHITECTURE AREA 1: DATABASES AND INFORMATION SYSTEMS INTEGRATION - Coupling and Integrating Heterogeneous Data Sources - Legacy Systems - Organisational Issues on Systems Integration - Mobile Databases - Enterprise Resource Planning - Middleware Integration - Databases in the Cloud - Data Mining - Data Warehouses and OLAP - Performance Evaluation and Benchmarking - Large Scale Databases - Non-relational Databases - Query Languages and Query Processing - Distributed Database Systems AREA 2: ARTIFICIAL INTELLIGENCE AND DECISION SUPPORT SYSTEMS - Evolutionary Programming - Group Decision Support Systems - Industrial Applications of Artificial Intelligence - Strategic Decision Support Systems - Advanced Applications of Neural Network - Applications of Expert Systems - Advanced Applications of Fuzzy Logic - Intelligent Agents - Case-Based Reasoning Systems - Multi-Agent Systems - Scheduling and Planning - Operational Research - Problem Solving - Game Theory Applications - Intelligent Transportation System - Natural Language Interfaces and Systems AREA 3: INFORMATION SYSTEMS ANALYSIS AND SPECIFICATION - Software Engineering - Knowledge Management - Modelling of Distributed Systems - Ontology Engineering - Security - Simulation - Requirements Analysis and Management - Tools, Techniques and Methodologies for System Development - Model Driven Architectures and Engineering - Modelling Formalisms, Languages, and Notations (e.g. UML, ER variants) - Organisational Learning - Project Management - Semiotics in Information Systems - Software Metrics and Measurement AREA 4: SOFTWARE AGENTS AND INTERNET COMPUTING - Wireless and Mobile Computing - E-Learning and E-Teaching - Ubiquitous Computing - Virtual Enterprises - Interoperability - Web Services - Web 2.0 and Social Networking - Internet Agents - Collaborative Computing - Electronic Commerce - Internet Portals - Profiling and Recommendation Systems - Internet of Things - Internet Systems Performance - Semantic Web Technologies and Applications AREA 5: HUMAN-COMPUTER INTERACTION - HCI on Enterprise Information Systems - Human Factors - Multimedia Systems - Virtual Reality and Augmented Reality - Geographical Information Systems - Guidelines, Principles, Patterns and Standards - Adaptive and Adaptable User Interfaces - Interaction Techniques and Devices - Interface Design - Ergonomics - Emotional and Affective Computing - Haptic Interfaces - Accessibility and Usability - Collaborative and Social Interaction - Multiple Sensory Devices AREA 6: ENTERPRISE ARCHITECTURE - Enterprise Engineering - Models and Frameworks - Enterprise Knowledge Engineering and Management - Business Modelling and Business Process Management - Business-IT Allignment - EA Adoption and Governance - EA and Organizational Theory and System Development - EA and Service Oriented Architecture (SOA) - Methods, Processes and Patterns for EA Development - Measurements, Metrics and Evaluation of EA Artefacts and Processes - Architectures and Design Principles for Enterprise Repositories - Maturity Models for EA Artefacts and Processes - Evolution of EA - Objective Control in EA KEYNOTE SPEAKERS ICEIS 2017 will have several invited keynote speakers, who are internationally recognized experts in their areas. Their names are not yet confirmed. CONFERENCE CO-CHAIRS Olivier Camp, MODESTE/ESEO, France Joaquim Filipe, Polytechnic Institute of Setúbal / INSTICC, Portugal PROGRAM CO-CHAIRS Slimane Hammoudi, ESEO, MODESTE, France Michal Smialek, Warsaw University of Technology, Poland LOCAL CO-CHAIRS Maria João Silva Costa Ferreira, Universidade Portucalense, Portugal Isabel Seruca, Universidade Portucalense, Portugal PROGRAM COMMITTEE http://www.iceis.org/ProgramCommittee.aspx ICEIS Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setubal – Portugal Tel: +351 265 520 184 Fax: +351 265 520 186 e-mail: iceis.secretariat@insticc.org Web: http://www.iceis.org","date_start":"2017-04-26","date_end":"2017-04-29","important_dates":{"abstract":"","full":"2016-11-30","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["iceis.secretariat@insticc.org"]}