{"name":"Edited book: Family Businesses in the Arab world. Governance, Strategy and Financing","series":"","short":"","website":"http://entreprisefamiliale.fr/index.php/revues/item/133-appel-a-conttributions-family-businesses-in-the-arab-world-governance-strategy-and-financing","content":"Book description: Family firms are the most common type of firms throughout the world and particularly in the Arab and Muslim-Majority countries. Surprisingly, very little academic research has been conducted about these organizations in a region characterized by a strong importance given by individuals and communities to family, clans, values and tradition. From the Maghreb to the Middle East, small and more aged firms are commonly owned and managed by members of extended families who play a distinguishing role in the Arab world unlike nuclear families in Western or Nordic countries. As extant research is mainly due to Western researchers established in many cases in these countries, current knowledge about Arab family firms is heavily influenced by a Western culture lens. Well, even if theses analyses are legitimate, one could assume that researching family firms in the Arab world may require handling the specific context, culture and values of the countries where they evolve. Besides, family business scholars have paid attention to family firms in some regions of the world – apart from Western countries – such as Asia, Latin America. But, to our best knowledge, no attention has been paid to the Arab countries region despite the need and value of such an analysis. The projected book intends to shed light on these organizations in order to highlight their uniqueness in the specific context of the Arab region. How these firms could grow, operate and compete in societies characterized by high collectivism, high uncertainty avoidance and high masculinity (Hofstede, 1991)? Even if it is difficult to generalize most cultural values across all Arab countries (Lamb, 1987), some authors emphasized the unique characteristics of the Arab culture and identified it as a fourth paradigm that represents the management practice in Arab countries besides the three most well-known paradigms (American, European, and Japanese cultural paradigms) (Obeidat et al., 2012). Particularly, Arab culture is adherent to religion and is characterized by “familism”, where the loyalty of individuals is to their families and then to the next social level that individuals belong to as their tribe, religious sect or to the extended family (Sidani and Thornberry, 2009). In addition, as pointed out by Al-Rasheed (2001), managers have a limited future orientation and excessive lack of delegation of authority. Moreover, a difficult emancipation from tradition is highly noticeable. In sum, some constant features may be underscored and may explain how family firms may be specific in Arab countries as all of these traits could be reflected in managerial styles, attitudes and practices. Economic environment is not to be neglected as many of these countries roughly share the same difficulties pertaining to underdevelopment, high rates of unemployment and weak diversification of economies. In some other Arab countries, oil abundance is a determinant feature which constitutes both a hindrance to the exploration of new economic models but also a facilitator allowing for the conversion of certain countries’ economies. Arab family firms greatly contribute in shaping the economies of their countries but they are also constrained by their environment. However, they are the key for the development of the region’s countries and may help to provide solutions to the current crisis and political turmoil mainly originating from unemployment and lack of freedom. We solicit your scholarly articles to be incorporated in this edited book as a chapter. Prospective authors are encouraged to submit papers tackling the various aspects of management, governance and strategy of family firms in the Arab countries. We expect scholarly articles to be incorporated in this edited book to highlight the following themes: - Does the cultural specificity of Arab family firms shape the governance and management of these firms? - What is the influence that specific values in the Arab world (Honor, pride, loyalty, trust) could exert on the management of family firms? How do spiritual and religious values influence business in family firms? - What’s the role of emotions in the management of family firms in the Arab World? - Is there any specificity of innovation by Arab family firms? - What influence do uncertainty avoidance and risk aversion have on financial decisions? - Do Arab family firms deal differently (from their Western counterparts) with social pressures and corporate social responsibility? - What impact, if any, political regimes and systems have on family firms in the Arab world? - How do Arab family firms compete internationally? - What is specific in the succession process for Arab Family firms? Submission procedure: Conceptual and empirical papers (9000 – 10000 words) adopting a managerial, economic, sociological or historical perspective are welcome. Papers must be original and not published or in consideration elsewhere in other books, journals or websites. All papers will be submitted to a peer review process. Interested authors are invited to send: - a working Chapter title; - a concise and a compelling abstract for the chapter; - a detailed resume (academic post, main academic qualifications and publications); Submissions are to be sent by email to: sbasly@u-paris10.fr Time frame: - Deadline for proposal submission: May 15, 2016 - The final version is needed by June, 30, 2016 Contact: For inquiries about this call for chapters and manuscript submissions, please email to the editor: sbasly@u-paris10.fr","date_start":"2016-06-29","date_end":"2016-06-30","important_dates":{"abstract":"","full":"2016-05-15","notification":"","final":""},"topics":["Business","Management / Leadership"],"location":{"virtual":"","full":["Nanterre","France"],"name":"","street":"","city":"Nanterre","state":"","ZIP":"","country":"France"},"organizers":[""],"societies":[],"indexes":[],"emails":["sbasly@u-paris10.fr"]}