{"name":"World Summit on Nanotechnology and Nanomedicine Research","series":"","short":"","website":"http://clytoaccess.com","content":"Clyto Access Inc invites scientists, research scholars, and key decision makers, companies, business delegates to participate at the ‘World Summit on Nanotechnology and Nanomedicine Research’, which is going to be held at Dubai during 28-30 November, 2016\\. The conference will focus on promoting research and enhancing the scientific community for a fruitful communication. The conference aims to provide a firm platform for the scientists, research scholars, and key decision makers to share their research and investigate scientific problems through cross networking. The conference will target recent research and implications of research, applications, and advancement of the research, engaging with companies and industries to better understand, relate, align, and open multiple avenues of Nanotechnology and Nanomedicine research. We hope this may be of interest to you. We are currently accepting abstract submissions. Should you choose to accept to attend the conference, please visit our website for more details. Abstract Submission: http://clytoaccess.com/submit-abstract?confid=47 For more details please contact our Project Manager at nanomed2016@clytoaccess.com SCIENTIFIC SESSIONS Nanotechnology and nano medicine Nano-materials and evolution Nano-materials for Medical Applications Nano biology and nano biotechnology Nanoengineering and DNA Nanomachines Emerging Nanotechnologies Nano robotics Nano electronics Nano energy Nano magnetics and Nano optics SCIENTIFIC SESSIONS Application of nano-materials Nano particles synthesis and application Polymer nanoparticles Nanoscale materials Nano-weapons Nanofluids and nano Structures Nano composites Nano fabrication Biomimetic approaches Wet nanotechnology SCIENTIFIC SESSIONS Nanotechnological tools and techniques Scanning Tunneling Microscope (STM) Nanomanipulations Carbon Nanotubes Nanowires and nanoscale networks Nano-toxicology Health implications of nanotechnology Environmental implications of nanotechnology Regulation of nanotechnology Nano-medicine and Pregnancy Looking forward to see you, along with your colleagues from around the globe at Dubai!","date_start":"2016-11-28","date_end":"2016-11-30","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Engineering & Technology","Material/Nanotechnology","Materials science, engineering, nanotechnology"],"location":{"virtual":"","full":["Dubai","UAE","United Arab Emirates","United Arab Emirates"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":["Clyto Access Inc"],"societies":[],"indexes":[],"emails":["nanomed2016@clytoaccess.com"]}