{"name":"IoT Solutions World Congress","series":"","short":"","website":"http://www.iotsworldcongress.com","content":"After a very successful first edition, the IoT Solutions World Congress will be back in October 2016\\. The IOTSWC is the first global event dedicated exclusively to joining IoT providers with industry in order to help the latter increase productivity via this disruptive technology. The event will offer a highly international environment with more than 8,000 visitors and will focus on IoT solutions in six dedicated areas: Manufacturing, Healthcare, Energy & Utilities, Transportation & Logistics, Innovation and Technology. To facilitate the connection between technology and industry, the IoT Solutions World Congress will feature keynotes from top experts in the industry who will discuss the opportunities offered by IoT technology as well as its transformative role in the economy. The event will also offer training on technical aspects and network security as well as networking sessions. There will also be a trade show area where companies can showcase the latest IoT innovations in their industry including prototypes, live demonstrations (including those of Testbeds), projects and real-life applications. Fira de Barcelona is organizing the event in partnership with the Industrial Internet Consortium, the Industrial IoT organization founded by AT&T, Cisco, General Electric, IBM, and Intel to bring together organizations and technology with the goal of accelerating the growth, adoption, and widespread use of industrial IoT. More details about the event can be found at: www.iotsworldcongress.com","date_start":"2016-10-25","date_end":"2016-10-27","important_dates":{"abstract":"","full":"2016-04-30","notification":"","final":""},"topics":["Engineering & Technology","Mechanical/Industrial","IOT Internet of Things (IoT)"],"location":{"virtual":"","full":["Barcelona","Spain"],"name":"","street":"","city":"Barcelona","state":"","ZIP":"","country":"Spain"},"organizers":["Industrial Internet Consortium"],"societies":[],"indexes":[],"emails":[]}