{"name":"10th International Conference on Bio-inspired Systems and Signal Processing – BIOSIGNALS 2017","series":"","short":"","website":"http://www.biosignals.biostec.org","content":"Venue: Porto, Portugal Event Date 21 - 23 February, 2017 Regular Papers Paper Submission: September 29, 2016 Authors Notification: November 23, 2016 Camera Ready and Registration:December 9, 2016 Position Papers Paper Submission: November 8, 2016 Authors Notification: December 14, 2016 Camera Ready and Registration: December 27, 2016 Workshops Workshop Proposal: November 3, 2016 Doctoral Consortium Paper Submission: December 29, 2016 Authors Notification: January 11, 2017 Camera Ready and Registration: January 23, 2017 Special Sessions Special Session Proposal: November 21, 2016 Tutorials, Demos and Panels Proposals: December 27, 2016 Scope: The purpose of the International Conference on Bio-inspired Systems and Signal Processing is to bring together researchers and practitioners from multiple areas of knowledge, including biology, medicine, engineering and other physical sciences, interested in studying and using models and techniques inspired from or applied to biological systems. A diversity of signal types can be found in this area, including image, audio and other biological sources of information. The analysis and use of these signals is a multidisciplinary area including signal processing, pattern recognition and computational intelligence techniques, amongst others. BIOSIGNALS is part of BIOSTEC, the 10th International Joint Conference on Biomedical Engineering Systems and Technologies. Registration to BIOSIGNALS allows free access to all other BIOSTEC conferences. CONFERENCE TOPICS - Speech Recognition - Neural Networks - Biometrics - Pattern Recognition - Medical Signal Acquisition, Analysis and Processing - Wearable Sensors and Systems - Real-time Systems - Evolutionary Systems - Acoustic Signal Processing - Time and Frequency Response - Wavelet Transform - Medical Image Detection, Acquisition, Analysis and Processing - Physiological Processes and Bio-signal Modeling, Non-linear Dynamics - Cybernetics and User Interface Technologies - Electromagnetic fields in biology and medicine - Fuzzy Systems and Signals - Monitoring and Telemetry - Cardiovascular Signals - Image Analysis and Processing - Detection and Identification - Motion Control BIOSTEC KEYNOTE SPEAKER Bart M. ter Haar Romeny, Eindhoven University of Technology, Netherlands BIOSTEC CONFERENCE CO-CHAIRS Ana Fred, Instituto de Telecomunicações / IST, Portugal Hugo Gamboa, LIBPHYS-UNL / FCT - New University of Lisbon, Portugal Mário Vaz, Inegi Lome, Feup, Portugal PROGRAM CHAIR Carlos D. Maciel, University of Sao Paulo (USP), Brazil PROGRAM COMMITTEE http://www.biosignals.biostec.org/ProgramCommittee.aspx BIOSIGNALS Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setúbal - Portugal Tel: +351 265 100 033 Fax: +351 265 520 186 e-mail: biosignals.secretariat@insticc.org Web: http://www.biosignals.biostec.org/","date_start":"2017-02-21","date_end":"2017-02-23","important_dates":{"abstract":"","full":"2016-09-29","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["biosignals.secretariat@insticc.org"]}