{"name":"7th International Conference on Knowledge Discovery and Information Retrieval – KDIR 2015","series":"","short":"","website":"http://www.kdir.ic3k.org","content":"Scope: Knowledge Discovery is an interdisciplinary area focusing upon methodologies for identifying valid, novel, potentially useful and meaningful patterns from data, often based on underlying large data sets. A major aspect of Knowledge Discovery is data mining, i.e. applying data analysis and discovery algorithms that produce a particular enumeration of patterns (or models) over the data. Knowledge Discovery also includes the evaluation of patterns and identification of which add to knowledge. Information retrieval (IR) is concerned with gathering relevant information from unstructured and semantically fuzzy data in texts and other media, searching for information within documents and for metadata about documents, as well as searching relational databases and the Web. Automation of information retrieval enables the reduction of what has been called \"information overload\". Information retrieval can be combined with knowledge discovery to create software tools that empower users of decision support systems to better understand and use the knowledge underlying large data sets. Conference Topics:  BioInformatics & Pattern Discovery  Business Intelligence Applications  Clustering and Classification Methods  Collaborative Filtering  Concept Mining  Context Discovery  Data Analytics  Data Mining in Electronic Commerce  Data Reduction and Quality Assessment  Foundations of Knowledge Discovery in Databases  Information Extraction  Interactive and Online Data Mining  Machine Learning  Mining Multimedia Data  Mining Text and Semi-structured Data  Pre-processing and Post-processing for Data Mining  Process Mining  Software Development  Structured Data Analysis and Statistical Methods  User Profiling and Recommender Systems  Visual Data Mining and Data Visualization  Web Mining KEYNOTE SPEAKERS IC3K 2015 will have several invited keynote speakers, who are internationally recognized experts in their areas. Their names are not yet confirmed. IC3K CONFERENCE CHAIR Joaquim Filipe, Polytechnic Institute of Setúbal / INSTICC, Portugal PROGRAM CHAIR Ana Fred, Instituto de Telecomunicações / IST, Portugal","date_start":"2015-11-12","date_end":"2015-11-14","important_dates":{"abstract":"","full":"2015-06-02","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Setúbal Municipality","Setúbal","Portugal"],"name":"","street":"","city":"Setúbal Municipality","state":"Setúbal","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":[]}