{"name":"ITU Kaleidoscope 2016 - ICTs for a Sustainable World","series":"","short":"","website":"http://www.itu.int/en/ITU-T/academia/kaleidoscope/2016/Pages/default.aspx","content":"Kaleidoscope 2016: ICTs for a Sustainable World is the eighth in a series of peer-reviewed academic conferences organized by ITU to bring together a wide range of views from universities, industry and research institutions. The aim of the Kaleidoscope conferences is to identify emerging developments in information and communication technologies (ICTs) and, in particular, areas in need of international standards to aid the healthy development of the Information Society. ICTs are omnipresent. They are applied as enabling technologies in the business processes of virtually all sectors of industry and society, and it is clear that they will play an essential role as enabling technologies in achieving social, environmental and economic sustainability. The 8th Kaleidoscope conference calls for academic papers presenting research into ICT technical developments, innovative ICT applications or policy and regulatory considerations relevant to supporting the achievement of the United Nations Sustainable Development Goals (SDGs), and in particular how international ICT standards will provide the platform for this innovation to achieve its aims on a global scale. Accepted and presented papers will be published in the Conference Proceedings. In addition, extended versions of selected papers will be considered for publication in the International Journal of Technology Marketing, the International Journal of Standardization Research, or the Journal of ICT Standardization. A prize fund totaling CHF 6,000 will be shared among the authors of the three best papers, as judged by the Steering and Technical Programme Committees. In addition, young authors of up to 30 years of age presenting accepted papers will receive Young Author Recognition certificates.","date_start":"2016-11-14","date_end":"2016-11-16","important_dates":{"abstract":"","full":"2016-06-20","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer engineering"],"location":{"virtual":"","full":["Bangkok","Thailand"],"name":"","street":"","city":"Bangkok","state":"","ZIP":"","country":"Thailand"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}