{"name":"CfP: The Fifth Euroacademia Forum of Critical Studies: Asking Big Questions Again, 11 – 12 November 2016, Lucca, Italy","series":"","short":"","website":"http://euroacademia.eu/conference/fifth-forum-critical-studies","content":"CALL FOR PAPERS The Fifth Global Forum of Critical Studies Asking Big Questions Again 11 - 12 November 2016, Lucca, Italy Palazzo Bernardini Deadline for Paper Proposals: 9th of September 2016 The Fifth Euroacademia Global Forum of Critical Studies aims to bring into an open floor the reflexive and questioning interaction among academics, intellectuals, practitioners and activists profoundly concerned with evaluative understandings of the world we’re living in. The focus of the forum is to initiate an arena where no question is misplaced and irrelevant as long as we acknowledge that evaluation, critical thinking and contestation are accessible trajectories to better understand our past, present and alternative scenarios for the future. Conference Description: Some say that the 21st Century or modernity altogether made humans more concerned with doing rather than being. As the classical Greek civilization valued the most reflexive thinking as a form of freedom from natural necessities, contemporary times profoundly involve individuals and the imaginary accompanying social practices in a restless logic of consumption, competition and engagement that profoundly - or some would say, radically – suspends or indefinitely postpones the autonomous capacity of human beings to question and reflect upon the social order and the meaning of social practices. The fast advancement of the logic of post-industrial societies, the gradual dissolution of alternative models to the capitalist logic and a multitude of other alerting factors pushed ahead a global spread culture of one-dimensional productions of meaning that advances a closure rather than a constant reflexive re-evaluation of cultural/social practices. Many alternatives at hand are often condemned to marginality or lost in the plural practices where everything goes as long as it’s part of an intellectual market. The ‘fatal strategies’ of post-industrial societies to keep individuals captive, busy and seduced by contingent social arrangements and economic practices minimized the questioning detachment required to evaluate and give meaning through reflexive criticism and unlimited interrogation. Various labels were given to our unfolding times from apocalyptic ones to some more comforting yet not by chance lacking some vital optimism. Despite a wide-spread discontent and suspicion towards the daily realities of our current societies, most of the big questions are often left outside by the self-involved active pursuit of an imagined well-being that is no longer transgressed by harsh critical evaluation of its meaning. The academic arena itself also advances, supports, integrates and promotes limited particular methodologies that generate an effect of mainstreaming and often keeps researchers or practitioners out of the battle-ground for big questions. The ongoing economic crisis made reality even harsher and pushed ahead the need for more thinking as many habitual categories lost their meaning or relevance. New ways of thinking could transgress some inappropriate conceptions or misconceptions that preserve their centrality due to the mechanics of habits. This is a time when a call to thinking is well-placed. This is a call to arms for critical studies that promotes alternative, questioning and multi-dimensional thinking. Panels: When it’s about critical thinking and critical studies there is intrinsically an unending open list of topics to be included. The Fifth Euroacademia Forum on Critical Studies proposes the 5 sections (that are by no means exclusive): • Theory/Philosophy • Politics • Cultural Studies • Political Economy • Arts, Literature, Film and Performance Studies Papers on the following topics (and not only) are welcomed: Diagnostics of Our Times: Where Is the 21st Century Heading? \\~ Our Societies Are As Good As It Gets: How to Escape the Closure of Meaning? \\~ Consumerist Societies and the Captivity of Thinking \\~ The Being/Doing Nexus \\~ Assessing Models of Capitalism \\~ Markets, Capital and Inequalities \\~ The Remains of Individual Autonomy \\~ How Plural Our Societies Truly Are? \\~ Debating Ideal vs. Real Multiculturalism \\~ Social Narcissism and Consumerism \\~ The Role of Critical Thinking: Proposing Alternative Methodologies \\~ Are There Any Alternatives to Capitalism Left? \\~ Social Causes and the Pursuit of Social Beliefs \\~ Protest and Social Change \\~ Re-Thinking Revolutions \\~ Hegemony and the Remaining Possibilities for Social Criticism \\~ Loneliness and Isolation in the Era of Mass Communication \\~ Living Low Cost: Values, Meaning and Market Exchange \\~ Ideology and Other Dominant Narratives \\~ Critical Economics \\~ Post-Modernism and the Critique of Modernity \\~ Marx and the 21st Century \\~ Debating the End of Communism \\~ Non-Oppositional Societies \\~ Consolation, Complicity and Passivity Today \\~ Who Still Waits For A Revolution? \\~ C. Castoriadis and the Project of Autonomy \\~ French Thinking and Alternatives for Thought \\~ Eastern Europe and the Enrollment to the School of Capitalism \\~ China and the Logic of Growth \\~ Crises of Culture \\~ Left and Right: Political Spectrums and Pluralism Re-Discussed \\~ Art as an Exchange Value \\~ Originality and Complacency \\~ Literatures and Authors \\~ Heroes and Heroines in Electronic Literature \\~ Fiction and the Fictionalization of the Contemporary World \\~ Film and the Persisting Hunger for Heroic Imagination \\~ The Illusory Charity and Imagined forms of Contemporary Humanisms \\~ The Growing Social Irrelevance of Philosophy \\~ Replacement of the Logic of Becoming by the Logic of Earning \\~ How Do We Look Back at Tradition? \\~ Just Wars or Unjust Thinking? \\~ The Myth of Cosmopolitanism \\~ Facing the Self \\~ Communication, Media and Simulacrum \\~ Science, Pragmatics and Vocation: Who Pays What We Can’t Sell? \\~ Is There Still a Postmodern or Any Other Kind of Condition? \\~ Post-Marxist Way of Looking at Facts \\~ The School of Suspicion and Evaluative Thinking \\~ Feminist Readings of Our Contemporary World \\~ Post-Colonialism and the Refurbished Other(s) \\~ Theory and Power \\~ Queer Theory and Living After the Sexual Revolution \\~ Subaltern Theory For complete information before applying see full details of the conference at: http://euroacademia.eu/conference/fifth-forum-critical-studies/ You can apply on-line by completing the Application Form on the conference website or by sending a 300 words titled abstract together with the details of contact and affiliation until 9th of September 2016 at application@euroacademia.eu","date_start":"2016-11-11","date_end":"2016-11-12","important_dates":{"abstract":"","full":"2016-10-09","notification":"","final":""},"topics":["Arts & Humanities","Philosophy","cultural studies"],"location":{"virtual":"","full":["Lucca","Italy"],"name":"","street":"","city":"Lucca","state":"","ZIP":"","country":"Italy"},"organizers":[""],"societies":[],"indexes":[],"emails":["application@euroacademia.eu"]}