{"name":"2016 Nonprofit Marketing Conference","series":"","short":"","website":"https://www.ama.org/events-training/Conferences/Pages/2016-Nonprofit-Marketing-Conference.aspx","content":"One-of-a-kind perspectives, expert-led sessions and an exceptional line-up of speakers will be featured throughout this unparalleled conference program, with all content tailored specifically for nonprofit marketers. Attendees will engage with a diverse group of their peers from nonprofits of all types and sizes, including foundations, charities, education, museums, associations, hospitals and government agencies. The conference will be organized into the following four tracks: •​Amping Up Content Marketing Want to boost content marketing effectiveness? Explore best practices, case studies, and effective approaches to creating, curating, and distributing content that gets noticed and gets results. Pick up game-changing ideas, learn how to make it relevant, discover tactical-level insights from SEO and social media to inbound and PPC, and get tips on integrating content marketing into your overall marketing strategy. •Energizing Engagement and Experience Refine, recharge, and reinvent your approach to create compelling experiences that advance your brand, your marketing goals, and your bottom line. Explore focus areas including channels, data intelligence, crisis communications, personalization, integration, and more to increase engagement, improve experience, and ultimately drive loyalty, advocacy, and action in an ever-evolving customer-centric landscape. •Maximizing Marketing Partnerships What’s the magic formula for marketing partnerships that work? Through case studies and in-depth how-tos, expert marketers from a variety of nonprofits reveal how to establish strategic partnerships to achieve both marketing and organizational objectives. Get the inside scoop with actionable takeaways and new ideas to create and leverage partnerships in a way that enhances your brand and generates sustainable results. •Staying on Top of Your Marketing Game Whether you’re solo or C-suite, build your arsenal of tools, tips, and tricks through real-world experiences. What’s hot and what’s not. Hear from experts who will help you step up and advance your marketing with a look at trends and proven techniques. From analytics, segmentation, and strategic planning to managing information and people, this diverse and dynamic collection of sessions is focused on empowering your effectiveness.​","date_start":"2016-07-11","date_end":"2016-07-13","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Marketing/Social-Networking","Marketing & advertising"],"location":{"virtual":"","full":["Washington","D.C.","United States"],"name":"","street":"","city":"Washington","state":"D.C.","ZIP":"","country":"United States"},"organizers":["American Marketing Association"],"societies":[],"indexes":[],"emails":[]}