{"name":"Motivation and Engagement in the Workplace","series":"","short":"","website":"www.motivationworks.com","content":"About the event... The summit will provide a wealth of knowledge and actionable strategies for deepening engagement and motivation in the workplace. The small group format enables attendees to not only learn through detailed presentations, but to actively engage with the world’s leading engagement and motivation experts to work through case studies, best practices, and direct exploration of each attendee’s unique challenges and goals. We hope you can join us in the Florida sun for this transformative experience! Topics Include... Motivational Design in your Organization •Understanding and Applying the Latest Science of Motivation to Improve KPI’s •Not all Motivation is the Same: The Critical Role of Motivational Quality Employee Engagement and Motivation: Measurement and Best Practices •Taking Your Workforce’s Motivational 'Pulse' & Accurately Measuring Employee Engagement •Techniques to Optimize Employee Engagement through High Quality Motivation •Establishing Optimal Incentives and Compensation Plans •Learning How Leaders Shape High Motivation Cultures (and How That Culture Shapes Them) Customers, Products, and Services •A Framework for Developing Highly Engaging Products and Services •Motivational Principles to Supercharge Customer and Employee Loyalty •The Right Approach to “Gamification” – and how to apply it The Vital Organization •Motivational Principles to Guide your Wellness and Health Initiatives •Catalyzing High Vitality in your Workforce (and in You!)","date_start":"2016-10-06","date_end":"2016-10-07","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Social Sciences","Psychology","Human Resource Management"],"location":{"virtual":"","full":["Orlando","Florida","United States"],"name":"","street":"","city":"Orlando","state":"Florida","ZIP":"","country":"United States"},"organizers":["Immersyve, Inc."],"societies":[],"indexes":[],"emails":[]}