{"name":"Global Conference on Prosperity, Equality & Sustainability: Perspectives and Policies for a Better World","series":"","short":"","website":"www.ihdindia.org/pesconference","content":"CALL FOR PAPERS AND PANEL PROPOSALS On September 25-27, 2015 world leaders adopted a new ambitious agenda for sustainable development through a set of 17 Sustainable Development Goals (SDGs) to end poverty, ensure prosperity and equality for all, and tackle climate change by 2030\\. The discourses reiterated the importance of social inclusion and reducing disparities, and a call for action to focus on global and national policies that consider the needs of the most vulnerable and excluded populations. In this context, the Institute for Human Development (IHD), New Delhi and The World Bank are jointly organizing a Global Conference to address the core issues of promoting shared prosperity and social inclusion through the right mix of strategies and policies. Apart from increasing the knowledge base needed to understand the sources of inequality and exclusion and the reasons for their persistence, each of these thematic sessions will address two main concerns: one, the links between growth and prosperity on the one hand and progress made in the thematic areas mentioned above on the other; two, the effectiveness of policies to promote greater inclusion and less inequality in ways that are consistent with sustainable development. There will be a focus on policies to spread prosperity to disadvantaged groups, with particular attention to inequalities marked by gender, race, ethnicity, and other social divides. Apart from inaugural, closing and four plenary panels, the conference will comprise about 20-25 thematic parallel sessions and panels in which 80-100 papers and presentations will be made. Conference Themes:  Jobs and economic security  Building healthy lives  Education for capability expansion  Food and nutritional security  Strengthening social protection  Challenge of Improving Environment  Inclusion and citizenship Key Dates: Deadline for submission of abstracts: January 31, 2016 Deadline for submission of panel proposals: January 31, 2016 Communication of paper acceptance: February 10, 2016 Communication of acceptance of panel proposals: February 10, 2016 Submission of full papers: April 12, 2016 Conference dates: April 25-27, 2016 Call for Papers: Research papers related to the conference themes, underpinned by the core question of how to promote prosperity, equality and sustainability through the right mix of strategies and policies, are invited from scholars and researchers. Abstracts (of 300-500 words) for papers should be submitted outlining the main research questions and their relevance to policy, conceptual framework, methodology and empirical base of the paper by January 31, 2016\\. A detailed set of sub-themes and specific questions to be addressed under each theme is available at the conference website (www.ihdindia.org/pesconference). An international scientific panel of experts will review the abstracts, taking into account the importance and policy relevance of the research questions, and technical quality. Abstract acceptance will be communicated by February 10, 2016\\. Authors of the selected papers will be required to submit full papers (of about 6000-8000 words) by April 12, 2016\\. The papers should not have been published earlier in any form. Authors of the accepted papers will be invited to present their work at the Conference and their expenses on travel, accommodation and meals will be covered by the Conference organisers. We particularly encourage proposals by young scholars below 40 years, by women, and by residents of developing countries, particularly in South and Southeast Asia. All submissions for the extended abstracts and panel proposals should be made online at the Conference website (www.ihdindia.org/pesconference). Call for Panel Proposals: Several panel discussions on special themes relevant for the Conference will be organised during the Conference. Proposals for panels are invited from scholars and institutions. The final proposals will be selected by a team of experts and reviewers. An ideal panel session will comprise 4–5 presentations. Each panel proposal should contain the following:  The title of the panel and a description of the panel’s theme.  The titles, presenters and abstracts of the presentations to be made.  The names, affiliations and short biographies of the proposed speakers/presenters.  The name and contact information of the panel organiser. The organisers of each Panel Session are expected to be coordinators of the Panel Discussion. Financial support for organizing the panel including travel, and local hospitality may be available. All proposals for the proposed panels should be submitted in the above format by January 31, 2016 and the decision about the acceptance would be communicated by 10 February 2016\\. For any queries or correspondence please contact: Ms. Priyanka Tyagi, Communication Officer, Institute for Human Development (IHD) NIDM Building, 3rd Floor, IIPA Campus, IP Estate, Mahatma Gandhi Marg, New Delhi – 110 002 Mobile - +91 9871177540 Phones: +91 11 23321610, 23358166, Ext.:48 – 50 Email: pesconference2016@ihdindia.org / with a copy to: priyanka.tyagi@ihdindia.org","date_start":"2016-04-25","date_end":"2016-04-27","important_dates":{"abstract":"","full":"2016-01-31","notification":"","final":""},"topics":["Social Sciences","Sociology","call for papers"],"location":{"virtual":"","full":["New Delhi","India"],"name":"","street":"","city":"New Delhi","state":"","ZIP":"","country":"India"},"organizers":["Institute for Human Development"],"societies":[],"indexes":[],"emails":["pesconference2016@ihdindia.org","priyanka.tyagi@ihdindia.org"]}