{"name":"NRJ 2017 : Stewardship and Development: Tensions and Transitions in Energy, Environment , and Natural Resources","series":"","short":"","website":"http://lawschool.unm.edu/nrj","content":"CALL FOR PAPERS Stewardship and Development: Tensions and Transitions in Energy, Environment, and Natural Resources The Natural Resources Journal (NRJ) at the University of New Mexico School of Law seeks academic articles for its Summer 2017 issue, Volume 57.2, on energy, environment, and natural resources law and policy. Suggested topics include: sustainable development and extractive industries; energy regulation; sustainable finance; trade and the environment; environmental and climate justice; environmental security; disaster law; indigenous rights; resilient communities; business and human rights; land, agriculture, and food systems; social-ecological systems; and political-economic, institutional, and jurisprudential analysis. About the Natural Resources Journal First published in 1961, the Natural Resources Journal is an international, interdisciplinary journal devoted to the study of law and policy issues surrounding natural resources. The NRJ’s contributors come from various disciplines and provide diverse perspectives on the complex issues that accompany natural resources management. The NRJ does not endorse any particular viewpoint, but seeks to highlight the best scholarship from a wide range of perspectives on law and policy topics. To Submit an Article Include in an email the following documents: (1)A manuscript of your article with citations (2)A link to or copy of your CV Email your proposal to nrj@law.unm.edu. Deadline Submissions should be received by November 15, 2016\\. Timeline Authors which receive a commission will be notified by December 1, 2016\\. Criteria Finished articles will generally be under 25,000 words in length (approximately 80 double-spaced pages or 50 law review pages) with citations for all statements of fact. NRJ prefers articles with a clear thesis or argument that can materially advance the academic and policy-making discussion surrounding the topic. Additional information, including an archive of past issues, is available at http://lawschool.unm.edu/nrj/","date_start":"2016-12-01","date_end":"","important_dates":{"abstract":"","full":"2016-11-15","notification":"","final":""},"topics":["Life Sciences","Ecology","Energy, clean, renewable"],"location":{"virtual":"","full":["United States"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":["Natural Resources Journal"],"societies":[],"indexes":[],"emails":["nrj@law.unm.edu"]}