{"name":"12th International Joint Conference on Computer Vision, Imaging and Computer Graphics Theory and Applications – VISIGRAPP 2017","series":"","short":"","website":"http://www.visigrapp.org","content":"Venue: Porto, Portugal Event Date 27 February - 1 March, 2017 Regular Papers Paper Submission: September 22, 2016 Authors Notification: November 16, 2016 Camera Ready and Registration: December 5, 2016 Position Papers Paper Submission: November 3, 2016 Authors Notification: December 12, 2016 Camera Ready and Registration: December 22, 2016 Workshops Workshop Proposal: October 28, 2016 Special Sessions Special Session Proposal: November 16, 2016 Tutorials, Demos and Panels Proposals: December 22, 2016 Scope: The purpose of VISIGRAPP is to bring together researchers and practitioners interested in both theoretical advances and applications of computer vision, computer graphics and information visualization. VISIGRAPP is composed of four co-located conferences, each specialized in at least one of the aforementioned main knowledge areas. 12th International Conference on Computer Graphics Theory and Applications – GRAPP 2017 Url: http://www.grapp.visigrapp.org/ 1st International Conference on Human Computer Interaction Theory and Applications – HUCAPP 2017 Url: http://www.hucapp.visigrapp.org/ 8th International Conference on Information Visualization Theory and Applications – IVAPP 2017 Url: http://www.ivapp.visigrapp.org/ 12th International Conference on Computer Vision Theory and Applications – VISAPP 2017 Url: http://www.visapp.visigrapp.org/ VISIGRAPP KEYNOTE LECTURES VISIGRAPP 2017 will have several invited keynote speakers, who are internationally recognized experts in their areas. Their names are not yet confirmed. VISIGRAPP CONFERENCE CHAIR Jose Braz, Escola Superior de Tecnologia de Setúbal, Portugal VISIGRAPP SECRETARIAT Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setúbal - Portugal Tel: +351 265 520 184 Fax: +351 265 520 186 e-mail: visigrapp.secretariat@insticc.org Web: http://www.visigrapp.org/","date_start":"2017-02-27","date_end":"2017-03-01","important_dates":{"abstract":"","full":"2016-09-22","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer graphics, animation, virtual reality & gaming"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["visigrapp.secretariat@insticc.org"]}