{"name":"2017 2nd International Conference on Materials Science and Nanotechnology (ICMSNT 2017)--Ei&Scopus","series":"","short":"","website":"http://www.icmsnt.org","content":"Call For Papers 2017 2nd International Conference on Materials Science and Nanotechnology (ICMSNT 2017)--Ei&Scopus--call for papers April 20-22, 2017 │Auckland, New Zealand Website: http://www.icmsnt.org/ 2017 2nd International Conference on Materials Science and Nanotechnology (ICMSNT 2017) is technical sponsored by Swinburne University of Technology, Southwest Jiaotong University and Auckland University of Technology(AUT). The conference will be held in Auckland, New Zealand, from April 20-22, 2017\\. ICMSNT 2016 was successfully held in Seoul University. ICMSNT 2017 is an international forum for the presentation of technological advances and research results in the fields of Materials Science and Nanotechnology. The conference will bring together leading researchers, engineers and scientists in the domain of interest from around the world. We warmly welcome prospected authors submit your new research papers to ICMSNT 2017, and share the valuable experiences with the scientist and scholars around the world. ●Committee Conference Committee Co-Chairs: Prof. Chen Zhan, Auckland University of Technology, New Zealand Prof. Timotius Pasang, Auckland University of Technology, New Zealand Prof. LAU Kin Tak Alan, Swinburne University of Technology, Australia Program Committee Chairs: Prof. Ramesh Singh, University of Malaya, Malaysia, Prof. Min-Hao Zhu, Southwest Jiaotong University, China ●Publication and Indexing 1.All the accepted papers will be included in the conference proceeding, which will be indexed by Ei Compendex, CPCI, Scopus, IET and other academical databases. 2\\. ICMSNT2016 proceeding has been indexed by Ei Compendex and other databases. 3.Selected papers with great extension will be recommended to publish in international journals. ●Topics (for more topics: http://www.icmsnt.org/author.html) Materials Science: Energy and Environment Materials Structural Materials Functional Materials Nano-scale and Amorphous Materials Materials Processing and Genomic Engineering Biomaterials and Healthcare Nanotechnology: Multiscale Modeling and Simulation Nanobiology Nanocircuits and Nanoarchitectures NEMS/MEMS Nanoelectronics Nanoenergy ●Paper Submission 1, Papers can be submitted as PDF via EasyChair: https://easychair.org/conferences/?conf=icmsnt2017 2, If you have any questions, please feel free to contact us. 3, Contributions must be written in English and report on original, unpublished work not submitted for publication elsewhere. Submissions not adhering to the above specified constraints may be rejected without review. ●Contact Us Ms. Crystal Chang Email: icmsnt@smehk.org Tel: +852-30697937(Hong Kong)","date_start":"2017-04-20","date_end":"2017-04-22","important_dates":{"abstract":"","full":"2017-03-20","notification":"","final":""},"topics":["Engineering & Technology","Material/Nanotechnology","Materials science, engineering, nanotechnology"],"location":{"virtual":"","full":["Auckland","New Zealand"],"name":"","street":"","city":"Auckland","state":"","ZIP":"","country":"New Zealand"},"organizers":["HKSME"],"societies":[],"indexes":[],"emails":["icmsnt@smehk.org"]}