{"name":"Sociology under State Socialism: Varieties, Similarities, and Exceptions","series":"","short":"","website":"http://www.stanrzeczy.edu.pl/dla-autorow/call-for-papers-sociology-under-state-socialism","content":"\"Stan Rzeczy\" (State of Affairs) is an interdisciplinary peer-reviewed journal, published by the Institute of Sociology of the University of Warsaw, indexed in Erih Plus, in the Central and Eastern European Online Library in The Central European Journal of Social Sciences and Humanities. \"Stan Rzeczy\" invites proposals for a special international issue focused on the relations between sociology and state socialism: The historiography of sociology in state socialist countries has emphasized the discipline’s subordination to the regimes’ political needs. Being ‘banned’ from the academic landscape in the course of the Stalinization of higher education systems during the late 1940s and 1950s, sociology was reintroduced as a subject of teaching and research after 1956 to varying but limited degrees. Common portrayals draw a picture of sociologists either as ideologues of Marxism-Leninism or as dissidents defending academic freedom against a repressive political elite. This standard narrative, oversimplified for the sake of clarity, deserves significant refinement for a large number of reasons. First, it tends to treat the situation of sociology under state socialism as a uniform experience, neglecting the enormous variations over space and time. In particular, the Stalinist period serves as the model while the expansion of higher education and the social sciences mostly took place during the late 1950s and 1960s in phases of relative relaxation of ideological control and repression. Both within, but more importantly, between countries, the diversity of theoretical, methodological, and thematic pluralism was enormous, with Marxism-Leninism being far from the monoparadigmatic hegemony often assumed. Second, the story is mostly written as a sociologist’s history, while the viewpoints of the Communist elites are seldom seriously reconstructed. The latter’s fundamental dilemma of being in need of social knowledge and expertise in order to legitimate their power, while at the same time limiting the space of critique and subversion inherent in this knowledge, is not adequately captured. Thus, also the concrete means by which the Communist elites exerted control over sociologists is not well studied, as well as the fact that the Communist elites were not homogenous in their views and policies. Third, the alleged backwardness of East European sociologies due to the socialist regimes is almost never corroborated by systematic international contextualization. Ideological pressure, the instrumentality of sociological knowledge for state power, and even ideological reconstruction of departments and research environments are no phenomena reserved for authoritarian regimes but have happened in West European democracies too. In general, most portrayals of sociology in state socialism rest upon assumptions of realities in the West being much brighter than they were. The aim of this special issue is to go beyond commonplace statements on sociology in state socialism by addressing these or similar issues through more rigorous historical research. We invite authors to take on the problematique of sociology in state socialism through systematic consideration of empirical evidence and theoretical argumentation. One way to achieve this is the use of comparative studies, contrasting instances of higher and lower degrees of academic freedom, of dissident and of conformist sociologies, of international and of parochial orientations, etc., and asking for possible explanations for these differences. Another strategy is to address the institutional and intellectual changes of the discipline in one or more countries more systematically. For example, why is it that Marxism has actually only blossomed under the most liberal conditions and began to disappear well before the end of the socialist regimes and under increasingly repressive conditions? Besides theoretically grounded empirical investigations we also very much welcome conceptual discussions of the relation between socialist rule and sociology as well as systematic reviews. / / / Please submit your proposal including all authors’ names, email addresses and affiliations and an abstract of around 500 words to redakcja@stanrzeczy.edu.pl by 31 October 2016\\. The editors will decide upon acceptance or rejection of the proposals by 7 November 2016\\. / / / Selected authors are invited to submit their manuscripts (max. 40.000 signs including tables, figures, and references) until 10 January 2017\\. All manuscripts will be peer-reviewed. Publication is planned for June 2017\\. / / / For any queries, please contact Matthias Duller (matthias.duller@uni-graz.at )or Mikołaj Pawlak (mikolajpawlak@uw.edu.pl), the guest editors of the issue.","date_start":"2017-10-31","date_end":"2017-01-10","important_dates":{"abstract":"","full":"2016-10-31","notification":"","final":""},"topics":["Social Sciences","Sociology","Sociology, Social Sciences"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":[""],"societies":[],"indexes":[],"emails":["redakcja@stanrzeczy.edu.pl","matthias.duller@uni-graz.at","mikolajpawlak@uw.edu.pl"]}