{"name":"African-American Arts: Activism and Aesthetics Conference","series":"","short":"","website":"http://www.bucknell.edu/ArtsActivismConference","content":"The African-American Arts: Activism and Aesthetic Conference will engage participants in a set of critical conversations by activists, scholars, and artists reflecting on the legacies of African-American activism as an element of artistic practice, particularly as they concern artistic expression and racism and the intersections of creative processes with aesthetic, economic, sociological, and psychological inequalities. What are the connections between African American arts, the work of social justice, and creative processes? If we conceive of the arts as part of the legacy of black activism in the United States, how can we use that construct to inform our understanding of the complicated intersections of African-American activism(s) and aesthetics? The conference will take place at Bucknell University, in Lewisburg, Pennsylvania, approximately three hours from the metropolitan areas of Washington, DC, Baltimore, Maryland, Philadelphia, Pennsylvania, and New York, New York. We invite scholars, activists, artists, and others to send abstracts engaging the questions and concerns of the conference as they intersect with African-American film, theater, dance, visual art, music, literature, performance and other art forms from disciplinary, multidisciplinary, and/or interdisciplinary perspectives. Possible topics for papers, lecture-demonstrations, and/or panels include but are not limited to: The Black Arts Movement of the 1950s Slam poetry and social justice New Black Aesthetic Improvisation Histories of Black Arts Movements Hip hop, and political activism Afrofuturism as a social justice project Performance and politics African-American aesthetics Author as public intellectual as well as the work of and questions raised by the creative productions of artists, including but not limited to: Erika Alexander, Alvin Ailey Dance Theater, Debbie Allen, Erykah Badu, Radcliffe Bailey, James Baldwin, Harry Belafonte, Gwendolyn Brooks, Octavia Butler, Ta-Nehisi Coates, John Coltrane, Misty Copeland, Julie Dash, Miles Davis, Jimmy Greene, Zora Neal Hurston, Samuel L. Jackson, Bill T. Jones, Spike Lee, Jacob Lawrence, Kasi Lemmons, Audre Lorde, Manning Marable, Wynton Marsalis, E. Ethelbert Miller, Toni Morrison, Gordon Parks, Prince, Faith Ringgold, Nina Simone, Anna Deveare Smith, Esperanza Spalding, Henry Ossawa Tanner, Alice Walker, Kara Walker, Carrie Mae Weems, Phillis Wheatley, August Wilson Submission Guidelines: Please submit a 250-word abstract here. The abstract should outline the central argument, offer key questions or concerns, and clear sites of engagement with conference themes. Presenters who wish to be considered for inclusion in the conference book publication edited collection will be required to submit a complete paper by September 1, 2016\\. https://griotinstituteforafricanastudiesbucknell.submittable.com/submit/5858?step=submission","date_start":"2016-09-29","date_end":"2016-10-01","important_dates":{"abstract":"","full":"2016-09-29","notification":"","final":""},"topics":["Arts & Humanities","Other","African American Studies"],"location":{"virtual":"","full":["Lewisburg","United States"],"name":"","street":"","city":"Lewisburg","state":"","ZIP":"","country":"United States"},"organizers":["Griot Institute for Africana Studies at Bucknell University"],"societies":[],"indexes":[],"emails":[]}