{"name":"Myth and Memory: Representing and Misrepresenting National Cultures and Peoples","series":"","short":"","website":"http://www.unishk.edu.al/sq/content/2nd-international-conference-english-and-american-studies-myth-and-memory-representing-and","content":"Myth and Memory: Representing and Misrepresenting National Cultures and Peoples - 2nd International Conference of English and American Studies, 5-6 May 2016 organized by Department of English and American Studies, Faculty of Foreign Languages “Luigj Gurakuqi” University of Shkodra, Albania CALL FOR PAPERS The Department of English and American Studies is pleased to announce a call for papers for an international and inter-disciplinary conference to be held at the University of Shkodra in May 2016\\. The end of the 20th century saw the break-up of several apparently established nation states, often following violent conflict. All this took place paradoxically in an era in which the idea of universal human rights was widely promoted in the context of a so-called globalised economy. The virulent racism of the early 20th century returned as „ethnic cleansing‟. This process, compounded by sectarian, linguistic and cultural difference and rivalry has continued into our own century seemingly accompanied by even greater violence. The older religious and imperial orders were largely replaced during the 19th century by the appeal to a new dynamic of „nation building‟. What appeared as a progressive movement of liberation, one of the grands recits of history, had consequences that proved disastrous, not least for Europe‟s „dark twentieth century‟. The subsequent break-up of Europe‟s overseas empires, the struggles for anti-colonial independence, may be thought in many cases to have produced similar results. Patriotic sentiment and revolutionary fervour, in both their positive and negative formations, have always been deeply entwined with cultural and educational activities and programmes. The whole fabric of civilisation is present: writing novels, history, poetry, journalism; composing music; sculpture, painting and architecture; building schools and universities; science andtechnology; mobilising and training armies; founding constitutions; establishing territorial and sectarian/confessional claims are all necessary and complementary features of a conflicted„modernity‟, that defers to the existence of nation states, while invoking a wider common multi- cultural humanity. In order to explore these issues, whether in the past or the present (or even, possibly, the future) we invite papers that address aspects of national, ethnic, sectarian, linguistic and cultural identities, and their relative importance as they are manifest in the following fields: Literary, artistic, and popular cultural (film, TV, newspapers, etc) production Political and economic history Legal and educational systems and practices Social psychology We hope to attract speakers from a wide variety of disciplines including literary, media and cultural studies; linguistics; sociology and political science; theology and philosophy; law and economics; history; education. Abstracts no longer than 300 words in English with up to 5 key words should be sent to bbushgjokaj@gmail.com or ierkoci@unishk.edu.al by 30 December, 2015\\. Please make sure you include the title, the author‟s name, affiliation and email. The conference fee of 80 euros includes the book of proceedings, conference material, conference dinner, refreshments, and certificate. The payment method, information about accommodation and other details will be available shortly on the conference website which is currently under construction.","date_start":"2016-05-05","date_end":"2016-05-06","important_dates":{"abstract":"","full":"2015-12-30","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","cultural studies"],"location":{"virtual":"","full":["Shkoder","Albania"],"name":"","street":"","city":"Shkoder","state":"","ZIP":"","country":"Albania"},"organizers":[""],"societies":[],"indexes":[],"emails":["bbushgjokaj@gmail.com","ierkoci@unishk.edu.al"]}