{"name":"Advances in Ovarian Cancer Research: Exploiting Vulnerabilities","series":"","short":"","website":"http://www.aacr.org/Meetings/Pages/MeetingDetail.aspx?EventItemID=43#.VPd0w2MZ7An","content":"This is the second AACR Special Conference focused on the latest advances in ovarian cancer research and their unique issues and challenges. The conference will explore basic and translational research concepts being used to develop novel therapeutic options for the treatment of women with ovarian cancer. A broad range of topics will be discussed, from cancer genomics to immunotherapy, appealing to laboratory scientists as well as clinical oncologists. World-renowned keynote speakers will discuss DNA repair and TP53, two key vulnerabilities in high-grade serous ovarian cancer. Mechanistic sessions will focus on our understanding of the basic biologic underpinnings of ovarian cancer biology, illustrating translational science, and developing concepts for clinical trials. This year, sessions will highlight non-serous ovarian cancer and approaches to prevention and early detection with results from a large screening trial expected to be presented. Other sessions will cover the increasingly important areas of immunotherapy, model systems, and the tumor microenvironment; areas of great scientific and therapeutic potential. In addition to presentations by invited speakers who are national and international experts, proffered talks from the most highly rated abstracts will be presented during plenary sessions. Attendees will be exposed to an extremely stimulating and interactive environment, enabling the exchange of ideas and fostering collaborations to bridge the gap between discovery and therapy. This conference is becoming a “must-attend” event that has previously attracted 300-400 basic, translational and clinical ovarian cancer investigators from around the world. Attending this program will not only provide the opportunity to hear the latest research in the fields mentioned above, but also help build collaborations to advance the detection, prevention, and treatment of this disease.","date_start":"2015-10-17","date_end":"2015-10-20","important_dates":{"abstract":"","full":"2015-08-03","notification":"","final":""},"topics":["Life Sciences","Biotechnology/ Bioinformatics","gender studies (and womens)"],"location":{"virtual":"","full":["ORLANDO","Vanuatu"],"name":"","street":"","city":"ORLANDO","state":"","ZIP":"","country":"Vanuatu"},"organizers":["AACR"],"societies":[],"indexes":[],"emails":[]}