{"name":"8th International Conference on Ad Hoc Networks","series":"","short":"","website":"http://adhocnets.org/2016/show/home","content":"CALL FOR PAPERS Scope Ad hoc networks, which cover a variety of network paradigms for specific purposes, such as mobile ad hoc networks, wireless sensor networks, vehicular networks, underwater networks, airborne networks, underground networks, personal area networks, and home networks, promise a broad range of applications in civilian, commercial, and military areas. The aim of the annual International Conference on Ad Hoc Networks (AdHocNets) is to provide a forum that brings together researchers from academia, government laboratories, as well as practitioners from industry to meet and exchange ideas and recent research work on all aspects of ad hoc networks. Held annually since 2009, the eighth edition of the event, AdHocNets 2016, will be held in Ottawa, Canada, in September 2016\\. The conference will consist of keynote talks, technical sessions, and associated workshops. The technical sessions will present original and fundamental research advances while the workshops will focus on development and application issues in this hot field. The workshops will be dedicated to specific and more focused themes, especially to the recent developments and emerging applications in ad hoc networking. Topics The conference solicits original technical papers that were not previously published and are not currently under review for publication elsewhere. Papers should address technical challenges in any type of ad hoc network, such as, but not limited to, Mobile Ad Hoc Networks, Sensor Networks, Vehicular Networks, Personal Area Networks, Body Area Networks, Smart Grid Networks, Nanonetworks, or Home Networks. Possible topics of interest include: - Network architectural and protocol design - Spectrum related issues in ad hoc networks - Metrics for ad hoc networks - Cognitive ad hoc networks - Cross-layer design - MAC, routing, and transport protocols - Resource allocation and management - Network control and management - Power control and management - Topology control and management - Quality of service provisioning - Service discovery - Ranging and node localization - Time synchronization - Data fusion - Network scalability and capacity - Reliability and fault tolerance - Security and privacy - Middleware for ad hoc networks - Applications of ad hoc networks - Performance modeling and analysis - Tools to design, implement, and evaluate ad hoc network protocols - Wireless Software-Defined Networking - Network Function Virtualization for ad hoc networks","date_start":"2016-09-26","date_end":"2016-09-27","important_dates":{"abstract":"","full":"2016-04-28","notification":"","final":""},"topics":["Engineering & Technology","Electrical/ Electronic","communication engineering"],"location":{"virtual":"","full":["Ottawa","Canada"],"name":"","street":"","city":"Ottawa","state":"","ZIP":"","country":"Canada"},"organizers":["EAI"],"societies":[],"indexes":[],"emails":[]}