{"name":"5th Annual International Conference on Language, Literature & Linguistics (L3 2016)","series":"","short":"","website":"http://l3-conference.org/index.html","content":"Important Dates \\*Extended Full Paper Submission Deadline: 12 February 2016 Early Bird Registration Deadline: 4 March 2016 Late Registration Deadline: 28 March 2016 Conference Dates: 30 - 31 May 2016 Keynote Addresses Prof. John Flowerdew, City University of Hong Kong, Hong Kong Assoc. Prof. Mie Hiramoto, National University of Singapore, Singapore Assoc. Prof. David Huddart, Chinese University of Hong Kong, Hong Kong Asst. Prof. Yin Ling Cheung, Nanyang Technological University, Singapore Assoc. Prof. Lian Hee Wee, Hong Kong Baptist University, Hong Kong Conference Theme Language is at a nexus of interrelationships between individuals, society and culture. The interface between language and literature has been the object of considerable interdisciplinary research on methods of analysis that can be applied across the two fields and their sub-areas. Less research has focused, however, on the influence of the new technologies on this interface, which transcends borders and cultures, with the process of translation adding yet another dimension to the already complex picture. The 4th Annual International Conference on L3 will examine the various issues and factors that intervene at the interface of language and literature, not least the cultural context(s) in which it is situated. The conference will bring together multi-disciplinary expertise from all relevant fields. We invite submissions for an abstract of a research-based paper in any of the relevant fields, including but not limited to: • Second-Language Acquisition • Public Service Interpreting and Translation • Comparative Literature • Linguistics • Translation and Interpreting • Curriculum Design \\*as we have received requests for extension from several authors","date_start":"2016-05-30","date_end":"2016-05-31","important_dates":{"abstract":"","full":"2016-02-12","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","Languages (human)"],"location":{"virtual":"","full":["Singapore","Singapore"],"name":"","street":"","city":"Singapore","state":"","ZIP":"","country":"Singapore"},"organizers":["Global Science and Technology Forum"],"societies":[],"indexes":[],"emails":[]}