{"name":"5th Annual International Conference on Geological and Earth Sciences","series":"","short":"GEOS 2016","website":"http://www.geoearth.org","content":"Scientific studies of the Earth System are generally oriented towards understanding three broad and inter-related issues, namely: the origin and evolution of the Earth through geological time span of about 4.55 Ga; the formation of earth resources and their distribution in space and time; and the earth processes in land-ocean-atmosphere interfaces. The evolution of the solid earth witnessed several bench mark events like core-mantle separation within 50 Ma since the origin of Earth, when bulk of the siderophile elements sank down to the core and the resultant thermal energy initiated the mantle convection, followed by extraction of continental and oceanic crust from the bulk silicate Earth. Mantle convection is believed to have played a significant role in several geodynamic processes including sea floor spreading, and the making and breaking of super-continents through the geological time. The formation of hydrosphere and atmosphere paved the way for the origin of life and its proliferation in water bodies and landmass from about 2500 Ma onwards. Human civilization has always relied on various Earth resources for survival, growth and development. Geoscientists have made significant contribution in understanding the genesis and spatial distribution of resources of industrial and ore minerals, fossil fuels and groundwater. Based on this knowledge several geological, geochemical and geophysical exploration methods have been developed and these are successfully practiced for discovery of earth resources. Earth’s surface processes on land, ocean and their interfaces with atmosphere have a direct bearing on landforms, climate, rainfall and vegetation. Understanding these processes helps in supporting agriculture, and zonation and mitigation of several natural hazards. Important dates: Extended Full Paper Submission Deadline : 30 June 2016 Final paper (Camera-Ready): 22 July 2016 Early Bird Registration: 29 july 2016 Late Registration Deadline : 19 August 2016 Conference Dates: 10 - 11 October 2016","date_start":"2016-10-10","date_end":"2016-10-11","important_dates":{"abstract":"","full":"2016-06-30","notification":"","final":""},"topics":["Social Sciences","Geography"],"location":{"virtual":"","full":["Singapore","Singapore"],"name":"","street":"","city":"Singapore","state":"","ZIP":"","country":"Singapore"},"organizers":["Global Science & Technology Forum (GSTF)"],"societies":[],"indexes":[],"emails":[]}