{"name":"11th International Conference on Heterogeneous Networking for Quality, Reliability, Security and Robustness","series":"","short":"","website":"http://qshine.org/2015","content":"Scope Computer networking has been embracing increased heterogeneity since its inception, in terms of the range of the applications it has to support, the various communication technologies it can run on, and the hierarchical, hybrid and heterogeneous techniques it has to rely on to meet the challenges from both the diverse application requirements and communication technologies. As the only conference focusing on heterogeneous networking, QShine has been established as the primary venue for researchers and practitioners to disseminate, exchange and discuss all recent advances related to heterogeneous networking, particularly for quality, experience, reliability, security and robustness. The 2015 edition of Qshine will focus on Innovative and Intelligent Infrastructure for the Future Networks. Original submissions, not under any concurrent reviews, are solicited in all areas related to heterogeneous wired, wireless and hybrid networks varying from sensor, vehicle, cellular, ad hoc, enterprise, datacenter, to service-provider and overlay networks, ranging from in/on-body, personal/local/metropolitan/wide-area, to intra/inter-planetary scales Conference topics Topics of interest include, but not limited to, the following: • Quality-of-Service (QoS) provisioning: architectures, protocols, mechanisms, etc. • Quality of Experience (QoE): user-perceived quality, cost-sensitive experience, etc. • Reliability and Scalability: performance, adaptation, cognition, extensibility, etc. • Security and Privacy: system/network security, user privacy/accountability, etc. • Robustness: fault/disruption/disaster-tolerance, resilience, survivability, etc. • Cross-Layer Design, Optimization and Implementation: spectrum/energy efficiency. • Social and Economic Perspectives: incentive, pricing, billing, governance, etc. • New Applications and Communication Technologies: cloud, smart grid, SDN, etc. Special Sessions 3 Special Sessions will be held in conjunction with QShine conference, for more information, click on the individual session to access call for papers: Sensor Networks and Cloud Computing Heterogeneous Big Data Processing in Mobile Cloud Computing 5G Communication Architecture and Technology","date_start":"2015-08-19","date_end":"2015-08-20","important_dates":{"abstract":"","full":"2015-05-31","notification":"","final":""},"topics":["Education / Legal / Other","Other","Networks, networking & communications"],"location":{"virtual":"","full":["Taipei","Taiwan","Province Of China"],"name":"","street":"","city":"Taipei","state":"Taiwan","ZIP":"","country":"Province Of China"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}