{"name":"3rd International Conference on Information Systems Security and Privacy – ICISSP 2017","series":"","short":"","website":"http://www.icissp.org","content":"Venue: Porto, Portugal Event date: 19 - 21 February, 2017 Regular Papers Paper Submission: October 7, 2016 Authors Notification: December 2, 2016 Camera Ready and Registration: December 16, 2016 Position Papers Paper Submission: November 11, 2016 Authors Notification: December 16, 2016 Camera Ready and Registration: January 5, 2017 Workshops Workshop Proposal: November 10, 2016 Paper Submission: November 24, 2016 Authors Notification: December 14, 2016 Camera Ready and Registration: December 28, 2016 Doctoral Consortium Paper Submission: December 29, 2016 Authors Notification: January 11, 2017 Camera Ready and Registration: January 23, 2017 Special Sessions Special Session Proposal: November 28, 2016 Tutorials, Demos and Panels Proposals: January 3, 2017 Scope: The International Conference on Information Systems Security and Privacy aims at creating a meeting point for researchers and practitioners that address security and privacy challenges that concern information systems, especially in organizations, including not only technological issues but also social issues. The conference welcomes papers of either practical or theoretical nature, presenting research or applications addressing all aspects of security and privacy, that concerns to organizations and individuals, thus creating new research opportunities. ICISSP 2017 will be held in conjunction with MODELSWARD 2017 and SENSORNETS 2017\\. Registration to ICISSP allows free access to the MODELSWARD and SENSORNETS conferences (as a non-speaker). CONFERENCE TOPICS: - Access and Usage Control - Authentication, Privacy and Security Models - Automotive Security - Biometric Technologies and Applications - Content Protection and Digital Rights Management - Cryptographic Algorithms - Data and Software Security - Data Mining and Knowledge Discovery - Database Security - Identity and Trust Management - Information Hiding and Anonymity - Intrusion Detection and Response - Legal and Regulatory Issues - Malware Detection - Mobile Systems Security - Phishing - Privacy Metrics and Control - Privacy, Security and Trust in Social Media - Privacy-Enhancing Models and Technologies - Risk and Reputation Management - Security and Privacy in Cloud and Pervasive Computing - Security and Trust in Pervasive Information Systems - Security Architecture and Design Analysis - Security Awareness and Education - Security Frameworks, Architectures and Protocols - Security Testing - Software Security Assurance - Threat Awareness - Vulnerability Analysis and Countermeasures - Web Applications and Services KEYNOTE LECTURES Elisa Bertino, Purdue University, United States Nancy Cam-Winget, Cisco Systems, United States Bart Preneel, K.U.Leuven ESAT/COSIC, Belgium CONFERENCE CHAIR Olivier Camp, MODESTE/ESEO, France PROGRAM CO-CHAIRS Paolo Mori, Istituto di Informatica e Telematica, Consiglio Nazionale delle Ricerche, Italy Steven Furnell, Plymouth University, United Kingdom PROGRAM COMMITTEE http://www.icissp.org/ProgramCommittee.aspx ICISSP Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setúbal - Portugal Tel: +351 265 100 033 Fax: +351 265 520 186 e-mail: icissp.secretariat@insticc.org Web: http://www.icissp.org","date_start":"2017-02-19","date_end":"2017-02-21","important_dates":{"abstract":"","full":"2016-10-07","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["icissp.secretariat@insticc.org"]}