{"name":"5th International Conference on Photonics, Optics and Laser Technology – PHOTOPTICS 2017","series":"","short":"","website":"http://www.photoptics.org","content":"Venue: Porto, Portugal Event date: February 27 – 1 March, 2017 Regular Papers Paper Submission: September 22, 2016 Authors Notification: November 16, 2016 Camera Ready and Registration: December 5, 2016 Position Papers Paper Submission: November 3, 2016 Authors Notification: December 12, 2016 Camera Ready and Registration: December 22, 2016 Workshops Workshop Proposal: October 28, 2016 Special Sessions Special Session Proposal: November 16, 2016 Paper Submission: November 30, 2016 Authors Notification: December 16, 2016 Camera Ready and Registration: December 26, 2016 Tutorials, Demos and Panels: December 22, 2016 Scope: Optical systems are ubiquitous in modern society, from medical sciences to space exploration, telecommunications, information processing and numerous industrial and military applications of all kinds. This 5th edition of PHOTOPTICS will feature 3 different tracks on Optics, Photonics and Lasers, covering both theoretical and practical aspects. Researchers, engineers and practitioners interested in any of these fields are welcome to join us in Rome and present their work on new methods or technologies, advanced prototypes, systems, tools and techniques, as well as general survey papers indicating future directions. Conference Areas: Each of these topic areas is expanded below but the sub-topics list is not exhaustive. Papers may address one or more of the listed sub-topics, although authors should not feel limited by them. Unlisted but related sub-topics are also acceptable, provided they fit in one of the following main topic areas: 1\\. Optics 2\\. Photonics 3\\. Lasers AREA 1: OPTICS - Adaptative Optics - Optometry - Fiber Optics Technology - Biomedical Optics - Computational Optical Sensing and Imaging - Optical Instrumentation - Optics in Astronomy and Astrophysics - Spectroscopy, Imaging and Metrology - Optical Communications and Networking - Photorefractive Effects, Materials and Devices - Optical Materials and Devices - Light-matter Interaction - Applied Industrial Optics AREA 2: PHOTONICS - Organic and Bio-photonics - Molecular Photophysics and Spectroscopy - Molecular energy transfer and light harvesting - MOEMS-MEMS - Nanophotonics and Optical Manipulation - Plasmonic Structures and Quantum dots - Photonics for Energy - Photonic and Optoelectronic Materials and Devices - Communications and Switching Photonics - Ultrafast Electronics, Photonics and Optoelectronics - Green Photonics - Photodetectors, Sensors and Imaging - Fiber Optics devices - Nonlinear Optics and Photonics - Microwave Photonics - Optogenetics AREA 3: LASERS - High Intensity Lasers and High Field Phenomena - Quantum Electronics and Laser Science - Quantum Information and Measurement - Biomedical and Therapeutic Laser Applications - Laser Spectroscopy and Microscopy - Fiber Lasers and Applications - Waveguide Lasers - Semiconductor Lasers and LEDs - Plasma Technologies KEYNOTE LECTURES José Luís Santos, Universidade do Porto, Portugal Jean–Luc Adam, Université de Rennes 1, France David J. Richarson, University of Southampton, United Kingdom CONFERENCE CO-CHAIRS David Andrews, University of East Anglia, United Kingdom Paulo A. Ribeiro, CEFITEC/FCT/UNL, Portugal PROGRAM CHAIR Maria Raposo, CEFITEC, FCT/UNL, Portugal LOCAL CHAIR Paulo Marques, FCUP / INESC Porto, Portugal PROGRAM COMMITTEE http://www.photoptics.org/ProgramCommittee.aspx PHOTOPTICS Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setubal - Portugal Tel: +351 265 520 185 Fax: +351 265 520 186 e-mail: photoptics.secretariat@insticc.org Web: http://www.photoptics.org/","date_start":"2017-02-27","date_end":"2017-03-01","important_dates":{"abstract":"","full":"2016-09-22","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["photoptics.secretariat@insticc.org"]}