{"name":"6th International Conference on Sensor Networks – SENSORNETS 2017","series":"","short":"","website":"http://www.sensornets.org","content":"Venue: Porto, Portugal Event date: February 19 - 21, 2017 Regular Papers Paper Submission: October 7, 2016 Authors Notification: December 2, 2016 Camera Ready and Registration: December 16, 2016 Position Papers Paper Submission: November 11, 2016 Authors Notification: December 16, 2016 Camera Ready and Registration: January 5, 2017 Workshops Workshop Proposal: November 10, 2016 Special Sessions Special Session Proposal: November 28, 2016 Tutorials, Demos and Panels proposals: January 3, 2017 Scope: Current developments show that in the near future the wide availability of low cost, short range radio technology, along with advances in wireless networking, will enable wireless adhoc sensor networks to become commonly deployed. In these networks, each node may be equipped with a variety of sensors, such as acoustic, seismic, infrared, motion, biomedical and chemical sensors with higher level of information inference associated with identification, embedded signal processing and networking of the data. This conference intends to be the meeting point of researchers and practitioners to share experiences and ideas on innovative developments in any aspect of sensor networks, including Hardware of Sensor Networks, Wireless Communication Protocols, Sensor Networks Software and Architectures, Wireless Information Networks, Data Manipulation, Signal Processing, Localization and Object Tracking through Sensor Networks, Obstacles, Applications and Uses. Conference Areas: Each of these topic areas is expanded below but the sub-topics list is not exhaustive. Papers may address one or more of the listed sub-topics, although authors should not feel limited by them. Unlisted but related sub-topics are also acceptable, provided they fit in one of the following main topic areas: 1\\. SENSOR NETWORKS SOFTWARE, ARCHITECTURES AND APPLICATIONS 2\\. SENSOR NETWORKS 3\\. ENERGY AND ENVIRONMENT 4\\. INTELLIGENT DATA ANALYSIS AND PROCESSING 5\\. SECURITY AND PRIVACY IN SENSOR NETWORKS Area 1: Sensor Networks Software, Architectures and Applications - Internet of Things - Modeling and Simulation - Decision Support - Platforms and Operating Systems - Programming and Middleware - Connectivity and Communication - Scheduling, Tasking and Control - Home Monitoring - Ambient Assisted Living - Human-Computer Interfaces - Multi-Agent Systems - Cloud Computing Area 2: Sensor Networks - Technologies and Standards - Wireless Network Protocols - Optical Sensors - Physical Sensors: Temperature, Mechanical, Magnetic, and other - Sensor Networks - Sensor Applications - Wired and Wireless Sensor Systems: Signals, Transceivers, and Interfaces - Routing Techniques - Ad Hoc Networks - Network Performance - Power Management - Network Topologies - Node Mobility - Cross-Layer Design - Connected Vehicles - Networked Embedded Systems - Wearable Computing and Body Area Networks Area 3: Energy and Environment - Green Sensor Networks - Environment Monitoring - Measurement and Control of Water - Air Quality Monitoring - Gas Analysis and Sensing - Remote Sensing and Telemetry - Geospatial Knowledge Management Systems - Fire, Drought and Flood Monitoring - Smart Grids and Energy Control Systems - Energy Efficiency - Environmental Impact Reduction - Industrial and Structural Monitoring Area 4: Intelligent Data Analysis and Processing - Sensor Data Fusion - Multi-sensor Data Processing - Aggregation, Classification and Tracking - Pattern Recognition - Reasoning on Sensor Data - Data Quality and Integrity - Interoperability - Statistical and Adaptive Signal Processing - Information Retrieval and Data Mining - Ontologies - Big Data - Computational Intelligence - Image Processing Area 5: Security and Privacy in Sensor Networks - Security Threats - Cryptography - Infrastructure Reliability - Authentication - Defense and Security - Wireless Surveillance - Visual Sensor Networks - Fault Tolerance and Diagnosis - Vulnerability and Privacy - Biometric Systems - Healthcare Applications KEYNOTE LECTURES Nancy Cam-Winget, Cisco Systems, United States Nirwan Ansari, New Jersey Institute of Technology, United States Mirko Presser, Alexandra Instituttet, Denmark CONFERENCE CHAIR César Benavente-Peces, Universidad Politécnica de Madrid, Spain PROGRAM CO-CHAIRS Eric Fleury, INRIA Grenoble - Rhône-Alpes, France Andreas Ahrens, Hochschule Wismar, University of Technology Business and Design, Germany PROGRAM COMMITTEE http://www.sensornets.org/ProgramCommittee.aspx SENSORNETS Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setúbal - Portugal Tel: +351 265 100 033 Fax: +351 265 520 186 e-mail: sensornets.secretariat@insticc.org Web: http://www.sensornets.org/","date_start":"2017-02-19","date_end":"2017-02-21","important_dates":{"abstract":"","full":"2016-10-07","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["sensornets.secretariat@insticc.org"]}