{"name":"International Conference On Cyber Security And Protection Of Digital Services (Cyber Security 2016), June 13-14, 2016, London, UK","series":"","short":"","website":"http://www.c-mric.org/cs-2015","content":"Call for Papers June 13-14, 2016, London, UK IEEE is the Technical Co-Sponsor (TCS) of the International Conference on Cyber Security and Protection of Digital Services (Cyber Security 2016), an international refereed conference dedicated to the advancement of Cyber Security, information security, network security, application security and business transformation of digital services, and the protection of public digital services, especially high value bearing online services. The aim of the Cyber Security 2016 is to encourage participation and promotion of collaborative scientific, industrial and academic inter-workings among individual researchers, practitioners, members of existing associations, academia, standardisation bodies, and including government departments and agencies. The purpose is to build bridges between academia and industry, and to encourage interplay of different culture. Cyber Security 2016 invites researchers and industry practitioners to submit papers that encompass principles, analysis, design, methods and applications. All submitted papers are independently peer-reviewed. The conference proceedings will be submitted, and published on bibliographic indexes by the following: IEEE Computer Society Digital Library, IEEE Xplore Digital Library, DBLP Computer Science, Scopus, CiteSeerX, Computer Science Index, EI Compendex, Academic Search Complete, CiteULike, Google Scholar & Microsoft Academic Search. Details Cyber Security 2016 is co-located with other conferences as part of Cyber Science 2016\\. · Posters will be presented during the conference. · Industry track is available for discussing and publishing pilot and proof of concepts. · Work in Progress track is available for preliminary work. · Research Ideas track is available for ideas in early stages assessment. · PhD Seminar track is available for discussing and publishing early PhD thesis research. Submission Deadline Deadline for all paper submissions, that is, both full papers and extended abstracts for Poster, WIP, PoC, Research Idea and PhD Seminar presentations is 26th February 2016\\. All Industry track, Work in Progress track, Research Ideas track and PhD Seminar track will be published in the conference proceedings. Interested participants, please submit your proposal using the online submission system hosted by Easychair Conference Portal. Full paper submission should be via Easychair Conference Portal. Topics of Interest Original papers are invited on recent advances in Cyber Security, Online Services, and Protection Mechanisms for Digital Services. The topics in Cyber Security 2016 include but not limited to: Cyber Security · Information Security · Computer Network Security · Application Security · Web Services Security · Mobile Security · Protective Security · Software Security · Wireless & Sensor Network Security · Software Coding Security · Barcode Scanner Security · Security in Middleware, Interface and Interaction · Security Services in Authentication, Authorisation, Accountability, Automation, Availability, Integrity and Nonrepudiation · Security Management · Security Operations · Digital Trust and Reputation · Geographical Location (IP Geolocation) and Cyber Travel · Geospatial Intelligence Networks (Centralised, Distributed & Hybrid) · Policy, Legal, Legislation & Compliance · Security Standardisation · Law, Legal and Ethics Digital Services · Web Services · Internet Banking · E-Booking · Cloud Computing · E-Government · Electronic Commerce · Citizens Public Online Services · Mobile Commerce · E-Postal Services · E-Health · Online & Virtual Education · E-Learning · Web Chats · Secure Protocols, Coding and Development · Security Principles, Theory and Analysis · Security Policy, Standards and Procedures · Security in Business Processes · Security Enforcing Function (SEF) Gateways · Intrusion Detection Systems · Intrusion Prevention Systems · Firewalls · Anti-Virus and Anti-Malware Gateways · Data Loss Prevention · Encryption Services Protection of Digital Services · Protection of Business Information Systems · Protection of Online Services · Public Online Services · Internet Banking · Security, Trust, Privacy · Security in Online Gaming Systems · Security in e-Government and Electoral Systems · Content Security · Protection of Public Online Content Distribution Systems · Secure practices, processes and procedures in Public Online Services · Cryptography - PKI, HSMs, Symmetric and Asymmetric Crypto, Crypto Custodian & Crypto Standards and Practices · Digital Forensics and Investigations · HoneyPots and Honey Nets · Critical National Infrastructures (CNIs) · Critical Network Systems (CNS) All the accepted papers will appear in the proceedings! Best Papers The best paper of each section will be selected and their author(s) will receive a corresponding Award Certificate. Authors of the Best 20%-25% papers presented at the conference will be invited to adapt their papers for their publication in one of the special issues peer reviewed journals. SA Journal","date_start":"2016-06-13","date_end":"2016-06-14","important_dates":{"abstract":"","full":"2016-02-26","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Big Data Mining & Analysis"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Centre for Multidisciplinary Research, Innovation and Collaboration (C-MRiC)"],"societies":[],"indexes":[],"emails":[]}