{"name":"Constanta International Model United Nations (CTAMUN) 2016","series":"","short":"","website":"www.ctamuncontact.wix.com/ctamun","content":"REGISTRATION FORM now available on https://docs.google.com/forms/d/1nuPBoCPExUmTvUS6Jj-81rSjASDTRZuoj8gxUclbgD4/viewform?c=0&w=1 Constanta International Model United Nations (CTAMUN), 21-24 April 2016, opens its gates for every individual ready to expand one’s political thought and diplomacy perspectives or simply for those willing to gain a sense of of what a varied, fascinating world we live in. Have you ever taken into consideration the possibility to be the ambassador of a country within a United Nations meeting? Now it’s your big chance to role-play as diplomats and secure the interests of nations whilst solving international issues. Being involved in simulations of conflict resolution processes and political negotiations is demonstrating again the willingness of youth to learn and understand the mechanics of our contemporary society. Join us to get an insight to the politicized nature of international predicaments, the bureaucratic functioning of UN organs, as well as to reach some memorable experience both for your personal and professional development in a friendly, sincere, respectful and challenging setting! http://ctamuncontact.wix.com/ctamun https://mymun.net/muns/ctamun-2016 MODEL UNITED NATIONS, as intimidating for some of you might sound, or already a piece of cake for the veterans, you might consider this opportunity, just let us highlight what you will gain from this experience: -Debating, Consulting, Deliberating, Diplomacy, Research and Leadership skills -A sense of awareness -Critical Thinking -Conduct international negotiations -Understanding the bureaucratic functioning of The United Nations Organization -An international perspective and open-mindedness regarding different cultural and political backgrounds. -Perform as an experimented public speaker -Abilities in Technical Writing -Fluency in international languages -New friendships beyond the diplomatic floor The conference takes place on a duration of 4 days in Ovidius University of Constanta. The delegates will role play as diplomats in 3 of the most compelling committees of the United Nations: General Assembly, Human Rights Council and Security Council over riveting topics and current affairs. MUN resembles a real political summit. The issues tackled during the conference are to be decided upon by the chairs and announced within a month before the conference alongside with the study guides. Do not miss this opportunity and book your special early-bird discount. You can apply either for being: -a chair -a delegate -a journalist. BEST VALUE MUN!!! The early-bird delegate fee: 12 €/55 Romanian Leu. Special discounts for delegations (minimum 3 persons): 10 €/45 Romanian Leu (price per person) The Early Bird Discount is available until the 1st of February 2016, after that date the prices will steadily increase. DEADLINE: -For Chairs and Journalists: 1st of February 2016 -Individual Delegates and Delegations: 14th of April 2016 The DELEGATE FEE includes: -Conference Supplies -Coffee&Lunch Breaks during the Conferences -Receptions at the Galas If you have further misunderstandings or inquiries do not hesitate to contact: • Vanda Niculescu (facebook) Director of Projects within United Nations Youth Association of Romania-Constanta Branch • Teodora Papuc (facebook) Project Executive within United Nations Youth Association of Romania-Constanta Branch Or email us on: constantaatunyouth.ro Visit our website: http://ctamuncontact.wix.com/ctamun and our facebook event: https://www.facebook.com/events/406712139537687/ LIKE US ON FACEBOOK AND STAY TUNED: https://www.facebook.com/UN-Youth-Association-of-Romania-…/… https://www.facebook.com/constantamun/","date_start":"2016-04-21","date_end":"2016-04-24","important_dates":{"abstract":"","full":"2016-04-14","notification":"","final":""},"topics":["Social Sciences","Political-Science","Languages (human)"],"location":{"virtual":"","full":["Constanta","Romania"],"name":"","street":"","city":"Constanta","state":"","ZIP":"","country":"Romania"},"organizers":["United Nations Youth Association of Romania-Constanta Branch"],"societies":[],"indexes":[],"emails":[]}