{"name":"Bank of Albania Call for Papers - 10th South-Eastern European Economic Research Workshop","series":"","short":"","website":"https://www.bankofalbania.org/web/pub/see_workshop_x_call_for_papers_2016_2_8467_1.pdf","content":"Invitation and Call for Papers - 10th South-Eastern European Economic Research Workshop organized by the Bank of Albania. Following the tradition of successful and productive research workshops, the Bank of Albania has the pleasure to announce its 10th SEE Economic Research Workshop. The workshop aims to bring together researchers, scholars and central banks experts to present and discuss their research work in economics and finance. The 10th SEE Economic Research Workshop will take place on 1 and 2 December 2016 in Tirana, Albania. The topic of this workshop will be “Including monetary policy and financial shocks and trends in modeling and policy analysis”. To participate in this workshop you should submit an extended abstract (300 – 500 words) in English and a short bio by August 31st 2016 to Dr. Altin Tanku, Director of the Research Department (atanku@bankofalbania.org) and to Drita Malutaj, Specialist in the Research Department (dmalutaj@bankofalbania.org). All abstracts should include the title, keywords, JEL classification, authors’ names and affiliation and the email address of the corresponding author. Submitted papers shall be assessed by a Selection Committee, which will notify you for the paper acceptance by the end of October. Final papers and the PowerPoint Presentations should be sent no later than November 15, 2016 to dmalutaj@bankofalbania.org. With kind regards, On behalf of the Bank of Albania, Dr. Altin TANKU, Head of the Research Department Bank of Albania","date_start":"2016-12-01","date_end":"2016-12-02","important_dates":{"abstract":"","full":"2016-12-01","notification":"","final":""},"topics":["Business","Finance","Statistics"],"location":{"virtual":"","full":["Tirane","Albania"],"name":"","street":"","city":"Tirane","state":"","ZIP":"","country":"Albania"},"organizers":["Bank of Albania"],"societies":[],"indexes":[],"emails":["atanku@bankofalbania.org","dmalutaj@bankofalbania.org"]}