{"name":"The IAFOR International Conference on the City 2017 (City2017)","series":"","short":"","website":"http://iafor.org/conferences/city2017","content":"The IAFOR Conference on “the City” places the international, intercultural and interdisciplinary tenets of IAFOR at the very heart of multiple academic approaches to the city, from the development of the classic city states east and west, to the emergence of the vast organisms that are our modern cities. Different cities have very different personalities, influenced, for example, by history, government, climate, and geographical location – from uptight financial powerhouses to relaxed tourist resorts, they are governed in different ways, and compete against each other for attention and resources, sometimes domestically, but also with other foreign rivals. This conference encourages interdisciplinary and comparative reflections from the world’s cities, from small cathedral city, to sprawling metropolis. The city has always been a center of creativity and imagination. The many cultures that are formed within the city have become definitive of the development of human civilization in different eras. From the cities that were the product of the ancient river civilizations on the Nile, the Tigris Euphrates or the Ganges and the Yellow River through the classical and medieval city states, to the modern cities of the industrial revolution, the city provides an exciting object of study. The conference is set up to encourage the exploration of the city in all its variations and to provide a further context for reflections on globalisation as the wave of today and tomorrow. This conference will be held in parallel to a conference on Global Studies, and will provide a counter to the localised perspectives that can easily obscure the simple fact that many of the world’s major cities have now become, more than ever, global portals and places of international exchange. We invite academics from around the world to join us in the fascinating historical, cultural, and artistic center of Barcelona, to exchange ideas and participate in the continuing story of this city. The IAFOR International Conference on the City 2017 will again be held alongside The IAFOR International Conference on Global Studies 2017\\. Registration for either of these conferences will allow participants to attend sessions in the other. \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ Conference Streams: Submissions are organised into the following thematic streams: Language. Literature and Linguistics Visual and Performing Arts Music, Musicology and Ethnomusicology Media, Film and Communication Studies Culture, Popular Culture and Cultural Studies Psychology and the Behavioral Sciences Ethics, Religion and Philosophy Sustainability: Ecology, Energy and the Environment History, Anthropology and Archaeology Geography and Landscape/Urban Planning, Architecture and Design Political Science: Administration, Governance and Finance Economics and Business Studies Sociology. Social Work and Social Concerns Technology and Information Science Global cross-cultural comparisons Public Policy (including Health and Education) Travel and Tourism \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ To submit an abstract, please log into the IAFOR Submission System: http://iafor.org/iafor/iafor-submission-system/login.php For more information on City2017, please visit the conference website: http://iafor.org/conferences/city2017/ We look forward to seeing you in Barcelona!","date_start":"2017-07-15","date_end":"2017-07-17","important_dates":{"abstract":"","full":"2017-02-28","notification":"","final":""},"topics":["Social Sciences","Other","cultural studies"],"location":{"virtual":"","full":["Barcelona","Spain"],"name":"","street":"","city":"Barcelona","state":"","ZIP":"","country":"Spain"},"organizers":["IAFOR - The International Academic Forum"],"societies":[],"indexes":[],"emails":[]}