{"name":"3rd ICSD 2015,International Conference on Sustainable Development Rome, Italy","series":"","short":"","website":"http://www.ecsdev.org/index.php/conference","content":"3rd ICSD 2015, 5-6 June 2015, Rome, Italy Conference Objective and Philosophical Framework The International Conference on Sustainable Development is inspired from the critical challenge of human, environmental, and economic sustainability concerning the present and future generations in a global-scale context The 3rd ICSD 2015 will be held at the Gregorian University, Piazza della Pilotta, 4, Rome, Italy Friday 5 - Saturday 6 June, 2015\\. The Conference theme is: \"Creating a unified foundation for the Sustainable Development: research, practice and education\". This theme emphasizes the strong foundation that is provided by using research to inform our everyday practices, policies, and analytical approaches. The 2015 Conference will once again provide a forum for the sharing of ideas, presentation of research findings, and discussion of professional issues relevant to Sustainability Science. This ambition will proceed in a multidisciplinary way across the various fields and perspectives, through which we can address the fundamental and related questions of Sustainable Development. This interdisciplinary forum is for scholars, teachers, and practitioners from any professional discipline who share an interest in—and concern for— sustainability in an holistic perspective, where environmental, cultural, economic and social concerns intersect. We invite you to submit an abstract in the range of the following streams within the ICSD2015 program: 1\\. Economic Sustainability: Financial Sustainability, SME, MicroFinance, Emerging Countries, International Trade, 2\\. Environmental Sustainability: Water and Soil conservation, Healthcare, Renewable Energies, Food and Enviromental Legislation 3\\. Socio-Cultural Sustainability: Sustainable Urbanism, Education, Human Development, Psychology, Sociology We are inviting proposals for paper presentations, posters/exhibits, or virtual presentation. Proposal ideas that extend beyond these thematic areas will also be considered. For more information about the ideas and themes underlying this community send an e-mail at: conference@ecdev.org Virtual participation is available for those who are unable to attend the conference in person. All conference registrants (in-person and virtual) will be published in the European Journal of Sustainable Development, Special Issue ICSD2015.","date_start":"2015-06-05","date_end":"2015-06-06","important_dates":{"abstract":"","full":"2015-06-05","notification":"","final":""},"topics":["Business","Economics","environmental science & ecology"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["ECSDEV - European Center of Sustainable Development"],"societies":[],"indexes":[],"emails":["conference@ecdev.org"]}