{"name":"9th International Conference on Agents and Artificial Intelligence – ICAART 2017","series":"","short":"","website":"http://www.icaart.org","content":"Venue: Porto, Portugal Event date: 24 - 26 February, 2017 Regular Papers Paper Submission: October 4, 2016 Authors Notification: November 28, 2016 Camera Ready and Registration: December 13, 2016 Position Papers Paper Submission: November 8, 2016 Authors Notification: December 13, 2016 Camera Ready and Registration: December 30, 2016 Workshops Workshop Proposal: November 7, 2016 Doctoral Consortium Paper Submission: December 26, 2016 Authors Notification: January 6, 2017 Camera Ready and Registration: January 16, 2017 Special Sessions Special Session Proposal: November 23, 2016 Paper Submission: December 9, 2016 Authors Notification: December 23, 2016 Camera Ready and Registration: January 2, 2017 Tutorials, Demos and Panels Proposals: December 29, 2016 Scope: The purpose of the International Conference on Agents and Artificial Intelligence is to bring together researchers, engineers and practitioners interested in the theory and applications in the areas of Agents and Artificial Intelligence. Two simultaneous related tracks will be held, covering both applications and current research work. One track focuses on Agents, Multi-Agent Systems and Software Platforms, Distributed Problem Solving and Distributed AI in general. The other track focuses mainly on Artificial Intelligence, Knowledge Representation, Planning, Learning, Scheduling, Perception Reactive AI Systems, and Evolutionary Computing and other topics related to Intelligent Systems and Computational Intelligence. ICAART 2017 will be held in conjunction with ICORES 2017 and ICPRAM 2017\\. Registration to ICAART allows free access to the ICORES and ICPRAM conferences (as a non-speaker). CONFERENCE AREAS: Each of these topic areas is expanded below but the sub-topics list is not exhaustive. Papers may address one or more of the listed sub-topics, although authors should not feel limited by them. Unlisted but related sub-topics are also acceptable, provided they fit in one of the following main topic areas: 1\\. AGENTS 2\\. ARTIFICIAL INTELLIGENCE AREA 1: AGENTS - Semantic Web - Multi-Agent Systems - Distributed Problem Solving - Agent Communication Languages - Agent Models and Architectures - Cooperation and Coordination - Conversational Agents - Negotiation and Interaction Protocols - Programming Environments and Languages - Task Planning and Execution - Autonomous Systems - Cognitive Robotics - Group Decision Making - Web Intelligence - Agent Platforms and Interoperability - SOA and Software Agents - Simulation - Economic Agent Models - Mobile Agents - Privacy, safety and security - Collective Intelligence - Physical Agents - Robot and Multi-robot Systems - Self Organizing Systems - Cloud Computing - Auctions and Markets - Agile Management AREA 2: ARTIFICIAL INTELLIGENCE - Intelligent User Interfaces - Bayesian Networks - Soft Computing - Neural Networks - Natural Language Processing - Machine Learning - Planning and Scheduling - Knowledge Representation and Reasoning - Uncertainty in AI - Model-Based Reasoning - Ontologies - Data Mining - Data Science - Constraint Satisfaction - State Space Search - Case-Based Reasoning - Cognitive Systems - Reactive AI - Vision and Perception - Pattern Recognition - Ambient Intelligence - AI and Creativity - Evolutionary Computing - Fuzzy Systems - Knowledge-Based System - Industrial applications of AI - Hybrid Intelligent Systems - Visualization - Knowledge-Based Maps KEYNOTE LECTURES Vanessa Evers, University of Twente, Netherlands João Leite, Universidade Nova de Lisboa, Portugal Nuno Lau, Universidade de Aveiro, Portugal CONFERENCE CHAIR Joaquim B Filipe, Polytechnic Institute of Setúbal / INSTICC, Portugal PROGRAM CO-CHAIRS Jaap van den Herik, Leiden University, Netherlands Ana Paula Rocha, LIACC-NIAD&R / FEUP, Portugal LOCAL CHAIR Brígida Faria, School of Allied Health Sciences - Polytechnic Institute of Porto (ESTSP-IPP), Portugal PROGRAM COMMITTEE http://www.icaart.org/ProgramCommittee.aspx ICAART Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setúbal - Portugal Tel: +351 265 520 185 Fax: +351 265 520 186 e-mail: icaart.secretariat@insticc.org Web: http://www.icaart.org/","date_start":"2017-02-24","date_end":"2017-02-26","important_dates":{"abstract":"","full":"2016-10-04","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["icaart.secretariat@insticc.org"]}