{"name":"6th Annual International Conference on Business Strategy and Asian Economic Transformation (BizStrategy 2016)","series":"","short":"","website":"http://biz-strategy.org/index.html","content":"Important Dates Extended paper submission: 24 June 2016 Final Paper (Camera-Ready) Submission Deadline: 5 August 2016 Early bird Registration Deadline : 8 July 2016 Late Registration Deadline: 29 July 2016 Conference date: 22 – 23 August 2016 Keynote Addresses Prof. Ian Eddie, Southern Cross University, Australia Assoc. Prof. Roy Chua, Singapore Management University, Singapore Assoc. Prof. Michael Chau, The University of Hong Kong, Hong Kong Conference Theme The issue of disruption is pervasive as numerous forces accelerate the pace of global change reshaping corporate and economic environments. There are many elements driving the age of disruption. Among these the most analysed is technological innovation that is transforming industries and ensuring rapid obsolescence of old industrial processes and consumer products and services. Consumer behaviour is also rapidly evolving in response to rapid urbanisation of the global population and this is creating new areas of demand and shifting patterns of consumption and production of goods and services. As a response to global climate change and environmental sustainability energy consumption and sourcing energy from renewable sources is disrupting the location of new factories and industrial equipment. A rising middle class in the emerging market economies of Asia, Africa and South America is further disrupting the established patterns of global demand for consumer products and services. How do corporations set and implement sustainable business strategy in an age of disruption? What lessons can companies learn from analysing organisations that have failed to respond to disruptive challenges? What lessons can be gleaned from those companies that appear to be mastering the challenges of the age of disruption? How do managers lead organisations through an era of unprecedented economic volatility and increasing uncertainty? What should investors, government regulatory agencies and policy advisors do to ensure corporations and organisations increase their adaptive capability and respond to change in the age of disruption? These are among the many questions that are addressed by researchers at BizStrategy 2016.","date_start":"2016-08-22","date_end":"2016-08-23","important_dates":{"abstract":"","full":"2016-06-24","notification":"","final":""},"topics":["Social Sciences","Other","Business Management & Leadership"],"location":{"virtual":"","full":["Singapore","Singapore"],"name":"","street":"","city":"Singapore","state":"","ZIP":"","country":"Singapore"},"organizers":["Global Science and Technology Forum"],"societies":[],"indexes":[],"emails":[]}