{"name":"2016 Marketing Workshops Spring","series":"","short":"","website":"https://www.ama.org/events-training/Training/Pages/2016-Marketing-Workshops-Spring.aspx","content":"18 Workshops | 2 Days | 0 Distractions Experts, fresh thinking, hands-on instruction, the opportunity to discuss your own unique circumstances-get ready to dive into Digital Marketing, Branding/Strategy & Marketing Communications. We have 18 workshops, in three tracks, with 0 distractions led by industry experts to help you be a better marketer. As marketers, it's hard to find the time to hone our skills, develop our ideas and keep up with the fluid, tech-fueled landscape we call our careers. That's why when you get an opportunity, you really have to make it count. We provide you with: Workshops That Get to Work ​Digital Marketing Assessing Your Content Intelligence Boosting Your Visibility with SEO Winning at Email Marketing Considering New Uses for Measuring Video Getting the Most from Google Analytics Optimizing Your Social Media Campaign Branding/Strategy ​ Orchestrating a Better Customer Experience-Workshop Has Been Cancelled Engaging with Internal Marketing Tools Measuring Marketing ROI Effectively Unleashing Advocates and Influencers Discovering Your Value Proposition Gathering Consumer Insights ​Marketing Communications Writing a Marketing Plan Managing the Creative Process Storytelling that Leads to Success ​Developing Strong Content Creating Integrated Marketing Campaigns Delivering Social Media that Your Organization Deserves","date_start":"2016-05-16","date_end":"2016-05-17","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Marketing/Social-Networking","Marketing & advertising"],"location":{"virtual":"","full":["Charlotte","North Carolina","United States"],"name":"","street":"","city":"Charlotte","state":"North Carolina","ZIP":"","country":"United States"},"organizers":["American Marketing Association"],"societies":[],"indexes":[],"emails":[]}