{"name":"The Toronto School: Then | Now | Next","series":"","short":"","website":"www.thetorontoschool.ca","content":"International Conference “The Toronto School: Then | Now | Next” Toronto, October 14-16, 2016 Deadline for Submission: June 30, 2016 The Coach House Institute at the Faculty of Information (iSchool) University of Toronto invites proposals for the international conference “The Toronto School: Then | Now | Next”. The conference will be held at the University of Toronto, October 14-16, 2016\\. ===Main theme=== Between the 1930s and 1970s, a community of intellectuals coalesced in the city of Toronto to discuss and investigate communication as a complex, interdisciplinary process that structures individuals, cultures, and societies. This scholarly community, that emerged in and around the University of Toronto achieved international recognition for its innovative and trans-disciplinary approaches to the evolving societal challenges. “The Toronto School: Then | Now | Next” Conference aims to bring together international scholars to engage in dialogue on the origins, rise, decline and the rebirth of the so-called Toronto School. Discussion will focus on its pioneers, champions but also its critics. It will examine the extent to which the Toronto School has provided a legacy that continues to offer insight on crucial and systemic issues facing contemporary society across various disciplines. ===Suggested Topics for Paper Submissions=== General areas of interest include, but are not limited to, the following topics: - New understandings, approaches, comparative assessments of the major figures associated with the golden age of the Toronto School, including for instance Eric Havelock, Harold Innis, Marshall McLuhan, Northrop Frye, Edmund Carpenter, Walter J. Ong, Tom Easterbrook, Jaqueline Tyrwhitt, Carl Williams, Glenn Gould, and Harley Parker. - Innovative interpretations of theories in their historical context, and ideas emanating from the School and its intellectual tradition. - Associations between core theories/ideas of the Toronto School of Communication and other schools/traditions, in the Humanities, in the Social Sciences and contemporary culture. - Germination of media studies in 1950s Toronto. - Canadian approaches to communications study and their impact on the twentieth-century intellectual debate internationally. - Role of communication in the history of civilization, and in the structuring of human cultures and the mind. - Time-biased and space-biased dialectical approaches applied to cultural ecology. - Sensorial, cognitive, and behavioural implications of the medium. - Interplay of orality and literacy in today’s media environment. - Poetic, symbolic, and mythical thinking in contemporary cultures. - Aesthetic forms as a mode of critique and interpretation of cultural artifacts. - Interpretation, extension, and application of the theories central to thinkers from the Toronto School. ===Guide for authors=== Authors are invited to submit their abstracts by June 30, 2016 using exclusively EasyChair https://easychair.org/conferences/?conf=torontoschool2016 Abstracts of between 1,000 and 1,500 words, in English, and presented in pdf format should be uploaded into EasyChair along with: title of proposed presentation, five keywords, and for each author their name, title, position, name affiliated institution and a short biographical statement (40-50 words each). In addition details for the corresponding author should be provided. In case of acceptance, author(s) will be asked also to provide a condensed abstract (200 words for inclusion in the program), and to present the paper at the Conference (see registration deadline for authors). NB: The submission of an abstract must be on the understanding that if the paper is accepted at least one author will register for and attend the conference. The costs of attending the conference including registration fees, travel, accommodation and other expenses, are the responsibility of the presenter or their institutions. A condensed abstract of each paper and a biographical statement of presenting author(s) will be published in the Conference Program. ===Peer Review Process=== All submissions will be reviewed by the Programme Committee (see Conference website for details). ===Paper Awards=== All accepted papers will be considered by the Programme Committee for one of three Outstanding Paper Awards (1,000 CAD $ each), including an award for Outstanding PhD Student Paper. Please indicate with your submission if the primary author is a PhD student. The Outstanding Paper Awards will be announced at the closing session of the Conference. ===Panel Presentation=== The language of the Conference is English. Accepted papers will grouped into sessions including 3 to 4 papers focused on similar themes. Each presentation must not exceed 20 minutes; each panel will include a 20-minute Q&A, following the last presentation. ===Conference Proceedings=== Full papers are not required in advance, but are invited for submission following the event to be considered for inclusion in the Conference Proceedings, which will be published in 2017\\. Final original unpublished papers between 5,000 and 6,000 words, should be submitted in English using U.S. spelling, in APA style, and in .doc or docx format, by December 15, 2016\\. All attendees will receive a copy of the Proceedings when it is published. ===Registration Fees=== Registration information will be available at the Conference website (www.thetorontoschool.ca). In order to be included in the final program the deadline for authors’ registration is August 30, 2016\\. Reduced hotel room rates will be available to conference attendees. Conference registration opens April 1, 2016\\. ===Important Dates=== Early Bird Registration Opens: April 1, 2016 Deadline for abstract submission: June 30,2016 Notification of acceptance: July 30, 2016 Draft Programme Published: August 1, 2016 Registration deadline for authors: August 30, 2016 Late registration begins: September 1, 2016 Final Programme Published: September 1, 2016 ===Information=== Conference Coordinator, Dr. Paolo Granata (McLuhan Centenary Fellow, Visiting Professor University of Toronto) For more information about the Conference visit: www.thetorontoschool.ca Send email correspondence to: torontoschool2016@easychair.org We look forward to welcoming you to Toronto and “The Toronto School: Then | Now | Next” ! INFO: www.thetorontoschool.ca CFP: http://uoft.me/toronto-school","date_start":"2016-10-14","date_end":"2016-10-16","important_dates":{"abstract":"","full":"2016-06-30","notification":"","final":""},"topics":["Arts & Humanities","Philosophy","social communication & mass media"],"location":{"virtual":"","full":["Toronto","Canada"],"name":"","street":"","city":"Toronto","state":"","ZIP":"","country":"Canada"},"organizers":["The Coach House Institute at the Faculty of Information (iSchool) University of Toronto"],"societies":[],"indexes":[],"emails":["torontoschool2016@easychair.org"]}