{"name":"4th International Conference on Bioimaging – BIOIMAGING 2017","series":"","short":"","website":"http://www.bioimaging.biostec.org","content":"Venue: Porto, Portugal Event Date 21 - 23 February, 2017 Regular Papers Paper Submission: September 29, 2016 Authors Notification: November 23, 2016 Camera Ready and Registration: December 9, 2016 Position Papers Paper Submission: November 8, 2016 Authors Notification: December 14, 2016 Camera Ready and Registration: December 27, 2016 Workshops Workshop Proposal: November 3, 2016 Doctoral Consortium Paper Submission: December 29, 2016 Authors Notification: January 11, 2017 Camera Ready and Registration: January 23, 2017 Special Sessions Special Session Proposal: November 21, 2016 Tutorials, Demos and Panels Proposals: December 27, 2016 Scope: Bioimaging is a term that covers the complex chain of acquiring, processing and visualizing structural or functional images of living objects or systems, including extraction and processing of image-related information. Examples of image modalities used in bioimaging are many, including: X-ray, CT, MRI and fMRI, PET and HRRT PET, SPECT, MEG and so on. Medical imaging and microscope/fluorescence image processing are important parts of bioimaging referring to the techniques and processes used to create images of the human body, anatomical areas, tissues, and so on, down to the molecular level, for clinical purposes, seeking to reveal, diagnose, or examine diseases, or medical science, including the study of normal anatomy and physiology. Image processing methods, such as denoising, segmentation, deconvolution and registration methods, feature recognition and classification represent an indispensable part of bioimaging, as well as related data analysis and statistical tools. BIOIMAGING is part of BIOSTEC, the 10th International Joint Conference on Biomedical Engineering Systems and Technologies. Registration to BIOIMAGING allows free access to all other BIOSTEC conferences. CONFERENCE TOPICS - Medical Imaging and Diagnosis - Image Processing Methods - Image Fusion Methods - Feature Recognition and Extraction Methods - Biomechanical Imaging - Image Archiving and Communication - Telemedicine and Virtual Environments - Magnetic Resonance Imaging (MRI) - Functional Magnetic Resonance Imaging (Fmri) - Single-photon Emission Computed Tomography (SPECT) - Positron Emission Tomography (PET) - High Resolution Research Tomography (HRRT) - Magnetoencephalography (MEG) - Ultrasound and Optical Imaging - Optical Elastography - X-ray Microscopy - Biophotonics - Fluorescence Resonance Energy Transfer (FRET) - Conventional Microscopy - Confocal Microscopy - Fluorescent Microscopy - Quantitative Bioimaging - Structural Biology - Brain Function Analysis - Hemodynamics Imaging - Histology and Tissue Imaging BIOSTEC KEYNOTE SPEAKER Bart M. ter Haar Romeny, Eindhoven University of Technology, Netherlands BIOSTEC CONFERENCE CO-CHAIRS Ana Fred, Instituto de Telecomunicações / IST, Portugal Hugo Gamboa, LIBPHYS-UNL / FCT - New University of Lisbon, Portugal Mário Vaz, Inegi Lome, Feup, Portugal PROGRAM CHAIR Available soon PROGRAM COMMITTEE http://www.bioimaging.biostec.org/ProgramCommittee.aspx BIOIMAGING Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setúbal - Portugal Tel: +351 265 100 033 Fax: +351 265 520 186 e-mail: bioimaging.secretariat@insticc.org Web: http://www.bioimaging.biostec.org/","date_start":"2017-02-21","date_end":"2017-02-23","important_dates":{"abstract":"","full":"2016-09-29","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["bioimaging.secretariat@insticc.org"]}