{"name":"6th International Conference on Smart Cities and Green ICT Systems – SMARTGREENS 2017","series":"","short":"","website":"http://www.smartgreens.org","content":"Venue: Porto, Portugal Event date: 22 - 24 April, 2017 Regular Papers Paper Submission: November 23, 2016 Authors Notification: January 25, 2017 Camera Ready and Registration: February 8, 2017 Position Papers Paper Submission: January 12, 2017 Authors Notification: February 15, 2017 Camera Ready and Registration: March 1, 2017 Workshops Workshop Proposal: January 5, 2017 Workshop TEEC Paper Submission: January 17, 2017 Authors Notification: February 2, 2017 Camera Ready and Registration: February 16, 2017 Workshop GreenLife Paper Submission: January 19, 2017 Authors Notification: February 6, 2017 Camera Ready and Registration: February 20, 2017 Doctoral Consortium Paper Submission: February 21, 2017 Authors Notification: March 7, 2017 Camera Ready and Registration: March 17, 2017 Special Sessions Special Session Proposal: January 23, 2017 Tutorials, Demos and Panels Proposals: February 24, 2017 Open Communicationss Paper Submission: February 21, 2017 Authors Notification: March 7, 2017 Camera Ready and Registration: March 17, 2017 Scope: The purpose of the 6th International Conference on Smart Cities and Green ICT Systems (SMARTGREENS) is to bring together researchers, designers, developers and practitioners interested in the advances and applications in the field of Smart Cities, Green Information and Communication Technologies, Sustainability, Energy Aware Systems and Technologies. SMARTGREENS 2017 will be held in conjunction with COMPLEXIS 2017, IoTBDS 2017, CLOSER 2017 and VEHITS 2017\\. Registration to SMARTGREENS allows free access to the COMPLEXIS, IoTBDS, CLOSER and VEHITS conferences (as a non-speaker). CONFERENCE AREAS: Each of these topic areas is expanded below but the sub-topics list is not exhaustive. Papers may address one or more of the listed sub-topics, although authors should not feel limited by them. Unlisted but related sub-topics are also acceptable, provided they fit in one of the following main topic areas: 1\\. ENERGY-AWARE SYSTEMS AND TECHNOLOGIES 2\\. SUSTAINABLE COMPUTING AND COMMUNICATIONS 3\\. SMART CITIES AREA 1: ENERGY-AWARE SYSTEMS AND TECHNOLOGIES - Architectures for Smart Grids - Load Balancing in Smart Grids - Energy Management Systems (EMS) - Economic Models of Energy Efficiency - Energy Monitoring - Renewable Energy Resources - Greener Systems Planning and Design - Virtualization for Reducing Power Consumption - Evolutionary Algorithms in Energy Applications - Scheduling and Switching Power Supplies - Energy Profiling and Measurement - Harvesting Energy - Energy-Aware Process Optimisation - Optimization Techniques for Efficient Energy Consumption - Microgeneration - Smart Energy Storage AREA 2: SUSTAINABLE COMPUTING AND COMMUNICATIONS - Wireless Systems and Networks - Security and Privacy - Wearable Computing - Green Data Centers - Algorithms for Reduced Power, Energy and Heat - Green Communications Architectures and Frameworks - Qos and Green Computing - Integration of Smart Appliances - Embedded Sensor Networks - Smart Homes (Domotics) - Educational Ecosystems - Green Computing and Education - Case Studies on Green Computing and Communications - Interoperability - Energy Efficient Network Hardware - Energy-Efficient Communication Protocols - Internet of Things - Green Software Engineering Methodologies and Tools - Virtualization Impact for Green Computing - Green Computing Models, Methodologies and Paradigms AREA 3: SMART CITIES - Case Studies, Business Models and Innovative Applications for Smart(er) Cities - Human Smart Cities - Intelligent Transport Systems and Traffic Management - e-Mobility and Smart Transport - Intelligent Buildings - Urban Monitoring and Optimization - User-Centred and Participatory Design of Services and Systems for Smart Cities - Innovation Labs, Experimental Test-Beds and Simulation Environments - Mechanisms for Motivating Behaviour Change - Internet-Enabled Infrastructures and Services - Service Innovation and Design to Support Smart Cities - e-Health systems - Smart Sensor-Based Networks and Applications - Big Data and Urban Data Analytics - IS Architecture Designs and Platforms for Smart Cities - Case Studies and Innovative Applications for Smart(er) Cities - Planning and Design Challenges for Smart Cities - Frameworks and models for Smart City Initiatives - Safety, Security, and Privacy for Smart Cities KEYNOTE SPEAKERS SMARTGREENS 2017 will have several invited keynote speakers, who are internationally recognized experts in their areas. Their names are not yet confirmed. CONFERENCE CHAIR Markus Helfert, Dublin City University, Ireland PROGRAM CO-CHAIRS Cornel Klein, Siemens AG, Germany Brian Donnellan, Maynooth University, Ireland LOCAL CHAIR Catarina Selada, INTELI- Inteligência em Inovação, Portugal WORKSHOPS CHAIRS - TEEC 2017 Karim Djemame, University of Leeds, United Kingdom - GREEN LIFE Calin Ciufudean, Stefan cel Mare University, Romania TUTORIAL LECTURER Calin Ciufudean, Stefan cel Mare University, Romania DOCTORAL CONSORTIUM CHAIR Helder Leite, Department of Electrical and Computer Engineering - University of Porto, Portugal PROGRAM COMMITTEE http://www.smartgreens.org/ProgramCommittee.aspx SMARTGREENS Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setúbal – Portugal Tel: +351 265 520 185 Fax: +351 265 520 186 e-mail: smartgreens.secretariat@insticc.org Web: http://www.smartgreens.org","date_start":"2017-04-22","date_end":"2017-04-24","important_dates":{"abstract":"","full":"2016-11-23","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["smartgreens.secretariat@insticc.org"]}