{"name":"10th International Conference on Biomedical Electronics and Devices - BIODEVICES 2017","series":"","short":"","website":"http://www.biodevices.biostec.org","content":"Conference name: 10th International Conference on Biomedical Electronics and Devices – BIODEVICES 2017 Venue: Porto, Portugal Event Date 21 - 23 February, 2017 Regular Papers Paper Submission: September 29, 2016 Authors Notification: November 23, 2016 Camera Ready and Registration: December 9, 2016 Position Papers Paper Submission: November 8, 2016 Authors Notification: December 14, 2016 Camera Ready and Registration: December 27, 2016 Workshops Workshop Proposal: November 3, 2016 Doctoral Consortium Paper Submission: December 29, 2016 Authors Notification: January 11, 2017 Camera Ready and Registration: January 23, 2017 Special Sessions Special Session Proposal: November 21, 2016 Tutorials, Demos and Panels Proposals: December 27, 2016 Scope: The purpose of the International Conference on Bio-Devices is to bring together researchers and practitioners from electronics, mechanical engineering, physics and related areas who are interested in developing, studying and using innovative materials, devices and systems inspired by biological systems and/or addressing biomedical requirements. Monitoring and diagnostics devices, sensors and instrumentation systems, biorobotics and prosthetics, micro-nanotechnologies including microfluidics systems and biomaterials are some of the technologies addressed at this conference. The fabrication and evaluation of biodevices, including wearable and implantable devices is also addressed. BIODEVICES is part of BIOSTEC, the 10th International Joint Conference on Biomedical Engineering Systems and Technologies. Registration to BIODEVICES allows free access to all other BIOSTEC conferences. CONFERENCE TOPICS - Emerging Technologies - Biomedical Instrumentation - Biomedical Equipment - Biomedical Sensors - Biomedical Metrology - Health Monitoring Devices - Low-power Design - Electrical Bio-impedance - Bio-electromagnetism - Biorobotics - Implantable Electronics - Wireless Systems and Biotelemetry - Biomaterials - MEMS - Nanotechnologies - Biomechanical Devices - Prosthetics - Technologies Evaluation - Electrocardiography and Heart Monitoring - Brain-computer Interfaces - Spectroscopic Applications - Imaging and Visualization Devices - Rehabilitation Technology - Lab on a Chip and Microfluidic Devices - Wearable and Mobile Devices - Diagnostic devices - Radio/Photo therapy devices - Biodevice fabrication - Energy Harvesting for biodevices BIOSTEC KEYNOTE SPEAKER Bart M. ter Haar Romeny, Eindhoven University of Technology, Netherlands BIOSTEC CONFERENCE CO-CHAIRS Ana Fred, Instituto de Telecomunicações / IST, Portugal Hugo Gamboa, LIBPHYS-UNL / FCT - New University of Lisbon, Portugal Mário Vaz, Inegi Lome, Feup, Portugal PROGRAM CHAIR Nathalia Peixoto, Neural Engineering Lab, George Mason University, United States PROGRAM COMMITTEE http://www.biodevices.biostec.org/ProgramCommittee.aspx BIODEVICES Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setúbal - Portugal Tel: +351 265 100 033 Fax: +351 265 520 186 e-mail: biodevices.secretariat@insticc.org Web: http://www.biodevices.biostec.org/","date_start":"2017-02-21","date_end":"2017-02-23","important_dates":{"abstract":"","full":"2016-09-29","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["biodevices.secretariat@insticc.org"]}