{"name":"5th CLOUD COMPUTING ON INFRASTRUCTURE AS A SERVICE AND ITS APPLICATIONS","series":"","short":"","website":"http://pdp2017.org/ccisa.html","content":"Call for Papers \n \\--------------- \n \n for the \n 5th CLOUD COMPUTING ON INFRASTRUCTURE AS A SERVICE AND ITS APPLICATIONS (CCISA) \n special session at the 25th Euromicro International Conference on Parallel, Distributed and network-based Processing \n \n Location \n \\======== \n St. Petersburg, Russia \n Conference dates: 6-8th March, 2017. \n \n Scope \n \\===== \n Cloud Computing covers a broad range of distributed computing principles from infrastructure (e.g distributed storage, reconfigurable networks) to new programming platforms (e.g MS Azure, Google Appe Engine), and internet based applications. Particularly, Infrastructure as a Service (IaaS) Cloud systems - such as Amazon EC2, Rackspace or Google Compute Engine - allow the dynamic creation, destruction and management of virtual machines (VMs) on virtualized clusters. IaaS Clouds provide a high-level of abstraction to the end user, one that allows the creation of on-demand services through a pay as you go infrastructure combined with elasticity. The increasingly large range of choices and availability of IaaS toolkits has also allowed creation of cloud solutions and frameworks even suitable for private deployment and practical IaaS use on smaller scales. This special session on Cloud Computing is intended to be a forum for the exchange of ideas and experiences on the use of Cloud Computing technologies and applications with compute and data intensive workloads. The special session also aims at presenting the challenges and opportunities offered by the development of open-source Cloud Computing solutions - such as OpenStack or OpenNebula - themselves, as well as case studies in applications of Cloud Computing. The general venue will be a good occasion to share, learn, and discuss the latest results in this field of research. The special session program will include presentations of peer-reviewed papers. \n \n The topics of interest include, but are not limited to: \n \\- Virtualization technologies and their effects on IaaS solutions \n \\- Incorporating beyond-CPU virtualization (e.g., I/O, GPU) aspects to cloud infrastructures \n \\- Cloud Computing resource management (e.g., Virtual Machine scheduling and management algorithms) \n \\- Container management and orchestration \n \\- Operational challenges, federative and interoperability aspects of private, hybrid and public IaaS systems \n \\- Cost and pricing models in virtualized infrastructures \n \\- Novel IaaS architectures, platforms and applications (e.g., incorpoarating IoT systems) \n \\- Virtual Appliance storage management (e.g., caching, repositories, marketplaces) \n \\- Virtual Machine migration techniques \n \\- Security and Privacy aspects of data management in Clouds \n \\- Cloud Computing for scientific applications \n \\- Performance evaluation, modeling, simulation and prediction of IaaS clouds \n \\- Programming models and tools \n \\- Cloud computing for compute and/or data intensive applications \n \\- Workflows on the Cloud \n \\- Cloud Computing deployment models \n \\- Cloud storage and I/O \n \\- Cloud services for the Internet of Things \n \n ENTICE project links \n \\==================== \n The session is organised in collaboration with the ENTICE project (www.entice-project.eu). We expect to receive additional papers in alignment with the goals of the project: \n \n \\- Creation of lightweight VM images through functional descriptions \n \\- Distributed lightweight VM image storage \n \\- Autonomous multi-objective repository optimisation \n \\- Elastic resource provisioning \n \\- Information infrastructure for strategic and dynamic reasoning \n \n Additionally, the project will present its use cases/pilot applications and show how they are aligned to the scope of the special session and to the wider cloud computing research and industrial communities. Finally, at the end of the session the project will organise a panel. \n \n Submission guidelines \n \\===================== \n Authors are required to submit original, unpublished research or overviews on infrastructure clouds and their applications. Submitted manuscripts should not exceeding 8 pages in the Conference proceedings format ( double-column, 10pt). The special session applies double-bind review: the paper should not contain authors’ names and affiliations; in the reference list, references to the authors’ own work entries should be substituted with the string \"omitted for blind review”. \n \n Submission site: \nhttp://www.easychair.org/conferences/?conf=pdp2017 \n Please note, as the first step of the submission procedure, authors must pick the cloud special session in order to be considered for inclusion within the session. \n \n All accepted papers will be included in the same volume as the main conference's material, and they will be published by the Conference Publishing Services (CPS). The Final Paper Preparation and Submission Instructions will be published after the notification of acceptance. Authors of accepted papers are expected to register and present their papers at the Conference. Conference proceedings will be submitted to IEEE explore, CDSL, and for indexing among others, to DBLP, Scopus ScienceDirect, and ISI Web of Knowledge. \n \n Important dates \n \\=============== \n Paper submission: 25th Aug. 2016 \n Acceptance notification: 25th Oct. 2016 \n Camera ready due: 20th Nov. 2016 \n Registration: 20th Nov. 2016 \n Conference: 6th - 8th Mar. 2017 \n \n Session Chair \n \\============= \n Gabor Kecskemeti, Liverpool John Moores University, United Kingdom \n \n Session Co-Chairs \n \\================= \n Thierry Delaitre, University of Westminster, United Kingdom \n Attila Kertesz, University of Szeged and MTA SZTAKI, Hungary \n \n Programme Committee \n \\=================== \n Vlado Stankovsky, University of Ljubljana, Slovenia \n Thierry Delaitre, University of Westminster, United Kingdom \n Vincent Chimaobi Emeakaroha, University College Cork, Ireland \n Thomas Fahringer, University of Innsbruck, Austria \n Eduardo Huedo, Universidad Complutense de Madrid, Spain \n Gabor Kecskemeti, Liverpool John Moores University, United Kingdom \n Attila Kertesz, University of Szeged and MTA SZTAKI, Hungary \n Steven Latre, University of Antwerp - iMinds, Belgium \n Philipp Leitner, University of Zurich, Switzerland \n Attila Csaba Marosi, MTA SZTAKI, Hungary \n Anne-Cecile Orgerie, CNRS, France \n Radu Prodan, University of Innsbruck, Austria \n Ivan Rodero, Rutgers University, USA \n Gabor Terstyanszky, University of Westminster, United Kingdom \n Massimo Villari, University of Messina, Italy \n \n Website for further information \n \\=============================== \n http://pdp2017.org/ccisa.html","date_start":"2017-03-06","date_end":"2017-03-08","important_dates":{"abstract":"","full":"2016-08-25","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","cloud storage & computing"],"location":{"virtual":"","full":["St. Petersburg","Russian Federation"],"name":"","street":"","city":"St. Petersburg","state":"","ZIP":"","country":"Russian Federation"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}