{"name":"IABE 2015 Rome (Italy) Summer Conference - Research/Teaching Excellence in Business and Economics","series":"","short":"","website":"http://www.iabe.org","content":"We invite you to participate in the upcoming IABE 2015 Conference: IABE-2015 Rome, Italy: Summer Conference, June 18-20, 2015 Submission Deadline: April 10, 2015 The mission of IABE conference is to create a platform where academics, consultants and practitioners from economic fields can present their research results, can exchange their experiences or can find business solutions. We invite papers/articles, abstracts, or cases on topics related to research, practice, and teaching in all subject areas of Business Administration, Economics, Accounting, Marketing, Management, Human Resources, International Business, E-Business, Public Administration, Healthcare Administration, and related subjects areas. Please refer to our list for nearly 70 subject areas in 10 broadly defined tracks for the conference. Online Submissions: Please submit your paper online at www.iabe.org. In case of difficulties with online submission, email your paper/abstract as an attachment to: review@iabe.org All manuscripts will be double-blind peer-reviewed on a continual basis throughout the year. We will email result of the review process to the author(s) in about eight weeks after the submission. All recommended manuscripts will be scheduled for presentation at the conference and for publication in the IABE Proceedings on CD. Based on the reviewers' recommendations and subject area, the highly competitive papers will be published in one of the refereed journals. Following refereed and publicly available journals are listed in the Cabell's Directories 2003-15 Editions. All our journals are listed in Ulrich's International Periodicals Directory since 2003\\. Each journal has the ISSN and Call Number issued by the U.S. Library of Congress, Washington. Our journals are sponsored by universities. The journals are Registered Trademarks or Trademarks. The journals are double blind peer-reviewed and publicly available publications. Refereed Publications: California Business Review (CBR) European Journal of Business Research (EJBR) European Journal of Management (EJM) International Journal of Business Research (IJBR) International Journal of Business Strategy (IJBS) International Journal of Strategic Management (IJSM) Journal of Academy of Business and Economics (JABE) Journal of International Business and Economics (JIBE) International journal of Finance and Economics (JIFE) Journal of International Finance Studies (JIFS) Journal of International Management Studies (JIMS) Review of Business Research (RBR) We invite you to visit our website www.iabe.org for more information.","date_start":"2015-06-18","date_end":"2015-06-20","important_dates":{"abstract":"","full":"2015-04-10","notification":"","final":""},"topics":["Business","Management / Leadership","Risk Management"],"location":{"virtual":"","full":["Rome","Italy"],"name":"","street":"","city":"Rome","state":"","ZIP":"","country":"Italy"},"organizers":["International Academy of Business and Economics"],"societies":[],"indexes":[],"emails":["review@iabe.org"]}