{"name":"Women and Ageing: New Cultural and Critical Perspectives","series":"","short":"","website":"https://womenandageing.wordpress.com","content":"Women and Ageing: New Cultural and Critical Perspectives University of Limerick, Ireland 20th-22nd May 2015 Conveners: Dr Cathy McGlynn, Dr Maggie O'Neill, Dr Michaela Schrage-Früh (University of Limerick) In a time when even Bridget Jones finds herself in her early fifties, it may at first glance seem unwarranted to speak of the invisibility of ageing women in literary and cultural contexts. In fact, in a review of Mad about the Boy in The Times, Sarah Lyall writes that, \"Bridget's amorous adventures … make the prospect of middle age not so bad at all\". Constructions like this open up questions about representations of women and ageing. What types of images of the \"ageing woman\" are created in cultural texts? Do women in later life, in order to become visible, need to find ways to \"pass\" as younger so that \"age shall not wither them\" as Kira Cochraine puts it in an article in The Guardian? Are these legitimate strategies or should women embrace the menopause as a new phase of life and liberation as advised by Germaine Greer? What impact do dominant representations of ageing women have on the sociocultural realities of women in their later years? And in what ways do they compare to earlier representations? The rise of the new interdisciplinary field of ageing studies / cultural gerontology testifies to the need to reassess cultural representations of ageing and to view ageing not only as part of the life course but as a social and cultural construct. It is all the more surprising that ageing is a topic still marginalised in feminist theory, despite Simone de Beauvoir’s testimony to her dismay at ‘society’s secret shame’ in The Coming of Age in 1970\\. There are some notable exceptions, such as Germaine Greer's work on the postmenopausal woman, Susan Bordo's work on the body, or Lynne Segal’s recent reflection and analysis of the process of growing older. This conference will engage with the symbolic aspects of women and ageing in culture and society, and the power these constructions exert over public and private conceptions of old age. The aim of this conference is to provide an opportunity to discuss intersections of the cultural, social and medical dimensions of women and ageing. It will engage with discourses on ageing in their various cultural manifestations through the ages but also across different cultures, genres and media. We invite papers from diverse disciplines such as literary and cultural studies, film and media studies, philosophy, anthropology, linguistics and the medical humanities. Plenary Speakers: Prof Germaine Greer; Prof Margaret Harper Events: Poetry reading by Medbh McGuckian; Roundtable on Women and Ageing Possible topics can include but are not limited to: • Ageing, autobiography and lived experience • Technologies, medicine and ageing • Ageing and popular culture • Ageing and neoliberalism • Visual images of ageing • Age and performance • The ageing body as text • Ageing and memory • Stigma • Myths about ageing, women in myth • Age and creativity • Queer ageing • Love, loss and mourning • Health, menopause, the post-maternal body • Male representations of women and ageing • Older and younger mothers • The ageing spinster • The cult of youth and perceptions of beauty • Ageing, recession and dependency • Ageing and women minorities • Age, race, and colour Please submit proposals for papers or panels by 15h March 2015\\. Proposals should be 250 words and should include a 50 word biography. Queries may be directed to the conference organisers at ageing.women@gmail.com. Conference fee TBC. Like us on Facebook for updates: facebook.com/womenandageing","date_start":"2015-05-20","date_end":"2015-05-22","important_dates":{"abstract":"","full":"2015-03-15","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","gender studies (and womens)"],"location":{"virtual":"","full":["Ireland"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":[""],"societies":[],"indexes":[],"emails":["ageing.women@gmail.com"]}