{"name":"2016 Advanced Research Techniques (ART) Forum","series":"","short":"","website":"https://www.ama.org/events-training/Conferences/Pages/Advanced-Research-Techniques-(ART)-Forum.aspx","content":"This is the 27th year of the AMA's Advanced Research Techniques (ART) Forum, where academics and practitioners discuss the latest developments in marketing research and analytics. The ART Forum is the place where practitioners learn about cutting-edge tools and academics learn about new problems. People attending the ART Forum develop a network of colleagues who are serious about developing tools that can solve the next generation of problems in the field of marketing. ART Forum also places an emphasis on education by offering an extended set of tutorials, which provide an introduction to areas that might be unfamiliar to some attendees. Our program this year includes: •Sessions on a wide range of topics: social network analysis and targeting, modeling customer and market dynamics, market structure and visualization, market segmentation, conjoint and choice modeling, marketing metrics, new advances in correcting for noise and biases in survey research and leveraging large and unstructured data for actionable insights. •Wednesday morning includes a presentation by the Paul E. Green award winning paper that best exemplifies high quality practical research published in the last year in the Journal of Marketing Research. •Opportunities for expanding your knowledge and growing your toolkit, while advancing the field of marketing! Rex Du and Melinda Thielbar (Conference Co-Chairs) Who Attends This Conference Since its inception in 1990, the conference has focused on how sophisticated methodologies and quantitative techniques can support strategic and tactical marketing decisions. Most of the attendees are experienced research practitioners who use advanced methods in their jobs.","date_start":"2016-06-26","date_end":"2016-06-29","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Marketing/Social-Networking","Marketing & advertising"],"location":{"virtual":"","full":["Boston","Massachusetts","United States"],"name":"","street":"","city":"Boston","state":"Massachusetts","ZIP":"","country":"United States"},"organizers":["American Marketing Association"],"societies":[],"indexes":[],"emails":[]}