{"name":"9th International Conference on Computer Supported Education – CSEDU 2017","series":"","short":"","website":"http://www.csedu.org","content":"Venue: Porto, Portugal Event date: 21 - 23 April, 2017 Regular Papers Paper Submission: November 28, 2016 Authors Notification: January 30, 2017 Camera Ready and Registration: February 13, 2017 Position Papers Paper Submission: January 17, 2017 Authors Notification: February 20, 2017 Camera Ready and Registration: March 6, 2017 Workshops Workshop Proposal: January 10, 2017 Doctoral Consortium Paper Submission: February 24, 2017 Authors Notification: March 10, 2017 Camera Ready and Registration: March 22, 2017 Special Sessions Special Session Proposal: January 26, 2017 Tutorials, Demos and Panels Proposals: March 2, 2017 Open Communicationss Paper Submission: February 24, 2017 Authors Notification: March 10, 2017 Camera Ready and Registration: March 22, 2017 Scope: CSEDU 2017, the International Conference on Computer Supported Education, aims at becoming a yearly meeting place for presenting and discussing new educational environments, best practices and case studies on innovative technology-based learning strategies, institutional policies on computer supported education including open and distance education, using computers. In particular, the Web is currently a preferred medium for distance learning and the learning practice in this context is usually referred to as e-learning. CSEDU 2017 is expected to give an overview of the state of the art as well as upcoming trends, and to promote discussion about the pedagogical potential of new learning and educational technologies in the academic and corporate world. CONFERENCE AREAS: Each of these topic areas is expanded below but the sub-topics list is not exhaustive. Papers may address one or more of the listed sub-topics, although authors should not feel limited by them. Unlisted but related sub-topics are also acceptable, provided they fit in one of the following main topic areas: 1\\. INFORMATION TECHNOLOGIES SUPPORTING LEARNING 2\\. LEARNING/TEACHING METHODOLOGIES AND ASSESSMENT 3\\. SOCIAL CONTEXT AND LEARNING ENVIRONMENTS 4\\. DOMAIN APPLICATIONS AND CASE STUDIES 5\\. UBIQUITOUS LEARNING 6\\. ARTIFICIAL INTELLIGENCE IN EDUCATION AREA 1: INFORMATION TECHNOLOGIES SUPPORTING LEARNING - Authoring Tools and Content Development - Classroom Management - e-Learning Hardware and Software - e-Learning Platforms, Portals - Tools for Educational Communication and Collaboration - Intelligent Tutoring Systems - Learning Analytics - Virtual Learning Environments - Virtual Worlds - Synchronous and Asynchronous Learning - Educational Data Mining AREA 2: LEARNING/TEACHING METHODOLOGIES AND ASSESSMENT - Tools to Assess Learning - Blended Learning - Educating the Educators - Game-based and Simulation-based Learning - Higher Order Thinking Skills - Immersive Learning - Flipped Classroom - Instructional Design - Mentoring and Tutoring - Metrics and Performance Measurement - Project Based Learning and Engineering Education AREA 3: SOCIAL CONTEXT AND LEARNING ENVIRONMENTS - Assessment and Accreditation of Courses and Institutions - Computer-Supported Collaborative Learning - Community Building - Vocational Training - Course Design and e-Learning Curriculae - Distance and e-Learning in a Global Context - Active Learning - Constructivism and Social Constructivism - Lifelong Learning: Continuing Professional Training and Development - Teacher Evaluation - Theoretical Bases of e-Learning Environments - Social Computing for Learning and Knowledge Sharing AREA 4: DOMAIN APPLICATIONS AND CASE STUDIES - Distance Learning Strategies - e-Learning in Developing Countries - e-Learning in Engineering Education - e-Learning Success Cases - Health Sector Applications - Intelligent Learning and Teaching Systems - Children's Education using Computer Support and K12 Students AREA 5: UBIQUITOUS LEARNING - Universal Design for Learning - Cloud-based Learning and Assessment - Context Dependent Learning - Distance Education - Mobile Learning (M-learning) - Smart Devices as Collaborative Learning Tools - Virtual Labs and Virtual Classrooms - Massive Open Online Courses - Ethics AREA 6: ARTIFICIAL INTELLIGENCE IN EDUCATION - Adaptive Educational Systems - Intelligent Teacher Dashboards - Intelligent Modelling of Affect for Learning - Authoring Tools for Intelligent Tutoring Systems - Empirical Studies of Learning with AI Educational Systems - Agent-based Learning Environments - Natural Language Interfaces for Instructional Systems - Intelligent Agents on the Web - Architectures for AI-based Educational Systems - Real-world Applications of AIED Systems - Gamification for Learning KEYNOTE SPEAKERS CSEDU 2017 will have several invited keynote speakers, who are internationally recognized experts in their areas. Their names are not yet confirmed. CONFERENCE CHAIR Bruce M. McLaren, Carnegie Mellon University, United States PROGRAM CO-CHAIRS Paula Escudeiro, Instituto Superior de Engenharia do Porto, Portugal Gennaro Costagliola, Università di Salerno, Italy Susan Zvacek, University of Denver, United States James Uhomoibhi, University of Ulster, United Kingdom LOCAL CO-CHAIRS Bertil Marques, ISEP, Portugal Ana Barata, ISEP, Portugal DOCTORAL CONSORTIUM CHAIR Carlos Vaz de Carvalho, ISEP, Portugal PROGRAM COMMITTEE http://www.csedu.org/ProgramCommittee.aspx CSEDU Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setúbal - Portugal Tel: +351 265 520 184 Fax: +351 265 520 186 e-mail: csedu.secretariat@insticc.org Web: http://www.csedu.org/","date_start":"2017-04-21","date_end":"2017-04-23","important_dates":{"abstract":"","full":"2016-11-28","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["csedu.secretariat@insticc.org"]}