{"name":"The Alienation of Man in Culture, Society and Politics International Conference","series":"","short":"","website":"http://alienation.irf-network.org","content":"The Alienation of Man in Culture, Society and Politics International Conference 28 October 2016 – Warsaw, Poland organised by Interdisciplinary Research Foundation Alienation is one of the most important problems of humanitarian and socio-political knowledge. The concept of alienation characterizes the relationship between man and the transcendent. Man is a key figure for interpretation and understanding of this problem. Alienation is a kind of reflection of man over his relationship with God, nature, culture, society, economic component, the state. The basis of different theories in literature, psychology, sociology, philosophy, anthropology, economics, politics is formed on reflections on human alienation issue. The conference will discuss a wide range of issues related to the problem of alienation in the humanities and social sciences. The topics for discussion will include, but not be limited to: – Sociological dimensions of human alienation – Exclusion of human and political ideologies – The alienation of man and state structures – Information technology and the alienation of man – Social networks and the alienation of man – Human alienation in the economic area – Identity of man and alienation in society – The alienation of man and religion – Disposal of human and national identity – The alienation of man in psychology and psychoanalysis – The problem of alienation of man in literature – Human alienation in the subject field of cultural studies and anthropology The language of the conference is English. Paper proposals up to 250 words and a brief biographical note should be sent by 10 August 2016 to: alienation@irf-network.org. Please download paper proposal form. All papers will be published in the post-conference volume.","date_start":"2016-10-28","date_end":"","important_dates":{"abstract":"","full":"2016-08-10","notification":"","final":""},"topics":["Arts & Humanities","History","anthropology"],"location":{"virtual":"","full":["Warsaw","Poland"],"name":"","street":"","city":"Warsaw","state":"","ZIP":"","country":"Poland"},"organizers":[""],"societies":[],"indexes":[],"emails":["alienation@irf-network.org"]}