{"name":"6th International Conference on Pattern Recognition Applications and Methods – ICPRAM 2017","series":"","short":"","website":"http://www.icpram.org","content":"Venue: Porto, Portugal Event date: 24 - 26 February, 2017 Regular Papers Paper Submission: October 4, 2016 Authors Notification: November 28, 2016 Camera Ready and Registration: December 13, 2016 Position Papers Paper Submission: November 8, 2016 Authors Notification: December 13, 2016 Camera Ready and Registration: December 30, 2016 Workshops Workshop Proposal: November 7, 2016 Doctoral Consortium Paper Submission: December 26, 2016 Authors Notification: January 6, 2017 Camera Ready and Registration: January 16, 2017 Special Sessions Special Session Proposal: November 23, 2016 Tutorials, Demos and Panels Proposals: December 29, 2016 Scope: The International Conference on Pattern Recognition Applications and Methods would like to become a major point of contact between researchers, engineers and practitioners on the areas of Pattern Recognition, both from theoretical and application perspectives. Contributions describing applications of Pattern Recognition techniques to real-world problems, interdisciplinary research, experimental and/or theoretical studies yielding new insights that advance Pattern Recognition methods are especially encouraged. ICPRAM 2017 will be held in conjunction with ICORES 2017 and ICAART 2017\\. Registration to ICPRAM allows free access to the ICORES and ICAART conferences (as a non-speaker). CONFERENCE AREAS: Each of these topic areas is expanded below but the sub-topics list is not exhaustive. Papers may address one or more of the listed sub-topics, although authors should not feel limited by them. Unlisted but related sub-topics are also acceptable, provided they fit in one of the following main topic areas: 1\\. THEORY AND METHODS 2\\. APPLICATIONS AREA 1: THEORY AND METHODS - Exact and Approximate Inference - Density Estimation - Bayesian Models - Gaussian Processes - Model Selection - Graphical and Graph-based Models - Missing Data - Ensemble Methods - Neural Networks - Kernel Methods - Large Margin Methods - Classification - Regression - Sparsity - Feature Selection and Extraction - Spectral Methods - Embedding and Manifold Learning - Similarity and Distance Learning - Matrix Factorization - Clustering - ICA, PCA, CCA and other Linear Models - Fuzzy Logic - Active Learning - Cost-sensitive Learning - Incremental Learning - On-line Learning - Structured Learning - Multi-agent Learning - Multi-instance Learning - Reinforcement Learning - Instance-based Learning - Knowledge Acquisition and Representation - Meta Learning - Multi-strategy Learning - Case-Based Reasoning - Inductive Learning - Computational Learning Theory - Cooperative Learning - Evolutionary Computation - Information Retrieval and Learning - Hybrid Learning Algorithms - Planning and Learning - Convex Optimization - Stochastic Methods - Combinatorial Optimization - Multiclassifier Fusion AREA 2: APPLICATIONS - Natural Language Processing - Information Retrieval - Ranking - Web Applications - Economics, Business and Forecasting Applications - Bioinformatics and Systems Biology - Audio and Speech Processing - Signal Processing - Image Understanding - Sensors and Early Vision - Motion and Tracking - Image-based Modelling - Shape Representation - Object Recognition - Video Analysis - Medical Imaging - Learning and Adaptive Control - Perception - Learning in Process Automation - Learning of Action Patterns - Virtual Environments - Robotics - Biometrics KEYNOTE LECTURES ICPRAM 2017 will have several invited keynote speakers, who are internationally recognized experts in their areas. Their names are not yet confirmed. CONFERENCE CHAIR Ana Fred, Instituto de Telecomunicações / IST, Portugal PROGRAM CO-CHAIRS Maria De Marsico, Sapienza Università di Roma, Italy Gabriella Sanniti di Baja, ICAR-CNR, Italy PROGRAM COMMITTEE http://www.icpram.org/ProgramCommittee.aspx ICPRAM Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setúbal - Portugal Tel: +351 265 520 185 Fax: +351 265 520 186 e-mail: icpram.secretariat@insticc.org Web: http://www.icpram.org/","date_start":"2017-02-24","date_end":"2017-02-26","important_dates":{"abstract":"","full":"2016-10-04","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["icpram.secretariat@insticc.org"]}