{"name":"International Conference on Biodiversity, Climate Change Assessment, and Impacts on Livelihood","series":"","short":"","website":"http://icbcl17.org","content":"he International Conference on Biodiversity, Climate Change Assessment, and Impacts on Livelihood (ICBCL) will focus on approaches from the natural and social sciences to support economic development in developing countries facing serious threats to biodiversity, environmental resources, and agricultural livelihoods caused by climate change. The three-day international conference will bring together eminent scientists, policy makers and development workers to integrate science, technology and policy into action. Emphasis will be on innovative applications of scientific and technological research to promote rural enterprises and broad based improvements in nutrition, health or living standards. This conference will also include opportunity for developing knowledge sharing hubs, regional working groups, action plans and pilot projects for regional climate change adaptations and village based agriculture enterprises. Deadlines: -Abstract submission: 30 September 2016 -Abstract selection notification: 15 October 2016 -Early bird registration: 30 November 2016 -Paper submission by February 15, 2017 Submit abstracts through EasyChair using the following link: https://easychair.org/conferences/?conf=icbcl17 In case of any trouble through easy chair kindly mail to icbcl17ateasychair.org Opportunity for participation in “International Conference on Technological Advances in Climate-Smart Agriculture and Sustainability in India”: Another International Conference on Technological Advances in Climate-Smart Agriculture and Sustainability will be held immediately after on 16-18 January 2017 at Nanded, India. If topics fit your interest, we encourage you to attend it also. Please see website more details to submit an abstracts www.tacsas.org","date_start":"2017-01-10","date_end":"2017-01-12","important_dates":{"abstract":"","full":"2016-09-30","notification":"","final":""},"topics":["Life Sciences","Other","Sustainable Development and Engineering"],"location":{"virtual":"","full":["Kathmandu","Nepal"],"name":"","street":"","city":"Kathmandu","state":"","ZIP":"","country":"Nepal"},"organizers":["USAID"],"societies":[],"indexes":[],"emails":[]}