{"name":"MICOLLAC 2016-Engaging Threads and Trends","series":"","short":"","website":"http://www.micollac.upm.edu.my/home.php?&value=0","content":"9th Malaysia International Conference on Languages, Literatures and Cultures In the research world, it is inconcievable to imagine a time when academics are confined to their rigid disciplinary walls in their disparate academic disciplines. Disciplinary compartmentalization may have once been the practice in the past, however, in today's versatile and technologically-challenging world, going beyond the boundaries of one's discipline is inevitable. This is because societies today are confronted with complex problems that are best addressed by intergrating the perspectives of multiple disciplines. Interdisciplinary and collaborative, engaged approaches are able to link knowledge with action to address new trends and problems in society. Hence, transdisciplinary collaboration (between academic researchers and stakeholders) and interdisciplinary collaboration (between academic disciplines) enable the research community to extend its significant resources toward meeting important community needs. Henceforth, a strong engagement of multiple-scholarly threads to acknowldege the emerging trends in society, either in the form of research problems or solutions, is vital to develop a productive common ground. The aim of MICOLLAC 2016 is to offer a platform for local and international academics, educators, planners and teaching professionals to meet, discuss and share latest research and fundamental advances in the field of language, literature and culture. It also aims to encourage engagement between those practicing in a wide variety of scientific areas to collaborate towards improving language and literature related applications. Attendees will have excellent opportunities to meet colleagues from Malaysia and other parts of the world. MICOLLAC 2016 invites academics to share their views and research, and welcomes paper submissions on the research theme, \"Engaging Threads and Trends\". Ever since 1999, the biennial MICOLLAC organized by the Department of English, Faculty of Modern Languages and Communication, Universiti Putra Malaysia has been steadfast in creating interconnections between theory and practice by going beyond barriers and welcoming fresh ideas in research, covering areas of languages, literatures and cultures.","date_start":"2016-08-16","date_end":"2016-08-18","important_dates":{"abstract":"","full":"2016-05-15","notification":"","final":""},"topics":["Social Sciences","Linguistics","literature"],"location":{"virtual":"","full":["Penang","Malaysia"],"name":"","street":"","city":"Penang","state":"","ZIP":"","country":"Malaysia"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}