{"name":"2017 International Conference on Graphics,Images and Interactive Techniques","series":"","short":"CGIIT 2017","website":"http://www.cgiit.org","content":"2017 International Conference on Graphics,Images and Interactive Techniques (CGIIT 2017)--Ei&Scopus--call for papers Feb.17-19, 2017 │Singapore Website: http://www.cgiit.org/ 2017 International Conference on Graphics, Images and Interactive Techniques (CGIIT 2017) will be held in Singapore during Feb.17-19, 2017\\. CGIIT 2017 is a not-to-be-missed opportunity that distills the most current knowledge on a rapidly advancing discipline in one conference. Join key researchers and established professionals in the field of graphics, images and interactive techniques as they assess the current state-of-the-art and roadmap crucial areas for future research. ●Publication and Indexing All the accepted papers will be included in the conference proceeding, which will be indexed by Ei Compendex, CPCI, Scopus, IET and other academical databases. Selected papers with great extension will be recommended to publish in international journals. ●Topics (for more topics: http://www.cgiit.org/CFP.html) Computer Graphics Image and Graphics Visualization Interactive Techniques ●Paper Submission 1, Papers can be submitted as PDF via EasyChair: https://easychair.org/conferences/?conf=cgiit2017 2, If you have any questions, please feel free to contact us. 3, Contributions must be written in English and report on original, unpublished work not submitted for publication elsewhere. Submissions not adhering to the above specified constraints may be rejected without review. ●Contact Us Ms. Crystal Chang Email: cgiit@apise.org Tel:+852-30506939( Hong Kong)","date_start":"2017-02-17","date_end":"2017-02-19","important_dates":{"abstract":"","full":"2017-01-15","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Singapore"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":[""],"societies":[],"indexes":[],"emails":["cgiit@apise.org"]}