{"name":"1st International Conference on Human Computer Interaction Theory and Applications – HUCAPP 2017","series":"","short":"","website":"http://www.hucapp.visigrapp.org","content":"Venue: Porto, Portugal Event Date 27 February – 1 March, 2017 Regular Papers Paper Submission: September 22, 2016 Authors Notification: November 16, 2016 Camera Ready and Registration: December 5, 2016 Position Papers Paper Submission: November 3, 2016 Authors Notification: December 12, 2016 Camera Ready and Registration: December 22, 2016 Workshops Workshop Proposal: October 28, 2016 Special Sessions Special Session Proposal: November 16, 2016 Tutorials, Demos and Panels Proposals: December 22, 2016 Scope: The International Conference on Human Computer Interaction Theory and Applications aims at becoming a major point of contact between researchers, engineers and practitioners in Human Computer Interaction. The conference will be structured along seventeen main tracks, covering different aspects related to Human Computer Interaction, from User Interfaces to Organic User Interfaces, Haptic Interfaces, Interactive Systems, Interaction Devices, Design and Evaluation, Principles, Theories and Models, User Modeling and User Focus, Paradigms, Usability and Universal Accessibility, Human-Web Interaction, Agents and Human Interaction, Social Aspects of Human-Computer Interaction, Computer Games and Gaming, Human-Computer Interaction in Education and Training, Applications in Medicine and Other Domain Applications. HUCAPP is part of VISIGRAPP, the 12th International Joint Conference on Computer Vision, Imaging and Computer Graphics Theory and Applications. Registration to HUCAPP allows free access to all other VISIGRAPP conferences. CONFERENCE AREAS: Each of these topic areas is expanded below but the sub-topics list is not exhaustive. Papers may address one or more of the listed sub-topics, although authors should not feel limited by them. Unlisted but related sub-topics are also acceptable, provided they fit in one of the following main topic areas: 1\\. THEORIES, MODELS AND USER EVALUATION 2\\. INTERACTION TECHNIQUES AND DEVICES 3\\. HAPTIC AND MULTIMODAL INTERACTION 4\\. AGENTS AND HUMAN INTERACTION AREA 1: THEORIES, MODELS AND USER EVALUATION - Design Methods and Tools - Cognitive and Conceptual Models - Model-Based and Mental Design - Evaluation Paradigms and Frameworks - User Performance Evaluation - User Modeling and Profiling - Analysis Methods and Tools - Usability and User Experience - Task Analysis, Guidelines and Heuristics AREA 2: INTERACTION TECHNIQUES AND DEVICES - General Input and Output Devices - Interaction Devices and Immersive Displays - Organic User Interfaces - Tangible User Interfaces - Mobile, Wearable and Pervasive Devices - Wearable, Ubiquitous and Pervasive Computing - Context-Aware and Adaptive Systems - Multi-User and Collaborative Systems - 3D Interaction Techniques and Metaphores - Virtual, Augmented and Mixed Reality - Interactive Systems for Education and Training - Collaborative Systems for Teaching, Studying and Learning AREA 3: HAPTIC AND MULTIMODAL INTERACTION - Fundamental of Haptic Interactions - Haptics Simulation and Rendering - Haptic Feedback and Control - Model for Haptic Interactions - Embodied Haptic Interfaces - Multimodal Systems and Application - Input and Output Modalities - Integration Mechanisms and Fusion Strategies AREA 4: AGENTS AND HUMAN INTERACTION - Models for Human-Agent Interaction - Agents for Human-Human Interaction - Agent-based Human-Computer-Interaction - Agent-based Human-Robot Interaction - Social Agents and Emotional Interaction - Human Cooperation and Agent-Based Interaction KEYNOTE LECTURES HUCAPP 2017 will have several invited keynote speakers, who are internationally recognized experts in their areas. Their names are not yet confirmed. CONFERENCE CHAIR Jose Braz, Escola Superior de Tecnologia de Setúbal, Portugal PROGRAM CO-CHAIRS Paul Richard, University of Angers, France Takehiko Yamaguchi, Tokyo University of Science, Japan AREA CO-CHAIRS Gilles Bailly, CNRS; Telecom ParisTech; University Paris-Saclay, France -Theories, Models and User Evaluation Thuong Hoang, The University of Melbourne, Australia -Interaction Techniques and Devices Stéphanie Buisine, CESI School of Engineering, France -Agents and Human Interaction Bob Antoine Jerry Menelas, Canada -Haptic and Multimodal Interaction PROGRAM COMMITTEE http://www.hucapp.visigrapp.org/ProgramCommittee.aspx HUCAPP Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setúbal - Portugal Tel: +351 265 520 184 Fax: +351 265 520 186 e-mail: hucapp.secretariat@insticc.org Web: http://www.hucapp.visigrapp.org/","date_start":"2017-02-27","date_end":"2017-03-01","important_dates":{"abstract":"","full":"2016-09-22","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["hucapp.secretariat@insticc.org"]}