{"name":"Innate Immunity: The first line of defence","series":"","short":"","website":"www.lifescienceevents.com/innate2016","content":"This is the FIRST live streamed only, three day professional conference discussing Innate Immunity. We have gathered together invited speakers from around the world, who you might not otherwise have access to. This event will discuss the increasingly appreciated role of the innate immune system in initiating and directing immune responses. Meeting description: This cross-disciplinary event will discuss recent findings related to the role of the innate immune system in pathogen recognition, effector function and activation of adaptive responses. We will also address its importance in aberrant immune function, and consider the potential of therapeutic targeting of the innate immune system to improve health outcomes. Who Should Attend: Those interested in the role of the innate immune system in health and disease, and in therapeutic strategies to modulate the innate immune response would all benefit from attending. This includes research scientists and academics, physicians and clinicians, and those who work within the industry We encourage questions, discussion and debate and have a relaxed atmosphere which generates maximum interaction online. After registration you will be connected to an online networking site where you will be able to have discussions with all participants of this event, before, during and after the meeting. The event will be recorded and available for all registered delegates up to a month after the event. So if you can’t manage all the days, or the different time zones, you can still have access to the full event. Deadlines Oral abstract submission deadline – 20th September 2016 Early registration discount ends – 20th September 2016 Poster submission deadline – 1st November 2016 “Innate Immunity: The first line of defence” has an open abstract session: Abstracts can be submitted on any subject related to Innate Immunity","date_start":"2016-11-15","date_end":"2016-11-17","important_dates":{"abstract":"","full":"2016-09-20","notification":"","final":""},"topics":["Medicine & Health","Medical-Speciality","immunology"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":[""],"societies":[],"indexes":[],"emails":[]}