{"name":"2nd EAI International Conference on Future Access Enablers of Ubiquitous and Intelligent Infrastructures","series":"","short":"","website":"http://fabulous-conf.org/2016/show/home","content":"FABULOUS 2016 aims at gathering prominent researchers from academia and industry, innovators and entrepreneurs in the broad areas of future wireless networks, ambient and assisted living and smart infrastructures in order to interact, exchange ideas, expertise, experience and know-how and discuss the latest results and achievements in the aforementioned topics of interest. Fabulous 2016 expects original works which describe theoretical work validated by simulation or experimental studies. Developed proof-of-concepts and testbeds are of particular interest. Topics of interest include the following: • 5G access networks; • Cloud RANs; • Self-organizing networks; • Ad-hoc networking; • Cognitive radio; • Dynamic spectrum access; • Spectrum offloading; • MmW and cmW bands for future access; • Internet of things; • Web of things; • Wireless sensor networks and practical applications; • Machine-to-machine (M2M) communications; • Device-to-device (D2D) communications; • Smart environments and examples (smart grids, eHealth solutions, assisted multi-modal learning etc.); • Energy efficiency and green solutions; • Cloud computing; • Software defined networking; • Big data; • Security; • Life sciences; • Data mining; • Dataflow supercomputing. The conference caters for a limited number of workshops on dedicated session topics. The aim of these workshops is to discuss work in progress and explore opportunities for new research related to a topic of interest within the context of the conference. Important dates: Workshops Proposal Deadline: 27th May, 2016 Full Paper Submission Deadline: 27th May, 2016 Notification Deadline: 1st July, 2016 Camera-ready deadline: 29th July, 2016 If you want to know more about the conference, visit the official website.","date_start":"2016-10-24","date_end":"2016-10-26","important_dates":{"abstract":"","full":"2016-05-27","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Belgrade","Serbia"],"name":"","street":"","city":"Belgrade","state":"","ZIP":"","country":"Serbia"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}