{"name":"2016 IEEE Workshop on Machine Learning in Security of Cyber-Physical Systems","series":"","short":"MLSCPS","website":"http://www.icmla-conference.org/icmla16","content":"It is a pleasure to invite you to 2016 IEEE Workshop on Machine Learning in Security of Cyber-Physical Systems (MLSCPS). The workshop is organized as a collaboration among academic and industrial leaders with the focus of application of Machine Learning on Security of Cyber-Physical Systems. Topics of Interests - Security of Networked Control Systems, applications in power, transportation, and biomedical systems - Intrusion Detection Techniques - Secure Communication protocols for Cyber-Physical Systems - Security Risk Analysis, Modeling, Evaluation, and Management - Software and Hardware Security - Cloud and Mobile Security - Attack and Threat Models - Techniques to Detect and Overcome new types of attacks - Security of Smart Grid Systems - Network and Sensor Security - Estimation Theory - Security of Autonomous Vehicles and Unmanned Systems - Industrial Control Systems Guide for Authors Papers should not exceed a maximum of six pages (including abstract, body, tables, figures an references), and should be submitted as a pdf in 2-column IEEE format. Submissions are via conference website. Please make sure to choose “Workshop on Machine Learning in Security of Cyber-Physical Systems” track when submitting your manuscript. You can find the link to submission website either from conference website or the link below: https://cmt.research.microsoft.com/ICMLA2016/Default.aspx Important Dates Paper Submission August, 06, 2016 Notification of Acceptance September, 07, 2016 Camera-ready papers October, 01, 2016 Program Committee Dr. Ben Amaba IBM, USA Dr. Jeff Daniels Lockheed Martin Co, USA Dr. Kang Yen Florida International University, USA Dr. Mohammad Al-Faruque University of California-Irvine, USA Dr. Mohamed Abdelghani University of Alberta, Canada Dr. Arif Sarwat Florida International University, USA Dr. Saman Sargolzaei Rancs Group LLC, USA Matt Wolff Cylance Inc, USA Xuan Zhao Cylance Inc, USA Dr. Alexander Pons Florida International University, USA Dr. Nansong Wu Florida International University, USA Dr. Anas Salah Eddin Florida Polytechnic University, USA Alireza Abbaspour Florida International University, USA Shirin Noei Florida International University, USA For any inquiries regarding the workshop, please contact workshop chair at a.sargolzaei@gmail.com We look forward to seeing you at 2016 IEEE Workshop on Machine Learning in Security of Cyber-Physical Systems (MLSCPS). Sincerely, Arman Sargolzaei, Ph.D. Chair 2016 IEEE Workshop on Machine Learning in Security of Cyber-Physical Systems (MLSCPS) Dec 18-20, Anaheim, California, USA","date_start":"2016-12-18","date_end":"2016-12-20","important_dates":{"abstract":"","full":"2016-08-06","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Biological Engineering & bioinformatics"],"location":{"virtual":"","full":["Aneheim CA","United States"],"name":"","street":"","city":"Aneheim CA","state":"","ZIP":"","country":"United States"},"organizers":["IEEE"],"societies":[],"indexes":[],"emails":["a.sargolzaei@gmail.com"]}