{"name":"Representations of Language Attrition and Loss in Film, Literature, and Popular Culture","series":"","short":"","website":"http://www.buffalo.edu/nemla/convention.html","content":"The panel seeks to bring together interdisciplinary research papers across, but not limited to, sociolinguistics, cultural studies, formalist and historicist approaches, medical humanities, literary theory, community-based revitalization practices, second language acquisition, communication sciences, and other disciplines seeking to correlate the linguistic correlates of attrition and loss to individual, community, and societal considerations. By focusing on the depiction, analysis and interpretation of manifestations of attrited language in film, literature, and popular culture irrespective of time periods, languages or spaces, the panel will raise interesting questions by aiming to carry out a cultural criticism of language loss within a broader range of topics. In particular, papers that aim to link previous criticism and theories of language loss with the intersections of globalization and marginalization, power and language endangerment, literary and non-standard varieties, identity and migration, minorities and linguistic inequalities, that might be represented in but not limited to movies, novels, plays, television, etc., underlying the growing interest on language loss will be considered. Thus, \"language loss\" for the purpose of this session has relatively lax categorical (first or second language loss), critical, historical, language and geographical constraints in order to foster competitive submissions and attract a wider audience whose research cross departmental, theoretical, and language boundaries. 300-word abstract G. Augusto Lorenzino galorenz@temple.edu","date_start":"2017-03-23","date_end":"2017-03-26","important_dates":{"abstract":"","full":"2016-09-30","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","literature"],"location":{"virtual":"","full":["Baltimore","United States"],"name":"","street":"","city":"Baltimore","state":"","ZIP":"","country":"United States"},"organizers":["Northeast Modern Language Association"],"societies":[],"indexes":[],"emails":["galorenz@temple.edu"]}