{"name":"An International Multi-disciplinary Graduate Conference","series":"","short":"","website":"http://grace2016.com","content":"UiTM Terengganu is proud to annouce its first two-day International Multi-disciplinary Graduate Conference of Terengganu (GRaCe 2016) to be held on 5th - 6th November 2016 at Taman Tamadun Islam (The Islamic Heritage Park) in Pulau Wan Man, Kuala Terengganu. Submission of Abstract from now until May 31, 2016\\. Submission of Fullpaper on July 31, 2016\\. Notification of Acceptance within 3 weeks of submission. Registration (Early bird) up until Sept 21, 2016\\. Open Registration (normal rate) until Oct 6, 2016\\. Conference Dates November 5-6, 2016\\. Backed by a pool of academic experts, the conference offers a great opportunity to refine thoughts, share concerns, and receive constructive criticism in a supportive and convivial environment. Additionally, it’s a great way to gain exposure in a conference as well as poster presentation that would surely boost up your soft skills and networking. As such, any students around the globe (be it an undergraduate or a postgraduate) from any disciplines (from Social Science to Science & Technology) who wish to take their work to the next level are warmly welcome to join us!!! Young scholar and researchers are invited to share their unpublished research findings in all but not limited to areas mentioned below: SCIENCE & TECHNOLOGY - engineering - computer science - multimedia - medical - health science - etc SOCIAL SCIENCES - business - accounting - law - human capital - hospitalities - etc LINK: http://grace2016.com/ Email: grace.tganuatgmail.com contact person: Assoc. Prof. Dr. Mazidah Puteh Phone: +609-8400 400","date_start":"2016-11-05","date_end":"2016-11-06","important_dates":{"abstract":"","full":"2016-05-31","notification":"","final":""},"topics":["Life Sciences","Other"],"location":{"virtual":"","full":["Kuala Terengganu","Malaysia"],"name":"","street":"","city":"Kuala Terengganu","state":"","ZIP":"","country":"Malaysia"},"organizers":["Universiti Teknologi MARA Terengganu"],"societies":[],"indexes":[],"emails":[]}