{"name":"Improving techniques and technology for cellular and molecular pathology","series":"","short":"","website":"www.lifescienceevents.com/path16","content":"This is the FIRST live streamed only, three day professional conference discussing Molecular, Cellular and Digital Pathology. We have gathered together invited speakers from around the world, who you might not otherwise have access to. This event will discuss the latest advances in methodologies for the cellular, molecular and digital analysis of disease. Meeting description: This event will showcase the latest applications of multimodal pathological investigations used to study disease, and consider how current techniques can be improved for the benefit of healthcare management. We encourage questions, discussion and debate and have a relaxed atmosphere which generates maximum interaction online. After registration you will be connected to an online networking site where you will be able to have discussions with all participants of this event, before, during and after the meeting. Who Should Attend: All those involved in pathological analysis and/or the development of novel analytical techniques, including researchers from academia and industry, laboratory technicians and clinicians. The event will be recorded and available for all registered delegates up to a month after the event. So if you can’t manage all the days, or the different time zones, you can still have access to the full event. A Euroscicon live streamed event gives you access to a wider range of international speakers at a fraction of the cost of a real world event. Furthermore, you no longer have to worry about travel or accommodation expenses, or any arrangements you have which clash with","date_start":"2016-11-29","date_end":"2016-12-01","important_dates":{"abstract":"","full":"2016-09-10","notification":"","final":""},"topics":["Life Sciences","Microbiology/ Pathology/ Toxicology","cancer & oncology"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":[""],"societies":[],"indexes":[],"emails":[]}