{"name":"Winter school on \"Big Software on the Run: Where Software meets Data\"","series":"","short":"","website":"http://www.3tu-bsr.nl/doku.php?id=bsr-ws2016","content":"BSR winter school - 1st Call for participation ======================================================== BSR winter school on “Big Software on the Run – Where Software meets Data” Sunday 23rd October – Friday 28th October, 2015, Ede, the Netherlands http://www.3tu-bsr.nl/doku.php?id=BSR-WS2016 ======================================================= We are pleased to announce the 1st BSR winter school on “Big software on the Run – Where Software meets Data”. Organized by the three Dutch technical universities (Eindhoven University of Technology, TU Delft, and University of Twente), this cross-disciplinary school gives you the unique opportunity to meet some of the world’s leading researchers working on software analytics and process mining related problems and discuss your research with other participants. The winter school is organized in the context of the 3TU.BSR (“Big Software on the Run”, http://www.3tu-bsr.nl/) initiative. The BSR winter school brings together university researchers including PhD students and postdoctoral-fellows as well as professionals from industry who are interested in discussing and developing new ideas combining approaches from multiple software analytics related disciplines. The school is organized in close collaboration with SIKS, ASCI and IPA and will run from Sunday 23rd to Friday 28th October, 2016\\. The venue is Hotel de Paasberg in Ede, the Netherlands. SCOPE AND GOAL Software systems have grown increasingly large and complex in today’s highly interconnected world. Communication, production, healthcare, transportation and education all increasingly rely on “Big Software”. This increasing dependence makes reliable software systems a major concern and stresses the need for effective prediction of software failures. Since software is evolving and operates in a highly dynamic and changing environment, it becomes difficult if not impossible to anticipate all problems at design-time. Within the BSR research program (http://www.3tu-bsr.nl/) that has started in 2015, we propose to shift the main focus from a priori software design to a posteriori software analytics, thereby exploiting the large amounts of event data generated by today's systems. The core idea is to study software systems in vivo, i.e., at runtime and in their natural habitat. We would like to understand the actual behavior of software, to detect and predict future violations (e.g. deviations from some normative model, privacy and security constraints, etc.) and to provide insightful recommendations for software engineering related tasks (e.g. development, testing, debugging, configuration, etc.). This paradigm shift requires new forms of empirical investigation that go far beyond the common practice of collecting error messages and providing software updates. Novel techniques in process mining, visualization, security, feedback, and analytics are being developed within a joint collaboration between the three technical universities. The aim of the BSR winter school is to bring together researchers, industry professionals and students to work on a multi-perspective and interdisciplinary understanding of the current problems and challenges related to in vivo software analytics concepts and practices. The school will cover software analytics related topics (including: dynamic analysis, testing, visualization, security and software analytics in the large) and process mining as a new enabler for in vivo software analytics. Lectures are combined with hands-on sessions that will help you to understand theoretical principles and how to apply them. SCHEDULE This five-day event (Monday to Friday) will consist of: • Sessions by some of the top researchers and industry professionals in the field. • Sessions by senior researchers working on the BSR project. • Hands-on sessions on novel methods and techniques for BSR. • Poster sessions and discussion on BSR related topics and their future. A detailed schedule will be announced soon. VENUE: The BSR winter school will be held at Hotel de Paasberg www.hoteldepaasberg.nl, Ede, The Netherlands, where all speakers and students will be accommodated. Ede, known as a holiday area, is in the center of the Netherlands. It is famous for its woods, heathland, drifting sands and the Hoge Veluwe National Park, where the Museonder (Subterranean Museum) and the Kröller-Müller Museum are located. APPLICATION: Qualified candidates should register by June 15th, 2016\\. All students of the winter school will be invited to present their ongoing work in poster sessions. They will be asked to submit a title and an abstract beforehand. Acceptance decisions will be made by June 30th, 2016\\. Accepted candidates will receive a link to the final registration form (requiring the payment of the registration fee) via email. The registration fee is 450€ and covers the following costs: • Accommodation costs for 5 nights (arrival on Sunday, October 23 afternoon) at Hotel de Paasberg. • Meal costs for 5 days (Breakfast, lunch and dinner) excluding drinks during the dinners • Participation in sessions • Social events (e.g. welcome party, excursion, etc.) All winter school material will be collected in proceedings that are handed out to the participants. Moreover, participants are invited to contribute short papers that will be published as online CEUR proceedings. For more information please visit http://www.3tu-bsr.nl/doku.php?id=BSR-WS2016:application SCHOOL DIRECTORS Prof. Wil van der Aalst: w.m.p.v.d.aalst@tue.nl Prof. Arie van Deursen: arie.vandeursen@tudelft.nl WEBSITE AND CONTACT For all additional information, please visit the website: http://www.3tu-bsr.nl/doku.php?id=BSR-WS2016 You can also contact the school organizers at bsr-ws@listserver.tue.nl","date_start":"2016-10-23","date_end":"2016-10-28","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Big Data Mining & Analysis"],"location":{"virtual":"","full":["Ede","Netherlands"],"name":"","street":"","city":"Ede","state":"","ZIP":"","country":"Netherlands"},"organizers":["Eindhoven university of technology, Delft university of technology, university of Twente"],"societies":[],"indexes":[],"emails":["w.m.p.v.d.aalst@tue.nl","arie.vandeursen@tudelft.nl","bsr-ws@listserver.tue.nl"]}