{"name":"IIPLA 2nd Global IP Summit 2016 London","series":"","short":"","website":"http://www.iipla.org/event/iipla-2nd-global-ip-summit-2016-london","content":"Who Should Attend? IIPLA's 2nd Global IP Summit is being organized for IP lawyers, in-house and external IP counsel, law firm partners, legal service providers, legal outsourcing service executives, policy makers, IP service buyers and investors in the IP world, along with the stakeholders in the legal and Intellectual Property Industry. The attendees further include educators & learners from global universities. Why Attend? IIPLA's 2nd Global IP Summit 2016 is the next step towards the unification of IP trends Worldwide. IIPLA's 2nd Global IP Summit aims to create an International Forum of Intellectual Property for In-house IP lawyers, partners, IP Agencies, Law Firms and providers of other services in the legal industry. IIPLA's 2nd Global IP Summit facilitates exchange of experience & ideas and encourages cross border cooperation. Thus, IIPLA's 2nd Global IP Summit would enrich the participants with IP knowledge, resources and its application in future. ome of the tentatives Agenda topics are listed below :- IP and Development IP and International Trade Agreements Intellectual Property Asset Management Medical Devices, Pharmaceuticals and IP Unitary Patent and the Unified Patent Court Valuation of IP and NPEs and New Businesses The future of patent sales and acquisitions Technology incubators, accelerators and hubs: The good, the bad and the ugly. Trademarks: From Filing to Litigation and Licensing & Assignment of Trademark Rights Current IP Enforcement Solutions in Complex Environments Safeguard against Registrability of identical or similar trademarks. Intellectual Property in Entertainment Industry and Copyright in the Digital Era Patent Litigation and Patent Prosecution strategies Non-Conventional Trademarks Intellectual Property and Competition Latest Trends in IP Litigation Intellectual Property(IP), Technology Transfer and Commercialization(TTC), IP Monetization IP Acquisition and Enforcement Strategies","date_start":"2016-06-06","date_end":"2016-06-07","important_dates":{"abstract":"","full":"2016-06-01","notification":"","final":""},"topics":["Education / Legal / Other","Law/Legal-Studies","Law and legal studies"],"location":{"virtual":"","full":["San Jose","California","United States"],"name":"","street":"","city":"San Jose","state":"California","ZIP":"","country":"United States"},"organizers":["International Intellectual Property Law Association Inc. , IExForum"],"societies":[],"indexes":[],"emails":[]}