{"name":"VII Nuclear Physics in Astrophysics Conference","series":"","short":"","website":"http://npa7.iopconfs.org/home","content":"Nuclear physics plays a central role in astrophysics as it accounts for the processes that govern the lives of stars and the creation of all elements beyond primordial hydrogen and helium. The energy released by nuclear reactions powers some of the most spectacular explosions in the Universe, which in turn contribute to the chemical evolution of our and other galaxies. The last decades have witnessed impressive advances in the field of Nuclear Astrophysics thanks to improved astrophysical observations, state of the art equipment for nuclear physics experiments and key developments in theoretical and computational modelling of stellar evolution and nucleosynthesis. Every two years the Nuclear Physics in Astrophysics Conference brings together researchers from a multi-disciplinary community of experimental and theoretical nuclear physicists, astronomers, astrophysicists and cosmo-chemists. It is sponsored by the Nuclear Physics Division of the European Physical Society. The seventh edition of the Nuclear Physics in Astrophysics Conference \\[NPA VII\\] will be held from 18 to 22 May 2015 in York, United Kingdom, and is jointly organised by the Universities of Edinburgh and York. The scientific programme of the NPAVII will include: Big Bang nucleosynthesis and the early universe Explosive scenarios in astrophysics: observations, theory, and experiments Exotic nuclei: toward the drip lines Neutrinos in astrophysics Neutron stars and dense matter equation of state Nuclear structure and nuclear theory Stellar evolution and nucleosynthesis Tools, techniques and facilities Underground nuclear astrophysics","date_start":"2015-05-18","date_end":"2015-05-22","important_dates":{"abstract":"","full":"2015-01-22","notification":"","final":""},"topics":["Physical Science & Math","Astronomy/Astrophysics","astronomy"],"location":{"virtual":"","full":["York","United Kingdom"],"name":"","street":"","city":"York","state":"","ZIP":"","country":"United Kingdom"},"organizers":["IOP Nuclear Physics Group"],"societies":[],"indexes":[],"emails":[]}