{"name":"12th International Conference on Computer Graphics Theory and Applications – GRAPP 2017","series":"","short":"","website":"http://www.grapp.visigrapp.org","content":"Venue: Porto, Portugal Event Date 27 February – 1 March, 2017 Regular Papers Paper Submission: September 22, 2016 Authors Notification: November 16, 2016 Camera Ready and Registration: December 5, 2016 Position Papers Paper Submission: November 3, 2016 Authors Notification: December 12, 2016 Camera Ready and Registration: December 22, 2016 Workshops Workshop Proposal: October 28, 2016 Special Sessions Special Session Proposal: November 16, 2016 Tutorials, Demos ans Panels Proposals: December 22, 2016 Scope: The International Conference on Computer Graphics Theory and Applications aims at becoming a major point of contact between researchers, engineers and practitioners in Computer Graphics. The conference will be structured along five main tracks, covering different aspects related to Computer Graphics, from Modelling to Rendering, including Animation, Interactive Environments and Social Agents In Computer Graphics. We welcome papers describing original work in any of the areas listed below. Papers describing advanced prototypes, systems, tools and techniques as well as general survey papers indicating future directions are also encouraged. Paper acceptance will be based on quality, relevance to the conference themes and originality. The conference program will include both oral and poster presentations. Special sessions, dedicated to case-studies and commercial presentations, as well as technical tutorials, dedicated to technical/scientific topics, are also envisaged. Companies interested in presenting their products/methodologies or researchers interested in lecturing a tutorial are invited to contact the conference secretariat. GRAPP is part of VISIGRAPP, the 12th International Joint Conference on Computer Vision, Imaging and Computer Graphics Theory and Applications. Registration to GRAPP allows free access to all other VISIGRAPP conferences. CONFERENCE AREAS: Each of these topic areas is expanded below but the sub-topics list is not exhaustive. Papers may address one or more of the listed sub-topics, although authors should not feel limited by them. Unlisted but related sub-topics are also acceptable, provided they fit in one of the following main topic areas: 1\\. GEOMETRY AND MODELING 2\\. RENDERING 3\\. ANIMATION AND SIMULATION 4\\. INTERACTIVE ENVIRONMENTS AREA 1: GEOMETRY AND MODELING - Procedural and Multiresolution Modeling - Quad-Dominant Remeshing - Hexahedral Meshing - 3D Model Repair and scene reconstruction - Architectural Geometry - Processing Frameworks and Data Structures - Modeling and Algorithms - Scene and Object Modeling - Modeling of Natural Scenes and Phenomena - Image-Based Modeling - Solid and Heterogeneous Modeling - Geometric Computing - Surface Modeling - Physics-Based Modeling - Fundamental Methods and Algorithms - Model Validation - Texture Models, Analysis, and Synthesis - CAGD/CAD/CAM Systems AREA 2: RENDERING - Real-Time Rendering - Systems and Software Architectures for Rendering - Volume Rendering - Rendering Algorithms - Image-Based Rendering - Lighting and Appearance - Non-Photorealistic Rendering, Painting-like rendering, Drawing - Rendering Hardware - Point-Based Rendering - Shadows, Translucency and Visibility - High-Performance Computing and Parallel Rendering - Computational Photography AREA 3: ANIMATION AND SIMULATION - Real-time Clothing and virtual fashion - Scalable Fluid Simulation - Simulation of Elastic Rods, Shells, and Solids - Dynamic Simulation of Physical Behaviour - Animation Algorithms and Techniques - Real-time Visual Simulation - Special Effects - Facial Animation - Animation Systems - Animation from Motion Capture - Real-time character Animation - Plausible Motion Simulation - Animation of Particle Systems - Human Figure Animation - Crowd Simulation - Physics-based Animation - Image-based Animation - Modeling and Simulation for Education and Training AREA 4: INTERACTIVE ENVIRONMENTS - Procedural and interactive artworks - Augmented, Mixed and Virtual Environments - Virtual Tours - Hardware Technologies for Augmented, Mixed and Virtual Environments - Collaborative Augmented, Mixed and Virtual Environments - Distributed Augmented, Mixed and Virtual Reality - Real-time Graphics - Advanced User Interfaces - Mobile Interfaces - Graphical Interfaces - Virtual Humans and Artificial Life - Interactive 3D Graphics and Immersive Systems for Servers, Desktop and Thin Clients - Interactive 3D Graphics for Mobile Devices Like Smart phones, PDAs and UMPCs - Sketch-based Interfaces - Virtual Reality Tools and Languages - Integration and Interoperation Between 3D Documents and Web/Multimedia Technologies, Including the Semantic Web - e-Learning Applications and Computer Graphics - Games for Education and Training - Human Performance and Usability of Virtual Environments VISIGRAPP KEYNOTE SPEAKERS VISIGRAPP 2017 will have several invited keynote speakers, who are internationally recognized experts in their areas. Their names are not yet confirmed. VISIGRAPP CONFERENCE CHAIR Jose Braz, Escola Superior de Tecnologia de Setúbal, Portugal PROGRAM CHAIR Ana Paula Cláudio, BioISI, Faculdade de Ciências, Universidade de Lisboa, Portugal PROGRAM COMMITTEE http://www.grapp.visigrapp.org/ProgramCommittee.aspx GRAPP Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setúbal - Portugal Tel: +351 265 520 184 Fax: +351 265 520 186 e-mail: grapp.secretariat@insticc.org Web: http://www.grapp.visigrapp.org/","date_start":"2017-02-27","date_end":"2017-03-01","important_dates":{"abstract":"","full":"2016-09-22","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer graphics, animation, virtual reality & gaming"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["grapp.secretariat@insticc.org"]}