{"name":"International Conference on Big Data & Smart City","series":"","short":"","website":"http://mec.edu.om/conf2016/index.html","content":"Every day, more than two quintillion bytes of data is created in this info-centric digitalized world. This vast influx of Big Data is being generated by immense velocity, volume and variety through cell phones, social media posts, transaction records, digital recordings, intelligent sensors etc. This Big Data, if analyzed, can extract an in-depth insight into the very fabric of our society. In this data-centric digital world, data is a key source for promoting growth and wellbeing of the society. Exploration of the interconnection of data helps to link information and formulate strategies efficiently. Big data is an emerging paradigm applied to large data sets where size, complexity and velocity are beyond the ability of a normal computer software and hardware tools. The spatial and temporal pattern of big data can play a vital role in framing the agenda of Smart City initiatives. Smart Cities strives for better living with better resources. The periphery of the Smart City initiative also encircles the area of utilization and allocation of available resources and related information in order to successfully achieve shared development. Smart City initiative is an attempt to identify the technologies that can solve problems which cities must confront, such as traffic congestion, energy crisis, poor air quality and health issues, and hence create a network of partner cities to share the ideas for future progress. The purpose of the conference on Big Data and Smart City is to bring together researchers, designers, developers and practitioners interested in the advances and applications in the field of smart cities, green information and communication technologies, sustainability, energy aware systems and technologies to realize smart communities of the future. Papers with new research results and new products or concepts are encouraged for submission. Accepted and presented papers will be published in the conference proceedings and submitted to IEEE Xplore as well as other Abstracting and Indexing (A&I) databases","date_start":"2016-03-15","date_end":"2016-03-16","important_dates":{"abstract":"","full":"2015-09-10","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Big Data Mining & Analysis"],"location":{"virtual":"","full":["Muscat","Town in Muscat","Masqat","Oman","Oman"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":["IEEE, Middle East College"],"societies":[],"indexes":[],"emails":[]}