{"name":"4th Annual Worldwide Nursing Conference","series":"","short":"WNC 2016","website":"http://nursing-conf.org/index.html","content":"Important Dates Full Paper Submission Deadline: 20 May 2016 Final Paper (Camera-Ready) Submission Deadline: 10 June 2016 Early Bird Registration Deadline: 3 June 2016 Regular Registration Deadline: 24 June 2016 Conference Dates: 18 - 19 July 2016 2 KEYNOTE SPEAKERS Prof. Alex Molasiotis, The Hong Kong Polytechnic University, Hong Kong Prof. Rozzano C. Locsin, Florida Atlantic University, USA 3 PLENARY SPEAKERS Prof. Esther Chang, Western Sydney University, Australia Assoc. Prof. Chris Kewley, University of Newcastle, Australia Assoc. Prof. Helen Chan, The Chinese University of Hong Kong, Hong Kong Conference Theme Nursing practice is both a science and an art. It requires scientific skill yet demands a strong background in the social sciences and humanities. Nursing makes a significant contribution to the health maintenance, health promotion and well-being of individuals, local communities and populations. A major challenge for current and future nursing practice, education and management is to address health for all and work towards equity and access to health care. Nursing Conference aims to explore advances in nursing practice, management and education in relation to health disparities as well as a breadth of other topics. WNC will provide an opportunity for nursing practitioners and educators to exchange research evidence, models of best practice and innovative ideas. WNC 2015 provided a forum and opportunity for delegates from 60 individual universities and 22 countries to share their research, practice, and educational initiatives with an international audience. 4th Annual WNC for 2016 will focus on “The Role of Nursing in Leading and Advancing Global Health”. WNC 2016 will focus on the following 6 streams: Advanced Practice Nursing and Global Perspectives Nursing Education and International Trends Nursing Leadership and Global Influence Cross-cultural Nursing and Models of Care International Nursing and Global Health Nursing and Integrated Care","date_start":"2016-07-18","date_end":"2016-07-19","important_dates":{"abstract":"","full":"2016-05-20","notification":"","final":""},"topics":["Medicine & Health","Nursing","nursing, healthcare"],"location":{"virtual":"","full":["Singapore","Singapore"],"name":"","street":"","city":"Singapore","state":"","ZIP":"","country":"Singapore"},"organizers":["Global Science and Technology Forum"],"societies":[],"indexes":[],"emails":[]}