{"name":"First International Conference on Anti-Cybercrime","series":"","short":"","website":"http://icacc.ccis-imsiu.edu.sa","content":"The ICACC-2015 aims to bring together primarily researchers, but also practitioners from academia, industry and governmental institutions to elaborate and discuss IT security and privacy challenges that we are facing today and will be facing in the future. The Scientific and Technical Program includes: - Keynote Presentations - Panels - Paper Sessions - Exhibitions - Poster Sessions - Pre-Congress workshops Authors from scientific, social, and policy making communities are invited to submit original research papers and experience reports describing innovative work in the subject field. Scope and Topics: ============ - Properties, effects and recent trends of cybercrime - Public awareness in cybercrime - Cybercrime and terrorism - Features of cybercrime criminals - Anti-cybercrime concepts and challenges - Anti-cybercrime laws and agreement - Anti-cybercrime knowledge in formal education - Cybercrime detection techniques and means - Information security role in cybercrime - Infrastructure protection for electronic information - Securing electronic transactions - Collection and handling of digital forensics - Countries’ experiences in cybercrime Digital Proceeding: ============ Accepted and presented papers will be published as proceedings in the IEEE Xplore® digital library. In addition, registrants will receive a copy of the papers at the conference. Registration and Local Arrangements: ======================== ICACC-2015 has No Registration Fee but participants must have to register online. Local arrangements (accommodation, food, and transportation) are complimentary for one presenter of each paper in the conference sessions.","date_start":"2015-02-09","date_end":"2015-02-11","important_dates":{"abstract":"","full":"2014-11-30","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Cybersecurity & digital forensics"],"location":{"virtual":"","full":["Riyadh","Saudi Arabia"],"name":"","street":"","city":"Riyadh","state":"","ZIP":"","country":"Saudi Arabia"},"organizers":["Al Imam Mohammad ibn Saud Islamic University and IEEE Social Implications of Technology Society"],"societies":[],"indexes":[],"emails":[]}