{"name":"2016 International Neighbourhood Symposium “Societal Transformations in the Eastern Neighbourhood and the Mediterranean South”","series":"","short":"","website":"http://www.khas.edu.tr/cies/187","content":"2016 International Neighbourhood Symposium “Societal Transformations in the Eastern Neighbourhood and the Mediterranean South” Heybeliada, Turkey 21 – 26 June 2016 The Center for International and European Studies (CIES) at Kadir Has University will host the 6th International Neighbourhood Symposium (INS) at Heybeliada, near Istanbul between Tuesday, 21 June and Sunday, 26 June 2016\\. This year’s Symposium will focus on “Societal Transformations in the Eastern Neighbourhood and the Mediterranean South”. The INS focuses principally on the Eastern Neighbourhood and the Mediterranean South, two regions that are shared neighborhoods of the European Union, its member states, the Russian Federation, and Turkey. While each region is distinct with its own historical, political, social, cultural and economic features; their contiguity implies a number of synergies on different sectoral concerns such as systemic dynamics given the concentration of great and 2nd tier powers with a stake in the two regions. The International Neighbourhood Symposium aims to promote further understanding and cooperation in the Eastern Neighbourhood and the Mediterranean South and beyond by providing a forum for study, dialogue and networking in a multicultural and interdisciplinary environment. Young professionals and graduate students primarily from the countries of the Eastern Neighbourhood, the Mediterranean South, Central Asia, EU member states, and the United States are the Symposium target group. In addition, applicants from the fields of public policy, politics, journalism, and business are especially encouraged to apply. The target age group is 22-35 years of age. The CIES project enjoys the support of numerous international partners and co-sponsors. To date these include the Black Sea Trust for Regional Cooperation; the Friedrich Naumann Foundation; the Harvard University Black Sea Security Program; Kadir Has University; the Corporate Social Responsibility Association of Turkey; Arcadia University; and the International Networking Institute, Istanbul. Please forward this information to anybody you think might be interested and qualified in taking part. More information on the Symposium is provided in the Event Announcement link below. The deadline for applications is Thursday, 31 March 2016\\. 2016 INS Event Announcement 2016 INS Application Form (http://p2.khas.edu.tr/ciesapp/ )","date_start":"2016-06-21","date_end":"2016-06-26","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Social Sciences","Political-Science"],"location":{"virtual":"","full":["Istanbul","Turkey"],"name":"","street":"","city":"Istanbul","state":"","ZIP":"","country":"Turkey"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}