{"name":"6th Annual International Conference on Accounting and Finance","series":"","short":"AF 2016","website":"http://acc-finance.org/index.html","content":"Important Dates \\*Extended Full Paper Submission Deadline: 12 February 2016 Early Bird Registration Deadline: 4 March 2016 Late Registration Deadline: 28 March 2016 Conference Dates: 30 - 31 May 2016 Keynote Addresses Assoc. Prof. Gao Huasheng, Nanyang Technological University, Singapore Assoc Prof Dragon Tang, University of Hong Kong, Hong Kong Assoc. Prof. Gang Hu, Hong Kong Polytechnic University, Hong Kong Conference Theme As financial markets integrate and business operations diversify, the need for adoption of common global accounting practices intensifies. Heightening this need further are inadequacies in reporting systems that sometimes undermine the credibility of published financial data. Incidences of inadequate reporting in turn have brought a call for research on how to align the content and presentation of corporate financial statements better with the interests of those statements’ users. The AF conference is a forum of communication for academics, researchers, practitioners, and policymakers in the areas of accounting and finance. Through its broadly defined scope, we welcome research in areas such as accounting history, finance, financial reporting and communication methodologies, interdisciplinary perspectives on accounting, management control, and public sector financial management. The AF conference provides an outlet for high-quality, refereed, empirical research on all aspects of accounting and finance. Purely theoretical research with the potential for empirical applications and in-depth literature reviews also are welcome. The main themes of AF 2016 are: Effects of mandatory IFRS reporting Accounting standard compliance in transitional economies Management accounting and organizational performance Sustainability accounting \\*as we have received requests for extension from several authors","date_start":"2016-05-30","date_end":"2016-05-31","important_dates":{"abstract":"","full":"2016-02-12","notification":"","final":""},"topics":["Business","Finance","accounting"],"location":{"virtual":"","full":["Singapore","Singapore"],"name":"","street":"","city":"Singapore","state":"","ZIP":"","country":"Singapore"},"organizers":["Global Science and Technology Forum"],"societies":[],"indexes":[],"emails":[]}