{"name":"9th Asian Conference on Intelligent Information and Database Systems","series":"","short":"","website":"http://www.aciids.pwr.edu.pl","content":"\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* CALL FOR PAPERS \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* Conference: ACIIDS 2017 Name: 9th Asian Conference on Intelligent Information and Database Systems Conference web site: http://www.aciids.pwr.edu.pl Date: April 3-5, 2017 Venue: Kanazawa, Japan Publication: Springer LNCS/LNAI Series (max 10 pages) Submission via EasyChair: https://easychair.org/conferences/?conf=aciids2017 \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* IMPORTANT DATES \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* Submission of papers: 1 October 2016 Notification of acceptance: 1 November 2016 Camera-ready papers: 15 November 2016 Registration and payment: 15 December 2016 Conference: 3-5 April 2017 \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* SCOPE \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* 1\\. Intelligent Information Systems: - Artificial and Computational Intelligence - Distributed Artificial Intelligence - Intelligent Agents and Multi-Agent Systems - Intelligent Techniques in Bioinformatics, Optimizations - Intelligent Systems: Internet, Software, Energy, Hybrid - Computational Nanotechnology - Game and Decision Theories, Planning - Neurocomputers - Parallel Computation - Automation Systems and Control - Robotics and Autonomous Robots - Method Engineering and Meta-Modeling - UML and Unified Processes - Empirical Software Engineering - Extreme Modeling and Extreme Programming 2\\. Intelligent Database Systems: - Data Warehousing, Data Mining, and Big Data - Mobile and Peer-to-Peer Databases - Spatial, Temporal, Multimedia, Scientific Databases - Semi-Structured, RDF, XML Databases - Stream and Sensor Databases - Social Networks, Web, and Personal Data Management - Object-Relational and Object-Oriented Databases - Heterogeneous and Distributed Databases - Heterogeneous Knowledge Bases - Data Integration and Interoperability - Ontologies and Information Sharing - Database Models and Query Languages - Database Privacy and Security - Database System Internals and Performance 3\\. Tools and Applications: - Collaborative Learning, Systems, and Applications - Enterprise Systems and Supply Chain Integration - Virtual Teams, Mobile Collaboration, Artificial Social Systems - Recommender Systems - Healthcare and Medicine - Autonomic Computing - E-learning, E-institutions, E-commerce, E-finance, E-business, and M-commerce - Web Services and Semantic Web - Speech and Natural Language Processing - Case Studies and Reports on Deployments - Simulation Systems - Computational Infrastructures \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* SUBMISSION DETAILS \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* All contributions should be original and not published elsewhere or intended to be published during the review period. Submitted papers should be prepared in English in LNCS/LNAI style and should not exceed 10 pages. Each paper is to be submitted electronically as a single PDF file through EasyChair at: https://easychair.org/conferences/?conf=aciids2017 All accepted papers must be presented by one of the authors who must register for the conference and pay the fee. The conference proceedings will be published by Springer in the prestigious series LNCS/LNAI (indexed by ISI, EI, DBLP, Inspec, Scopus, etc.). A selected number of accepted and personally presented papers will be expanded and revised for possible inclusion in special issues in high quality scientific journals. \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* ORGANIZERS \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* Japan Advanced Institute of Science and Technology (JAIST), Japan Wroclaw University of Technology, Poland \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* GENERAL CHAIRS \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* Satoshi Tojo, JAIST, Japan Ngoc Thanh Nguyen, Wrocław University of Technology, Poland \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* PROGRAM CHAIRS \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* Tzung-Pei Hong, National University of Kaohsiung, Taiwan Le Minh Nguyen, JAIST, Japan Edward Szczerbicki, University of Newcastle, Australia Bogdan Trawiński, Wrocław University of Technology, Poland \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* SPECIAL SESSION CHAIRS \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* Dariusz Krol, Wroclaw University of Technology, Poland Kiyoaki Shirai, JAIST, Japan \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* LIAISON CHAIRS \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* Ford Lumban Gaol, Bina Nusantara University, Indonesia Bao Hung Hoang, Viethanit, Vietnam Mong-Fong Horng, National Kaohsiung University of Applied Sciences, Taiwan Dosam Hwang, Yeungnam University, Korea Ali Selamat, Universiti Teknulogi Malaysia, Malyasia \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* ORGANIZING CHAIRS \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* Atsuo Yoshitaka, JAIST, Japan Adrianna Kozierkiewicz-Hetmańska, Wrocław University of Technology, Poland \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* PUBLICATION CHAIR \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* Marcin Maleszka, Wrocław University of Technology, Poland \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* PUBLICITY CHAIRS \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* Danilo. S. Carvalho, JAIST, Japan Bernadetta Maleszka, Wrocław University of Technology, Poland \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* CONTACT \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* Organizational issues: aciids@pwr.edu.pl Special sessions: dariusz.krol@pwr.edu.pl Webmaster: marek.kopel@pwr.edu.pl","date_start":"2017-04-03","date_end":"2017-04-05","important_dates":{"abstract":"","full":"2016-10-01","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Kanazawa","Japan"],"name":"","street":"","city":"Kanazawa","state":"","ZIP":"","country":"Japan"},"organizers":["Japan Advanced Institute of Science and Technology (JAIST), Japan; Wrocław University of Technology,"],"societies":[],"indexes":[],"emails":["aciids@pwr.edu.pl","dariusz.krol@pwr.edu.pl","marek.kopel@pwr.edu.pl"]}