{"name":"Journal of Communication: Media Watch","series":"","short":"","website":"www.mediawatchjournal.in","content":"Call for Papers Journal of Communication: Media Watch Index & Abstract Scopus, Elsevier, Ebsco Communication and Media Index, Embase, CrossRef, Reaxys, Google Scholar, ERIH Plus, Asian Education Index, CiteFactor, Scientific Indexing Service, Index Copernicus, ResearchBib, Engineering Village, MIAR, Ulrichsweb, J-Gate, Indian Citation Index, DRIJ Free Speech after a Free Press Issue Editor: Dr. Brian Gorman Associate Professor, Communication Studies MacEwan University, Edmonton AB, Canada For detail information, please visit: www.mediawatchjournal.in Important Dates: November 15, 2016 (Abstract submission) January 15, 2017 (Full paper submission) In some parts of the world– notably North America, Great Britain and Australia – newspapers and, to a lesser extent, broadcast news organizations, appear to be dying. In the case of newspapers, the disease is a wasting one, in which the loss of advertising dollars combined with a disastrous decision to give content away for free online is quickly starving all but the largest news organizations with the widest reach. And the speed with which the atrophy has taken place has been breathtaking. The conditions ailing broadcast news are more complex and subtle – ranging from the same struggle for ad revenue to the race to the bottom instigated by all-news networks. In other areas of the world, however, newspapers are doing well, often thriving and sometimes growing. Sometimes, it seems as if nations that came later to – or had to struggle for – free speech tend less to take it for granted. However, it’s likely that, even in countries with the most robust free press, technology is going to force evolution upon the news business. Media Watch is planning an issue dealing with the future of the news business around the world. Thus, we are calling for submission from media scholars in as wide a range of locations as possible, dealing with the future of the free press, as seen from technological, labour, craft and business perspectives. We are interested in sociological, political and cultural revolution in a post-free press environment. Rather than examining ways to preserve the press as we know it, we are asking scholars to imagine a world after the demise of the current news industry. Dr. Sony Jalarajan Raj Editor-in-Chief, The Journal of Media Watch Department of Communication 7-166C, 10700-104 Avenue MacEwan University, Edmonton, AB, Canada, T5J 4S2 E-mail your submission to: sonyjraj@gmail.com editor@mediawatchjournal.in mediawatchjournal@gmail.com","date_start":"2017-01-15","date_end":"","important_dates":{"abstract":"","full":"2016-11-15","notification":"","final":""},"topics":["Arts & Humanities","Other","social communication & mass media"],"location":{"virtual":"","full":["Puri","India"],"name":"","street":"","city":"Puri","state":"","ZIP":"","country":"India"},"organizers":["Centre for Academic Social Action"],"societies":[],"indexes":[],"emails":["sonyjraj@gmail.com","editor@mediawatchjournal.in","mediawatchjournal@gmail.com"]}