{"name":"3rd International Conference on Language and Literacy Education","series":"","short":"","website":"www.wits.ac.za","content":"Theme: Diversifying Pathways for Language and Literacy Education in Multilingual Contexts The validity of boundaries between languages and literacies has been intensely debated in the field of language and literacy education questions since the turn of the 21st Century. Competing concepts such as translanguaging, codemeshing, metrolanguaging and polylanguaging have taken a centre stage in current discourses around multilingual and multicultural education. However, there are very few literacy programmes that have provided blue prints on how these multilingual spaces can be harnessed as resources to offset monolingual bias and its attendant rigidity that is pervasive in our classrooms. This conference will showcase local and international responses to the changing language and literacy spaces and to provide pathways for future imperatives through dialogues and forge networks among researchers and practitioners worldwide. We are inviting teachers, researchers and postgraduate students to present papers in any of the following broad areas: 1) Language Methodologies 2) Translingual classroom interactions 3) Inclusive literacy 4) Literacy, race and masculinity 5) Language, ideology and landscapes 6) Language in education policy, planning and management 7) Teaching English to Speakers of Other Languages 8) Teaching African Languages to Speakers of Other Languages 9) New Multilingualism and Multilingual Literacies Submit your abstract for paper or poster presentation of 200-­‐250 words by 1 April 2016 to Matlakala.Moagi@wits.ac.za. Presenters will be notified of acceptance of their proposals by 30 April, 2016.","date_start":"2016-08-12","date_end":"2016-08-14","important_dates":{"abstract":"","full":"2016-04-01","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Johannesburg","South Africa"],"name":"","street":"","city":"Johannesburg","state":"","ZIP":"","country":"South Africa"},"organizers":[""],"societies":[],"indexes":[],"emails":["matlakala.moagi@wits.ac.za"]}