{"name":"The 4th International Congress on Sports Sciences Research and Technology Support","series":"","short":"","website":"http://www.icsports.org","content":"In the XXI century most human activities, including sports, are becoming more and more technological. Engineering in general and Information Technology in particular are becoming an important support for many activities directly or indirectly related to sport sciences, including improvement of physical activities, sports medicine, biotechnology and nutrition, sports management, and all imaginable application areas in sports. This congress intends to be a meeting point of both academics and practitioners, in order to exchange ideas and developed synergies. CONGRESS AREAS Each of these topic areas is expanded below but the sub-topics list is not exhaustive. Papers may address one or more of the listed sub-topics, although authors should not feel limited by them. Unlisted but related sub-topics are also acceptable, provided they fit in one of the following main topic areas: icSPORTS 2016 will be held in conjunction with NEUROTECHNIX 2016\\. icSPORTS KEYNOTE LECTURES icSPORTS 2016 will have several invited keynote speakers, who are internationally recognized experts in their areas. Their names are not yet confirmed. CONGRESS CHAIR Jan Cabri, Norwegian School of Sport Sciences, Norway PROGRAM CHAIR Pedro Pezarat Correia, Faculdade de Motricidade Humana, Universidade de Lisboa, Portugal PROGRAM COMMITTEE www.icsports.org/ProgramCommittee.aspx icSPORTS Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setúbal - Portugal Tel.: +351 265 100 033 Fax: +351 265 520 186 e-mail: icsports.secretariat@insticc.org Web: www.icsports.org","date_start":"2016-11-07","date_end":"2016-11-09","important_dates":{"abstract":"","full":"2016-05-26","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["icsports.secretariat@insticc.org"]}