{"name":"Developing antibiotic alternatives: A discussion of new approaches to overcoming antimicrobial resistance","series":"","short":"","website":"www.lifescienceevents.com/antibiotics2016","content":"This is the FIRST live streamed only, three day professional conference on antibiotic resistance and alternatives. We have gathered together invited speakers from around the world, who you might not otherwise have access to. In the face of rising levels of antibiotic resistance, this live streamed international event will explore alternative strategies to infection control. Meeting description: This event will discuss recent research into the development and spread of antibiotic resistance including its clinical impact, and a range of approaches to tackle this rise. Methods for infection control and monitoring of resistant strains, as well as novel therapeutic intervention strategies to reduce conventional antibiotic use will also be discussed. We encourage questions, discussion and debate and have a relaxed atmosphere which generates maximum interaction online. After registration you will be connected to an online networking site where you will be able to have discussions with all participants of this event, before, during and after the meeting. Who Should Attend: Those with an interest in the rising levels of antibiotic resistance and in strategies aimed at overcoming drug resistance and/or developing new antimicrobial therapies would benefit from ths event. This includes academics, pharmacists, clinicians and pharmaceutical professionals. Deadlines Oral abstract submission deadline September 20th 2016 Early registration deadline September 20th 2016 Poster submissions deadline October 25th 2016 The event will be recorded and available for all registered delegates up to a month after the event. So if you can’t manage all the days, or the different time zones, you can still have access to the full event.","date_start":"2016-11-08","date_end":"2016-11-10","important_dates":{"abstract":"","full":"2016-09-20","notification":"","final":""},"topics":["Life Sciences","Microbiology/ Pathology/ Toxicology","microbiology"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":[""],"societies":[],"indexes":[],"emails":[]}