{"name":"8th International Conference on Bioinformatics Models, Methods and Algorithms – BIOINFORMATICS 2017","series":"","short":"","website":"http://www.bioinformatics.biostec.org","content":"Venue: Porto, Portugal Event Date 21 - 23 February, 2017 Regular Papers Paper Submission: September 29, 2016 Authors Notification: November 23, 2016 Camera Ready and Registration: December 9, 2016 Position Papers Paper Submission: November 8, 2016 Authors Notification: December 14, 2016 Camera Ready and Registration: December 27, 2016 Workshops Workshop Proposal: November 3, 2016 Doctoral Consortium Paper Submission: December 29, 2016 Authors Notification: January 11, 2017 Camera Ready and Registration: January 23, 2017 Special Sessions Special Session Proposal: November 21, 2016 Tutorials, Demos and Panels Proposals: December 27, 2016 Scope: The purpose of the International Conference on Bioinformatics Models, Methods and Algorithms is to bring together researchers and practitioners interested in the application of computational systems, algorithmic concepts and information technologies to address challenging problems in Biomedical research with a particular focus on the emerging problems in Bioinformatics and computational biology. There is a tremendous need to explore how mathematical, statistical and computational models can be used to better understand biological processes and systems, while developing new methodologies and tools to analysis the massive currently-available biological data. Areas of interest to this community include systems biology, sequence analysis, biostatistics, image analysis, network and graph models, scientific data management and data mining, machine learning, pattern recognition, computational evolutionary biology, computational genomics and proteomics, and related areas. BIOINFORMATICS is part of BIOSTEC, the 10th International Joint Conference on Biomedical Engineering Systems and Technologies. Registration to BIOINFORMATICS allows free access to all other BIOSTEC conferences. CONFERENCE TOPICS - Simulation and Modeling - Computational Intelligence - Genomics and Proteomics - Sequence Analysis - Structural Bioinformatics - Structure Prediction - Structural Variations - Image Analysis - Visualization - Databases and Data Management - Data mining and Machine Learning - Biostatistics and Stochastic Models - Pharmaceutical Applications - Systems Biology - Algorithms and Software Tools - Web Services in Bioinformatics - Computational Molecular Systems - Immuno- and Chemo-informatics - Pattern Recognition, Clustering and Classification - Model Design and Evaluation - Transcriptomics - Next Generation Sequencing BIOSTEC KEYNOTE SPEAKER Bart M. ter Haar Romeny, Eindhoven University of Technology, Netherlands BIOSTEC CONFERENCE CO-CHAIRS Ana Fred, Instituto de Telecomunicações / IST, Portugal Hugo Gamboa, LIBPHYS-UNL / FCT - New University of Lisbon, Portugal Mário Vaz, Inegi Lome, Feup, Portugal PROGRAM CHAIR Available soon PROGRAM COMMITTEE http://www.bioinformatics.biostec.org/ProgramCommittee.aspx BIOINFORMATICS Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setúbal - Portugal Tel: +351 265 100 033 Fax: +351 265 520 186 e-mail: bioinformatics.secretariat@insticc.org Web: http://www.bioinformatics.biostec.org/","date_start":"2017-02-21","date_end":"2017-02-23","important_dates":{"abstract":"","full":"2016-09-29","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["bioinformatics.secretariat@insticc.org"]}