{"name":"2016 International Conference on Mechanical, Manufacturing, Modeling and Mechatronics","series":"","short":"","website":"http://www.ic4m.net","content":"Good News: 1, IC4M 2016 will be hosted at University of Malaya, Kuala Lumpur! 2, All accepted papers of IC4M 2016 will be published in Jurnal Teknologi, indexed by Scopus! Keynote Speakers: 1, Prof. Dr. Mohd Hamdi Bin Abd Shuko,University of Malaya, Malaysia 2, Prof. Du Ruxu, The Chinese University of Hong Kong Submission Deadline: Dec. 30, 2015 Submission Method: Authors can submit the full manuscript through electronic submission system through: http://www.easychair.org/conferences/?conf=ic4m2016 . If you have any question, please feel free to contact our conference secretary. Ms. Jennifer Law Tel:+852-30697937 Welcome you to contact us by Email to ic4m@smehk.org. Topics of interest for submission include, but are not limited to: 1, Mechanical Engineering: Automation Engineering Aeronautical Engineering CAD/CAM Integration Technology Computational Mechanics Energy Machinery and Equipment High-speed/precision machining Mechanism and Machine Science Mechanical Power Engineering Material Engineering Robotics 2, Manufacturing Engineering: Precision Manufacturing & Measurement Flexible Manufacturing Technology & System Manufacturing Process Simulation Advanced Manufacturing Technology Sustainable Production Recycling and Remanufacturing Rapid Manufacturing 3, Modeling in Engineering: Modeling and Identification Modeling and Control Theory Modeling Non Functional Properties of Systems Real-Time Simulator, Instrument and Control System Modeling and Simulation Techniques 4, Mechatronics Engineering: Advanced Mechatronics Devices Mechatronics Sensing and Control Bioengineering and Mechatronics Applications in Life Sciences Mechatronics System for Medical/Welfare Technolgies More details of CFP can be found at: http://www.ic4m.net/cfp.html .","date_start":"2016-02-27","date_end":"2016-02-29","important_dates":{"abstract":"","full":"2015-12-30","notification":"","final":""},"topics":["Engineering & Technology","Mechanical/Industrial","mechanical engineering"],"location":{"virtual":"","full":["Kuala Lumpur","Malaysia"],"name":"","street":"","city":"Kuala Lumpur","state":"","ZIP":"","country":"Malaysia"},"organizers":["HKSME"],"societies":[],"indexes":[],"emails":["ic4m@smehk.org"]}