{"name":"7th Biennial Congress in Comparative Literature: FEAR & SAFETY - ENCLS 2017","series":"","short":"","website":"http://encls.net/?q=event/fear-and-safety","content":"7th Biennial congress FEAR AND SAFETY European Network for Comparative Literary Studies (ENCLS) Location: University of Helsinki, Finland Dates of the congress: 23-26 August 2017 Deadline for proposals: 30 September 2016 Proposals are welcome in: English, French, Finnish, Swedish, Sami. In its recent past, Europe has encountered economic depressions, climate change, military interventions, terrorist attacks and the dual rise of aggressive nationalism and the fear of the loss of national identity and autonomy. These times reveal the presence of collective fears concerning economic, political, environmental, and security issues. Simultaneously, in their everyday lives, people deal with a sense of fear that arises on a more individual level: they fear for their own financial future, perhaps for their threatened cultural, gender or sexual identities, and possibly even for their physical safety. In view of this, it is pertinent to ask whether there is a contemporary European mind-set that is obsessed with the idea of safety. By virtue of its etymology, the notion of safety has been associated with salvation and redemption. Such connotations, however, seem to have receded in secular, liberal-capitalist society and have been replaced by the far more protective and restrictive idea of security. How are safe – or secure – environments and societies being imagined and idealised in Europe, and have such imaginings changed over the decades and centuries? This conference calls for contributions dealing with the issues of fear and safety in European literature. Paper topics might include contemporary realist narratives of migration, or the apocalyptic and dystopian narratives currently permeating the entire cultural landscape. Papers on transnational and multicultural issues are welcomed, as are papers focusing on the genre-specific problematics of approaching the themes of fear and safety (e.g. fantasy, thrillers, speculative fiction, children’s literature, literature for young adults). Recent trends in research, such as affect and risk theory, are also pertinent. How do literary presentations create and shape the social, “public”, and possibly collective emotions that frame our experience? How do such representations, usually far more accessible to the public than scientific information, influence the reallife evaluation and selection of risks? What kinds of textual strategies and ways of story-telling are being used to express the affectivities of fear and safety? How are increasingly popular adaptations and multimodal works of art connected to contemporary notions of fear and safety in their ways of (re)telling (past) stories? Confirmed keynote speakers: Dr. Timothy Morton, Rita Shea Guffey Chair in English at Rice University, Texas. His research is multifaceted: it analyses the intersection of food and cultural studies, centers on environmental theory, and has been associated with object-oriented ontology. He is the author of Nothing: Three Inquiries in Buddhism and Critical Theory (Chicago, 2015), Hyperobjects: Philosophy and Ecology after the End of the World (Minnesota, 2013), Realist Magic: Objects, Ontology, Causality (Open Humanities, 2013), The Ecological Thought (Harvard UP, 2010), Ecology without Nature (Harvard, 2007), seven other books and one hundred and twenty essays on philosophy, ecology, literature, food and music. His blog can be found here. Dr. Anne Duprat, translator and professor in Comparative Literature at the University of Picardie Jules Verne. She specialises in the theory of fiction and European studies from the XVIth and XVIIth centuries and directs the collection Imago Mundi (Presses Université Paris-Sorbonne). She contributes regularly to the work of the Center for Research on Travel Writing. She is the author of Vraisemblances. Poétiques de la fiction en France et en Italie (Champion, 2009), and of co-director of Fiction et Cultures (Paris, 2010), Récits d’Orient en Occident (PUPS, 2008) and Histoires et savoirs. Anecdotes scientifiques aux XVIe et XVIIe siècles (2012). For her complete bibliography, click here. Dr. Johan Schimanski, professor of Comparative Literature at the University of Oslo, member of several editorial boards among which those of Fafnir: The Nordic Journal of Science Fiction and Fantasy Research and The Journal of Gender Research. His research areas encompass borders, national identity, postcolonialism, Arctic discourses, Welsh literature, science-fiction, genre theory, literary forgeries and literary museums. He has worked in cooperation with the University of Eastern Finland and the University of Tromsø. He is the author of Passagiere des Eises: Polarhelden und arktische Diskurse 1874 (Boehlau, 2015), co-author of Border Poetics De-limited (Wehrhahn, 2007) and a contributor to Arctic Discourses (2010). The full array of his works can be found online. Send your proposals and questions to: encls2017@gmail.com","date_start":"2017-08-23","date_end":"2017-08-26","important_dates":{"abstract":"","full":"2016-09-30","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","literature"],"location":{"virtual":"","full":["Helsinki","Finland"],"name":"","street":"","city":"Helsinki","state":"","ZIP":"","country":"Finland"},"organizers":["University of Helsinki"],"societies":[],"indexes":[],"emails":["encls2017@gmail.com"]}