{"name":"XXVIIth International Symposium on Cerebral Blood Flow, Metabolism and Function and the XIIth International Conference on Quantification of Brain Function","series":"","short":"","website":"http://brain.kenes.com","content":"Following the tradition of previous meetings, \"Brain 2015\" will cover numerous aspects within the area of neuroscience research, particularly those related to brain function and metabolism, cerebral blood flow, the function of the neurovascular unit and the b​lood-brain barrier, brain imaging, and cerebrovascular pathology. Our goal is to present the state-of-the art and novel discoveries that will increase our understanding of brain function under physiological and pathological conditions, and the most promising investigations in brain protection and neuroregeneration. Leading scientist in these fields, members of the International Society for Cerebral Blood Flow and Metabolism (ISCBFM) and other exceptional scientists will participate as in previous biannual meetings of the ISCBFM. The program committee is actively working to create an engaging scientific program that will be of interest to you. Bordered by the Coast Mountain Range and the Pacific Ocean, Vancouver is recognized as one of the world's most beautiful cities with one of the smallest carbon footprints of any major city in North America.With its diverse and multicultural settings, Vancouver provides an ideal backdrop for ​International exchange. Vancouver with its suburbs is a rapidly growing city of 2.1 million people, with a population originating from more than 60 cultural groups and as many ties to South America and Africa as it has to Europe and Asia. Nestled in spectacular natural settings, with a moderate climate, Vancouver's v​ast array of activities can be enjoyed year round but has an especially spectacular summer, with warm temperatures and low humidity. Leisurely enjoying the city and its surroundings is made easier by its network of pedestrian-friendly streets and shopping areas, accessible beaches and the availability of multiple day-trips to the su​​rrounding mountains. Vancouver will provide the delegates and their families with a wealth of opportunities for discoveries and enjoyment, at the Conference and beyond","date_start":"2015-06-27","date_end":"2015-06-30","important_dates":{"abstract":"","full":"2015-02-04","notification":"","final":""},"topics":["Life Sciences","Neuroscience","neurology & neuroscience"],"location":{"virtual":"","full":["Vancouver","Canada"],"name":"","street":"","city":"Vancouver","state":"","ZIP":"","country":"Canada"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}