{"name":"9th Annual International Conference on Computer Games Multimedia & Allied Technologies","series":"","short":"CGAT 2016","website":"http://www.cgames.com.sg/index.html","content":"Important Dates \\*Extended Full Paper Submission Deadline: 29 January 2016 Early Bird Registration Deadline: 12 February 2016 Late Registration Deadline: 29 February 2016 Conference Dates: 28 - 29 March 2016 2 KEYNOTE SPEAKERS Prof Paul Bourke, University of New South Wales, Australia Prof. Francis C.M. Lau, Hong Kong University, Hong Kong 3 PLENARY SPEAKERS Prof. Hong Shen, University of Adelaide, Australia Assoc. Prof. Cai Jianfei, Nanyang Technological University, Singapore Prof. Harold Thwaites, Sunway University, Malaysia Conference Theme 1\\. Computer Games, Multimedia – A discussion not only about the components and designs (software and hardware) of computer games and multimedia but also on its’ social implications such as censorships and regulations, education, and training. This would also be a platform to gather future trends and visions on multimedia games, strategies and troubleshooting. 2\\. Cloud Computing and Virtualization – Discussions on the value of cloud computing, theoretical and historical analyses and comparisons of different cloud business models and applications. This will also include discussions about the incubation process of IT Virtualization, security and future trends. 3\\. Web Technologies and Internet Applications – Discussions on the emerging and future trends on web technologies and internet applications. Education and training are also one of the key areas to be emphasized on this topic. 4\\. Social Computing and Behavioural Modelling – Discussions on evolution and historical influences of social computing, applications and behavioural modelling and all its implications. Public may also present their opinions on trending topics and case studies. 5\\. Enterprise Resource Planning & Supply Chain Management – Discussions on ERP and Supply Chain Management performance, security, and maintenance. Topics would also include processes and implementations, tactics and strategies to adapt. 6\\. Mobile Communications, Networking and Applications – Discussions on soft components of mobile networking and applications together with its systems, networks, mobile computing and network security. Major innovations and future trends would be one of the most trending topics for this area in which all mobile users can easily relate to. \\*as we have received requests for extension from several authors","date_start":"2016-03-28","date_end":"2016-03-29","important_dates":{"abstract":"","full":"2016-01-29","notification":"","final":""},"topics":["Engineering & Technology","Other","computer graphics, animation, virtual reality & gaming"],"location":{"virtual":"","full":["Singapore","Singapore"],"name":"","street":"","city":"Singapore","state":"","ZIP":"","country":"Singapore"},"organizers":["GSTF"],"societies":[],"indexes":[],"emails":[]}