{"name":"6th International Conference on Operations Research and Enterprise Systems – ICORES 2017","series":"","short":"","website":"http://www.icores.org","content":"Venue: Porto, Portugal Event date: 23 - 25 February, 2017 Regular Papers Paper Submission: October 4, 2016 Authors Notification: November 28, 2016 Camera Ready and Registration: December 13, 2016 Position Papers Paper Submission: November 8, 2016 Authors Notification: December 13, 2016 Camera Ready and Registration: December 30, 2016 Workshops Workshop Proposal: November 7, 2016 Special Sessions Special Session Proposal: November 23, 2016 Tutorials, Demos and Panels Proposals: December 29, 2016 Scope: The purpose of the International Conference on Operations Research and Enterprise Systems (ICORES) is to bring together researchers, engineers and practitioners interested in both advances and applications in the field of operations research. Two simultaneous tracks will be held, covering on one side domain independent methodologies and technologies and on the other side practical work developed in specific application areas. ICORES 2017 will be held in conjunction with ICPRAM 2017 and ICAART 2017\\. Registration to ICORES allows free access to the ICPRAM and ICAART conferences (as a non-speaker). CONFERENCE AREAS: Each of these topic areas is expanded below but the sub-topics list is not exhaustive. Papers may address one or more of the listed sub-topics, although authors should not feel limited by them. Unlisted but related sub-topics are also acceptable, provided they fit in one of the following main topic areas: 1\\. METHODOLOGIES AND TECHNOLOGIES 2\\. APPLICATIONS AREA 1: METHODOLOGIES AND TECHNOLOGIES - Stochastic Processes - Simulation - Optimization - Decision Analysis - Management Sciences - Data Mining and Business Analytics - Information Systems - Industrial Engineering - Forecasting - Dynamic Programming - Linear Programming - Inventory Theory - Queuing Theory - Game Theory - Mathematical Modeling - Predictive Analytics - Stochastic Optimization - Analytics for Enterprise (Engineering) Systems - Systems of Systems/Teams and Socio-technical Systems - Design in ES (e.g., real options for flexible design, etc) - Analytical Architecture in ES AREA 2: APPLICATIONS - Decision Support Systems - Supply Chain Management - Project Management - Scheduling - Network Optimization - Routing - Logistics - Energy and Environment - Automation of Operations - Maintenance - Globalization and Productivity - Resource Allocation - Optimization in Finance - Risk Management - OR in Telecommunications - OR in Health - OR in Transportation - OR in National Defense/International Security - OR in Education - Systems of Systems/Teams and Socio-technical Systems - Engines for Innovation - Analytical Architecture in ES KEYNOTE LECTURES Dries Goossens, Ghent University, Belgium Olivier Hudry, Télécom ParisTech, France José Oliveira, Universidade do Minho, Portugal CONFERENCE CHAIR Marc Demange, School of Mathematical and Geospatial Sciences, RMIT University, Australia PROGRAM CO-CHAIRS Federico Liberatore, Universidad Carlos III de Madrid, Spain Greg H. Parlier, INFORMS, United States LOCAL CHAIR Pedro Nuno Ferreira Pinto Oliveira, Universidade do Porto, Portugal PROGRAM COMMITTEE http://icores.org/ProgramCommittee.aspx ICORES Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setúbal – Portugal Tel: +351 265 520 185 Fax: +351 265 520 186 e-mail: icores.secretariat@insticc.org Web: http://www.icores.org/","date_start":"2017-02-23","date_end":"2017-02-25","important_dates":{"abstract":"","full":"2016-10-04","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["icores.secretariat@insticc.org"]}