{"name":"GSTF ACE - 4th Annual International Conference on Architecture and Civil Engineering","series":"","short":"ACE 2017","website":" http://ace-conference.org","content":"4th Annual International Conference on Architecture and Civil Engineering (ACE 2017) Advances in Architecture and Civil Engineering are the order of the day with the rapid industrialization and urbanization seen in developed and developing nations. Innovative design and construction practices are challenging tasks to the architects and engineers to meet the ever growing demands of society. The conference is the premiere forum for the presentation of new advances and research results in the fields of Architecture and Civil Engineering. The conference will bring together leading researchers, architects, engineers and scientists in this domain of interest from around the world. The themes of the conference are: Infrastructure Design for Regions in Rapid Development Infrastructure Design for New Vertical Cities Infrastructure for new Cities and Landscapes Design for Urban Infrastructure: Parks, Buildings, Streets and Systems Full Paper Submission Deadline: 18 November 2016 Final Paper (Camera-Ready) Submission Deadline: 9 December 2016 Early Bird Registration Deadline: 13 January 2017 Late Registration Deadline: 17 February 2017 Conference Dates: 24 - 25 April 2017 Keynote Speaker: Dr. Tommy Chan Professor of Civil Engineering School of Civil Engineering and Built Environment Science and Engineering Queensland University of Technology, Australia","date_start":"2017-05-08","date_end":"2017-05-09","important_dates":{"abstract":"","full":"2017-03-10","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental","Architecture & Civil Engineering"],"location":{"virtual":"","full":["singapore","Singapore"],"name":"","street":"","city":"singapore","state":"","ZIP":"","country":"Singapore"},"organizers":["Global Science & Technology Forum (GSTF)"],"societies":[],"indexes":[],"emails":[]}