{"name":"7th INTERNATIONAL CONFERENCE OF POLITICAL ECONOMY","series":"","short":"","website":"http://www.icopec.org","content":"ICOPEC 2016 is organized by Batman University Faculty of Economics and Administrative Sciences and Marmara University Faculty of Economics with the cooperation of University of Westminster (UK), Institute for Economic & Social Research of Piedmont (IRES, Italy), Ostrava Technical University (Czech Republic), University of Belgrade (Serbia), GITAM School of International Business (India) and Pontifica Catholic University of Lima \\[Peru\\]. International Political Economy Conference series began with the theme “Adam Smith Today” in 2009, which was followed by “Crisis and Development” in 2010, “Labour Markets and Employment” in 2011\\. “Flexibility” in 2012, ‘Logic’ of Our Age: The Individual and Society in the Market’s Grasp” in 2013, and “New Socioeconomic Perspectives, Social Movements, Actors\" in 2014\\. The main theme of 7th conference is decided as “State, Economic Policy, Taxation, & Development”. However, ICOPEC 2016 will attempt to explain and account for all political economy’s subtopics and different aspects associated with political economy that are mentioned below. 7\\. ICOPEC 2016 will be held in Istanbul on June 28-30, 2016\\. Accepted papers will be published by IJOPEC as an e-book with ISBN “STATE, ECONOMIC POLICY, TAXATION, AND DEVELOPMENT” before conference. Also, after conference, selected papers will be published in an edited international book and peer reviewed journals such as International Journal of Productivity Management and Assessment Technologies (IJPMAT), Journal of Life Economics (JLE), World Journal of Applied Economics (WJAE), and Marmara Üniversitesi İktisadi ve İdari Bilimler Fakültesi Dergisi. The languages of the conference will be both ENGLISH and TURKISH. Abstracts and session proposals should be around 300 words, in Word format and 12 fonts, and include paper title, the name(s) and full address (mail address, affiliated institution, e-mail, phone and fax) of the author(s), the purpose and the method of the work, expected results and suggestions. Papers should be electronically submitted by May 1st, 2016, via e-mail to bilgi@icopec.org or electronically submitted at http://www.icopec.org/submission-form.html Detailed information regarding the conference can be reached at www.icopec.org All abstracts and full papers will subject to a stringent double-blind peer review process. The presentations are expected to cover, but not limited to, the following issues and subtopics and its details can see at http://www.icopec.org/call-for-papers.html • ECONOMIC DEVELOPMENT IN THE CONTEXT OF SOCIAL AND POLITICAL INTERACTIONS • STATE-BUILDING, STATE CAPACITY, INSTITUTIONS, AND ECONOMIC DEVELOPMENT • POLITICAL ECONOMY, ECONOMIC POLICY, AND ECONOMIC DEVELOPMENT • TAXATION, FOREIGN DIRECT INVESTMENT, PORTFOLIO FLOWS, AND ECONOMIC DEVELOPMENT • GLOBALIZATION, INTERNATIONAL INSTITUTIONS, HEGEMONY, AND CONFLICT","date_start":"2016-06-28","date_end":"2016-06-30","important_dates":{"abstract":"","full":"2016-05-01","notification":"","final":""},"topics":["Social Sciences","Political-Science","political science"],"location":{"virtual":"","full":["ISTANBUL","Turkey"],"name":"","street":"","city":"ISTANBUL","state":"","ZIP":"","country":"Turkey"},"organizers":[""],"societies":[],"indexes":[],"emails":["bilgi@icopec.org"]}