{"name":"3rd International Conference on Geographical Information Systems Theory, Applications and Management – GISTAM 2017","series":"","short":"","website":"http://www.gistam.org","content":"Venue: Porto, Portugal Event date: 27 - 28 April, 2017 Regular Papers Paper Submission: November 30, 2016 Authors Notification: February 1, 2017 Camera Ready and Registration: February 15, 2017 Position Papers Paper Submission: January 19, 2017 Authors Notification: February 22, 2017 Camera Ready and Registration: March 8, 2017 Workshops Workshop Proposal: January 12, 2017 Doctoral Consortium Paper Submission: March 1, 2017 Authors Notification: March 14, 2017 Camera Ready and Registration: March 24, 2017 Special Sessions Special Session Proposal: January 30, 2017 Tutorials, Demos and Panels Proposals: March 6, 2017 Open Communicationss Paper Submission: March 1, 2017 Authors Notification: March 14, 2017 Camera Ready and Registration: March 24, 2017 Scope: The International Conference on Geographical Information Systems Theory, Applications and Management aims at creating a meeting point of researchers and practitioners that address new challenges in geo-spatial data sensing, observation, representation, processing, visualization, sharing and managing, in all aspects concerning both information communication and technologies (ICT) as well as management information systems and knowledge-based systems. The conference welcomes original papers of either practical or theoretical nature, presenting research or applications, of specialized or interdisciplinary nature, addressing any aspect of geographic information systems and technologies. CONFERENCE AREAS: Each of these topic areas is expanded below but the sub-topics list is not exhaustive. Papers may address one or more of the listed sub-topics, although authors should not feel limited by them. Unlisted but related sub-topics are also acceptable, provided they fit in one of the following main topic areas: 1\\. DATA ACQUISITION AND PROCESSING 2\\. REMOTE SENSING 3\\. MODELING, REPRESENTATION AND VISUALIZATION 4\\. KNOWLEDGE EXTRACTION AND MANAGEMENT 5\\. DOMAIN APPLICATIONS AREA 1: DATA ACQUISITION AND PROCESSING - Photogrammetry - Natural Phenomena Data Acquisition - Spatio-temporal Data Acquisition - Geospatial Information and Technologies - Seismic Data Processing - Geodesy - Image Processing and Pattern Recognition - Geocomputation - Geospatial Architectures and Middleware - Performance Evaluation - Parallel and Distributed Computation - Real-Time Sensors AREA 2: REMOTE SENSING - Spectroscopy and Spectroradiometry - Hyperspectral Imaging - Earth Observation and Satellite Data - RADAR and LiDAR - Infrared Remote Sensing - Sensor Networks - Urban Remote Sensing - Remote Sensing of Agriculture - Hydrological Remote Sensing - Ocean Topography - Remote Sensing in Climate Change Studies AREA 3: MODELING, REPRESENTATION AND VISUALIZATION - Computational Geometry - Query Processing and Optimization - Cartography and Geodesy - 3D Modeling and Simulation - Computer Graphics Applications - Computer Vision Applications - Human Computer Interaction and Visualization - Spatial Information and Society - Data Sharing, Privacy and Security - Topological Modeling and Analysis - Underground Geo-Reserves Modeling - Spatial Modeling and Reasoning - Standardization and Interoperability - Storage, Indexing and Searching AREA 4: KNOWLEDGE EXTRACTION AND MANAGEMENT - Decision Support Systems - Web Applications - Geographic Information Retrieval - Intelligent Data Fusion - Data Mining and OLAP - GPS and Location Detection - Location-based and Mobile Services - Spatio-Temporal Database Management - Spatial Data Quality and Uncertainty - Spatial Analysis and Integration - Image and Video Understanding - Big Data and GIS AREA 5: DOMAIN APPLICATIONS - Ecological and Environmental Management - Urban and Regional Planning - Crops and Soils Research - Water Information Systems - Energy Information Systems - Coastal Management - Natural Resource Management - Industrial Applications - Disaster Management - Climate Change - Transportation Engineering - Ocean Engineering - Oil Exploration KEYNOTE SPEAKERS GISTAM 2017 will have several invited keynote speakers, who are internationally recognized experts in their areas. Their names are not yet confirmed. CONFERENCE CHAIR Lemonia Ragia, Technical University of Crete, Greece PROGRAM CHAIR Jorge Gustavo Rocha, University of Minho, Portugal HONORARY CHAIR Robert Laurini, INSA, University of Lyon, France PROGRAM COMMITTEE http://www.gistam.org/ProgramCommittee.aspx GISTAM Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setubal – Portugal Tel: +351 265 100 033 Fax: +351 265 520 186 e-mail: gistam.secretariat@insticc.org Web: http://www.gistam.org/","date_start":"2017-04-27","date_end":"2017-04-28","important_dates":{"abstract":"","full":"2016-11-30","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["gistam.secretariat@insticc.org"]}