{"name":"The Future of Ageing, an ILC-UK conference","series":"","short":"","website":"www.futureofageing.org.uk","content":"Dear Colleague, You are invited to attend the second International Longevity Centre – UK (ILC-UK) Future of Ageing conference on Wednesday 9th November 2016 in Westminster, London. Wednesday, 9th November 2016, 09:00 (for a 09:30 start) – 16:30 Central Hall Westminster, Storey's Gate, London, SW1H 9NH We expect over 200 attendees to join us at this year's conference made up of business leaders; charity sector experts; public sector decision makers; local authority staff; academics; and senior journalists. Our first conference, described by one delegate as ‘one of the best conferences I have ever attended’, was held in November 2015\\. The conference assembled experts from the fields of health, housing, finance and business to identify the challenges and opportunities posed by an ageing society. The Future of Ageing 2015 sold out weeks ahead of the event. Last year's speakers included: Baroness Altmann (Minister for Pensions); Professor Sir Mark Walport (Government Chief Scientific Adviser \\[GCSA\\] and Head of the Government Office for Science); Lord Willetts (Executive Chair at Resolution Foundation, and former Minister of State \\[Department for Business, Innovation and Skills\\]); Lord Filkin (Chair of the Centre for Ageing Better and Chair of the House of Lords Committee on Public Service and Demographic Change); Paul Johnson (Director, Institute for Fiscal Studies); Jim Boyd (Director of Corporate Affairs at Partnership) - Jim Boyd stepped in at short notice for Steve Groves who was unwell; Professor Jane Elliott (Chief Executive, Economic and Social Research Council); Steven Baxter (Partner, Hymans Robertson); Professor Ian Philp (Deputy Medical Director for Older People’s Care, Heart of England NHS Foundation Trust) Elaine Draper (Director, Accessibility & Inclusion, Barclays) Mario Ambrosi (Head of Communications and Public Affairs, Anchor) and Baroness Kay Andrews (Member of the House of Lords Built Environment Committee, Former Parliamentary Under-Secretary (Department for Communities and Local Government) 2006-2009) Following the 2016 conference, ILC-UK will collate information presented by the speakers, contributions from industry and policy experts, and data from original research conducted by the ILC-UK into a report that will be published on the ILC-UK website. We are offering early bird rates at present which will increase to the full rate from Monday 1st August. Corporate Rate £235+VAT (Early Bird Rate) £299+VAT (Full Rate) Charity/ Not for Profit/ Uni /Individuals Rate £155+VAT (Early Bird Rate) £210+VAT (Full Rate) If you are a member of the ILC-UK Partners Programme, please contact us at events@ilcuk.org.uk for a Partners Programme Discount Code. For more information about the ILC-UK Partners Programme, or to check if your organisation is a member of the Programme, please click here. If you experience any problems making a booking or payment, please contact Lyndsey Mitchell on 0207 340 0440 or events@ilcuk.org.uk. SPONSORSHIP OPPORTUNITIES We have a number of promotional opportunities available for organisations wishing to be involved in the 2016 Future of Ageing conference: Full Package – to include exclusive sponsorship of the write-up from the conference, a full page advertisement space in the conference programme, company logo on the cover of the conference programme, exhibition space at the conference, free delegate spaces, and more. Advertisement Package – to include a half page advertisement space in the conference programme, exhibition space at the conference and company logo at the front of the conference programme and more. Bursary places for older and younger lay people – sponsorship would cover the travel and attendance of 20 older and younger lay people at the conference, exhibition space, shout outs on the ILC-UK social media platforms and more. Exhibition package – to include exhibition space at the conference, promotional materials in delegate packs, two free delegate spaces and more. We are also happy to work with organisations on bespoke packages. If you would like to discuss sponsorship and the various packages in more detail, please contact Lyndsey Mitchell (lyndseymitchell@ilcuk.org.uk). We look forward to hearing from you. CANCELLATIONS There is a £50 non-refundable charge on all bookings. Cancellations within 14 days of the conference will be charged 50% of the purchased cost. Cancellations within 7 days of the conference are non-refundable. If you wish to transfer your ticket to a colleague, please contact us at events@ilcuk.org.uk.","date_start":"2016-11-09","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Social Sciences","Public-Admin/Planning","Healthcare"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["International Longevity Centre - UK"],"societies":[],"indexes":[],"emails":["events@ilcuk.org.uk","lyndseymitchell@ilcuk.org.uk"]}