{"name":"12th International Conference on Computer Vision Theory and Applications – VISAPP 2017","series":"","short":"","website":"http://www.visapp.visigrapp.org","content":"Venue: Porto, Portugal Event Date 27 February – 1 March, 2017 Regular Papers Paper Submission: September 22, 2016 Authors Notification: November 16, 2016 Camera Ready and Registration: December 5, 2016 Position Papers Paper Submission: November 3, 2016 Authors Notification: December 12, 2016 Camera Ready and Registration: December 22, 2016 Workshops Workshop Proposal: October 28, 2016 Special Sessions Special Session Proposal: November 16, 2016 Tutorials, Demos and Panels Proposals: December 22, 2016 Scope: The International Conference on Computer Vision Theory and Applications aims at becoming a major point of contact between researchers, engineers and practitioners on the area of computer vision application systems. Five simultaneous tracks will be held, covering all different aspects related to computer vision: Image Formation and Preprocessing; Image and Video Analysis and Understanding; Motion, Tracking and Stereo Vision; and Applications and Services. VISAPP is part of VISIGRAPP, the 12th International Joint Conference on Computer Vision, Imaging and Computer Graphics Theory and Applications. Registration to VISAPP allows free access to all other VISIGRAPP conferences. CONFERENCE AREAS: Each of these topic areas is expanded below but the sub-topics list is not exhaustive. Papers may address one or more of the listed sub-topics, although authors should not feel limited by them. Unlisted but related sub-topics are also acceptable, provided they fit in one of the following main topic areas: 1\\. IMAGE FORMATION AND PREPROCESSING 2\\. IMAGE AND VIDEO ANALYSIS 3\\. IMAGE AND VIDEO UNDERSTANDING 4\\. APPLICATIONS AND SERVICES 5\\. MOTION, TRACKING AND STEREO VISION AREA 1: IMAGE FORMATION AND PREPROCESSING - Image Formation, Acquisition Devices and Sensors - Device Calibration, Characterization and Modeling - Image Enhancement and Restoration - Image and Video Coding and Compression - Multimodal and Multi-sensor Models of Image Formation - Image Generation Pipeline: Algorithms and Techniques AREA 2: IMAGE AND VIDEO ANALYSIS - Image Registration - Segmentation and Grouping - Early and Biologically-inspired Vision - Color and Texture Analyses - Shape Representation and Matching - Features Extraction - Visual Attention and Image Saliency AREA 3: IMAGE AND VIDEO UNDERSTANGING - Cognitive Models for Interpretation, Integration and Control - Machine Learning Technologies for Vision - Face and Expression Recognition - Content-based Indexing, Search, and Retrieval - Object and Face Recognition - Object detection and Localization - Categorization and Scene Understanding - Event and Human Activity Recognition - Computational Photography - Near Duplicate Image Retrieval AREA 4: APPLICATIONS AND SERVICES - Entertainment Imaging Applications - Camera Networks and Vision - Document Imaging in Business - Medical Image Applications - Pervasive Smart Cameras - Human and Computer Interaction - Digital Photography - Media Watermarking and Security - Multimedia Forensics - Mobile Imaging - Imaging for Cultural Heritage (Modeling/Simulation, Virtual Restoration) AREA 5: MOTION, TRACKING AND STEREO VISION - Image-based Modeling and 3D Reconstruction - Stereo Vision and Structure from Motion - Active and Robot Vision - Optical Flow and Motion Analyses - Tracking and Visual Navigation - Video Surveillance and Event Detection - Vision for Robotics - Video Stabilization KEYNOTE LECTURES VISAPP 2017 will have several invited keynote speakers, who are internationally recognized experts in their areas. Their names are not yet confirmed. CONFERENCE CHAIR Jose Braz, Escola Superior de Tecnologia de Setúbal, Portugal PROGRAM CO-CHAIRS Francisco Imai, Canon U.S.A. Inc., Innovation Center, United States Alain Tremeau, University of Saint Etienne, France PROGRAM COMMITTEE http://www.visapp.visigrapp.org/ProgramCommittee.aspx VISAPP Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setúbal - Portugal Tel: +351 265 520 184 Fax: +351 265 520 186 e-mail: visapp.secretariat@insticc.org Web: http://www.visapp.visigrapp.org/","date_start":"2017-02-27","date_end":"2017-03-01","important_dates":{"abstract":"","full":"2016-09-22","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["visapp.secretariat@insticc.org"]}