{"name":"OIKONET Third International Conference","series":"","short":"","website":"http://www.uclan.ac.uk/conference_events/global-dwelling-conference.php","content":"This conference will examine the notion of global dwelling through three themes: 1\\. Sustainability of housing environments. 2\\. Innovation in housing design and planning. 3\\. Participation in housing design and construction. We invite researchers, lecturers, design studio instructors, policy makers, practitioners and community leaders, involved in the research, teaching, design and provision of housing, from unit/building to urban and regional scales, to submit original papers and posters addressing one of the conference three themes and considering the following questions: 1\\. What are the challenges facing sustainable housing environments and communities, globally? 2\\. What is the future of public rental housing and its affordability? 3\\. What are the alternatives to gentrification as driver of urban regeneration? 4\\. What are the lessons learned from mass housing renovations? 5\\. What are the standards that should shape future housing? 6\\. What should be changed in current architectural programmes to train architects how to interact with residents during the procurement processes of new housing? 7\\. How can housing communities be mobilised and strategic alliances established in order to foster innovation in housing? 8\\. How can future participatory processes learn from past experiences? 9\\. What does ‘learning to dwell’ mean in our contemporary world?","date_start":"2016-09-23","date_end":"","important_dates":{"abstract":"","full":"2016-02-15","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental","Urban Studies, Planning & Design"],"location":{"virtual":"","full":["Manchester","United Kingdom"],"name":"","street":"","city":"Manchester","state":"","ZIP":"","country":"United Kingdom"},"organizers":["University of Central Lancashire"],"societies":[],"indexes":[],"emails":[]}