{"name":"14th European Conference on Cyber Warfare and Security","series":"","short":"","website":"http://academic-conferences.org/eccws/eccws2015/eccws15-home.htm","content":"The increase in Web services and online operations for various industries and critical businesses has led to an increase in different threats and malicious activities. The security community have witnessed a significant increase in security threats, violations and spread of different types of malware. Recently, there has been an international collaboration to confront a major cybercrime operation behind the spread of GameoverZeus botnet which affected many individuals and businesses worldwide. Therefore, critical industries must keep their operational environment secure and resilient against constantly evolving cyber threats. This is to maintain the safety of workers, industrial assets as well as the communities they serve. Recent advances in the fields of cyber security and technology development are a key factor in the growth of security services and operations. The ECCWS 2015 Conference aims to bring together researchers, practitioners and industrials that are interested in various cyber security aspects. This Conference is expected to attract people from the cyber security community to stimulate interesting discussions about the latest development and technologies. We are pleased to invite you to the 14th ECCWS Conference at the University of Hertfordshire to share your experience and success with us. This Conference is a networking hub for academics, professionals and the cyber security community in general. On Thursday, July 2nd 2015, ECCWS Conf. attendees will have the opportunity to participate in a number of interesting sessions and exciting events.","date_start":"2015-07-02","date_end":"2015-07-03","important_dates":{"abstract":"","full":"2014-12-11","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Cybersecurity & digital forensics"],"location":{"virtual":"","full":["Hatfield","United Kingdom"],"name":"","street":"","city":"Hatfield","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Academic Conferences & Publishing International"],"societies":[],"indexes":[],"emails":[]}