{"name":"Development and Security in a Contemporary Conflict Zones Migration Crisis, Lessons Learned and Future Opportunities","series":"","short":"","website":"http://www.wsmip.uj.edu.pl/en_GB/news-and-events/-/journal_content/56_INSTANCE_LYVlozUo6spu/41658/131845004","content":"The conference will focus on the development-security nexus during and post-conflict in a context of migration crisis in the Europe and the MEAN area and ongoing conflicts in Iraq, Syria, Libya with a reassessment of lessons from earlier interventions in Iraq and Afghanistan. The conferece issues include: a civil-military relations, nationbuilding, peacabuilding and develpopment actions in non-permissive environments. We expect to attract participants with different academic backgrounds and wish to create a space for formal and informal discussion over research on the development-security nexus and relevant policy issues. One of the aims of the accompanying workshop would be to explore the potential for a large bid in this area. Please, submit abstract of a paper covering one or more of following issues: 1) research on development processes during interventions in Iraq and Afghanistan 2) theory and practice of civil-military cooperation in a non-permissive environment 3) nationbuilding and statebuilding in a context of ‘stabilization’ 4) cultural and ethical aspects of development actions and security 5) activities and potential of the Provincial Reconstruction Team model of civilian-military collaboration 6) international organisations and the security-development nexus 7) Development aid NGO’s actors and military in an asymmetric conflict zone 8) security sector perspective over re-construction and development issues 9) private sector, conflict zones economy challenges and development 10) state actors political attitude towards development issues during ‘interventions’ We aim to publish some of the papers for the Conference in the Journal of Development Studies. Accepted papers will be peer-reviewed and enabled for publication in a Special Edition of the JDS. In addition, certain groups of papers may be suitable for publication in other reputed and specialised journals. The word limit and format for papers considered for publication will be as listed in the Conference’s specification (about 9000 words, extended abstract).","date_start":"2016-12-01","date_end":"2016-12-03","important_dates":{"abstract":"","full":"2016-09-15","notification":"","final":""},"topics":["Social Sciences","Political-Science"],"location":{"virtual":"","full":["Kraków","Poland"],"name":"","street":"","city":"Kraków","state":"","ZIP":"","country":"Poland"},"organizers":["IDD University of Birmingham, EADI, IMFES Jagiellonian University"],"societies":[],"indexes":[],"emails":[]}