{"name":"12th International Conference on Evaluation of Novel Approaches to Software Engineering – ENASE 2017","series":"","short":"","website":"http://www.enase.org","content":"Venue: Porto, Portugal Event date: 28 - 29 April, 2017 Regular Papers Paper Submission: November 30, 2016 Authors Notification: February 1, 2017 Camera Ready and Registration: February 15, 2017 Position Papers Paper Submission: January 19, 2017 Authors Notification: February 22, 2017 Camera Ready and Registration: March 8, 2017 Workshops Workshop Proposal: January 12, 2017 Doctoral Consortium Paper Submission: March 1, 2017 Authors Notification: March 14, 2017 Camera Ready and Registration: March 24, 2017 Special Sessions Special Session Proposal: January 30, 2017 Paper Submission: February 13, 2017 Authors Notification: February 27, 2017 Camera Ready and Registration: March 8, 2017 Tutorials, Demos and Panels Proposals: March 6, 2017 Open Communications Paper Submission: March 1, 2017 Authors Notification: March 14, 2017 Camera Ready and Registration: March 24, 2017 Scope: The mission of ENASE (Evaluation of Novel Approaches to Software Engineering) is to be a prime international forum to discuss and publish research findings and IT industry experiences with relation to novel approaches to software engineering. The conference acknowledges evolution in systems and software thinking due to contemporary shifts of computing paradigm to e-services, cloud computing, mobile connectivity, business processes, and societal participation. By publishing the latest research on novel approaches to software engineering and by evaluating them against systems and software quality criteria, ENASE conferences advance knowledge and research in software engineering, including and emphasizing service-oriented, business-process driven, and ubiquitous mobile computing. ENASE aims at identifying most hopeful trends and proposing new directions for consideration by researchers and practitioners involved in large-scale systems and software development, integration, deployment, delivery, maintenance and evolution. CONFERENCE AREAS: Each of these topic areas is expanded below but the sub-topics list is not exhaustive. Papers may address one or more of the listed sub-topics, although authors should not feel limited by them. Unlisted but related sub-topics are also acceptable, provided they fit in one of the following main topic areas: 1\\. SERVICE SCIENCE AND BUSINESS INFORMATION SYSTEMS 2\\. SOFTWARE ENGINEERING AREA 1: SERVICE SCIENCE AND BUSINESS INFORMATION SYSTEMS - Cloud Computing - Business Process Management and Engineering - Data & Process Mining - Collaborative Software Engineering - Delivery, Deployment and Maintenance of Service Systems - Document and Workflow Management - Knowledge Management and Engineering - Software and System Interoperability - Service-Oriented Architectures (SOA) - Service Level Agreements (SLAs) and Quality of Service (QoS) AREA 2: SOFTWARE ENGINEERING - Agile, Aspect-oriented and Agent-oriented Software Engineering - Application Integration Technologies - Architectural Design and Frameworks - Big Data and Software Engineering - Component-based software engineering - Design Thinking - Empirical Software Engineering - Formal Methods - Frameworks and Middleware - Meta Programming Systems and Meta Modeling - Model-driven Engineering - Requirements Engineering - Reverse Software Engineering - Software and System Complexity - Software and Systems Development Methodologies - Software and System Quality Management - Software Change and Configuration Management - Software Metrics - Software Patterns and Refactoring - Software Product Line Engineering - Software Process Improvement - Service-oriented Software Engineering - User-centered Software Engineering KEYNOTE SPEAKERS Paris Avgeriou (University of Groningen, Netherlands). CONFERENCE CHAIR Leszek Maciaszek, Wroclaw University of Economics, Poland and Macquarie University, Sydney, Australia PROGRAM CO-CHAIRS Ernesto Damiani, EBTIC-KUSTAR, United Arab Emirates George Spanoudakis, City University London, United Kingdom PROGRAM COMMITTEE http://www.enase.org/ProgramCommittee.aspx ENASE Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setúbal – Portugal Tel: +351 265 100 033 Fax: +351 265 520 186 e-mail: enase.secretariat@insticc.org Web: http://www.enase.org","date_start":"2017-04-28","date_end":"2017-04-29","important_dates":{"abstract":"","full":"2016-11-30","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["enase.secretariat@insticc.org"]}