{"name":"2017 International Conference on Data Processing and Robotics","series":"","short":"ICDPR 2017","website":"http://www.icdpr.org","content":"2017 International Conference on Data Processing and Robotics (ICDPR 2017)—Ei&Scopus Jan. 13-15, 2017 University of Malaya,Kuala Lumpur,Malaysia Website: http://www.icdpr.org/ ICDPR 2017 aims to cover a wide range of topics in the intersection of Data Processing and Robotics and to provide an effective platform for discussions between the academic and industrial researches and applications. Apart from sessions that will present new research results, tutorials and special sessions will be offered as well. Publishing and Indexing All the papers will be peer reviewed by 2-3 experts. The review result comes out in 20-30 days. If the paper needs revising, the revised copy should be submitted again for peer review. All the accepted papers will be included in the conference proceeding, which will be indexed by Ei Compendex, CPCI, Scopus, IET and other academical databases. Selected papers with great extension will be recommended to publish in international journals. Speakers: Prof. Loo Chu Kiong, University of Malaya, Malaysia Prof. Sameem Binti Abdul Kareem, University of Malaya, Malaysia Prof. Bipin C. Desai, University of Concordia, Canada Prof. Mariusz Giergiel, AGH University of Science and Technology, Poland Papers are invited to submit to ICDPR 2017 in the following (non exclusive) topics（for more topics: http://www.icdpr.org/cfp.html）: Robotics Data Processing Networked and Distributed Intelligent Control Ubiquitous Data Management and Mobile Databases Real Time Supervisory Control Data Privacy and Security Adaptive Control Systems Semi-structured data and XML databases Embedded Systems Data Mining Mobile and Autonomous Systems Web Data Management and Deep Web Space and Underwater Robotics Database Applications and Experiences Entertainment Robotics Temporal, Spatial, and Multimedia databases Agriculture and Field Robotics Database System Internals and Performance Submission: 1\\. Prospective authors are invited to submit full-length, 6-page (max) papers in two-column formats including diagrams and references. Authors can submit their papers as PDF files through the online submission system： http://www.easychair.org/conferences/?conf=icdpr2017 2\\. You can also choose to submit your paper directly to icdpr@apise.org Contact Us Beca Feng (Conference secretariat) email: icdpr@apise.org","date_start":"2017-01-13","date_end":"2017-01-15","important_dates":{"abstract":"","full":"2016-12-10","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Kuala Lumpur","Malaysia"],"name":"","street":"","city":"Kuala Lumpur","state":"","ZIP":"","country":"Malaysia"},"organizers":[""],"societies":[],"indexes":[],"emails":["icdpr@apise.org"]}