{"name":"4th Annual International Conference on Architecture and Civil Engineering","series":"","short":"ACE 2016","website":"http://ace-conference.org/index.html","content":"Important Dates \\*Extended Full Paper Submission Deadline: 12 February 2016 Early Bird Registration Deadline: 26 February 2016 Late Registration Deadline: 18 March 2016 Conference Dates: 25 - 26 April 2016 ACE 2015 provided a forum and opportunity for delegates from 86 individual universities and 28 countries to share their research, practice, and educational initiatives with an international audience. 3 KEYNOTE SPEAKERS Prof. Mark S. T. Anderson, University of California, USA Prof. Koh Chan Ghee, National University of Singapore, Singapore Prof. Stephen Loo, University of Tasmania, Australia 4 PLENARY SPEAKERS Assoc. Prof. Erik L'Heureux, National University of Singapore, Singapore Assoc. Prof. David Chua Kim Huat, National University of Singapore, Singapore Assoc. Prof. Peter Anderson, California College of the Arts, USA Dr. M. Hank Haeusler, University of New South Wales, Australia Conference Theme Advances in Architecture and Civil Engineering are the order of the day with the rapid industrialization and urbanization seen in developed and developing nations. Innovative design and construction practices are challenging tasks to the architects and engineers to meet the ever growing demands of society. The conference is the premiere forum for the presentation of new advances and research results in the fields of Architecture and Civil Engineering. The conference will bring together leading researchers, architects, engineers and scientists in this domain of interest from around the world. The themes of the conference are: Infrastructure Design for Regions in Rapid Development Infrastructure Design for New Vertical Cities Infrastructure for new Cities and Landscapes Design for Urban Infrastructure: Parks, Buildings, Streets and Systems \\*as we have received requests for extension from several authors","date_start":"2016-04-25","date_end":"","important_dates":{"abstract":"","full":"2016-02-12","notification":"","final":""},"topics":["Engineering & Technology","Other","civil engineering"],"location":{"virtual":"","full":["Singapore","Singapore"],"name":"","street":"","city":"Singapore","state":"","ZIP":"","country":"Singapore"},"organizers":["GSTF"],"societies":[],"indexes":[],"emails":[]}