{"name":"The 13th International Conference on Informatics in Control, Automation and Robotics","series":"","short":"","website":"http://www.icinco.org","content":"Scope: The purpose of the 13th International Conference on Informatics in Control, Automation and Robotics (ICINCO) is to bring together researchers, engineers and practitioners interested in the application of informatics to Control, Automation and Robotics. Four simultaneous tracks will be held, covering Intelligent Control Systems, Optimization, Robotics, Automation, Signal Processing, Sensors, Systems Modelling and Control, and Industrial Engineering, Production and Management. Informatics applications are pervasive in many areas of Control, Automation and Robotics; This conference intends to emphasize this connection. ICINCO 2016 will be held in conjunction with SIMULTECH 2016\\. CONFERENCE AREAS: Each of these topic areas is expanded below but the sub-topics list is not exhaustive. Papers may address one or more of the listed sub-topics, although authors should not feel limited by them. Unlisted but related sub-topics are also acceptable, provided they fit in one of the following main topic areas: 1\\. INTELLIGENT CONTROL SYSTEMS AND OPTIMIZATION 2\\. ROBOTICS AND AUTOMATION 3\\. SIGNAL PROCESSING, SENSORS, SYSTEMS MODELLING AND CONTROL 4\\. INDUSTRIAL INFORMATICS KEYNOTE LECTURES Roland Siegwart, ETH Zürich, Switzerland Houria Siguerdidjane, Supélec, France Sethu Vijayakumar, The University of Edinburgh, United Kingdom CONFERENCE CHAIR Kurosh Madani, University of Paris-EST Créteil (UPEC), France PROGRAM CO-CHAIRS Oleg Gusikhin, Ford Research & Adv. Engineering, United States Dimitri Peaucelle, LAAS-CNRS, France PROGRAM COMMITTEE http://www.icinco.org/ProgramCommittee.aspx ICINCO Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setubal - Portugal Tel.: +351 265 520 185 Fax: +351 265 520 186 e-mail: icinco.secretariat@insticc.org URL: http://www.icinco.org/","date_start":"2016-07-29","date_end":"2016-07-31","important_dates":{"abstract":"","full":"2016-03-08","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Lisbon","Portugal"],"name":"","street":"","city":"Lisbon","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["icinco.secretariat@insticc.org"]}