{"name":"International Conference Migration and Diasporas: Emerging Diversities and Development Challenges","series":"","short":"","website":"http://www.ignou.ac.in/userfiles/SOITS%20International%20Conference%20on%20Migration%20and%20Diaspora_edited.pdf","content":"Human mobility and migration is not a recent phenomenon rather it is one of the survival strategies adopted since the dawn of human civilization. Migration is the most important and natural phenomena leading to human progress and development. The International Migration Report (2015) brought out by UNDP underscores the importance of migration and development linkages. It mentions that there are more than 244 million people or 3.3 percent of world's population live outside their country of origin. Most of them are youth population with median age 39 years. Unlike earlier migration, the recent decade has seen growing feminisation of migration. The migration flow cannot be ignored in an interconnected global world considering its impact on the social, economic and political arena. Both migration and its outcome in the form of Diaspora has been a significant policy challenge for the home and host countries. No countries and society stand isolated today. The global movement of individuals, ideas, technology, and culture, has significantly affected the everyday interactions among people. The complex interplay of local and global conditions, including the lobby groups, socio-economic and political conditions of the country, levels of development, technological progress and other institutional development such as financial, educational, social, etc., have also influenced the migration and diaspora policy formation of the host as well as source country. Today, migrant and diaspora communities are seen as a critical component of the development process of a country. Development engagement is constantly mediated through social and cultural identities of the migrant and Diaspora communities. These identities are not only very diverse but are also a space for social, political and ideological contestation There are different challenges faces by different countries with regard to engagement with migrant and diaspora communities. Developing countries face different challenges in the emerging scenario as compared to the developed countries as they encounter with different level of human progress and development. Therefore, today the focus is more sustainability, inclusiveness, diversity and multiculturalism as barometers of development. With the advent of knowledge-based service economy and development of ICT and transportation, the the migrant communities and diasporas often played a very significant role in many countries in the process of transfer of knowledge and skills, being part of innovation and investment. In recent years, we find the policies related to the human and financial capital gaining serious attention. Contrary to the idea of brain drain that dominated the development debate in the 60s and 70s among the scholars and policy-makers of developing countries, migrant and Diaspora communities in the age of internet are seen as human, financial and social capital for the development of their home as well as the host country. Human capital plays an important role and can be effectively transferred across borders with the use of ICT creating opportunities in many sectors such as higher education, training, research, and development, etc. There is evidence of successful diasporic knowledge transfer in many areas such as IT and Healthcare. For example, the Bangalore IT boom in India and the corporate health care is a diasporic venture rooted in the Diasporas in developed countries especially in the USA. Similar is the case of China’s economic progress. The other important areas of recent development are the global and local cultural diversity as a result of multidirectional movement of people and through virtual platforms such as T.V, the Internet, films, etc. The impact of migration and Diaspora on culinary, dress, language, films, and literature has become a fascinating area of inquiry. The recent crisis due to forced migration and refugee adds new dimensions to the migration and Diaspora debate. Forced migration played a very significant role in the formation of Diaspora population. Historically, most of the Diasporas from India, China, Turkey, Africa, etc. are the outcome of forced migration as a result of colonization or conflict. Today the forced migration crisis has been further intensified due to conflicts within and between countries. In this context, this Conference is an attempt to consolidate the research findings related to policies on Diaspora that will provide better insights into the issue. The general objectives and specific objectives are given as below. To get familiar with the recent theoretical and conceptual advancement in understanding the migration and Diaspora issues 2\\. To get familiarity with the interdisciplinary perspectives on the issue Specific Objectives 1\\. To get knowledge and insights on the new dynamics of migration and diasporic movement as global and local spaces through empirical studies. 2\\. To have knowledge on policy challenges arising out of migration and Diaspora movement 3\\. To develop an academic and research network that can help the programmes initiated by the University in the area of Migration and Diaspora There are several countries actively engaged in policies, and there are hardly any efforts to provide a comparative perspective. The Conference will have both conceptual as well as applied areas so as to give a holistic approach to understand the issue Abstract Submission Guidelines All participants are required to submit abstract of about 300 words to diasporaconferenceignou@gmail.com Registration There is no registration fee require for selected participants. Accommodation and local hospitality during conference will be provided to all selected participants. Coordinators: Prof. Nandini Sinha Kapur and Dr. Sadananda Sahoo Important Dates: Last date for Receiving Abstracts 30 November 2016 Communicating about the Selection 10 December 2016 Full Paper 15 February 2017 Date of Conference 22-23 March 2017","date_start":"2017-03-22","date_end":"2017-03-23","important_dates":{"abstract":"","full":"2016-11-30","notification":"","final":""},"topics":["Social Sciences","Sociology"],"location":{"virtual":"","full":["New Delhi","India"],"name":"","street":"","city":"New Delhi","state":"","ZIP":"","country":"India"},"organizers":["IGNOU"],"societies":[],"indexes":[],"emails":["diasporaconferenceignou@gmail.com"]}