{"name":"Colloquium TCeurope 2016","series":"","short":"","website":"http://www.tceurope.org/colloquia","content":"As new products and new product features are released at an ever-faster rate, technical communicators must adapt to stay relevant. In a world where users have become accustomed to the immediacy of a Google search and expect the applications they use to be intuitive and self-explanatory, the days of the traditional user manual or online help system are numbered. The advent of cloud computing and the Software as a Service (SaaS) business model have brought significant upheaval to the software industry in recent years. The adoption of agile methodologies and lean manufacturing processes across a wide range of industries has also significantly changed how products are designed, developed and delivered. With an increasingly educated and demanding consumer market and the widespread availability of online product reviews and comparisons, today’s users spend more time shopping around before they buy than ever before. They are thus far less willing to put up with a poor user experience and are often quick to share their experiences (positive or negative) online. It is therefore more important than ever for companies to focus on the end-to-end customer experience and ensure their customers become proficient with their products as quickly as possible, and that they stay happy for as long as possible. Technical communicators possess an intimate understanding of the product or service they are documenting and are trained to explain how the system works in a language that end users can understand. Technical Communicators are thus well positioned to play a key role in ensuring the success of users, and thus the long-term profitability of organizations. However, to succeed in this new world, they need to think differently about their roles. They need to align themselves with this new customer-centric approach. They must position themselves as “knowledge enablers” and drop attachment to “documentation.” A more closely cooperation with colleagues from marketing, support, training, sales and renewals is desirable, focusing on the success of users in order to be in a position to measure and demonstrate the value technical communication provides in terms of customer-retention, user satisfaction, and bottom-line revenue for organizations. The TCeurope Europe Colloquium 2016 will offer participants the chance to explore and discuss the new tools, methodologies, and skills that technical communicators must acquire and leverage in order to stay relevant and succeed in this challenging environment. We are seeking forward-thinking speakers to lead discussions around the following topics: • Cloud Computing and SaaS and their impact on user assistance delivery • Documentation best practices for lean manufacturing processes • Innovative approaches to multimedia learning • Search engine optimization for documentation • Positioning technical communication as a key contributor to Customer Success • Agile methodologies for documentation and user assistance • Content curation/community management/user-generated content • Business metrics for technical communicators This year’s TCeurope Colloquium will be highly interactive. Proposals should thus focus on exploring the opportunities, challenges and questions that these changes raise for today’s technical communicators, in a way that invites debate. In addition to presenting a short (15-20 minutes) plenary session to introduce their proposed topic, speakers will be invited to lead an interactive follow-up discussion with participants interested in exploring the topic further. If you are interested in speaking at the Colloquium, please complete this form no later than December 30, 2015\\. We will get back to you on or before January 20, 2016.","date_start":"2016-04-15","date_end":"","important_dates":{"abstract":"","full":"2015-12-30","notification":"","final":""},"topics":["Business","Information-Technology"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["ISCAP-IPP"],"societies":[],"indexes":[],"emails":[]}