{"name":"10th International Conference on Health Informatics – HEALTHINF 2017","series":"","short":"","website":"http://www.healthinf.biostec.org","content":"Venue: Porto, Portugal Event Date 21 - 23 February, 2017 Regular Papers Paper Submission: September 29, 2016 Authors Notification: November 23, 2016 Camera Ready and Registration: December 9, 2016 Position Papers Paper Submission: November 8, 2016 Authors Notification: December 14, 2016 Camera Ready and Registration: December 27, 2016 Workshops Workshop Proposal: November 3, 2016 Doctoral Consortium Paper Submission: December 29, 2016 Authors Notification: January 11, 2017 Camera Ready and Registration: January 23, 2017 Special Sessions Special Session Proposal: November 21, 2016 Paper Submission: December 6, 2016 Authors Notification: December 21, 2016 Camera Ready and Registration: December 29, 2016 Tutorials, Demos and Panels Proposals: December 27, 2016 Scope: The purpose of the International Conference on Health Informatics is to bring together researchers and practitioners interested in the application of information and communication technologies (ICT) to healthcare and medicine in general and to the support of persons with special needs in particular. Databases, networking, graphical interfaces, data mining, machine learning, intelligent decision support systems and specialized programming languages are just a few of the technologies and research areas currently contributing to medical informatics. Mobility and ubiquity in healthcare systems, physiological and behavioral modeling, standardization of technologies and procedures, certification, privacy and security are some of the issues that medical informatics professionals and the ICT industry and research community in general are addressing in order to further promote ICT in healthcare. In the case of medical rehabilitation and assistive technology, research in and applications of ICT have contributed greatly to the enhancement of quality of life and full integration of all citizens into society. HEALTHINF is part of BIOSTEC, the 10th International Joint Conference on Biomedical Engineering Systems and Technologies. Registration to HEALTHINF allows free access to all other BIOSTEC conferences. CONFERENCE TOPICS - Data Mining - Knowledge Management - Decision Support Systems - Interoperability - Telemedicine - Medical and Nursing Informatics - Confidentiality and Data Security - Wearable Health Informatics - Semantic Interoperability - Therapeutic Systems and Technologies - Physiological Modeling - Databases and Datawarehousing - Cognitive Informatics - Affective Computing - Human-machine Interfaces for Disabled Persons - ICT, Ageing and Disability - Design and Development of Methodologies for Healthcare IT - Mobile Technologies for Healthcare Applications - Evaluation and Use of Healthcare IT - Healthcare Management Systems - E-Health - Development of Assistive Technology - Electronic Health Records and Standards - Software Systems in Medicine - Pervasive Health Systems and Services - e-Health for Public Health - Clinical Problems and Applications - Data Visualization - Pattern recognition and Machine Learning - Practice-based Research Methods for Healthcare IT BIOSTEC KEYNOTE SPEAKER Bart M. ter Haar Romeny, Eindhoven University of Technology, Netherlands BIOSTEC CONFERENCE CO-CHAIRS Ana Fred, Instituto de Telecomunicações / IST, Portugal Hugo Gamboa, LIBPHYS-UNL / FCT - New University of Lisbon, Portugal Mário Vaz, Inegi Lome, Feup, Portugal PROGRAM CHAIR Egon L. van den Broek, University of Twente / Radboud UMC Nijmegen, Netherlands PROGRAM COMMITTEE http://www.healthinf.biostec.org/ProgramCommittee.aspx HEALTHINF Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setúbal - Portugal Tel: +351 265 100 033 Fax: +351 265 520 186 e-mail: healthinf.secretariat@insticc.org Web: http://www.healthinf.biostec.org/","date_start":"2017-02-21","date_end":"2017-02-23","important_dates":{"abstract":"","full":"2016-09-29","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["healthinf.secretariat@insticc.org"]}