{"name":"The 13th International Joint Conference on e-Business and Telecommunications","series":"","short":"","website":"http://www.icete.org","content":"Conference name: The 13th International Joint Conference on e-Business and Telecommunications – ICETE 2016 Venue: Lisbon, Portugal Event Date 26-28 July, 2016 Regular Papers Paper Submission: March 1, 2016 Authors Notification: May 18, 2016 Camera Ready and Registration: June 2, 2016 Position Papers Paper Submission: April 13, 2016 Authors Notification: May 18, 2016 Camera Ready and Registration: June 2, 2016 Workshops Workshop Proposal: February 19, 2016 Doctoral Consortium Paper Submission: May 20, 2016 Authors Notification: May 30, 2016 Camera Ready and Registration: June 9, 2016 Special Sessions Special Session Proposal: March 1, 2016 Tutorials, Demos and Panels Proposals March 31, 2016 Scope: ICETE 2016 is a joint conference aimed at bringing together researchers, engineers and practitioners interested on information and communication technologies, including data communication networking, e-business, optical communication systems, security and cryptography, signal processing and multimedia applications, and wireless networks and information systems. These are the main knowledge areas that define the six component conferences, namely: DCNET, ICE-B, OPTICS, SECRYPT, SIGMAP, and WINSYS, which together form the ICETE joint conference: The 7th International Conference on Data Communication Networking – DCNET 2016 Url: http://www.dcnet.icete.org/ The 13th International Conference on e-Business – ICE-B 2016 Url: http://www.ice-b.icete.org/ The 7th International Conference on Optical Communication Systems – OPTICS 2016 Url: http://www.optics.icete.org/ The 13th International Conference on Security and Cryptography – SECRYPT 2016 Url: http://www.secrypt.icete.org/ The 13th International Conference on Signal Processing and Multimedia Applications – SIGMAP 2016 Url: http://www.sigmap.icete.org/ The 13th International Conference on Wireless Networks and Mobile Systems – WINSYS 2016 Url: http://www.winsys.icete.org/ ICETE 2016 will be held in conjunction with PECCS 2016 and PhyCS 2016\\. ICETE KEYNOTE LECTURES Hamid Aghvami, King's College London, United Kingdom Giuseppe Bianchi, University of Roma Tor Vergata, Italy Anastasios Economides, University of Macedonia, Greece Erina Ferro, CNR-ISTI, Italy Mateo Valero, Universidad Politecnica de Catalunya, Spain ICETE CONFERENCE CHAIR Mohammad S. Obaidat, Fordham University, United States ICETE Secretariat Address: Av. D. Manuel I, 27A, 2º esq. 2910-595 Setúbal - Portugal Tel.: +351 265 520 185 Fax: +351 265 520 186 e-mail: icete.secretariat@insticc.org Web: http://www.icete.org/","date_start":"2016-07-26","date_end":"2016-07-28","important_dates":{"abstract":"","full":"2016-03-01","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Telecommunications"],"location":{"virtual":"","full":["Lisbon","Portugal"],"name":"","street":"","city":"Lisbon","state":"","ZIP":"","country":"Portugal"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["icete.secretariat@insticc.org"]}