{"name":"SAASE 2018 : 2018 2nd International Symposium on Aviation and Aerospace System Engineering","series":"","short":"","website":"http://www.saase.org","content":"2018 2nd International Symposium on Aviation and Aerospace System Engineering (SAASE 2018) May 10, 2018 - May 13, 2018/Wuhan, China Web:http://www.saase.org/ Welcome to the official website of 2018 2nd International Symposium on Aviation and Aerospace System Engineering (SAASE 2018). SAASE 2018 is organized by China University of Geosciences (Wuhan) and Hong Kong Society of Mechanical Engineers( HKSME). The conference will be held in Wuhan, China, from 10-13, May, 2018!The conference is an international symposium for the presentation of technological advances and research results in the fields of Aviation and Aerospace System Engineering. The conference will bring together leading researchers, engineers and scientists in the domain of interest from around the world. We warmly welcome prospected authors submit your new research papers to SAASE 2018, and share the valuable experiences with the scientist and scholars around the world. ●Publication and Indexing 1.All submissions will be peer reviewed by 2-3 reviewers. All the registered and presented papers will be published in the conference proceeding of SAASE 2018\\. which will be indexed by EI Compendex, Scopus, Thomson Reuters (WoS), Inspec, and other indexing organizations. \\*All registered and presented papers will be online publishing. 2.Selected papers with great extension will be recommended to publish in international journals. 3.Selected papers with extension can be recommended to publish in International Journal of Mechanical and Aeronautical Engineering (IJMAE). ●SAASE 2017 Confirmed Speakers Prof. Peter X. Liu \\[Biography\\]Carleton University, Canada Prof. Xin Zhang (biography)Hong Kong University of Science and Technology, Hong Kong ●The topics of inetest are included below, but not limited to : Adaptive control Ionospheric Techniques Advanced modulation theory Aerodynamics & Flight Mechanics Meteorological Radar Aeronautical engineering MIMO radar moving target detection Aerospace & electronics systems Modeling & Simulation Aircraft Navigation MTI radar Antennas Multi-spacecraft imaging systems ●Paper Submission 1.You can also choose to submit your paper directly to:saase@smehk.org 2.You can submit your full paper through electronic submission system:https://cmt3.research.microsoft.com/SAASE2018 ●CONTACT US Ms. Young Yang Email:saase@smehk.org Tel:+852-30697937","date_start":"2018-05-10","date_end":"2018-05-13","important_dates":{"abstract":"","full":"2018-04-10","notification":"","final":""},"topics":["Engineering & Technology","Other"],"location":{"virtual":"","full":["Wuhan","China"],"name":"","street":"","city":"Wuhan","state":"","ZIP":"","country":"China"},"organizers":[""],"societies":[],"indexes":[],"emails":["saase@smehk.org"]}