{"name":"Building Legal Strategies Against Sex Offenses","series":"","short":"","website":"http://glctvpm.com/pages/contact.shtml","content":"Against the background of mounting sexual violence against women and children, there is urgent public demand in Kerala for strong and effective legal action against sex offences. The Government of Kerala has announced its intention to establish India’s first public registry of sex offenders, following the US and Ireland model. The workability of a US/Ireland model registry in Kerala needs to be carefully considered in light of US and Ireland experience. Beyond the registry, a more comprehensive legal strategy needs to be developed for strong and effective legal action against sex offences in the Kerala context, covering social and community-based action, state services and criminal justice reforms in light of the Verma committee recommendations. To address this major legal policy challenge, the 142-year-old Government Law College, Thiruvananthapuram, is holding a public consultation on “Building Legal Strategies Against Sex Offenses” on Friday, August 4, 2017, in Thiruvananthapuram, Kerala. The public consultation will bring together national, International and Kerala experts from law and other disciplines, officials, civil society activists, policy makers and media to review and debate a set of specific policy proposals for legal reform. The draft strategies will also be posted for public comment on-line. The tentative program for the public consultation is attached. After incorporating suggestions received, the strategies will be finalized and presented to the Government of Kerala for its consideration. The strategies will also be widely circulated at the national level. The outcome will be shared with the Kerala law reform agencies, the Law Commission of India, the members of the legislative assembly in Kerala and members of the national Parliament from Kerala. In addition, the findings will be shared with major women’s organizations, human rights organizations and bar associations in Kerala and elsewhere in the country.","date_start":"2017-08-04","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Law/Legal-Studies","gender studies (and womens)"],"location":{"virtual":"","full":["Thiruvananthapuram","India"],"name":"","street":"","city":"Thiruvananthapuram","state":"","ZIP":"","country":"India"},"organizers":["Government Law College, Thiruvananthapuram"],"societies":[],"indexes":[],"emails":[]}