{"name":"13th International Conference: “Challenges of Europe: Growth, Competitiveness, Innovation and Well-being”","series":"","short":"","website":"http://conference.efst.hr","content":"On behalf of the Faculty of Economics, Business and Tourism Split, we are very excited to invite you join us in beautiful Bol (Island Brač), Croatia, for the 13th International Conference: “Challenges of Europe: Growth, Competitiveness, Innovation and Well-being” (22-24, May 2019). Ever since its beginning the Conference has been trying to tackle relevant economics issues. The 2019 Conference aims particularly to study different business and economic challenges important not only for the European but also for the global economy as a whole. We would like to inform you that our keynote speakers will be: • Erik Maskin (Nobel laureate, 2007), • Oliver Hart (Nobel laureate, 2016), • Olivier Blanchard (Peterson Institute for International Economics), • Edward Glaeser (Harvard University), • Koen Pauwels (Northeastern University) • Sergei Guriev (EBRD’s Chief Economist). • Please take into consideration that there are several different possibilities for participation with: REFEREED PAPERS (R-TYPE), PAPERS IN PROGRESS (S-TYPE), PAPERS FOR THE PHD WORSHOP (P-TYPE), YOUNG PARTICIPANT PAPERS (Y-TYPE) and SPECIAL SESSION PAPERS (X- TYPE). • In addition, several special events will be organised such as: Meet the Professors, Meet the Editors, Advice for young researchers and a PhD workshop. Thus, this is an exceptional opportunity to understand what people are working on in more detail, build up networks and improve your presentation skills. Participants will also benefit from plenary and other sessions in which keynote speakers and senior economists will present their most recent contributions. One of the aims of the conference is to encourage international exposure of the research presented at the venue by providing an opportunity to offer research papers for publication in various refereed publication channels. Thus, selected papers will be considered for publication in Journals Indexed/abstracted in: Current Contents – Social & Behavioral Sciences, Social Sciences Citation Index, Journal Citation Reports (Thomson Reuters), IBSS – International Bibliography of the Social Sciences (LSE); Scopus (Elsevier), ProQuest LLC., EBSCO Publishing bibliographic and research databases. Also, papers fulfilling the reviewers’ standards will have an opportunity to be published in the Conference proceedings and later on published through the EBSCO, Scopus and ProQuest ABI Inform publishing systems. Taking into consideration that the conference will investigate all the challenging issues related to the general topic, please note that you have the opportunity to submit your paper and be a part of our Conference. All information can be found in the attached Call for papers or at our web site http://conference.efst.hr/ Please feel free to share this information with anyone that might be interested. Best regards, Professor Ivan Pavic, Programme Committee Chair Assistant Professor, Vinko Muštra, Organising Committee Chair","date_start":"2019-05-22","date_end":"2019-05-24","important_dates":{"abstract":"","full":"2019-02-04","notification":"","final":""},"topics":["Business","Managerial Economics","Economics & econometrics"],"location":{"virtual":"","full":["Bol","Croatia"],"name":"","street":"","city":"Bol","state":"","ZIP":"","country":"Croatia"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}