{"name":"16th International Conference on Environmental Science and Technology","series":"","short":"","website":"https://cest2019.gnest.org","content":"The 16th International Conference on Environmental Science and Technology will be held in the island of Rhodes, Greece from 4 to 7 September 2019\\. CEST biennial series has become one of the worldwide leading environmental events gathering experts, scientists, entrepreneurs as well as representatives of public administration and social initiatives presenting state-of-the-art research and addressing emerging environmental issues. A selection of topics for which the Scientific and Programme Committee is particularly seeking contributions can be found https://cest2019.gnest.org/thematic-areas-and-topics. The previous event, CEST2017, was the most successful event since the series was initially launched in 1989, with 460 participants from 75 countries originating from 6 continents (Europe, Asia, Africa, North America, South America and Australia). The programme included 415 oral and 253 poster presentations from 25 unique research areas. Participants also benefited from the interaction with 15 distinguished scientists that were invited and delivered keynote and plenary talks. CEST2019, coincides with the celebration of the 30 years anniversary (1989-2019) of CEST series and we are aiming to make it a memorable event. All the papers that are selected for either oral or poster presentation undergo a review process. As a result of the improving quality of the papers in previous conferences, their proceedings have been included in databases, such as Science Citation Index (ISI) and SRCosmos. Since 2015, the papers that are presented in CEST, are submitted to cooperating journals for review and publication in special issues. The conference is organized by the University of the Aegean (Greece) together with the South Aegean Region and is supported by the University of Salerno (Italy) and the Imperial College London (UK). The main organizer is the multi-disciplinary Global NEST (Network of Environmental Science and Technology); an international scientific movement that has been successfully developing for the last 29 years with members from more than 60 countries. Global NEST is an international scientific movement focusing on innovative environmental issues. The official language of CEST2019 is English. More info as well as registration and submission of paper are available at http://cest.gnest.org. The full paper submission deadline is the 12th December 2018.","date_start":"2019-09-04","date_end":"2019-09-07","important_dates":{"abstract":"","full":"2018-12-12","notification":"","final":""},"topics":["Life Sciences","Ecology","environmental science & ecology"],"location":{"virtual":"","full":["Rhodes Island","Greece"],"name":"","street":"","city":"Rhodes Island","state":"","ZIP":"","country":"Greece"},"organizers":["Waste Management Laboratory, Department of Environment, University of the Aegean"],"societies":[],"indexes":[],"emails":[]}