{"name":"2nd International Conference Europe Middle East & North Africa Information Systems and Technologies to support Learning +212662583442","series":"","short":"","website":"www.emena.org","content":"2nd International Conference Europe Middle East & North Africa Information Systems and Technologies to support Learning (EMENA-ISTL) 2018 To be held from 25 to 27 October 2018 in Fez, Morocco http://www.emena.org/ Call for Papers We'd like to invite you to submit your papers/posters/demo proposals for the 2nd edition of Europe Middle East & North Africa Information Systems and Technologies to support Learning (EMENA-ISTL) 2018 to be held from 25-27 October 2018 in Fez, Morocco. EMENA-ISTL 2018 attracts researchers, scientists, PhD students, and technologists from some of the top companies, universities, research firms and government agencies from around the world. Each paper will be reviewed by at least three regular PC members or two senior PC members. The acceptance decisions will take into account paper novelty, technical depth, elegance, practical or theoretic impact, and presentation. The conference program will include paper presentations, poster sessions and project demonstrations, along with prominent keynote speakers and industrial workshops. The venue city Fez (فاس) (French: \"Fès\") is one of the imperial cities of Morocco. It is famous for being home to the world's oldest university, the Qarawiyyin university (established in 859). It has an ancient walled city, which many compare to the walled city of Jerusalem. Topics: Original papers are solicited in, but are not limited to, the following topics: A) Information systems Technologies to support Education; B) Education in Science, Technology, Engineering and Mathematics; C) Emerging Technologies in Education Learning innovation in digital age D) Software Systems, Architectures, Applications and Tools; E) Multimedia Systems and Applications; F) Computer Communications and Networks; G) IOT, Smart Cities and People, Wireless, Sensor and Ad-Hoc Networks; H) Organizational Models and Information Systems and Technologies; ; I) Human-Computer Interaction; J) Computers & Security, Ethics and Data-forensic; K) Health Informatics,and Medical Informatics Security; L) Information and Knowledge Management; M) Big Data Analytics and Applications, Intelligent Data Systems, and Machine Learning; N) Artificial Intelligence, High Performance Computing, O) Mobile,Embedded and Ubiquitous Systems; P) Language and Image Processing,, Computer Graphics and vision; Q) Interdisciplinary Field of Fuzzy Logic and Data Mining; Important Dates: Paper Submission Due : 31 May 2018 Acceptance Notification : 30 June 2018 Author Registration : 15 July 2018 Camera Ready Submission : 30 July 2018 Conference Dates : 25-27 October 2018 Complete details are available on the conference website : www.emena.org Proceedings & Publication EMENA-ISTL 2018 papers will be will be published in Springer series \" Smart Innovation, Systems and Technologies book series \" and submitted for indexing to ISI Proceedings, EI-Compendex, DBLP, SCOPUS, Google Scholar and Springerlink. Best selected papers will be published in SCI/Scopus among others-indexed journals Looking forward to your submissions.","date_start":"2018-10-25","date_end":"2018-10-27","important_dates":{"abstract":"","full":"2018-06-30","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Information technology systems (IT)"],"location":{"virtual":"","full":["Fez","Morocco"],"name":"","street":"","city":"Fez","state":"","ZIP":"","country":"Morocco"},"organizers":["Private University of Fes"],"societies":[],"indexes":[],"emails":[]}