{"name":"“Nonviolence and Intercultural Dialogue” International Conference","series":"","short":"","website":"http://violence.society.lcir.co.uk","content":"“We may never be strong enough to be entirely nonviolent in thought, word and deed, but we must keep nonviolence as our goal and make strong progress towards it” – Mohandas (Mahatma) Gandhi The principle of nonviolence, also known as nonviolent resistance, rejects the use of physical violence to achieve social or political change. History shows that the success of peaceful social transformation depends largely on individuals who are charismatic, knowledgeable, skilled in the strategies and methods of nonviolence (Tolstoy, Gandhi, King, Chavez, Walesa, Dalai Lama, Louise Patterson, Menchu and others). Gene Sharp coined the term revolutionary nonviolence in the 20th century and transformed the meaning of the nonviolence from the passive to an active agent as a framework for creating peace. This conference seeks to explore, analyse and discuss the complex concept of nonviolence as a strategy toward peace and progress. It will apply an interdisciplinary approach to various manifestations of nonviolence and will also act as an academic space to explore solutions for creating peace. Conference presentations will be related, but not limited, to: Theories of nonviolence History of nonviolence Nonviolence and religion Nonviolence and philosophy Nonviolence and peace studies Nonviolence and literature Nonviolence and media Nonviolence and art Nonviolence and culture Nonviolence and activism Nonviolence and politics Icons of nonviolence Teaching nonviolence The conference will bring together scholars from different fields including philosophy, religion, sociology, international relations, history, literature, art, peace studies, cultural studies, political studies and others. Submissions may propose various formats, including: \\*Individually submitted papers (organised into panels by committee) \\* Panels (3-4 individual papers) \\* Roundtable discussions (led by one of the presenters) \\* Posters Proposals up to 250 words and a brief biographical note should be sent by 1 February, 2019 to: violence.society@lcir.co.uk. Download Paper proposal form from the official event page: http://violence.society.lcir.co.uk/. Standard registration fee – 220 GBP Student registration fee – 180 GBP Provisional conference venue: Birkbeck, University of London, Bloomsbury, London, WC1E 7HX, UK","date_start":"2019-06-08","date_end":"2019-06-09","important_dates":{"abstract":"","full":"2019-06-08","notification":"","final":""},"topics":["Social Sciences","Sociology","humanitarian aid & peace"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["violence.society@lcir.co.uk"]}