{"name":"Invitation and Call for Papers 12th South-Eastern European Economic Research Workshop organized by the Bank of Albania","series":"","short":"","website":"https://www.bankofalbania.org","content":"Invitation and Call for Papers 12th South-Eastern European Economic Research Workshop organized by the Bank of Albania The Bank of Albania has the pleasure to announce its 12th SEE Economic Research Workshop, to be hosted on 6 and 7 December 2018 in Tirana, Albania. The main target of the workshop is to bring together central bankers, academic community and market practitioners from the SEE region and around the world to present and discuss latest empiric research in the fields of economics and finance. The workshop is intended to provide a forum for discussing innovative research, to foster exchanges of views between researchers and policymakers in the region and beyond, and to develop long-term collaborative relationships. Suggested topics In line with our tradition, the workshop is open to multidisciplinary research and welcomes theoretical and empirical contributions on central bank relevant topics, among others: · Euroization, exchange rate developments and their implications for price and financial stability; · Theoretical and empirical aspects of monetary policy and macro prudential policy; · Financial innovation, dynamics and uncertainty implications for monetary policy and banking supervision; · Macroeconomic models for policy analysis and forecasts; · Global capital flows, finance and firm stability; · Labor market, productivity and real wages after financial crisis. · Risk analysis and risk management tools in financial sector. However, the workshop is not limited to the topics listed above, and submissions on other related topics are also welcome. Please note that it is also possible to attend the workshop without presenting a paper. Submissions Authors are welcome to submit extended abstracts (300–500 words including the title, keywords, JEL classification, authors’ names and affiliation) or, preferably, full drafts of papers as well as a short bio, by 30 September 2018 to BoAresearchworkshop@bankofalbania.org. Please indicate in your submission whether you would like to act as a discussant of another paper. Submitted papers will be reviewed by a Selection Committee, and authors of accepted papers will be notified by 12 October 2018\\. Final papers and the PowerPoint Presentations should be sent no later than November 15, 2018 to BoAresearchworkshop@bankofalbania.org. Workshop Schedule Information The Workshop will comprise academic presentations, keynote speeches and discussions. Papers exploring similar topics will be grouped together and presented during separate sessions. For each paper, time will be allocated to and split between the presentation of the paper by the author/s (in PowerPoint format), the presentation of the respective discussion by another pre-selected researcher, and a panel discussion. Participants will be given a final schedule of the Workshop after the collection of the papers. Expenses Please note that there is no fee for registration/participation. Participants from central banks and other public institutions will need to cover their own expenses. The Bank of Albania will be happy to cover accommodation costs for a limited number of accepted authors, who are in the final stages of their PhD studies. Coffee breaks and two lunches will be covered by the Bank of Albania. A social program will be also organized on the occasion of this event.","date_start":"2018-12-06","date_end":"2018-12-07","important_dates":{"abstract":"","full":"2018-09-30","notification":"","final":""},"topics":["Business","Finance","Banking finance fintech and regulations financial"],"location":{"virtual":"","full":["tirana","Albania"],"name":"","street":"","city":"tirana","state":"","ZIP":"","country":"Albania"},"organizers":[""],"societies":[],"indexes":[],"emails":["boaresearchworkshop@bankofalbania.org"]}