{"name":"4th International Conference on Computing Sciences ICCS-2018-(Feynman 100)","series":"","short":"","website":"http://conferences.lpu.in/iccs/index.php ","content":"4th International Conference on Computing Sciences ICCS-2018-(Feynman 100) Lovely Professional University, India | August 30-31, 2018 As the world celebrates Feynman’s first birth centenary, Lovely Professional University (India) pay the homage to this great Physicist by hosting “FEYNMAN100” – 4th International Conference on Computing Sciences. The conference aims to bring together researchers, scientists, industry personnel, research scholars, and students pan India and from across the globe. Call For Papers: Multidimensional System Architecture Software Engineering and Automation intelligent Systems Data Science and Engineering Networks and data Communication Internet of Things Cyber Security and Data Privacy Control and Embedded Systems Applied Mathematical Physic and Statistics Technology Innovation in Education and Business Conference Committees & Keynote / Plenary Speakers 1\\. Oge Marques Professor and ACM Distinguished Speaker Department of Computer and Electrical Engineering and Computer Science Florida Atlantic University, USA 2\\. Richard Hill Professor and Head Department for Computer Science Huddersfield University, UK 3\\. Valentina E. Balas Associate Professor Faculty of Engineering Aurel Vlaicu University of Arad, Romania Papers were published in one of the following journals • Far East Journal of Electronics and Communications • International Journal of Information Security and Privacy • International Journal of Mobile Computing and Multimedia Communications • International Journal of Decision Support System Technology • International Journal of Healthcare Information Systems and Informatics Important Dates Submission Deadline: June 30, 2018 Registration Deadline: July 31, 2018 Conference Dates: August 30 -31, 2018 Conference Website http://conferences.lpu.in/iccs/index.php","date_start":"2018-08-30","date_end":"2018-08-31","important_dates":{"abstract":"","full":"2018-06-30","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Online Event","India"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"India"},"organizers":["LPU"],"societies":[],"indexes":[],"emails":[]}