{"name":"Chief Learning Officer Forum, Fall","series":"","short":"","website":"https://go.evvnt.com/231473-2?pid=4868","content":"The Premier Meeting Place for the Executive LandD Community\n\nThe CLO Forum Fall is North America's leading learning and development conference for Chief Learning Officers, Chief Diversity Officers, Chief HR Officers, Organizational Leadership and Employee Engagement Executives across the learning and development landscape.\n\nBased off of the success of our 2017 event, CLO Forum Fall 2018 will bring together the best of the best in the LandD industry. 83% of our attendees are Director-level or above and we handpick our senior level speakers from a number of different industries. Every aspect of the event is designed to facilitate networking and our sessions are offered in different formats to peak your interests and help you tackle specific issues that are directly related to your role.\n\nWhy Invest your time at CLO Fall?\n\nTHE BEST OF THE BEST - 83% of our attendees are Director-level or above, meaning you will be discussing with the people making decisions and setting strategies in companies from 30+ Industries. \nWORLD CLASS SPEAKERS -We provide a unique blend of handpicked speakers from multiple industries including; Healthcare, Pharmaceutical, Airlines, Hospitality, Retail and the Public Sector. \nNETWORK - Every aspect of the event is designed to facilitate networking opportunities and conversations between our speakers, panelists, and fellow attendees. With over 8 hours of free networking time, CLO Forum Fall has unrivalled opportunity to pick the brains of your fellow LandD professionals and make lasting business connections. \nLEARN and SHARE - Our keynote presentations, panels and Discussion Groups are created with your immediate needs in mind. Our goal is for you to walk away having learned new strategies and tactics that you can apply to your company the minute you return. We offer a variety of session formats to peak your interests and help you tackle specific issues within LandD\n\n**URLs:** \nBooking: <https://go.evvnt.com/231473-0?pid=4868> \nTwitter: <https://go.evvnt.com/231473-3?pid=4868> \n\n**Prices:** \nLandD Professional - Full Price (Discounts Available) : USD 2400.0 \nSolution Providers and Consultants - Full Price (Discounts Available) : USD 2900.0\n\n**Speakers:** Susanne Stead, Assistant Vice President of Talent Development, Flagship Credit Acceptance, Maureen Solero, Chief Learning and Talent Officer, Health Quest, Darlene Samer, Head of Learning and Development - National Sales, Yelp, Michelle Tan, Vice President, Learning and Development, OppenheimerFunds, Damian Hanft, Senior Director of Learning, Arby's Restaurants, Donna Beccaria, VP of Enterprise Learning, Alnylam Pharmaceuticals, Mies de Koning, VP, Talent and Organizational Development, The New York Public Library, David Yozzi, Director Enterprise Learning and Development, Twitter\n\n**Venue details:** TBD, Boston, Boston, 02101, United States\n\n**Time**: 8:00 am - 6:00 pm","date_start":"2018-11-27","date_end":"2018-11-29","important_dates":{"abstract":"","full":"2018-11-26","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education, teaching"],"location":{"virtual":"","full":["Boston","Massachusetts","United States"],"name":"","street":"","city":"Boston","state":"Massachusetts","ZIP":"","country":"United States"},"organizers":["Corinium Global Intelligence"],"societies":[],"indexes":[],"emails":[]}