{"name":"2018 Asia ADR Week","series":"","short":"","website":"https://aiac.world/events/280","content":"The Asian International Arbitration Centre (AIAC) will hold its highlight event of the year, the “ASIA ADR Week” which will be held from 5th-7th May 2018 at Kuala Lumpur, Malaysia. The ASIA ADR WEEK 2018 provides a platform to promote Asia, as a pivotal market for trade agreements, and a strategic location for business development. This year’s event breakdown can be viewed as attached, the highlights of which will include: · The official launch of the newly rebranded Asian International Arbitration Centre; · The growth of the Asian economy and the corresponding opportunities in fields such as oil & gas, law, banking, construction, and transportation; · A session on the growth, opportunities, and challenges of businesses in Malaysia; · Several interactive sessions on emerging trends in investment state disputes, smart contracts, cryptocurrencies, third party funding, as well as digitisation and artificial intelligence; · Training workshops on AIAC’s rules, drafting of agreements, and dealing with procedural violations. · A session overviewing the issues and challenges arising from AIAC’s Standard Form Contracts; and · The annual Construction Industry Payment and Adjudication Act (CIPAA) Conference which analyses recent jurisprudence in relation to its impact on statutory adjudication. The full, three-day conference fee is USD410 (RM1,588). Should you wish to register for the Conference or need further information, please contact us at events@aiac.world.","date_start":"2018-05-05","date_end":"2018-05-07","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Industry-Specific"],"location":{"virtual":"","full":["Kuala Lumpur","Malaysia"],"name":"","street":"","city":"Kuala Lumpur","state":"","ZIP":"","country":"Malaysia"},"organizers":["Asian International Arbitration Centre"],"societies":[],"indexes":[],"emails":["events@aiac.world"]}