{"name":"Innovation in Language Learning International Conference - 11th edition","series":"","short":"","website":"https://conference.pixel-online.net/ICT4LL/index.php","content":"The 11th edition of the Innovation in Language Learning International Conference will take place in Florence, Italy, on 8 - 9 November 2018\\. The objective of the Innovation in Language Learning Conference is to promote transnational cooperation and share good practice in the field of the application of Information and Communication Technologies (ICT) to Language Learning and Teaching. The Innovation in Language Learning conference is also an excellent opportunity for the presentation of previous and current language learning projects and innovative initiatives. The Call for Papers is addressed to teachers, researchers and experts in the field of language teaching and learning as well as to coordinators of language teaching and training projects. Experts in the field of language teaching and learning are therefore invited to submit an abstract of a paper to be presented in the conference. Important dates: - 30 July 2018: Extended Deadline for submitting abstracts - 3 August 2018: Notification of Abstracts Acceptance / Rejection - 17 September 2018: Deadline for final submission of papers - 8 - 9 November 2018: Conference days There will be three presentation modalities: oral, poster and virtual presentations. All accepted papers will be included in the Conference Proceedings published with ISBN and ISSN (2384-9509) codes. This publication will be sent to be reviewed for inclusion in SCOPUS (https://www.elsevier.com/solutions/scopus). Papers will also be included in ACADEMIA.EDU (https://www.academia.edu/) and Google Scholar. For further information, please contact us at the following address: conference@pixel-online.net or visit the conference website: https://conference.pixel-online.net/ICT4LL","date_start":"2018-11-08","date_end":"2018-11-09","important_dates":{"abstract":"","full":"2018-07-30","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","Languages (human)"],"location":{"virtual":"","full":["Firenze","Italy"],"name":"","street":"","city":"Firenze","state":"","ZIP":"","country":"Italy"},"organizers":[""],"societies":[],"indexes":[],"emails":["conference@pixel-online.net"]}