{"name":"Firewalk Instructor Training in Peterborough United Kingdom May 2019","series":"","short":"","website":"http://go.evvnt.com/236111-0?pid=4868","content":"Go beyond the knowledge of skill and understanding and into the realm of personal power and persuasion. Certify as a Firewalk Instructor with a Firewalking Center Certifying Master Firewalk Trainer. Are you a Speaker, a Trainer, a Life Coach, Therapist or an Exceptional Individual looking to enhance your skills to empower yourself to empower others? Super-Charge your life and your current programme with the only UK based Empowerment Intensive and Firewalk Instructor Certification Course. Tony Robbins, T. Harv Eker, Andy Harrington - Names you have heard? That's because they have learned some skills and knowledge but then went onto this course - The Firewalking Instructor Training and Empowerment Intensive. Now, you can too. It's purely experiential!! By that, we mean that we will not take you through a knowledge-based understanding of what it feels like to feel fantastic, confident, and empowered. You will gather these resources through practicing, every day, and we never know which learning tasks will be the ones that impact you most. You may not know either, until you do them! Our delegates are winners. You will be in great company. For many people, this is simply the course that changes their lives. Either way, when you make a decision to say 'yes' to this course, you're already a winner. Many come on specifically to change their lives and build a business, if you're interested in joining a group that includes the most successful coaches on the planet, this is for you. Whether you are a speaker, a corporate trainer, a life coach or just an individual that wants to get to the next level, this course is one you simply cannot afford to miss. This in-depth programme will teach you everything you need to know to enhance your current program or life and get it running more efficiently and effectively than ever before. Below is an overview of what the program offers. Venue Details: The Retreat, Wisbech Road, Peterborough PE6 0TS, United Kingdom. Time: 9:00 am - 10:00 pm. Category: Classes / Courses | Professional Training | Personal Development. Sub-Categories: Conferences | Education | Training, Classes / Courses | Professional Training | Classes, Courses & Workshops. Prices: Firewalk Instructor Training - Early Bird: GBP 1497.00, Firewalk Instructor Training - Standard: GBP 2097.00.","date_start":"2019-05-16","date_end":"2019-05-19","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Peterborough","United Kingdom"],"name":"","street":"","city":"Peterborough","state":"","ZIP":"","country":"United Kingdom"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}