{"name":"STREMAH 2019 - 16th International Conference on Studies, Repairs and Maintenance of Heritage Architecture","series":"","short":"","website":"https://www.wessex.ac.uk/conferences/2019/stremah-2019","content":"Introduction STREMAH 2019 is the 16th International Conference on Studies, Repairs and Maintenance of Heritage Architecture. The meeting has taken place on a regular basis since the first conference started in Florence (1989) and continued in Seville (1991); Bath (1993); Crete (1995); San Sebastian (1997); Dresden (1999); Bologna (2001); Halkidiki (2003); Malta (2005); Prague (2007); Tallinn (2009); Tuscany (2011), the New Forest, UK home of the Wessex Institute (2013), A Coruna, Spain (2015) and Alicante, Spain (2017). The importance of retaining the built cultural heritage cannot be overstated. Rapid development and inappropriate conservation techniques are threatening many heritage unique sites in different parts of world. This conference aims to provide the knowledge required to formulate regulatory policies, to ensure effective ways of preserving the architectural heritage. The series has been most successful and the conference continues to attract a wide range of high quality contributions since it started in 1989\\. The meeting addresses a series of topics related to the historical aspects and the reuse of heritage buildings, as well as technical issues on the structural integrity of different types of buildings, such as those constructed with materials as varied as iron and steel, concrete, masonry, wood or earth. Restoration processes require the appropriate characterisation of those materials, the modes of construction and the structural behaviour of the building. This knowledge can be gained through a series of material characterisation techniques, preferably via non-destructive tests. Modern computer simulation can provide accurate results demonstrating the stress state of the building and possible failure mechanisms affecting its stability. Of particular importance are studies related to their dynamic and earthquake behaviour aiming to provide an assessment of the seismic vulnerability of heritage buildings. This conference brings together contributions from scientists, architects, engineers and restoration experts from all over the world dealing with different aspects of heritage buildings. Papers contained in the volumes in the series have been published in paper and digital format, and widely distributed around the world. They are also permanently archived in the Wessex Institute eLibrary where they are available to the international community http://www.witpress.com/elibrary. Conference Topics The following list covers some of the topics to be presented at STREMAH 2019\\. Papers on other subjects related to the objectives of the conference are also welcome. Heritage architecture and historical aspects Learning from the past Surveying and monitoring Maintenance issues Rehabilitation of metallic structures","date_start":"2019-10-07","date_end":"2019-10-09","important_dates":{"abstract":"","full":"2019-07-01","notification":"","final":""},"topics":["Business","Information-Technology"],"location":{"virtual":"","full":["Seville","Spain"],"name":"","street":"","city":"Seville","state":"","ZIP":"","country":"Spain"},"organizers":["Wessex Institute"],"societies":[],"indexes":[],"emails":[]}