{"name":"International Conference on Mass Communication, Journalism, Advertising, Broadcasting, Film Studies, Visual Culture, Information and Multimedia Technology:","series":"","short":"","website":"http://www.krishisanskriti.org/mass29.html","content":"Mass-Comm. - 2018 warmly welcomes each one of the individuals and supporters from worldwide to attend our inaugural edition of International Conference on Mass Communication, Journalism, Advertising, Broadcasting, Film Studies, Visual Culture, Information and Multimedia Technology: Issues and Challenges, on December 29th 2018 in JNU, New Delhi. This conference will provide valuable teaching and networking, but choosing which to attend can be overwhelming, from digital media to editing to data journalism, there are options around globe. Being a Pioneer we have been continuously producing high-quality conferences, meetings, workshops and symposia in all major fields of science, technology, Management, Humanities and medicine. Topics of interest for submission include various subthemes, but are not limited to the conference aims. The aim of the (Mass- Comm. - 2018) conference is to provide a forum for laying the foundations of a new principled approach to Mass Communication, Journalism, Advertising, Broadcasting, Film Studies, Visual Culture, Information and Multimedia Technology. To this end, the Conference aims to attract participants with different backgrounds, to foster cross-pollination between different research fields, and to expose and discuss innovative theories, frameworks, methodologies, tools, and applications. All contribution should be of high quality, Original and not published elsewhere or submitted for publication. During the review period, Papers will be reviewed by eminent scholars in the respective areas. All Selected papers will be published in International Journal having ISSN No./ Conference proceeding/ As a chapter in edited book with ISBN No.","date_start":"2018-12-29","date_end":"","important_dates":{"abstract":"","full":"2018-12-20","notification":"","final":""},"topics":["Arts & Humanities","Other","Mass Communications"],"location":{"virtual":"","full":["Delhi","India"],"name":"","street":"","city":"Delhi","state":"","ZIP":"","country":"India"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}