{"name":"9th International Symposium on Ambient Intelligence","series":"","short":"","website":"https://www.isami-conference.net","content":"Ambient Intelligence (AmI) is a recent paradigm emerging from Artificial Intelligence (AI), where computers are used as proactive tools assisting people with their day-to-day activities, making everyone’s life more comfortable. Another main concern of AmI originates from the human computer interaction domain and focuses on offering ways to interact with systems in a more natural way by means user friendly interfaces. This field is evolving quickly as can be witnessed by the emerging natural language and gesture based types of interaction. The inclusion of computational power and communication technologies in everyday objects is growing and their embedding into our environments should be as invisible as possible. In order for AmI to be successful, human interaction with computing power and embedded systems in the surroundings should be smooth and happen without people actually noticing it. The only awareness people should have arises from AmI: more safety, comfort and wellbeing, emerging in a natural and inherent way. ISAmI is the International Symposium on Ambient Intelligence, aiming to bring together researchers from various disciplines that constitute the scientific field of Ambient Intelligence to present and discuss the latest results, new ideas, projects and lessons learned. Brand new ideas will be greatly appreciated as well as relevant revisions and actualizations of previously presented work, project summaries and PhD thesis. IMPORTANT DATES Submission date: 5th February, 2018 Notification date: 12th March, 2018 Paper ready deadline: 26th March, 2018 Conference dates: 20th-22nd June, 2018 Submission Guidelines Review process isami-conference welcomes the submission of application papers with preference to the topics listed in the call for papers. All submitted papers will undergo a thorough review process; each paper will be refereed by at least three experts in the field based on relevance, originality, significance, quality and clarity. The papers must consist of original, relevant and previously unpublished sound research results related to any of the topics of the conference Submitting papers isami-conference papers must be formatted according to the Springer LNCS Template, with a maximum length of 8 pages in length, including figures and references. All proposed papers must be submitted in electronic form (PDF format) using the Paper Submission Page. Publication Accepted papers will be included in isami-conference Proceedings. At least one of the authors will be required to register and attend the symposium to present the paper in order to include the paper in the conference proceedings. All accepted papers will be published by AISC series of Springer Verlag. - More information: www.isami-conference.net - Contact: info@isami-conference.net","date_start":"2018-06-20","date_end":"2018-06-22","important_dates":{"abstract":"","full":"2018-02-05","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Biological Engineering & bioinformatics"],"location":{"virtual":"","full":["Toledo","Spain"],"name":"","street":"","city":"Toledo","state":"","ZIP":"","country":"Spain"},"organizers":["Universtiy of Castilla-La Mancha"],"societies":[],"indexes":[],"emails":["info@isami-conference.net"]}