{"name":"Hank Denson's Pay Teachers more Money Comedy Show","series":"","short":"","website":"https://go.evvnt.com/194506-0?pid=4868","content":"Hank Denson, an Atlanta based Comedian, has been making a name for himself on the comedy circuit for the past 10 years. He’s a friend to your favorite comedian, having opened up for Jamie Foxx, Cedric the Entertainer, Amy Schumer and Rodney Perry. Hank appeared in Barbershop 3 and has a role in the upcoming Tupac biopic, All Eyes on Me. Portion of the Show proceeds will be donated to supporting teachers. It was a random yet honest moment, however, that led to Denson becoming an Internet sensation. After volunteering as a chaperone during his son’s field trip, a mentally tortured Denson recorded an amusing commentary about his day at the Georgia Aquarium with a group of six-year-old kids. His summation: Pay teachers more money! He confessed that after one day with these six-year-olds, he was completely drained and the heroes that do the work everyday, teachers, should be payed more. “Summer school should come with a PSA, ‘Make Your Kid Take a Shower.’ It’s hard to teach in the funk!” jokes Hank. After receiving widespread support and 5.8 million views and counting for his #payteachersmoremoney movement, Denson not only recorded follow up posts but hit the road performing exclusively for teachers, and even put the call out that if any teacher have a hard day, he would buy them a round of drinks. Denson, who rarely drinks, jokes, “People ask me, ‘Why pay teachers more money?’ I tell them, you go volunteer at your local school. You will need a Hennessy and Coke!” #payteachersmoremoney Please NOTE the floor chart provided is only a visual reference chart and not to be used for specific seating. The colors indicate the general location of the seats you are purchasing in each section. Rating: 18+ FAQs Are there ID requirements or an age limit to enter the event? Yes you must be 18 to attend events with valid photo ID. 21 to drink Alcohol Where can I contact the organizer with any questions? You can call the box office anytime at 239-389-6901 or Prices: General Admission seating: USD 12.00 DOOR GA: USD 14.00 Artists / Speakers: Hank Denson, CCPS, Collier county schools Time: 7:00 pm - 8:30 pm Venue details: Off the Hook Comedy Club, 2500 Vanderbilt Beach Rd, Naples, 34109, United States","date_start":"2018-02-21","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Naples","Florida","United States"],"name":"","street":"","city":"Naples","state":"Florida","ZIP":"","country":"United States"},"organizers":["Off The Hook Comedy Club"],"societies":[],"indexes":[],"emails":[]}