{"name":"Cities’ Identity Through Architecture and Arts – 2nd Edition","series":"","short":"","website":"https://www.ierek.com/events/cities-identity-through-architecture-and-arts-2#introduction","content":"Cities’ Identity Through Architecture and Arts – 2nd Edition Nowadays, all countries seem to be seeking one pressing issue and that is heritage maintenance, especially in Architecture and Urban design. Organizations and Universities play a vital role in saving or rather conserving old cities through Conferences. Therefore, a conference on “Cities’ Identity Through Architecture & Arts” will be held in 2018.In this conference, examples, and tendencies dealing with urban identities as well as the transformation of cities that shape the current art scene in different places of the world will be discussed. This type of architectural art continuously renews itself -from new materials to different means of communication, from new approaches to perceptional paradigms and nature in the millennium, from new subjects to manifestations. Contemporary art continues to be produced in various directions, consumed and put forward into ideas.This conference will present how citizens see their cities and how they physically or mentally compare it with the ideal city in their own perceptions. Conference Topics: 1\\. Cultural Spaces & Landscapes In Contemporary Arts. 2\\. Cities With Religious And Culture Theme. 3\\. Urban Growth, Morphology And Its Impact On Cities Identity. 4\\. Slums And Urban Fringe Belts. 5\\. New Developments In Urban Design And Shaping The City And Its Culture. 6\\. Contemporary Art In Modern And Historical Cities. 7\\. The Future Of Historical Cities. 8\\. The City’s Image And Self-identity. 9\\. Ideologies & Movements: Shaping The City And Its History. 10\\. Artistic Heritage And Its Impact On Contemporary Arts. 11\\. The Correlation Between Architecture And Arts And Conservation. 12\\. Architecture And Arts In Cultural Transformation Age. 13\\. Policies & Guidelines For Planning And Developing The Historical Areas. 14\\. Best Practices For Dealing With Historical Areas & Buildings. 15\\. Branding The City Heritage. 16\\. Art, Music, Interaction Visualization Media And Its Impact On Human. To more information: \\*Date : 25, September / 30,September 2018 \\*Venue : Cairo,Egypt \\*website: https://goo.gl/vqrjnh \\*Event cost: 500$ \\*Email:ctiaa@ierek.com \\*phone: +203 576 3827 , +2010 272 33310","date_start":"2018-09-25","date_end":"2018-09-27","important_dates":{"abstract":"","full":"2018-06-27","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental","Architecture & Civil Engineering"],"location":{"virtual":"","full":["cairo","Egypt"],"name":"","street":"","city":"cairo","state":"","ZIP":"","country":"Egypt"},"organizers":["ierek"],"societies":[],"indexes":[],"emails":["ctiaa@ierek.com"]}