{"name":"5th International Conference on Innovations in Computer Science & Engineering","series":"","short":"","website":"www.icicse2017.org","content":"The aim of the “International Conference on Innovations in Computer Science & Engineering ICICSE2017”, is to provide a platform for researchers, scientists, technocrats, academicians and engineers to exchange their innovative ideas and new research findings in the field of Computer Science & Engg. GNI cordially invites academicians, researchers and industrialists to submit their research papers to ICICSE-2017\\. Prospective authors are invited to submit full text papers including results, tables, figures and references. Full text papers (.pdf, .doc) will be accepted by electronic submissions system at : https://easychair.org/conferences/?conf=icicse2017 http://events.digitalpapers.org/icicse-2017ss/public/index.php For further details, please visit the website of the conference www.icise2017.org and for further any queries please contact +91-8096609844, 8096609826, 8497900084, 8096215678, 7729869111 or mail to icicse2017@gniindia.org All submitted conference papers will be double blind peer reviewed Technical Program Committee. All accepted & Registered Papers will be published in Springer series, Titled : “Lecture Notes on Networks and Systems”. All others papers may be considered for Special Sessions and those papers will be published in special issues of \"Journal of Innovations in Computer Science and Engineering” (JICSE) with ISSN 2278-0947\\. Topics: Data Science & Analytics Cloud Computing Mobility Network Security Emerginf Technologies","date_start":"2017-08-18","date_end":"2017-08-19","important_dates":{"abstract":"","full":"2017-06-21","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","cloud storage & computing"],"location":{"virtual":"","full":["Hyderabad","India"],"name":"","street":"","city":"Hyderabad","state":"","ZIP":"","country":"India"},"organizers":["Guru Nanak Institutions"],"societies":[],"indexes":[],"emails":["icicse2017@gniindia.org"]}