{"name":"College Expo18","series":"","short":"","website":"http://go.evvnt.com/215706-0?pid=4868","content":"College Expo18 is a new FREE to attend landmark event for everyone involved in post-16 education and training. It will explore: 'Redesigning the Future of Education and Skills'. This two-day conference and exhibition is a celebration of vocational learning, mixed with cutting-edge discussion on innovations to enhance vocational learning outcomes. Expect to learn, debate and participate in a range of interactive indoor and outdoor sessions and activities, through a choice of over 90 workshops, seminars, learning activities, discussion and hands-on practical sessions. It will do all this through three topic strands: 1\\. Access – Retention – Achievement 2\\. Innovation – Creativity – Learning 3\\. Employability – Skills – Industry Sectors. In addition to inspirational and thought-provoking key note speakers, the programme offers active professional learning, discussion and hands-on sessions, including: (Probably) the best ... lesson series A focus on student mental health Digital futures Mindfulness sessions Employer engagement Work-based learning Walk and Talk discussion sessions Outdoor learning: Latest research and practice Industry sector skills The future of colleges and universities Creativity in learning Film screenings Loads of free learning and teaching resources And much more ... check out: http://ow.ly/CUQb30jfr7M Our media partner is TES: https://www.tes.com/news/further-education/breaking-news/programme-college-expo-launched Our exhibition will feature a wide range of educational partners and suppliers, including: Scottish Drama Training Network, Google, SQA, Ecorys, Robertson Trust, Tree of Knowledge, qdp, AoC Create. Check out our sponsorship packages: http://ow.ly/jn8o30jfrfM Speakers: Sir William Atkinson, labelled the UK's most successful headteacher, Dr Stephen Breslin, CEO, Glasgow Science Centre, Shirley-Anne Somerville MSP, Miniser for Further Education, Higher Education and Science, Josh Quigley, mental health survivor, Dr Ken Thomson, Principal, Forth Valley College, Garry Coutts, Chair of Court, University of Highlands and Islands Venue Details: Queen Margaret University, Queen Margaret University College (Leith Campus), Edinburgh, Scotland, EH21 6UU, United Kingdom Time: 9:30 am to 4:00 pm","date_start":"2018-06-06","date_end":"2018-06-07","important_dates":{"abstract":"","full":"2018-06-05","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Edinburgh","United Kingdom"],"name":"","street":"","city":"Edinburgh","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Wendy Grindle"],"societies":[],"indexes":[],"emails":[]}