{"name":"International Data Science Conference","series":"","short":"","website":"www.idsc.at","content":"iDSC 2019 - Agile meets Data Science Organizations have moved already from the rigid structure of classical project management towards the adoption of agile approaches. This holds also true for software development projects, which need to be flexible to adopt to rapid requests of clients as well to reflect changes that are required due to architectural design decisions. With data science having established itself as corner stone within organizations and businesses, it is now imperative to perform this crucial step for analytical business processes as well. The non-deterministic nature of data science and its inherent analytical tasks require an interactive approach towards an evolutionary step-by-step development to realize core essential business applications and use-cases. The 2nd International Data Science Conference (iDSC 2019) brings together researchers, scientists, and business experts to discuss means of establishing new ways of embracing agile approaches within the various domains of data science, such as machine learning and AI, data mining, or visualization and communication as well as case studies and best-practices from leading research institutions and business companies. Topics interest include, but are not limited to: Agile Artificial Intelligence & Machine Learning • Deep Learning and Convolutional Neural Networks • Knowledge Representation & Reasoning • Supervised and Unsupervised Learning • Predictive Analytics and Methods • Machine Learning & Intelligence Implementation of Agile Data Mining Processes • Data Masking • Data Classification • Data Resilience Assessment • Data-centric Audit and Protection Tools • Data Analytics in Security Technologies Agile Data Science and Visualization • Interfaces and Interaction Techniques • Collaborative Co-Located and Distributed Visualization • Visual Data Mining and Visual Knowledge Discovery • Cognition and Perception • Immersive and Virtual Environments Case Studies and Applications for Agile Data Science • Blockchain • Graph Databases • Distributed Computing Platforms / HPC • Cyber-physical Systems • Edge/Fog Computing • Green Computing • Case-based Reasoning How to submit Papers must be clearly presented in English language and must not exceed 6 pages, including tables, figures, references, and appendices. Submissions which are simultaneously submitted to this conference and other events or publication venues as well as submissions that do not utilize the correct formatting template, will be automatically rejected. Submissions will be selected based on their originality, timeliness, significance, relevance, and clarity of presentation. Submissions should be regarded as a commitment that, should the paper be accepted, at least one of the authors has to register and attend the conference to present the work. Accepted and presented papers will be included in the IDSC Proceedings. Reviews are double-blind. Timeline Time schedule and deadlines for research papers: Paper Submission Deadline: January 11th, 2019 Notification of Acceptance: February 24th, 2019 Submission of Camera Ready Paper: March 17th, 2019 Conference: May 22nd – 24th, 2019","date_start":"2019-05-22","date_end":"2019-05-24","important_dates":{"abstract":"","full":"2019-01-11","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Database Management Systems"],"location":{"virtual":"","full":["Salzburg","Austria"],"name":"","street":"","city":"Salzburg","state":"","ZIP":"","country":"Austria"},"organizers":["www.fh-salzburg.ac.at/en"],"societies":[],"indexes":[],"emails":[]}