{"name":"Edge Poetics: A Symposium on Innovative and Speculative Creative Writing Practices in Higher Education","series":"","short":"","website":"https://www.beds.ac.uk/edgepoetics","content":"Keynotes from Professor Robert Sheppard (Edge Hill University) and Nicholas Royle (Manchester Metropolitan University), and contributions from Dr Helen Marshall (Anglia Ruskin University) and Dr Daniel Watt (Loughborough University). In the late essay, ‘Literature and Life’, Gilles Deleuze expands on ideas from his earlier work about the ways literary writing can open up ‘a kind of foreign language within language, which is neither another language nor a rediscovered patois, but a becoming-other of language, a minorization of this major language, a delirium that carries it off, a witch’s line that escapes the dominant system.’ Till relatively recently, Creative Writing in Higher Education has been dominated by a set of techniques and tropes derived from realism, and also by the expectations of mainstream literary fiction. Increasingly, however, aspects of innovative and speculative poetics are finding their way into the classroom. This one-day symposium will ask: what are the benefits for the pedagogy of Creative Writing of writing practices drawn from experimental and fantastic traditions; and what does it mean to be a writer interested in such traditions who also teaches Creative Writing in academe? Is there a value in teaching students to find the kind of delirium Deleuze writes of? It will bring together writers, teachers of Creative Writing, and others with an interest in the field, to discuss these questions. Suggested topics for papers might include but are not limited to: Creative Writing pedagogy and innovation; Creative Writing pedagogy and writing in genre; all forms of creative writing that work at the borders of genre in the Creative Writing classroom; blurred lines between theory and creative practice Conference organisers Tim Jarvis, Keith Jebb, and Lesley McKenna (University of Bedfordshire) invite abstracts of 350 words for 20-minute papers; please submit along with a short biographical note, by 4th August 2017, to edgepoetics@gmail.com.","date_start":"2017-11-04","date_end":"","important_dates":{"abstract":"","full":"2017-08-04","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","Pedagogy"],"location":{"virtual":"","full":["Luton","United Kingdom"],"name":"","street":"","city":"Luton","state":"","ZIP":"","country":"United Kingdom"},"organizers":["University of Bedfordshire"],"societies":[],"indexes":[],"emails":["edgepoetics@gmail.com"]}