{"name":"32nd Indian EngineeringCongress","series":"","short":"","website":"www.iec2017chennai.in","content":"AIM The aim of the Indian Engineering Congress is to enlighten the technical fraternity about the developments in various fields of Engineering and thereby enabling them to face the future challenges and ensure the development of the nation. OBJECTIVES To debate and deliberate on the theme of the Congress to create awareness; promote ideas, innovation, and creativity in various engineering disciplines. To provide engineers with a forum for the exchange of knowledge, updating information and developing a sense of responsibility in their professional functioning. To promote and inculcate social responsibilities of engineers towards fulfilling the basic needs of common citizen of our country. To promote the engineering practice that meets the challenges of sustainable and renewable energy demands. HISTORY The Annual Convention, which the Institution had been organizing earlier, manifested into Indian Engineering Congress (IEC) to provide a wider spectrum. The Institution organizes the Indian Engineering Congress every year concurrently with its Annual General Meeting since 1987\\. The Engineering Congress is intended to broaden the scope of interaction and transfusion of knowledge amongst engineers hailing from the country as well as from prominent parts of the globe, who are professional experts in their respective fields, to participate and effectively diffuse their experiences and infuse their thinking. The Indian Engineering Congress has thrown open the threshold of knowledge to all, both members and non-members, and has provided them with a forum. The first Indian Engineering Congress was held in Kolkata in 1987 and was inaugurated by Hon'ble Prime Minister of India Bharat Ratna Late Rajiv Gandhi. Thereafter, the event got inaugurated by Hon'ble President of India, Late S D Sharma on two occasions. Hon'ble Prime Minister, Shri Atal Bihari Vajpayee and Hon'ble President of India, Bharat Ratna Dr. A P J Abdul Kalam have inaugurated and addressed the International Technical Congresses on the invitation of the Institution. The 27th and 28th Congress were also inaugurated by the Respected President of India, Shri Pranab Mukherjee. The 31st Congress was also inaugurated by the Government of West Bengal.","date_start":"2017-12-21","date_end":"2017-12-23","important_dates":{"abstract":"","full":"2017-12-21","notification":"","final":""},"topics":["Engineering & Technology","Mechanical/Industrial"],"location":{"virtual":"","full":["Chennai","India"],"name":"","street":"","city":"Chennai","state":"","ZIP":"","country":"India"},"organizers":["Tamil Nadu state centre"],"societies":[],"indexes":[],"emails":[]}