{"name":"GSTF JMComm - 6th Annual International Conference On Journalism and Mass Communications","series":"","short":"","website":"http://www.jmcomm.org","content":"\"JOURNALISM, MEDIA AND MASS COMMUNICATION AT THE CROSSROADS\" Today’s media exist in an age of challenging dichotomies: truth versus 'post-truth', facts versus 'alternative facts’ and news versus ‘fake news'. If media practitioners find this evolving environment perplexing, what of their audiences? The media landscape increasingly comprises traditional and new media - and media producers range from experienced professionals who publish or broadcast their work widely, to relative novices who use the internet and social media to access niche audiences. Regulated and unregulated media compete for audiences, but what implications for trust are there to the monetisation of falsehood? Mass media are found in almost every area of our daily lives and the proliferation of platforms has increased their ubiquity, as well as their potential as agents of social change, with possible influences on culture, language, employment, health, social welfare, development, politics and religion. Social media enable dialogues to emerge, seemingly from nowhere, and create impact almost everywhere, through the ongoing evolution of the ‘public sphere’. These trends are observable almost worldwide, and deserve recognition and analysis. Through the divergence of sources and platforms, and the convergence of content and practices, many similarities and differences persist between information, entertainment and communication in today's mass media and social media alike. These various media interactions might influence societies in a number of ways and evidently impact social relations through the way we communicate with one another. Drawing academically-robust conclusions requires an understanding of this complex, highly-mediatized world, and encourages interdisciplinary scholarship, critical reading, data analysis, and an examination of the impact of the various media.","date_start":"2017-10-09","date_end":"2017-10-10","important_dates":{"abstract":"","full":"2017-05-31","notification":"","final":""},"topics":["Life Sciences","Other","Journalism"],"location":{"virtual":"","full":["singapore","Singapore"],"name":"","street":"","city":"singapore","state":"","ZIP":"","country":"Singapore"},"organizers":["Global Science and Technology Forum"],"societies":[],"indexes":[],"emails":[]}