{"name":"THE INTERNATIONAL CONFERENCE ON HARBOR, MARITIME AND MULTIMODAL LOGISTIC MODELLING AND SIMULATION","series":"","short":"HMS 2018","website":"http://www.msc-les.org/conf/hms2018","content":"The HMS Conference concentrates on applications of simulation and computer technologies to logistics, supply chain management, multimodal transportation, maritime environment and industrial logistics. HMS Conference is a traditional event and it was held successfully worldwide, usually in the surroundings of major international ports ( HMS1999 Genoa, HMS2000 Portofino, HMS2001 Marseille, HMS2002 Bergeggi, HMS2003 Riga, HMS2004 Rio de Janeiro, HMS2006 Barcelona, HMS2007 Bergeggi). However HMS foundations are even older, originally a \"Harbour & Maritime Transport Workshop\" was included as part of Simulation in Industry Conference, Genoa (1996) and then a \"Modelling and Simulation within a Maritime Environment Conference\" was organized in Riga during 1998; In 2008 the Conference moved to South Italy in HMS2008, in co-location with I3M2008, the event was a great success in term of quality and attendance; the 2009 edition was very successful in the Canary Island: Tenerife Spain and the HMS2010 was held in Fes (Morocco). In 2011 the conference moved in Italy, while HMS 2012 has been held in Vienna and it is a joint event in I3M2012\\. In 2013 the conference moved to Greece as a joint event of I3M2013, co-locating HMS2013, EMSS2013, MAS2013, DHSS2013, IMAACA2013, I-WISH 2013 and SESDE 2013 . In 2014 the conference was held in Bordeux, France, as part of I3M2014\\. HMS2015 was held in Bergeggi, Italy, still as part of I3M2015\\. In the past editions worldwide specialist had the opportunity to participate and interact to this important International Forum on Logistics. The audience includes both users, vendors and scientists operating in applying advanced techniques to supply chains, logistics and handling facilities.","date_start":"2018-09-17","date_end":"2018-09-19","important_dates":{"abstract":"","full":"2018-05-15","notification":"","final":""},"topics":["Engineering & Technology","Transportation","transportation engineering & logistics"],"location":{"virtual":"","full":["Budapest","Hungary"],"name":"","street":"","city":"Budapest","state":"","ZIP":"","country":"Hungary"},"organizers":["Cal-tek S.r.l."],"societies":[],"indexes":[],"emails":[]}