{"name":"International Conference on Qualitative and Quantitative Economics Research - QQE 2018","series":"","short":"","website":"http://qq-economics.org","content":"FOREIGN CAPITAL INFLOWS AND CAPITAL CONTROLS The growth momentum of the global economy seems to be satisfactory, though there is a change in its direction. US economy has not grown at the desired rate over last couple of years, whereas, European and Asian countries had GDP growth more than projected, along with rise in global manufacturing and trade. Emerging markets' financial conditions have supported growth, though there has been tightening of US policy. Several emerging and advanced economies are still operating below capacity. At the same time, some factors are contributing to already high vulnerabilities and external imbalances. China has been following the policies of unsustainable private and public debt expansions and asset price booms. Similarly, in countries like India, Indonesia and Turkey, the corporate leverage and bank vulnerabilities have increased. As a result, corporate defaults have risen. In advanced economies, low interest rates have hidden vulnerabilities, while excessive liquidity has suppressed volatility and default risk. Low interest rates coupled with lower yields along with high non performing assets have reduced bank profits and made them more prone to financial distress. Another problem has been , excessive global current account imbalances. Some current account imbalances can be desirable for growth, excessive imbalances reflect faulty policies or domestic distortions. These imbalances have to be corrected for more balanced and resilient growth. This has to be done through changes in foreign capital inflows and asset prices. Looking at the frequent boom -bust cycles in capital flows, the countries have learnt the lesson that they must manage the capital inflows, if they want to benefit from financial globalization. Normally, they employ a combination of tools, depending on the nature of risk. However, there are differences across countries with respect to policy response even in similar macro economic conditions. That means that some peculiar characteristics of the economy or political considerations may be important to make countries' response different. The pertinent question here is that whether the capital controls persued by many countries have reduced financial crisis in last few years or not? Only research on these issues can answer these questions. The theme of \"Qualitative and Quantitative Economics Research - QQE 2018\" is “The Challenges of Capital Inflows: Are Countries on the Same Line? The papers are invited on the following topics , though not restricted to them: 1\\. Capital Flows and Regulatory Requirements 2\\. Exchange Rate Volatility and Capital Flows 3\\. Structural Reforms and Capital Requirements 4\\. External Rebalancing 5\\. Monetary Policy and Fiscal Policy Controls 6\\. Bank Consolidation , Efficiency and Profitability 7\\. International Monetary System 8\\. Financial Assets and Debt Sustainability 9\\. Macroprudential Policies 10\\. Financial Stability Vulnerabilities 11\\. Trade Integration and Capital Inflows 12\\. Capital Controls and Cost of Debt 13\\. Non Performing Assets 14\\. Current Account Deficit and Growth 15\\. Bank Profitability and Cost of Funding 16\\. International Interest Rates 17\\. Tax Administration Reforms 18\\. Credit Supply and Corporate Productivity 19\\. Private and Public Debt 20\\. Foreign Direct Investments and Growth","date_start":"2018-08-27","date_end":"2018-08-28","important_dates":{"abstract":"","full":"2018-02-23","notification":"","final":""},"topics":["Business","Economics","Economics & econometrics"],"location":{"virtual":"","full":["Singapore"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":["Global Science & Technology Forum (GSTF)"],"societies":[],"indexes":[],"emails":[]}