{"name":"Africa and Europe Moving Forward - Evidence-based Solutions for African Development","series":"","short":"","website":"www.leuphana.de/africa-conference","content":"How can Africa and Europe move forward together? African economies face a number of critical challenges (e.g. limited employment opportunities, low quality of education), but also offer many opportunities (e.g. young and motivated workforce, high entrepreneurial activity). Unfortunately, most indicators suggest that large parts of Africa are not on track to address the critical challenges and leverage the opportunities. Africa’s and Europe’s challenges are linked in multiple ways. Accordingly, the conference theme is that Africa and Europe can move forward together by jointly developing and using evidence-based solutions. Evidence-based solutions play an increasingly prominent role in “project-based” development cooperation. Yet, there is still a major knowing-doing gap. Further, policy-relevant evidence is often scarce in key areas, including employment creation, migration, trade, and investment policies. Leuphana University of Lueneburg and the GIGA German Institute of Global and Area Studies invite experts from academia and practice to discuss current approaches, policies and interventions for African development. The conference fosters the exchange of ideas between science and practice to close the knowing-doing gap and to contribute to a more rigorous implementation of evidence-based solutions in a wider range of areas. The aim is to create an interdisciplinary platform to address the challenges of African development and European development cooperation by applying the logic of evidence-based management and policy. ------------------------ CALL FOR ABSTRACTS --------------------------------------------------------- Wednesday, October 15, 2018, 5:00 p.m. CET From now until October 15, you can submit abstracts of your paper(s), research and practical projects, or contributed sessions (including a list of 2-3 speakers). Additionally, you can register for the Organized Workshop by Leuphana on Saturday. You can submit several abstracts. All this can be done during registration. Your abstract should be a maximum 750-word abstract (in doc / docx format) including title, description of the project, method, implications and results. Authors will receive an email with information on acceptance of their abstracts on October 31\\. We intend to propose a special issue on our conference theme to “World Development”. “World Development” is a multi-disciplinary international journal devoted to the study and promotion of world development. The focus of the special issue is on evidence-based approaches for African development, entrepreneurship and management. Some papers presented at the conference will be considered for publication in a special issue in World Development. SUBMISSION OPTIONS From now until October 15, you can submit abstracts of your paper(s), research and practical projects, or contributed sessions (including a list of 2-3 speakers). Additionally, you can register for the Organized Workshop by Leuphana on Saturday. You can submit several abstracts for the three options. All this can be done during registration https://en.xing-events.com/africa-conference or via africa-conference@leuphana.de. FURTHER INFORMATION WEBSITE: www.leuphana.de/africa-conference EMAIL: africa-conference@leuphana.de REGISTRATION: https://en.xing-events.com/africa-conference CONFERENCE DESCRIPTION IN ENGLISH: https://www.leuphana.de/fileadmin/user\\_upload/Forschungseinrichtungen/imo/files/Conference\\_-\\_Africa\\_and\\_Europe\\_english.pdf CONFERENCE DESCRIPTION IN GERMAN: https://www.leuphana.de/fileadmin/user\\_upload/Forschungseinrichtungen/imo/files/Konferenz\\_-\\_Africa\\_and\\_Europe.pdf","date_start":"2019-01-24","date_end":"2019-01-26","important_dates":{"abstract":"","full":"2018-10-15","notification":"","final":""},"topics":["Business","Economics"],"location":{"virtual":"","full":["Lueneburg","Germany"],"name":"","street":"","city":"Lueneburg","state":"","ZIP":"","country":"Germany"},"organizers":["Leuphana University, GIGA Institute of Global and Area Studies, German UNESCO Commission, Global Bus"],"societies":[],"indexes":[],"emails":["africa-conference@leuphana.de"]}