{"name":"3rd Annual Nuclear Plant Digitization Conference","series":"","short":"","website":"https://go.evvnt.com/261658-0?pid=4868","content":"The Annual Nuclear Plant Digitalization Conference is the premier global meeting point for the nuclear digitalization community bringing to together the best industry speakers from regulatory bodies, utility companies and innovative vendors. For 2018 the agenda will feature even more CIOs, CTOs, SVPs and Directors than ever before, meaning you're guaranteed to get the information that really matters to your business. Insights will be shared on using the Digitalization of Nuclear Power Plants to optimize reliability, safety and performance. With digital technologies, data analytics, records management and automated programs all identified by utilities as stand-out contributors for cost reduction, the utilisation of digitalization is key to reducing future operation and production costs. URLs: Tickets: https://go.evvnt.com/261658-1?pid=4868 Brochure: https://go.evvnt.com/261658-3?pid=4868 Prices: Super Early Bird- Platinum Pass (exp 07/09): USD 2000.0, Super Early Bird- Gold Pass (exp 07/09): USD 1899.0, Super Early Bird- Silver Pass (exp 07/09): USD 1499.0, Platinum Pass: USD 2699.0, Gold Pass: USD 2499.0, Silver Pass: USD 1499.0 Speakers: Bradley Adams- Southern Nuclear, Janice Hoerber- Ameren, Robert Austin- EPRI, Matt Gibson- EPRI, Jason Wright-Ontario Power, Gary Waldrep- INPO, Christian Williams-INPO, Michael Taylor- EPRI, Max Sperando- Exelon, Edward Kee- Nuclear Economics Consulting Group, Bill Nowicki- INPO, + more Time: 9:00 am to 4:00 pm Venue Details: Hilton Charlotte Center City, 222 East 3rd Street, Charlotte, 28202, United States","date_start":"2018-11-28","date_end":"2018-11-29","important_dates":{"abstract":"","full":"2018-11-27","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education, teaching"],"location":{"virtual":"","full":["Charlotte","North Carolina","United States"],"name":"","street":"","city":"Charlotte","state":"North Carolina","ZIP":"","country":"United States"},"organizers":["Nuclear Energy Insider"],"societies":[],"indexes":[],"emails":[]}