{"name":"14th ESSE Conference: S10 Discursive Strategies in Politically Sensitive Media Texts","series":"","short":"","website":"http://www.esse2018brno.org","content":"14th ESSE Conference S10: Discursive Strategies in Politically Sensitive Media Texts The seminar is aimed at exploring discursive strategies used in the interaction between journalists and the public in media texts presenting politically sensitive topics. The seminar invites scholarly driven investigations based on comparative and/or contrastive studies analysing language in relation to the political context in which it appears. Based on linguistic evidence, contributions are expected to provide insight into how the specific strategies employed by the media in news reporting (ranging from opinionation, condemnatory rhetoric to manipulative persuasion) shape both ideological stance as well as the social, political and cultural identity of the public exposed to them. Since the seminar is intended to provide a platform for exchange of thought and knowledge related to political discourse in the media, we believe it will provide an enriching experience for all participants. In addition, we are planning a joint publication of selected papers presented within the seminar. The publication would be with a prominent international publisher, the choice of which will depend on the aims and scope of the selected papers. Individual paper abstracts for participation in our seminar (up to 250 words) should be submitted to the seminar conveners' email addresses jasmina.djordjevic@filfak.ni.ac.rs and bledartoska@yahoo.co.uk by 31 January 2018\\. Convenors: Jasmina Đorđević, University of Niš, Serbia, jasmina.djordjevic@filfak.ni.ac.rs Bledar Toska, University of Vlora, Albania, bledartoska@yahoo.co.uk","date_start":"2018-08-29","date_end":"2018-09-02","important_dates":{"abstract":"","full":"2018-01-31","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature"],"location":{"virtual":"","full":["Masaryk University in Brno","Czech Republic"],"name":"","street":"","city":"Masaryk University in Brno","state":"","ZIP":"","country":"Czech Republic"},"organizers":[""],"societies":[],"indexes":[],"emails":["jasmina.djordjevic@filfak.ni.ac.rs","bledartoska@yahoo.co.uk"]}