{"name":"Sexual Harassment and the Communication Conundrum","series":"","short":"","website":"www.mediawatchjournal.in","content":"Journal of Communication: Media Watch Invites Papers on: Sexual Harassment and the Communication Conundrum Sexual harassment, a weapon in the arsenal of men to control the communicational interactions with women, is being challenged by its targets. ‘Media Watch’ Journal of Communication (https://www.mediawatchjournal.in/) believes communication scholars should join this public discuss. Therefore, the editors are inviting scholars to submit articles for our May, 2018 issue. The topics are wide ranging across the discipline: • Sexual harassment charges have occurred in the film industry, journalism, and television. Men long in charge now are under criminal investigation. Female stars are providing times and details. The mass media hierarchies are being challenged. • Much mediated communication would seem to place sexual harassment into the public agenda: pornographic, magazines that glorify fashion, beauty, and sexuality; advertisements; plot lines of movies and television shows, and lyrics from songs. • Definitions are unclear. Rape and physical force are generally agreed upon as means of ascertaining sexual harassment. However, are all hugs, kisses, touches, and sexual repartee inherently harassment? How about looks, behaviors, body language? When does a communication become sexual harassment? • The allegations have focused on men sexually harassing women, but do men sexually harass other men? Can women sexually harass men and how would that be different? • No doubt, culturally understood signifiers contribute to sexual harassment. How much of what we understand to be sexual harassment or not interpret as sexual harassment is contextual or based on our individual past experiences as we all play out gender roles and assumptions in our daily discourses with others? No doubt, communication scholars can contribute on these topics and many more communicative aspects of sexual harassment. As a journal that seeks to bring the scholarship of communication to important topics, we invite a full range of interdisciplinary, communication theoretical approaches to the topic of sexual harassment. Dr. Mark Goodman Special Issue Guest Editor Professor of Communication Mississippi State University, USA Last date of Full Paper submission: 15 February 2018 E-mail your submission to: editor@mediawatchjournal.in & mediawatchjournal@gmail.com For more information visit: https://www.mediawatchjournal.in/call-for-papers-2/","date_start":"2018-05-01","date_end":"","important_dates":{"abstract":"","full":"2018-02-15","notification":"","final":""},"topics":["Social Sciences","Gender/Sexuality","sexuality and eroticism"],"location":{"virtual":"","full":["Puri","India"],"name":"","street":"","city":"Puri","state":"","ZIP":"","country":"India"},"organizers":["Centre for Academic Social Action"],"societies":[],"indexes":[],"emails":["editor@mediawatchjournal.in","mediawatchjournal@gmail.com"]}