{"name":"International Journal of Fuzzy Logic Systems","series":"","short":"IJFLS","website":"http://wireilla.com/ijfls","content":"Scope & Topics International Journal of Fuzzy Logic Systems (IJFLS) is an open access peer-reviewed journal that covers all topics in theoretical, experimental and applied fuzzy techniques and systems. It is aimed to bring together researchers and developers from both academia and industry to discuss the latest scientific and theoretical advances in this field, and to demonstrate the state-of-the-art systems. The journal solicits original technical papers that were not previously published and are not currently under review for publication elsewhere. Topics to be discussed in this journal include (but are not limited to) the following: Fuzzy logic techniques & Algorithm Fuzzy mathematics Fuzzy measure and integral Type 2 fuzzy Logic Possibility theory and imprecise probability Fuzzy database Fuzzy Clustering Fuzzy decision support system Fuzzy expert system Fuzzy mathematical programming Fuzzy decision making and decision support systems Fuzzy modeling and fuzzy control of biotechnological processes Fuzzy neural systems, neuro-fuzzy systems Fuzzy systems modeling and identification Fuzzy pattern recognition Fuzzy process control Fuzzy reasoning system Fuzzy-rule based system Fuzzy System in Multimedia and web-based applications Fuzzy system applications in computer vision Hybrid fuzzy systems (fuzzy-neuro-evolutionary-rough) Fuzzy system applications in e-commerce Fuzzy sets in bioinformatics Fuzzy system applications in human-machine interface Fuzzy system applications in robotics Fuzzy system applications in system and control engineering Important Dates Submission Deadline : July 14, 2018 Notification : August 15, 2018 Final Manuscript Due : August 23, 2018 Publication Date : Determined by the Editor-in-Chief","date_start":"2018-08-23","date_end":"2018-08-25","important_dates":{"abstract":"","full":"2018-07-14","notification":"","final":""},"topics":["Engineering & Technology","Design","Fuzzy Logic, Math & Computing"],"location":{"virtual":"","full":["Sydney","Australia"],"name":"","street":"","city":"Sydney","state":"","ZIP":"","country":"Australia"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}