{"name":"2019 Spring International Conference on Mineral Processing and Metallurgical Engineering (MPME-S 2019)","series":"","short":"","website":"http://www.scetconf.org/conference/SCET2019/MPME.htm","content":"2019 Spring International Conference on Mineral Processing and Metallurgical Engineering (MPME-S) Conference Date: April 22-24, 2019 Conference Venue: Xiamen, China Website: http://www.scetconf.org/conference/SCET2019/MPME.htm Online Registration System: http://www.scetconf.org/RegistrationSubmission/default.aspx?ConferenceID=1093 Invited Speakers Prof. Wanyang Dai, Nanjing University, China Prof. Manu Pratap Singh, Dr. B. R. Ambedkar University, India Prof. Sanjeev KUMAR, Dr. B.R. Ambedkar University, India Prof. Lee D. Wilson, University of Saskatchewan, Canada Prof. Laichang Zhang, Edith Cowan University, Australia If you wish to serve the conference as an Invited Speaker, please send email to us with your CV. Publication and Presentation All the accepted papers of MPME-S in English will be published by a peer-reviewed open access journal that can ensure the widest dissemination of your published work, For more information, please contact us. Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Contact Person: Ms Rolin Email: scet\\_service@163.com Tel : +86 151 7233 0844 QQ: 741494290/3025797047 Linkedin: SCET Conference Wechat(微信): 3025797047 Conference Topics Topics: The conference is soliciting state-of-the-art research papers in the following areas of interest: Adhesion, interfacial strength and fracture Adiabatic and isothermal process Amorphous and nanocrystalline metallic alloys Atomistic and microstructural aspects of plastic deformation Corrosion Coupling of phase transformations and plasticity Craft of metalworking Cyclic deformation and fatigue Electrostatic separation Enthalpy Entropy Extractive metallurgy Ferrous and non-ferrous alloys Foundry, pressure processing, welding and Cutting Gibbs phase rule Heat treatment of metallic alloys Hess’s law High Strength Alloys High temperature deformation and creep Kirchhoff’s law Magnetic separation Magnetocaloric and magnetic properties of metallic alloys Mechanical, physical, and chemical properties of metallic alloys Metal forming Metal Materials Metal Processing Metallic alloys Metallic elements and their intermetallic compounds Metallurgical and Material Engineering Metallurgical Technology Metallurgical testing Metallurgical thermodynamics Metallurgy and mineralogy Metalworking processes Mineral Processing Mining and Safety Mining Machinery and Automation Mining Technique Petroleum Engineering Phase diagram","date_start":"2019-04-22","date_end":"2019-04-24","important_dates":{"abstract":"","full":"2019-03-22","notification":"","final":""},"topics":["Engineering & Technology","Mining/Mineral","Metallurgical Engineering"],"location":{"virtual":"","full":["Xiamen","China"],"name":"","street":"","city":"Xiamen","state":"","ZIP":"","country":"China"},"organizers":[""],"societies":[],"indexes":[],"emails":["_service@163.com"]}