{"name":"2019 4th International Conference on Artificial Intelligence and Robotics","series":"","short":"ICAIR 2019","website":"http://www.icair.net","content":"Call for Papers 2019 4th International Conference on Artificial Intelligence and Robotics (ICAIR 2019), whichi is in conjunction with 2019 4th International Conference on Automation, Control and Robotics Engineering (CACRE 2019), ICAIR 2019 is co-organized by Georgia Institute of Technology, Sichuan University, The Hong Kong University of Science and Technology and Hong Kong Society of Mechanical Engineers( HKSME). The conference will be held at Georgia Institute of Technology, Shenzhen Campus, China, from July 19 to 21, 2019\\. ●Publication Information All the registered and presented papers will be published in IOP Conference Series: Materials Science and Engineering(ISSN: 1757-899X) , which will be indexed by EI Compendex, Scopus, Thomson Reuters (WoS), Inspec, and other indexing organizations. 2.Selected papers with extension can be recommended to publish in The Cyber-Physical Systems (ISSN: 2333-5785) . ●Topics(for more topics: http://www.icair.net/CFP.html) Networked and Distributed Intelligent Control Real Time Supervisory Control Adaptive Control Systems Embedded Systems Mobile and Autonomous Systems Virtual Systems Brain models, Brain mapping, Cognitive science Natural language processing Fuzzy logic and soft computing Software tools for AI Expert systems ●Paper Submission Submission Email:icair@smehk.org Submission System: https://cmt3.research.microsoft.com/ICAIR2019 ●Call for participants 1,Presenter:If you are interested in giving presentation on conference, without publishing your paper in the proceeding, you need to submit the abstract and title of your presentation to us:icair@smehk.org 2,Listener: If you are interested in attending the conference to participant this gathering on the field of Artificial Intelligence and Robotics, you are welcome to join us and share your ideas! 3,Reviewer:Experts in the area of Artificial Intelligence and Robotics are welcome to join the conference as reviewer. Send your CV to: icair@smehk.org ●Contact Us Ms. Sophia Liu Email: icair@smehk.org Tel:+852-30697937( Hong Kong) Web: http://www.icair.net/","date_start":"2019-07-19","date_end":"2019-07-21","important_dates":{"abstract":"","full":"2019-06-20","notification":"","final":""},"topics":["Engineering & Technology","Other","Biological Engineering & bioinformatics"],"location":{"virtual":"","full":["Online Event","China"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"China"},"organizers":["HKSME"],"societies":[],"indexes":[],"emails":["icair@smehk.org"]}