{"name":"International Conference on Green Energy and Environmental Technology","series":"","short":"","website":"https://geet-19.com","content":"The 2019 International Conference on Green Energy and Environmental Technology is organized by academics and researchers belonging to different scientific areas of the University Complutense of Madrid, University Carlos III of Madrid, University of Extremadura and University of Las Palmas de Gran Canaria with the technical support of Sciknowledge European Conferences. The event has the objective of creating an international forum for academics, researchers and scientists from worldwide to discuss worldwide results and proposals regarding to the soundest issues related to Green Energy and Environmental Technologies. This event will include the participation of renowned keynote speakers, oral presentations, posters sessions and technical conferences related to the topics dealt with in the Scientific Program as well as an attractive social and cultural program. The papers will be published in the Abstracts E-book of the Conference. Those communications considered of having enough quality can be further considered for publication in International Conference Journals. At the authors’ choice, those works not suitable for publication in any of the congress journals will be published in the Extended Proceedings E-book of the International Congress. The Conference will also have a space for companies and/or institutions to present their products, services, innovations and research results. If you or your company is interested in participating of this exhibition, please contact the Technical Secretariat here. Finally, on behalf of the Organizing Committee, I would like to invite all the Scientific Community to participate in this project, presenting papers or communications related to any of the proposed topics.","date_start":"2019-07-24","date_end":"2019-07-26","important_dates":{"abstract":"","full":"2019-04-01","notification":"","final":""},"topics":["Physical Science & Math","Chemistry","environmental science & ecology"],"location":{"virtual":"","full":["PARIS","France"],"name":"","street":"","city":"PARIS","state":"","ZIP":"","country":"France"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}