{"name":"“Parties, Festivals and Celebrations” International Conference","series":"","short":"","website":"http://celebrations.lcir.co.uk","content":"“Parties, Festivals and Celebrations” International Conference 20 July 2019 – London, UK organised by London Centre for Interdisciplinary Research Traditional celebrations are a key part of any culture: whether it is a wedding, a harvest festival, a religious holiday, or a national observance, celebrations are woven tightly into cultural identity. Whether it is the Mad Hatter's tea party in Alice’s Adventures in Wonderland or the Meryton ball in Pride and Prejudice, parties can be pivotal points in the dramatic structure of a literary work. Moreover, special days and celebrations are largely incorporated in art (Giovanni Bellini's The Feast of the Gods or Édouard Manet's Le Déjeuner sur l’herbe), music (Mozart's The Marriage of Figaro or Requiem), film (Home Alone or Saturday Night Fever) or popular culture (La Tomatina or Oktoberfest). They can be different in size – from a private birthday party to Carnival in Rio de Janeiro, they can celebrate life or death, knowledge or creative achievement and they can be an occasion for merrymaking or mourning. The conference will explore the literary representations and cultural significance of celebrations, examining them as sites for contestation and identifying them as examples of a particular socio-cultural manifestation. It will focus on special days as reflection of values, history, fashion, lifestyle, religion, etc. and view them as social texts requiring interpretation and contextualisation. Topics include but are not limited to: holiday, vacation, weekend festival, fête, fiesta birthday, anniversary, jubilee, wedding, funeral ceremony, inauguration, honouring, commemoration show, exhibition, display, presentation performance, concert, recital carnival, fair, circus, masquerade, parade convention, assembly, congress ball, banquet, reception, feast, picnic, barbecue awards, games, competitions conference, symposium, seminar religious celebrations and rituals The conference aims to bring together scholars from different fields including literature, culture studies, sociology, anthropology, philosophy, psychology, history, arts, film studies, tourism, religious studies, etc. Paper proposals up to 250 words and a brief biographical note should be sent by 15 March, 2019 to: celebrations@lcir.co.uk. Please download paper proposal form. Registration fee – 100 GBP","date_start":"2019-07-20","date_end":"","important_dates":{"abstract":"","full":"2019-03-15","notification":"","final":""},"topics":["Education / Legal / Other","Regional-Cultural","interdisciplinary"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["celebrations@lcir.co.uk"]}