{"name":"The 1st International Industry/University Workshop on Data-center Automation, Analytics, and Control","series":"","short":"","website":"http://www.depts.ttu.edu/cac/conferences/ucc2017/page-2/daacworkshop.html ","content":"Description and Scope Data centers are becoming complex, highly automated computing dynamos that are essential for all forms of large-scale and distributed computing. Recent advances in both the hardware and software aspects of data centers have drawn considerable attention to the needs for corresponding advances in development of high-performance analytics, automation, and control methods specifically aimed for the needs of large-scale data centers, and to the needs for continual improvement in support for cloud software stacks, grids, hyper-converged and container-based infrastructures and automation of associated methods. It is no longer the case that data centers can be designed or operated without deep understanding of the specific workflows to be supported. This workshop will provide a forum to discuss fundamental issues on real-time operation of highly automated data centers, including methods to provision, debug, analyze and control data center equipment and to improve how machines are operated, monitored, and used. Topics to be covered will include how software stacks are deployed and provisioned, how data is processed and transferred in real time from the data center to the cloud as well as challenges in design and implementation of novel automated data center architectures and systems. New methods, techniques, hardware, software, and standards for data center automation and control will be discussed and in scope. With the development of various large-scale cloud and Big Data processing applications for handling real-time processing of vast amounts data, optimized hardware deployments are becoming among the most important issues in cloud computing. Government, industrial and academic institutions have already begun to pay close attention to how to efficiently process large amounts of data from all sources to be integrated, filtered, and analyzed in real-time using automated cloud computing data processing technologies. These architectures increasingly require customized and highly automated data center designs that are closely coupled with the needs of the applications to be supported. Further advancers to the design and operation of data center equipment to optimize components for operation in large-scale data centers will also be covered. The relevant topics include, but not limited to: • Design and implementation of hardware for large-scale data center operation • Artificial intelligence methods to detect and respond to shifting workloads • Integration of cloud software stack design and data center operations • Internet of Things applications for data center facilities equipment • Real-time monitoring architectures and systems • Data analytics infrastructures for data centers • Data movement within and between large-scale data center implementations • Debugging operational issues in multi-level cloud data centers • Network design for inter-tenant, intra-cloud, and intercloud communications • Data collection, analytics, security and management for data centers • Techniques for on-demand virtual machine image or container provisioning • Mining sensor data collected from large-scale sensing deployments • Big data analytics in large data center sensor networks • Sensor systems for remote and real-time monitoring of data center equipment • Scheduling for distributed systems within and among data centers • Optimizing energy use in multi-tenant cloud data center deployments • Emergency response methods for automated protection of equipment • Control software frameworks for handling large numbers of machines • Custom design of software and hardware to optimize operation in data centers Submission Authors are invited to submit papers electronically. Submitted manuscripts should be structured as technical papers and may not exceed 6 letter size (8.5 x 11) pages including figures, tables and references using the templates available at http://www.acm.org/publications/proceedings-template, which include an optional free collaborative cloud-based LaTeX authoring tool. Authors should submit the manuscript in PDF format and make sure that the file will print on a printer that uses letter size (8.5 x 11) paper. The official language of the meeting is English. All manuscripts will be reviewed and will be judged on correctness, originality, technical strength, significance, quality of presentation, and interest and relevance to the DAAC workshop attendees. Papers conforming to the above guidelines can be submitted through the easychair paper submission system: (https://easychair.org/conferences/?conf=daac2017). Submitted manuscripts should be structured as technical papers and need to conform to the ACM conference format guidelines. Submitted manuscript may not have been previously published in or under consideration for publication in another journal or conference.One full registration (non-student, non-workshop) at UCC 2017 is necessary for all accepted papers and each accepted paper must be presented by one of the authors. Papers without a registration and/or not presented at the workshop will not be published. Important Dates • Deadline for paper submission: 30th July, 2017 • Notification to authors: 16th September, 2017 • Camera-ready papers: 30th September, 2017 • Early Registration Date: 30th September, 2017 Organisation (more info needed): General Chairs: • Alan Sill (Texas Tech University) • Yong Chen (Texas Tech University) Industrial Chairs • Jon Hass (Dell) Program Chairs: • Jerry Perez (Texas Tech University) • Dong Dai (Texas Tech University) Publicity Chair: • Ghazanfar Ali (Texas Tech University) Publication Chair: • Elham Hojati (Texas Tech University) Industrial Program Committee (TBD) • Technical Program Committee (TBD) • Christopher Turner • Eric Rees Contact: • Jerry Perez, email: jerry.perez (at) ttu.edu • Dong Dai, email: dong.dai (at) ttu.edu","date_start":"2017-12-05","date_end":"2017-12-08","important_dates":{"abstract":"","full":"2017-07-30","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Austin","Texas","United States"],"name":"","street":"","city":"Austin","state":"Texas","ZIP":"","country":"United States"},"organizers":["Texas Tech University"],"societies":[],"indexes":[],"emails":[]}