{"name":"‘IIPLA 3rd Dubai IP Congress 2017’","series":"","short":"","website":"http://www.iipla.org","content":": IIPLA today announced its 3rd Dubai IP Congress 2017 to be held in Dubai, United Arab Emirates on January 16 & 17, 2017 at Radisson Blu Hotel, Dubai Deira Creek to discuss “Challenges and Developments in Global IP”. The congress will be specially addressed by HE Dr. Tala Abu Ghazaleh, Chairman of Abu Ghazaleh Intellectual Property Jordan together with internationally recognized speakers from USPTO, WIPO, Fortune Corporation and leading law firms. The Congress is the largest Intellectual Property event in the Gulf region dedicated to bringing together a diverse set of audiences from all over the world including IP experts, owners and investors to discuss and find solutions for key issues and operational challenges faced by corporations and IP professionals today. Registration is now open for the Conference, which will bring together Law Firm Partner, In-House/Corporate Counsel, Investors, C Level Executives, Directors & Heads of Legal and IP Departments, Policy Makers, CTOs, Stakeholder,IP Software Service Providers & Legal Outsourcing Professionals from all over the globe. The Congress will provide valuable insights on all stages of the Intellectual Property Lifecycle including IP Development, IP Management, IP Protection, IP Enforcement and IP Monetization so that you can maximize benefits from your intellectual property portfolio. The Congress aims to provide an IP networking platform to accelerate collaboration of all Stakeholders in Intellectual Property Industry.","date_start":"2017-01-16","date_end":"2017-01-17","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Law/Legal-Studies"],"location":{"virtual":"","full":["Dubai","UAE","United Arab Emirates","United Arab Emirates"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":["International Intellectual Property Law Association Inc. , IExForum"],"societies":[],"indexes":[],"emails":[]}