{"name":"International Conference on Marketing, Tourism and Hospitality-ICT19Las Vegas","series":"","short":"","website":"http://globalbizresearch.org/Las_Vegas_Conference_2019_May2/ ","content":"Please submit your manuscripts/case studies/ poters in any of the areas/topics indicated below: Topics! Tourism & Hospitality! Agri-Tourism, Birth Tourism, Creative Tourism, Culinary Tourism, Cultural Tourism, Dark Tourism, Doom Tourism, Educational Tourism, Extreme Tourism, Experiential Tourism, Geo-Tourism, Ghetto Tourism, Heritage Tourism, LGBT Tourism, Medical Tourism, Nautical Tourism, Pop-Culture Tourism, Religious Tourism, Social Tourism, Slum Tourism, Space Tourism, Virtual Tourism, War Tourism, Wellness Tourism, Wildlife Tourism and other related topics in tourism. Marketing! Advertising, Advertising Management, Buyer Behavior, Business to Business Marketing, Brand Management, Consumer Behavior, Direct Marketing, e-business, Internet Marketing, Integrated Marketing, Information Systems, Marketing Planning and Forecasting, Market Segmentation, Mega Marketing, Marketing Research and Strategy, Market Structure and Pricing, Marketing Theory and Applications, Pricing, Product Promotion, Product Management, Relationship Marketing, Services Marketing and other related fields. (The topics given are just suggestive in nature. You may feel free to submit manuscripts on related topics in your area of specialization.) A 10% Group Discount on the ‘registration fee’ available for a group comprising three members. A 5% discount is applicable for those who register and complete conference fee payment on or before the deadline – March 20, 2019\\. (The discount offers are not applicable to one day attendance). For more details please visit: www.globalbizresearch.org E-mail: lasvegasconf@globalbizresearch.org Conference link: http://globalbizresearch.org/Las\\_Vegas\\_Conference\\_2019\\_May2/","date_start":"2019-05-24","date_end":"2019-05-25","important_dates":{"abstract":"","full":"2019-04-10","notification":"","final":""},"topics":["Business","Other","Marketing & advertising"],"location":{"virtual":"","full":["Las Vegas","Nevada","United States"],"name":"","street":"","city":"Las Vegas","state":"Nevada","ZIP":"","country":"United States"},"organizers":["Greater Vision Conferences & Seminars Organizing, Dubai-UAE & GBRJ"],"societies":[],"indexes":[],"emails":["lasvegasconf@globalbizresearch.org"]}