{"name":"International Conference 'Teacher Education and Educational Research in the Mediterranean’","series":"","short":"","website":"www.um.edu.mt/events/teerm2018","content":"The Faculty of Education of the University of Malta, Malta Educational Research Association (MERA), and the Euro-Mediterranean Centre for Educational Research (EMCER) organise the 2018 International Conference 'Teacher Education and Educational Research in the Mediterranean’. The Conference will take place at the University of Malta, Valletta Campus on the 8th and 9th of June 2018\\. Participation of the members of your organisation would provide a highly valuable contribution to the conference. As the Members of the Scientific Committee, we are inviting you to take part in this event that marks the 40th Anniversary of the Faculty of Education in Malta and the recent initiation of the Malta Educational Research Association. Keynote Speakers: Prof Marilyn Cochran-Smith, Boston College, Massachusetts, U.S. Prof André Elias Mazawi, University of British Columbia, Canada Prof Carmel Borg, University of Malta, Malta Abstracts for oral presentations, symposiums, poster presentations and the emerging researchers' sessions should be submitted by the 5th of February 2018\\. For more information about the complete list of topics, venue and registration, please visit the conference website (https://www.um.edu.mt/events/teerm2018/callforpapers). The call for research in progress will remain open until the registration deadline. Members of the Scientific Committee Email: teerm2018@um.edu.mt","date_start":"2018-06-08","date_end":"2018-06-09","important_dates":{"abstract":"","full":"2018-02-05","notification":"","final":""},"topics":["Education / Legal / Other","Education","Multidisciplinary Research"],"location":{"virtual":"","full":["Valletta","Malta"],"name":"","street":"","city":"Valletta","state":"","ZIP":"","country":"Malta"},"organizers":["Faculty of Education of the University of Malta, Malta Educational Research Association (MERA), and"],"societies":[],"indexes":[],"emails":["teerm2018@um.edu.mt"]}