{"name":"ICSDGB 2018 : 2018 2nd International Conference on Sustainable Development and Green Buildings","series":"","short":"","website":"http://www.icsdgb.org","content":"Call for Paper 2018 2nd International Conference on Sustainable Development and Green Buildings (ICSDGB 2018)--EI Mar.1-3, 2018|Xiamen, China Web:http://www.icsdgb.org/ 2018 2nd International Conference on Sustainable Development and Green Buildings (ICSDGB 2018) will be held in Xiamen, China, from 1-3 March, 2018! ICSDGB 2018 is an international forum for the presentation of technological advances and research results in the fields of Sustainable Development and Green Buildings.ICSDGB 2018 will bring together leading researchers, engineers and scientists in the domain of interest from around the world.We warmly welcome prospected authors submit your new research papers to ICSDGB 2018, and share the valuable experiences with the scientist and scholars around the world. ●Publication and Indexing All the accepted papers will be published on Conference Proceeding, which will be indexed by Ei Compendex,SCOPUS, Inspec, Conference Proceedings Citation Index – Science (CPCI-S)(Thomson Reuters, Web of Science), NASA Astrophysics Data System,and other databases.. Selected papers with great extension will be recommended to publish in international journals. ●Topics(for more topics:http://www.icsdgb.org/CFP.html) Sustainable Development Green Building Air emission trading Eco-technology Biofuels Building Structure Air pollution and control Nutrients removal Habitat reconstruction Building Technology Anaerobic treatment Economic instruments Hydrology Building Materials ●Paper Submission Submission Email: icsdgb@apise.org Submission System: https://cmt3.research.microsoft.com/ICSDGB2018 ●Call for participants 1,Presenter:If you are interested in giving presentation on conference,without publishing your paper in the proceeding,you need to submit the abstract and title of your presentation to us: icsdgb@apise.org 2,Listener:You are welcome to attend this great event. You need to complete the registration as Listener before the registration dealdine.Send email to icsdgb@apise.org for further information. 3,Reviewer:We sincerely welcome experts in the areas of Renewable Energy and Smart Grid join the conference as reviewer. ●Contact Us Ms. Linda Lee Email: icsdgb@apise.org Tel:+852-30697937( Hong Kong) http://www.icsdgb.org/","date_start":"2018-03-01","date_end":"2018-03-03","important_dates":{"abstract":"","full":"2018-03-01","notification":"","final":""},"topics":["Engineering & Technology","Other","Sustainable Development and Engineering"],"location":{"virtual":"","full":["Xiamen","China"],"name":"","street":"","city":"Xiamen","state":"","ZIP":"","country":"China"},"organizers":[""],"societies":[],"indexes":[],"emails":["icsdgb@apise.org"]}