{"name":"Challenges of the knowledge society","series":"","short":"","website":"http://cks.univnt.ro","content":"CKS 2019 – “CHALLENGES OF THE KNOWLEDGE SOCIETY” THE 13TH INTERNATIONAL CONFERENCE CALL FOR PAPERS 17th -18th MAY 2019, BUCHAREST The main purpose of this International Scientific Conference – organized by “Nicolae Titulescu” University and \"Nicolae Titulescu\" Foundation for Law and International Relations, Complutense University of Madrid and Deusto University of Bilbao – is to provide an opportunity to international specialists in social sciences and other related fields to meet and exchange opinions. In addition, CKS also provides a place for specialists with cross-disciplinary interests related to social sciences to exchange their views and interact with members inside and outside their own particular fields of study. The conference language is English. CONFERENCE WEB PAGE: http://cks.univnt.ro/ TOPIC AREAS 1\\. Juridical Sciences (Law); 2\\. Economic Sciences; 3\\. Administrative and Political Sciences; 4\\. Innovation in Mediation. Investments; 5\\. IT in Social Sciences. Interested participants are invited to submit research papers (of minimum 3,000 and maximum 12,000 words). Papers will be evaluated for originality, significance, clarity and contribution. Each paper will be subjected to a double blind peer review. Summary of review feedback/reports will be sent back to the author(s). All comments and suggestions should be addressed in the final submission. Papers must NOT have been previously published and they must NOT be currently submitted for publication elsewhere. ONLINE SUBMISSION For online submission, fill in the form at: http://cks.univnt.ro/formular\\_de\\_inregistrare.html PUBLICATION OPPORTUNITIES All accepted papers will be included in the CKS 2019-eBook, proceedings with ISSN number, published “Nicolae Titulescu” University Publishing House. The CKS eBook is currently indexed in EBSCO CEEAS, DOAJ, Index Copernicus and Ulrich’s Databases.Participation fee is 70e/paper. FOR ANY ENQUIRIES, PLEASE WRITE TO US ON: conference@univnt.ro","date_start":"2019-05-17","date_end":"2019-05-18","important_dates":{"abstract":"","full":"2019-02-05","notification":"","final":""},"topics":["Education / Legal / Other","Law/Legal-Studies","Economics & econometrics"],"location":{"virtual":"","full":["Bucharest","Romania"],"name":"","street":"","city":"Bucharest","state":"","ZIP":"","country":"Romania"},"organizers":[""],"societies":[],"indexes":[],"emails":["conference@univnt.ro"]}