{"name":"2nd Conference of the Museum of the Bank of Albania, organised in Tirana, Albania, on 20 September 2018, at the Bank of Albania","series":"","short":"","website":"https://www.bankofalbania.org/Press/Press_Releases/INVITATION_AND_CALL_FOR_PAPERS_20068_1.html","content":"The Bank of Albania has the pleasure of announcing its second Conference of the Museum of the Bank of Albania, organised in Tirana, Albania, on 20 September 2018, at the Bank of Albania. The one-day conference will be dedicated to: \"The role of money in wartime”. The currency is certainly one of the most important discoveries of all times. But, has the emergence of the currency and the development of monetary systems influenced, to date, only the economy of cities and countries? Studies have clearly shown that the currency has a strong connection not only with the economy but also with the war. The rise of the currency helped above all to maintain the military arsenal in ancient city-states, facilitate payments for the rapid construction of naval fleets, sustain the army, make soldier and mercenary payments, as well as ensure food for the troops during combat operations. The advancement of scientific studies has shown that radical changes in monetary systems and policies are often associated with wartime periods. These monetary changes may appear in the form of changes in the monetary system, increase in the money supply/ money issued before and during a war, the massive circulation of a currency in distant areas from its country of origin, the numerous hoards found in once conflict areas. There have been many examples of such phenomena which show the constant relationship, throughout the centuries, between military conflicts on the one hand and the role of currency / money in wartime on the other. Within this framework, the aim of this conference is to bring together historians, archaeologists, scholars of the history of money and the economy, and experienced and young researchers to share their findings on the role of money throughout the centuries in wartime. The conference will be organised in sessions focusing on various periods from antiquity to the modern period. The Bank of Albania invites all the interested candidates to send an extended abstract of their proposed paper and a short bio, no later than 10 June 2018, at 23:55, CET, to: Museum of the Bank of Albania: muzeu@bankofalbania.org Ms Elsa Zhulali (Research Department): ezhulali@bankofalbania.org Authors of accepted papers will be notified by 20 June 2018\\. No conference fee will be charged.","date_start":"2018-09-20","date_end":"","important_dates":{"abstract":"","full":"2018-06-10","notification":"","final":""},"topics":["Business","Economics","Economics & econometrics"],"location":{"virtual":"","full":["Tirana","Albania"],"name":"","street":"","city":"Tirana","state":"","ZIP":"","country":"Albania"},"organizers":[""],"societies":[],"indexes":[],"emails":["muzeu@bankofalbania.org","ezhulali@bankofalbania.org"]}