{"name":"2018 Igniter Conference and Expo","series":"","short":"","website":"http://ignitecon.com ","content":"2018 IGNITER CONFERENCE AND EXPO IgniterCon 2018 is packed with Startup sessions by Industry experts on Marketing, Finance, PR, Immigration, Fund-raising and Branding, workshops by Stanford lecturers on Team building, Leadership and 4 dedicated Expert Panels and Pitch Competitions tracks for AI, Blockchain, Enterprise, Consumer products, Hardware and more. Our Keynote speakers this year are Nancy Duarte, TED Speaker and Author of slide:ology, Don Peppers, Author of Customer Experience: What, How, and Why Now and Ravi Belani, Managing Director, Alchemist Accelerators. What you will get out of it? Latest trends on Marketing, PR, Branding, Immigration and Legal issues for Startups from Industry Experts Learn from Industry Experts on AI, Blockchain, Robotics, Enterprise and Consumer Products Participate in team building, leadership, Pitching workshops by Stanford Lecturers Pitching and fund raising in front of 40+ Silicon Valley Investors we have multiple tracks for Pitch Competition Startup founders will showcase their products at the Expo There are also four Pitch Competitions - two each day: 1\\. Artificial Intelligence (AI), Blockchain, and Big Data 2\\. Hardware and Robotics 3\\. Consumer Products 4\\. Enterprise and Ecommerce Cost: \\*Payment required - Purchase your tickets on Eventbrite. Use the 40% OFF Ticket code: \"IGNT-WKND-SPCL\" Apply promo code to \"Standard - Early Bird\" ticket. https://www.eventbrite.com/e/igniter-international-startup-conference-tickets-46570376249","date_start":"2018-10-13","date_end":"2018-10-14","important_dates":{"abstract":"","full":"2018-10-13","notification":"","final":""},"topics":["Business","Industry-Specific"],"location":{"virtual":"","full":["Mountain View","United States"],"name":"","street":"","city":"Mountain View","state":"","ZIP":"","country":"United States"},"organizers":["Igniter Silicon Valley"],"societies":[],"indexes":[],"emails":[]}