{"name":"The Emirates Dermatology Society Annual Conference 2018","series":"","short":"","website":"http://conference.edsuae.com","content":"The Emirates Dermatology Society is proud to announce the second yearly EDS Conference. This premier conference is scheduled to be held on 15 – 17 November 2018, Jumeirah at Etihad Towers Hotel, in Abu Dhabi – United Arab Emirates. The aim of Emirates Dermatology Society Conference 2018 is to provide a forum of the highest standard for scientific (clinical & experimental), educational and social exchange between professionals involved in Dermatology care (adult & paediatrics) in order to achieve progress in the clinical care of patients. It also aims to build bridges between dermatologists practicing all over the world to easily exchange knowledge and experience. Excellence in dermatology advances occurs at many levels, from the individual dermatologists to the collective profession, and it occurs across many areas. Our sessions are divided into 8 tracks, peer dermatology societies updates, in addition to hands-on workshops. The program is planned to cover a number of educational subjects, naming few: Paediatric Dermatology, Dermatopathology, Cosmetic Dermatology, and Laser and Phototherapy. Please check the conference website regularly for additions and changes. EDS 2018 promises for this yearly planned conference to be the cornerstone and foundation for an international scientific meeting place, and to be the core of dermatology studies. The scientific program has been designed to promote discussion of the most significant developments in clinical practice, research and education. There are opportunities for poster displays and oral presentations. We welcome abstracts that have been presented recently at other conferences. We are interested in receiving case reports from clinicians as well as abstracts from dermatology fellows or trainees in other specialties. We look forward to seeing you in Abu Dhabi, 15-17 November 2018!","date_start":"2018-11-15","date_end":"2018-11-17","important_dates":{"abstract":"","full":"2018-07-13","notification":"","final":""},"topics":["Medicine & Health","Medical-Speciality"],"location":{"virtual":"","full":["Abu Dhabi","United Arab Emirates"],"name":"","street":"","city":"Abu Dhabi","state":"","ZIP":"","country":"United Arab Emirates"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}