{"name":"21st International Conference on System Theory, Control and Computing","series":"","short":"","website":"http://www.icstcc2017.ac.tuiasi.ro","content":"The International Conference on System Theory, Control and Computing ICSTCC 2017 aims at bringing together under a unique forum, scientists from academia and industry to discuss the state of the art and the new trends in system theory, control and computer engineering, and to present recent research results and prospects for development in this rapidly evolving area. The conference will be for the eighth time organized in this format, joining three previous different scientific meetings: SINTES (International Conference on System Theory and Control) - organized by the Faculty of Automation, Computers and Electronics from University of Craiova; SACCS (International Symposium on Automatic Control and Computer Science) - organized by the Faculty of Automatic Control and Computer Engineering from “Gheorghe Asachi” Technical University of Iasi; SIMSIS (International Symposium on Modelling, Simulation and Identification Systems) - organized by the Faculty of Control Systems, Computers, Electrical and Electronics Engineering from “Dunarea de Jos” University of Galati. As well as the previous editions, ICSTCC 2017 will be technically co-sponsored by IEEE Control Systems Society, and the proceedings will be submitted to IEEE Xplore Digital Library. ICSTCC 2017 will feature several kinds of presentations,including invited talks, contributed papers and special sessions. The outcome of ICSTCC 2017 can be a better understanding and development of some leading research areas, as already System Theory, Control and Computing have demonstrated.","date_start":"2017-10-19","date_end":"2017-10-21","important_dates":{"abstract":"","full":"2017-04-30","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Biological Engineering & bioinformatics"],"location":{"virtual":"","full":["Sinaia","Romania"],"name":"","street":"","city":"Sinaia","state":"","ZIP":"","country":"Romania"},"organizers":["IEEE Control Systems Society"],"societies":[],"indexes":[],"emails":[]}