{"name":"15th Annual Pharmaceutical IT Congress","series":"","short":"","website":"http://bit.ly/1CZv606","content":"Oxford Global Conferences are proud to present the 15th Annual Pharmaceutical IT Congress co-located with our Artificial Intelligence in Drug Development Congress, taking place on the 27-28 September 2017 in London. 200 delegates from world renowned academic institutions, hospitals, global pharmaceutical organisations and leading biotechnology companies. 40 presentations and case studies focusing on the key developments in in Big Data and analytics, lab informatics, collaboration, digital health, wearable technologies, blockchain technology, lab automation and challenges in data privacy. Including 4 interactive streams: • Getting the most out of big data in R&D IT • Translational Science and Medicine • Data Management, Real-World Evidence & Real-World Data • IT Solutions 14 pre-scheduled one to one meetings, exhibition and informal networking opportunities. This event is co-located with our Artificial Intelligence in Drug Development Congress. Free Pre-Congress Webinars Workflow Management in Analytical R&D Labs Hosted by Jan Hauβ, Merck KGaA. Download today, for free: http://bit.ly/2tpaXhO Public-Private Partnerships. A safe zone for pre-competitive collaboration Tuesday 20th June 2017 | 2pm BST Hosted by Christopher Hart, AstraZeneca and Nigel Hughes, Janssen Research and Development. Register today, for free: http://bit.ly/2rR43Vw Can’t make the date? Still register and a copy of the recording will be sent to you. For further information on how to register and what discounts are available to your company, please contact Angela Fernandez Saez on a.fernandez@oxfordglobal.co.uk","date_start":"2017-09-27","date_end":"2017-09-28","important_dates":{"abstract":"","full":"2017-09-27","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Pharmacology & Pharmaceuticals"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Oxford Global"],"societies":[],"indexes":[],"emails":["a.fernandez@oxfordglobal.co.uk"]}