{"name":"Education Malaysia Student Recruitment Drive in Qatar","series":"","short":"","website":"https://go.evvnt.com/261116-1?pid=4868","content":"MY Aspiration Sdn. Bhd. will be organising its 2nd edition of Student Recruitment Drive in Qatar, which will be held in the capital Doha, Qatar from 6th until 8th September 2018\\. It is a focused counseling session where you will meet reputable and well-established universities from MALAYSIA, whose representatives are flying in all the way from the country to meet students and parents in Qatar for a one to one personalized session to know about your study needs and the various courses and options to further your studies in Malaysia. Our major focus is to meet students who are interested in gaining admission into the current or up-coming 2018/2019 intakes, and also those who are planning to further their studies in Malaysia in the future. The programme is deemed appropriate and the timing is best, after taking into consideration the suitable timing after the Thanaweeya Amma High School results, Pakistan High School results, O Level and A Level results are out in Qatar. The participating Malaysian Universities will provide an array of programmes; from foundation studies, diploma, degree, post-graduate studies, professional development programmes, short-term courses, summer camps and many more. Come and meet us at the event! The entrance to the event is FREE. For further details, email to info@my-aspiration.com or contact +974 55665150 / +974 33194399 / +6012 2929631 URLs: Facebook: https://go.evvnt.com/261116-0?pid=4868 Facebook: https://go.evvnt.com/261116-2?pid=4868 Tickets: https://go.evvnt.com/261116-3?pid=4868 Facebook: https://go.evvnt.com/261116-5?pid=4868 Time: 4:00 pm to 7:00 pm Venue details: Zurich Hall, Movenpick Hotel, West Bay, Doha, 00000, Qatar","date_start":"2018-09-06","date_end":"2018-09-08","important_dates":{"abstract":"","full":"2018-09-05","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Doha","Qatar"],"name":"","street":"","city":"Doha","state":"","ZIP":"","country":"Qatar"},"organizers":["My Aspiration"],"societies":[],"indexes":[],"emails":["info@my-aspiration.com"]}