{"name":"12th International Conference on Practical Applications of Computational Biology & Bioinformatics","series":"","short":"","website":"https://www.pacbb.net","content":"The success of Bioinformatics in recent years has been prompted by research in Molecular Biology and Molecular Medicine in several initiatives. These initiatives gave rise to an exponential increase in the volume and diversification of data, including nucleotide and protein sequences and annotations, high-throughput experimental data, biomedical literature, among many others. Systems Biology is a related research area that has been replacing the reductionist view that dominated Biology research in the last decades, requiring the coordinated efforts of biological researchers with those related to data analysis, mathematical modeling, computer simulation and optimization. The accumulation and exploitation of large-scale data bases prompts for new computational technology and for research into these issues. In this context, many widely successful computational models and tools used by biologists in these initiatives, such as clustering and classification methods for gene expression data, are based on Computer Science/ Artificial Intelligence (CS/AI) techniques. In fact, these methods have been helping in tasks related to knowledge discovery, modeling and optimization tasks, aiming at the development of computational models so that the response of biological complex systems to any perturbation can be predicted. The 12th International Conference on Practical Applications of Computational Biology & Bioinformatics (PACBB) aims to promote the interaction among the scientific community to discuss applications of CS/AI with an interdisciplinary character, exploring the interactions between sub-areas of CS/AI, Bioinformatics, Chemoinformatics and Systems Biology. Brand new ideas in these fields are sought, as well as substantial and relevant revisions and actualizations of previously presented work, project summaries and PhD thesis presented or not. - MORE INFORMATION: https://www.pacbb.net/ - Contact: info@pacbb.net","date_start":"2018-06-20","date_end":"2018-06-22","important_dates":{"abstract":"","full":"2018-02-05","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Biological Engineering & bioinformatics"],"location":{"virtual":"","full":["Toledo","Spain"],"name":"","street":"","city":"Toledo","state":"","ZIP":"","country":"Spain"},"organizers":["Universtiy of Castilla-La Mancha"],"societies":[],"indexes":[],"emails":["info@pacbb.net"]}