{"name":"2019 IEEE Jordan International Joint Conference on Electrical Engineering and Information Technology","series":"","short":"","website":"https://jeeit.net","content":"2019 IEEE Jordan International Joint Conference on Electrical Engineering and Information Technology (JEEIT) April 9-11, 2019 | Amman, Jordan https://jeeit.net/ JEEIT 2019 is the joint, merged conference that IEEE – Jordan Section, Jordan Engineers Association, and Al-Zaytoonah University of Jordan organize. JEEIT 2019 merges the following three conferences in one big conference with one organizing committee, one program, and one proceedings: 1\\. The 5th IEEE Jordan Conf. on Applied Electrical Eng. and Computing Technologies (AEECT 2019) 2\\. The 11th Jordanian International Electrical and Electronic Engineering Conference (JIEEEC 2019) 3\\. The 9th International Conference on Information Technology (ICIT 2019) Publication The accepted and presented papers will be submitted to the IEEE Xplore® digital library and indexed in Scopus. Important Dates Submission Deadline: December 22, 2018 Notification Date: February 16, 2019 Author Registration Deadline: March 9, 2019 Conference Dates: April 9-11, 2019 Registration Full Author Rate USD350 Member Author Rate USD190 One extra paper (but same attendee and a maximum of two papers per attendee) Half Rate Extra Page (Beyond 6 pages and up to additional 2 pages) USD50 Full Attendee Rate USD300 Member Attendee Rate USD190 Student Attendee Rate USD190 Tracks and Topics The JEEIT 2019 topics include, but are not limited to: JIEEEC 2019 Tracks Power and Drives: Power systems protection, Operation and planning, Stability and control, Transmission and distribution systems, Quality and reliability, High voltage systems, Electrical machines and transformers, Power electronics and drives, Distributed generation. Renewable Energy: Photovoltaic and solar energy systems, Wind energy, Hydrogen energy and fuel cell technology applications, Hybrid energy systems, Grid stability at high RE penetration, Smart grids, Electrical vehicles, grid to vehicle and vehicle to grid, Energy storage, Waste to energy, Financing renewable energy. Communications: Security in communication systems, Green communications, QoS, reliability, and modeling, Next-generation communication systems, Optical communications, Signal processing in communications, Wireless communications. Nano-technology and Electronics: Nano-technology and Electronics, Advanced and smart nanomaterials, Nanomaterials for energy and environment, Nanomaterials in drug delivery and diseases treatment, Nano fabrication and Nano systems, Microelectronic Systems, Electronic Materials, Design and Implementation of ASIC, SoC, and VLSI. AEECT 2019 Tracks Computer Engineering: Computer architecture, Embedded systems, Digital circuits applications, Parallel and high performance processing, Performance evaluation and modeling, Storage systems, GPUs, multicore processors, and hardware accelerators. Computer Networks: Wireless sensor and ad-hoc networks, Wireless networks, Internet of Things, Software defined networks, Content delivery networks, Multimedia transmission systems, Quality of service, Network coding, Network management, Performance evaluation, Media access control protocols. Control, Robotics, and Mechatronics: Control methods and systems, Automation and Instrumentation, Modelling and simulation, Mechatronic system design, System identification, Robotics, Manufacturing methods, Unmanned vehicles, Navigation, mapping and localization. Biomedical Engineering: Biomedical signal and image processing, Biomedical instrumentation, Biomedical systems modeling, Medical informatics, Biomechanics, artificial organs and prosthesis, Biomaterials and tissue engineering, Biomedical imaging. ICIT 2019 Tracks Data Science: Big data, Deep data, Cyberinfrastructure and information security, Bioinformatics, Data analysis and data mining, Data wrangling, Data science management. Intelligent Systems: Machine vision, Machine learnings, Deep and reinforcement learning, Human computer interactions, Natural language processing. Information Technology Trends: Software engineering and quality, Information systems, Algorithms, High performance computing, Distributed systems, Quantum computing, Cloud computing. E-Technologies: E-Business, E-Learning, E-Government, Digital marketing, Smart cities, Mobile applications. Mathematical Modeling and Analysis: Operation research, Risk management, Statistic process and analysis, Computer graphics and differential equations, Applied problems and methods in research and education, Mathematical modeling in computing and optimization, Computational methods and combinatorics, Data analysis. Contact Details For enquires and further information, please contact us at info@jeeit.net","date_start":"2019-04-09","date_end":"2019-04-11","important_dates":{"abstract":"","full":"2018-12-22","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Information technology systems (IT)"],"location":{"virtual":"","full":["Amman","Jordan"],"name":"","street":"","city":"Amman","state":"","ZIP":"","country":"Jordan"},"organizers":["IEEE – Jordan Section (Organizer); Jordan Engineers Association (Organizer); Al-Zaytoonah Universi"],"societies":[],"indexes":[],"emails":["info@jeeit.net"]}