{"name":"PECB Insights Conference 2018","series":"","short":"","website":"http://bit.ly/2Lod0v1","content":"PECB is announcing the 2018 PECB Insights Conference that will gather C-level professionals including top CEOs, Presidents, Founders, investors, influencers and other key figures within the ISO Industry. This conference that strives to promote networking and learning is a remarkable opportunity for all the individuals wanting to challenge current global perceptions through the exceptional discussions conducted with some of the world’s leading experts on these tracks: - Information Security, - Governance, Risk, and Compliance, - Business Continuity, - Anti-Bribery & Forensics. Moreover, you will have the chance to challenge your opinions inside the Roundtable Discussions. These discussions will tend to draw together participants with an interest of tackling all the above tracks. Experts will discuss technology’s role in cyber security, Blockchain technology and its impact in cybersecurity, ISO 37001 after two years, and many more. To advance the skills and competencies of participants, this conference will also deliver the following pre-conference training courses: -GDPR Foundation Training course -ISO 31000:2018 Foundation Training course -PECB Certified Lead Ethical Hacker (Intensive Training Course) -Advanced Auditing Techniques Training course PECB will also host the Gala Night Awards Ceremony to show appreciation for the outstanding contribution of its worldwide Resellers, Trainers, Auditors, and Auditees and to encourage networking and collaboration. The PECB Insights Conference targets PECB worldwide partners, trainers, auditors, clients with the main focus on professionals who share similar interests in this industry. Based on the audience of the previous PECB Insights Conferences, we ensure that the audience will consist of entrepreneurs and professionals from the technological, technical, operational, business, policy-making and internet communities. Do not miss this valuable opportunity to join one of the most attractive events in the industry of international standards.","date_start":"2018-10-22","date_end":"2018-10-26","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education","Risk Management"],"location":{"virtual":"","full":["Paris","France"],"name":"","street":"","city":"Paris","state":"","ZIP":"","country":"France"},"organizers":["PECB"],"societies":[],"indexes":[],"emails":[]}