{"name":"Maritime Transport 2019 - 1st International Conference on Maritime Transport","series":"","short":"","website":"https://www.wessex.ac.uk/conferences/2019/maritime-transport-2019","content":"Introduction The first International Conference on Maritime Transport is to be held in Rome, organised by Sapienza University of Rome and the Wessex Institute, UK, to discuss new developments and advanced technologies in a wide variety of topics covered by the meeting. The substantial growth of maritime shipping has resulted in large quantities of good and products being transported around the world, creating a demand for innovative solutions for infrastructure and fleets. A further increase in the scale and the size of container carriers and passenger cruisers also requires special facilities. These developments have presented a challenge for different types of technologies, as well as operational systems. Maritime transportation ought to be integrated with other services such as railways, roadways and airports and, in some cases, river and canal traffic in order to achieve maximum efficiency. It also needs to respond rapidly to the economic and political circumstances in different parts of the world. These challenges often require extreme performances in terms of capacity, speed of delivery, energy consumption, environmental sustainability, as well as social and economic aspects. Therefore, the study of Maritime Transport requires an interdisciplinary approach in order to respond efficiently to the interaction between diverse agents. The Conference will focus on multidisciplinary research and development, as well as operational experiences, which require new approaches. Conference Topics The following list covers some of the topics to be presented at Maritime Transport 2019\\. Papers on other subjects related to the objectives of the conference are also welcome. Navigation and ship operations Ports and their operation Port infrastructure Safety and security Emergency response","date_start":"2019-09-10","date_end":"2019-09-12","important_dates":{"abstract":"","full":"2019-06-30","notification":"","final":""},"topics":["Business","Information-Technology","shipping & marine transport"],"location":{"virtual":"","full":["Rome","Italy"],"name":"","street":"","city":"Rome","state":"","ZIP":"","country":"Italy"},"organizers":["Wessex Institute"],"societies":[],"indexes":[],"emails":[]}