{"name":"ICA's 10th Annual Conference: The Big Compliance Conversation, London 2018","series":"","short":"","website":"https://go.evvnt.com/178092-0?pid=4868","content":"Hear from two inspirational keynote speakers and attend niche streams (many of which hosted by ICA Fellows) on topics relevant to you and your role including technology as an enabler, developing a compliance culture, managing change, doing business with high-risk jurisdictions, GDPR and much more. We are looking forward to welcoming our members and the wider compliance community to a day packed full of practical insight. This event is part of The Big Compliance Conversation, our new worldwide initiative designed to get the global compliance community talking about the key issues of today and tomorrow. The first event as part of our Big Compliance Conversation aims to: Educate - Hear from our Fellows and other industry experts on topics which impact your roles, firms and the wider operating environment. Stimulate - Learn about the latest developments, get involved and benchmark your approach against those of your peers. Challenge - Debate with your peers and other stakeholders on key issues, consider best practice and see how the modern compliance professional can address the needs of an evolving landscape. Inspire - Share knowledge and experience and help move the compliance agenda forward. To say the times in which we live and work are changing rapidly would be an understatement. Globalisation, geopolitical uncertainty, challenger businesses and technological advances have impacted every aspect of our lives. The speed of change is unprecedented. But what does this mean for the compliance community? What is our relevance and how can we future proof our businesses? Join us as we embark on a journey to explore and debate the latest challenges and issues facing you, our members, and regulatory and financial crime compliance professionals all over the world. For Sponsorship / Exhibition opportunities, please get in touch. URL: Booking: https://go.evvnt.com/178092-1?pid=4868\\. Prices: ICA Member fee (excl. VAT): GBP 395, Non ICA Member fee(excl. VAT): GBP 495\\. Speakers: ICA Executive President Bill Howarth, Conference Chair Sally Scutt, Strategic Advisor to ICA, Keynote speaker: Tom Cardamone, Managing Director, Global Financial Integrity, David McClean, Head of Enforcement and Engagement, OFSI HM Treasury, Julie Sadler FICA, Managing Director, Bankhall, Paul Asare-Archer FICA, Head of Compliance, Telefonica, Dr Steve Strickland FICA, Director of Anti-Financial Crime, Deutsche Bank AG, Adrian Burton, Channels Business Risk Director, Community Banking Business Risk, Lloyds Banking Group, Cherise Cox-Nottage FICA, Executive Director, Head of Legal and Compliance Departments, UBS Trustees (Bahamas) Ltd, David Brain, Partner, Bovill, Brendan Leddy FICA, Head of Compliance and MLRO, British Arab Commerical Bank, Gary Brown GDPR Programme Director, Banco Santander. Time: 9:00 am to 5:00 pm. Venue details: Sofitel St. James, 6 Waterloo Pl, St. James's, London, SW1Y 4AN, United Kingdom.","date_start":"2018-04-19","date_end":"2018-04-20","important_dates":{"abstract":"","full":"2018-04-18","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education, teaching"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["International Compliance Association (ICA)"],"societies":[],"indexes":[],"emails":[]}