{"name":"2019 The Asia-Pacific Conference on Life Science and Biological Engineering","series":"","short":"","website":"http://aplsbe.org","content":"The 5th Asia-Pacific Conference on Life Science and Biological Engineering (APLSBE 2019) is an international platform for scholars, researchers and practitioners to discuss interdisciplinary research and practices in the fields of Life Sciences and Biological Engineering. APLSBE 2019 will take place from March 26-28, 2019 in Kyoto, Japan. Prospective authors are invited to submit research abstracts or full papers. Audiences are also welcome to join the conference for research and opinions exchanging. ★TOPICS 《Biological Engineering》 - Advanced Biochemistry - Biomechanics of the Human Neromusculoskeletal System - Biomedical Polymers - Biomedical Ultrasonics - Clinical Gait Analysis : Theory Application - Drug Delivery Systems - Experimental Neurobiology - Human Anatomy and Physiology - Hyperthermia-Biology, Physics and Instrumentation - Mathematics for Biomedical Engineering - Medical Devices Quality System - Medical Ethics - Medical Microsensor - Multimodal Spatiotemporal Analysis on the Neuroimaging Data - Optimization in Biomechanical Engineering - Physical Stimulation on Cell and Tissue - Physiological Magnetic Resonance Imaging - Radiation Physics for Medicine and Biology - Solid Biomechanics 《Life Sciences 》 - Advanced Biochemistry - Computational & Systems - Bacteriology - Biochemistry & Biophysics - Bioengineering - Biology - Biomechanics of the Human - Biomedical Polymers - Biomedical Ultrasonic - Botany Microbiology - Cancer Biology - Cell Biology - Developmental Biology - Genetics - Human Anatomy and Physiology - Human Genetics - Hyperthermia-Biology, Physics and Instrumentation - Immunology - Molecular Medicine & Human Disease - Nero Musculoskeletal System - Neurobiology Plant Science - Structural Biology - Veterinary Sciences - Zoology","date_start":"2019-02-26","date_end":"2019-02-28","important_dates":{"abstract":"","full":"2018-11-21","notification":"","final":""},"topics":["Life Sciences","Biotechnology/ Bioinformatics","Biological Engineering & bioinformatics"],"location":{"virtual":"","full":["Kyoto","Japan"],"name":"","street":"","city":"Kyoto","state":"","ZIP":"","country":"Japan"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}