{"name":"2019 IEEE International Conference on Electrical, Computer and Communication Technologies (IEEE ICECCT 2019)","series":"","short":"","website":"www.icecct.com","content":"IEEE ICECCT conference series is regarded as one of the premier events in its kind worldwide. Every edition of IEEE ICECCT series receives more than 1,000 research papers/proposals from the scientific, research and academic communities from different parts of the world. IEEE ICECCT 2019 will be held at Coimbatore, India, the second largest city in Tamil Nadu state and is well connected by road, rail and air. The IEEE ICECCT 2019 aims to offer a great opportunity to bring together professors, researchers and scholars around the globe a great platform to deliver the latest innovative research results and the most recent developments and trends in Electrical, Electronics and Computer Engineering and Technology fields. The conference will feature invited talks from eminent personalities all around the world, pre-conference tutorial/workshops and referred paper presentations. The vision of IEEE ICECCT 2019 is to promote foster communication among researchers and practitioners working in a wide variety of the above areas in Engineering and Technology. ICECCT 2019 is technically sponsored by the IEEE Inc., USA (IEEE Conference record #45014). Potential number of participants gather at ICECCT to present research results, share visions and ideas, obtain updates on latest technologies and expand professional and social networking. There had been more than 2,100 manuscripts received by the ICECCT conference secretrait and more than 500 manuscripts had been registered and presented in the previous two editions of ICECCT. The acceptance ratio of IEEE ICECCT is less than 30\\. Participants from more than 25 countries visited the ICECCT conference venue and presented their research articles. The proceedings of IEEE ICECCT 2019 will be forwarded to be indexed in IEEE Xplore, the digital library of IEEE. The Proceedings of IEEE ICECCT will be submitted to be indexed in SCOPUS.","date_start":"2019-02-20","date_end":"2019-02-22","important_dates":{"abstract":"","full":"2018-11-20","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Coimbatore","India"],"name":"","street":"","city":"Coimbatore","state":"","ZIP":"","country":"India"},"organizers":["IEEE"],"societies":[],"indexes":[],"emails":[]}