{"name":"2019 Singapore Conference on Applied Psychology","series":"","short":"SCAP 2019","website":"https://scap.ear.com.sg","content":"2019 Singapore Conference on Applied Psychology (SCAP 2019), organized by East Asia Research and supported by Singapore University of Technology and Design & University of Derby, will be held in the cosmopolitan city of Singapore. We invite researchers & practitioners from all fields of psychology research & practice to present and discuss the most recent innovations, trends, concerns, practical challenges encountered and the solutions adopted in the field of Applied Psychology. Join the best psychology conference taking place in Singapore. You are invited to attend and participate in this annual international Applied Psychology conference which offer numerous opportunities to share your ideas, applications experiences and to establish business or research relations for future collaboration. Join us for this exciting Psychology Conference in Singapore from 20th to 21st June 2019 at the Grand Copthorne Waterfront. Special theme for SCAP: ‘Psychology in Practice’ We welcome all papers on the topic of Applied Psychology to be presented at SCAP 2019\\. What can you expect at SCAP 2019? • Ample interaction opportunities for SCAP delegates • Top Singapore hospitality for all attending delegates • An intellectually stimulating scientific program featuring more than 100 presentations by leading researchers, teachers, and practitioners • An opportunity for East-West science and practice collaborations at SCAP • A’ Best Research Paper Award’ & ‘Best Student Paper Award’ to be given out to SCAP presenters","date_start":"2019-06-20","date_end":"2019-06-21","important_dates":{"abstract":"","full":"2019-03-06","notification":"","final":""},"topics":["Social Sciences","Psychology","psychology"],"location":{"virtual":"","full":["Singapore","Singapore"],"name":"","street":"","city":"Singapore","state":"","ZIP":"","country":"Singapore"},"organizers":["East Asia Research & University of Derby"],"societies":[],"indexes":[],"emails":[]}