{"name":"SecureComm 2018 - 14th EAI International Conference on Security and Privacy in Communication Networks","series":"","short":"","website":"http://securecomm.org","content":"SecureComm seeks high-quality research contributions in the form of well-developed papers. Topics of interest encompass research advances in ALL areas of secure communications and networking. Topics in other areas (e.g., formal methods, database security, secure software, theoretical cryptography) will be considered only if a clear connection to private or secure communication/networking is demonstrated. ...................................................... ..............................................................................................................................................................................................Publication All accepted papers will be published by Springer and made available through SpringerLink Digital Library, one of the world’s largest scientific libraries. The proceedings are submitted for inclusion to the leading indexing services: Elsevier (EI), Thomson Scientific (ISI), Scopus, Crossref, Google Scholar, DBLP. Authors of accepted papers must guarantee their papers be presented in the conference. ....................................................................................................................................... Authors of selected best accepted papers will be invited to submit an extended version to: http://eai.eu/transaction/security-and-safety ......................................................................................................................................................................................................... Topics of interest include, but are not limited to the following: Security & Privacy in Wired, Wireless, Mobile, Hybrid, Sensor, Ad Hoc networks, Network Intrusion Detection and Prevention, Firewalls, Packet Filters, Malware Analysis and Detection including Botnets, Trojans and APTs, Web and Systems Security, Distributed Denial of Service Attacks and Defenses, Communication Privacy and Anonymity, Circumvention and Anti-Censorship Technologies, Network and Internet Forensics Techniques, Authentication Systems: Public Key Infrastructures, Key Management, Credential Management, Secure Routing, Naming/Addressing, Network Management, Security & Privacy in Pervasive and Ubiquitous Computing, e.g., RFIDs, Security & Privacy in Peer-to-Peer and Overlay Networks, Security & Privacy for Emerging Technologies: VoIP, Internet-of-Things, Social Networks, Security & Isolation in Cloud, Data Center and Software-Defined Networks","date_start":"2018-08-08","date_end":"2018-08-10","important_dates":{"abstract":"","full":"2018-02-16","notification":"","final":""},"topics":["Business","Information-Technology","Computer network systems"],"location":{"virtual":"","full":["Singapore","Singapore"],"name":"","street":"","city":"Singapore","state":"","ZIP":"","country":"Singapore"},"organizers":["http://eai.eu/"],"societies":[],"indexes":[],"emails":[]}