{"name":"SAFE 2019 - 8th International Conference on Safety and Security Engineering","series":"","short":"","website":"https://www.wessex.ac.uk/conferences/2019/safe-2019","content":"Introduction This eighth Conference on Safety and Security Engineering follows the success of the first seven meetings held in Rome (2005), Malta (2007), Rome (2009), Antwerp (2011), Rome (2013), Opatija in Croatia (2015) and Rome (2017). The purpose of the Conference is to provide a forum for the presentation and discussion of the most recent research and industrial developments in the theoretical and practical aspects of safety and security engineering. Safety and Security Engineering, due to its special nature, is an interdisciplinary area of research and application that brings together in a systematic way, many disciplines of engineering, from the traditional to the most technologically advanced. The conference covers areas such as crisis management, security engineering, natural disasters and emergencies, terrorism, IT security, man-made hazards, risk management, control, protection and mitigation issues, and many others. The meeting aims to attract papers in all related fields, in addition to those listed under the Conference Topics, as well as case studies describing practical experiences. Due to the multitude and variety of topics included, the list is only indicative of the themes of the expected papers. Authors are encouraged to submit abstracts in all areas of Safety and Security, with particular attention to integrated and interdisciplinary aspects. The conference is aimed at engineers, scientists, field researchers, managers and other specialists involved in one or more aspects of safety and security. Conference Topics The following list covers some of the topics to be presented at Safe 2019\\. Papers on other subjects related to the objectives of the conference are also welcome. Risk analysis and assessment System safety engineering Incident monitoring and management Information and communication security Cybercrime and health care","date_start":"2019-09-23","date_end":"2019-09-25","important_dates":{"abstract":"","full":"2019-06-01","notification":"","final":""},"topics":["Business","Information-Technology","Safety and health"],"location":{"virtual":"","full":["Ancona","Italy"],"name":"","street":"","city":"Ancona","state":"","ZIP":"","country":"Italy"},"organizers":["Wessex Institute"],"societies":[],"indexes":[],"emails":[]}