{"name":"Single-Molecule Sensors and NanoSystems International Conference","series":"","short":"","website":"http://premc.org/conferences/s3ic-single-molecule-sensors-nanosystems","content":"Sensor systems have emerged that exhibit extraordinary sensitivity for detecting physical, chemical, and biological entities at the micro/nanoscale. Particularly exciting is the detection and analysis of molecules on miniature devices that have many possible applications in health, environment, analysis, and security. A new class of label-free micro and nanosensors are starting to emerge that allow us to observe dynamic processes at the single molecule level directly, with unprecedented spatial- and temporal resolution and without significantly affecting the natural and functional movements of the molecules. Micro- and nanosensors by virtue of their small interaction length probe molecules over a dynamic range often inaccessible by other techniques. Their small size enables an exceedingly high sensitivity, and the application of quantum optical measurement techniques can allow us to approach or surpass classical limits of detection. Advances in optical and electrical measurement methodology, laser interferometry, quantum optics, micro/nanofluidics, control of molecules and reactions at the nanoscale, DNA origami/synthetic molecular machines, in-vivo and wearable sensing materials, they all contribute to the rapid progress of the field of Single Molecule Sensors and nanoSystems. It is this convergence of previously often disparate fields that is accelerating the advancements in micro and nano-sensing. This conference will bring together researchers in the rapidly advancing field of Single Molecule Sensors and nanoSystems. The conference focuses on the most recent advances in micro and nano-sensing techniques that have either demonstrated single-molecule detection or that claim single-molecule detection capability on sensor chips in the longer term. Topics Single-Molecule Devices and Sensor Technologies Single-Molecule Spectroscopy Quantum Limits in Biodetection Biophotons and Biophotonics Sensors Molecular Machines, Synthetic Biology and DNA Origami In-vivo and wearable Sensor Devices, Materials and Systems Integrated Sensor Chips and multiplexed Sensing Modelling and Analysis of Sensors and Systems Micro/Nanofluidics and chemical control at the Nanoscale Commercial Single-molecule Sensors and Sequencers Chairman Prof. Frank Vollmer, University of Exeter, UK Confirmed speakers Prof. Michel Orrit, Leiden University, Netherlands Prof. Jeremy J. Baumberg, University of Cambridge, UK Prof. Warwick Bowen, University Of Queensland, Australia Prof. Philipp Kukura, University of Oxford, UK Prof. Stefan Maier, LMU Munich, Germany Prof. Tim Liedl, LMU Munich, Germany Prof. Hagan Bayley, University of Oxford, UK Prof. Niek van Hulst, ICFO, Spain Prof. Cees Dekker, TU Delft, The Netherlands Prof. Christian Degen, ETH Zurich, Switzerland Prof. Reuven Gordon, University of Victoria, Canada Deadlines Regular Submission - January 22nd, 2019 Regular Registration - February 22nd, 2019 Conference - April 3-5, 2019 Venue Konferenzzentrum München Lazarettstraße 33, 80636 Munich, Germany http://premc.org/conferences/s3ic-single-molecule-sensors-nanosystems/ @S3IC\\_Conference https://www.facebook.com/events/197856721012291/ s3ic2019@premc.org +331.46.60.89.40","date_start":"2019-04-03","date_end":"2019-04-05","important_dates":{"abstract":"","full":"2019-01-22","notification":"","final":""},"topics":["Physical Science & Math","Chemistry"],"location":{"virtual":"","full":["Munich","Germany"],"name":"","street":"","city":"Munich","state":"","ZIP":"","country":"Germany"},"organizers":["PremC"],"societies":[],"indexes":[],"emails":["s3ic2019@premc.org"]}