{"name":"THE INTERNATIONAL FOOD OPERATIONS AND PROCESSING SIMULATION WORKSHOP","series":"","short":"FOODOPS 2018","website":"http://www.msc-les.org/conf/foodops2018","content":"Food engineering has expanded enormously in terms of issues addressed, theories and tools deployed to improve food processing and food traceability. Indeed, there is a growing effort toward the application of artificial intelligence techniques as well as mathematical modeling and software development for food processing and traceability purposes. This widening domain along with the dynamism in the Modeling and Simulation technologies and approaches throw up many challenges for researchers and practitioners seeking to come to terms with the scope and diversity of the field. As a matter of facts the food sector has its own particular nature that makes it quite different from other industrial sectors. Among others the need to ensure quality standards against time and environmental conditions, to guarantee the traceability along the whole supply chain, to meet customers’ needs with costs and energy savings are merely a few of all the hallmarks of food engineering. Therefore the International Food Operations & Processing Simulation Workshop has the potential to make an important contribution to the literature both in appraising the current state of research and in providing advanced approaches for the future development of the field. The aim of the Workshop is to collect papers that go beyond the current state of the field, and have also the potential to stimulate and guide future research efforts delineating critical paths for future research. Such papers would address key aspects such as modeling and simulation of food processes, comparison and optimization of emerging food technologies, risk assessment, food safety and shelf-life prediction; analysis and modeling of food packaging; food processing sustainability, traceability, production planning and scheduling; supply chain and cold chain design and management; inventory management and storage area design; automation of production processes and logistics etc directing the attention to the relationships among concepts and theories within and across the different subfields.","date_start":"2018-09-17","date_end":"2018-09-19","important_dates":{"abstract":"","full":"2018-05-15","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Budapest","Hungary"],"name":"","street":"","city":"Budapest","state":"","ZIP":"","country":"Hungary"},"organizers":["Cal-tek S.r.l."],"societies":[],"indexes":[],"emails":[]}