{"name":"IEEE AVSS International Workshop on Multi-source Surveillance for Public Safety and Healthcare","series":"","short":"","website":"http://www.iitrpr.ac.in/mukesh/wnc/avss2018/mss18.html","content":"With rapid growth in sensing and communication technology, we have various new sources ofinformation that can complement video to achieve robust and reliable surveillance, e.g. heatdetector, smoke detector, infrared/thermal sensor, motion sensor, metal detectors, GPS,weather sensors, and various other sensors found on current smartphones. Additionally, online social networks and real-time news portals provide valuable information about individuals and surrounding environment. We can assimilate all these data from different sources to make accurate and reliable situation assessment using artificial intelligence (AI) and Deep learning (DL) methods. This workshop aims to bring together researchers that are specifically working on applying advanced learning techniques to exploit multi-source information for public safety and healthcare. The workshop aims to build a common platform for synergizing research efforts and develop innovative methods population health and safety. We solicit original and unpublished research papers that analyse multiple source for safety and healthcare applications. Topics for the workshop include, but not limited to:- -Multi-source data analysis for security threat and crime detection -Multi-source data analysis for forensics -Multi-source data analysis for abnormal situation monitoring -Advanced learning techniques for multi-source data analysis for safety and health -Multi-source data analysis for population health management -Multi-source data analysis for disease detection, diagnosis and treatment plans -Online social network analysis for safety and health monitoring -Multi-source data analysis for remote or tele-health management Researchers working on multimodal analysis of single source (such as image, audio, text) for public safety and healthcare are also encouraged to submit their original work. Length of workshop the workshop is intended to be a half day event with 6 to 8 oral presentations including a keynote address.","date_start":"2018-11-27","date_end":"2018-11-29","important_dates":{"abstract":"","full":"2018-09-07","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Auckland","New Zealand"],"name":"","street":"","city":"Auckland","state":"","ZIP":"","country":"New Zealand"},"organizers":["IEEE"],"societies":[],"indexes":[],"emails":[]}