{"name":"TRAUMA AND NIGHTMARE - 2nd International Interdisciplinary Conference","series":"","short":"","website":"http://traumanightmare.ug.edu.pl","content":"CFP: “Trauma” and “nightmare” have become the most popular metaphors of evil in our times. The old philosophical discussion about “the nature (or mystery) of Evil” has been replaced by modern (and postmodern) studies on trauma. Nightmare is a more and more frequent phenomenon, and it is being studied by dream and sleep researchers. However, nightmare means not only bad dream – today this term describes also a variety of unpleasant experiences, memories, emotions, so it deserves special attention as an important factor which characterizes human condition. Keeping this in mind, during our conference we would like to ask how the discourse on trauma and nightmare helps us to understand our contemporary world. In order to answer this general question, we will have to concentrate on many particular issues. Thus, we are interested in all aspects of traumatic experiences, in their individual and collective dimensions, in the past and in the present-day world. We would like to describe the phenomena of nightmare and trauma in their multifarious manifestations: psychological, social, historical, cultural, philosophical, religious, economic, political, and many others. We also want to devote considerable attention to how these phenomena appear in artistic practices: literature, film, theatre or visual arts. That is why we invite researchers representing various academic disciplines: anthropology, history, psychiatry, psychology, psychoanalysis, sociology, politics, philosophy, economics, law, memory studies, consciousness studies, dream studies, sleep studies, literary studies, theatre studies, film studies, migration studies, gender studies, postcolonial studies, medical sciences, cognitive sciences, and urban studies, to name w few. Different forms of presentations are encouraged, including case studies, theoretical inqueries, problem-oriented arguments or comparative analyses. We will be happy to hear from both experienced scholars and young academics at the start of their careers, as well as doctoral and graduate students. We also invite all persons interested in participating in the conference as listeners, without giving a presentation. Our repertoire of suggested topics includes but is not restricted to: I. Individual experiences - Trauma and childhood memories - Trauma and child abuse - Trauma and women abuse - Trauma and domestic violence - Trauma and old age - Trauma and love - Trauma and death - Trauma and mourning - Trauma and crime - Trauma and neurosis - Trauma and psychosis - Secondary traumatization - Life after trauma - Trauma and psychotherapy - Help for traumatized people II. Collective experiences - Trauma and war - Trauma and genocide - Trauma and terrorism - Trauma and natural disasters - Trauma and post-memory - Traumatized nations - Traumatized minorities - Traumatized generations - Traumatized social classes - Trauma of victims - Trauma of witnesses - Trauma of bystanders - Trauma of perpetrators - Trauma and oblivion - Trauma and forgiveness III. Dream experiences: - Nightmare after trauma - Nightmare and post-traumatic stress disorder - Nightmare and life cycle - Nightmare and physical illness - Nightmare and suicide - Nightmare and threat simulation theory - Nightmare and dream recall - Therapy of nightmares - Nightmare and lucid dreaming - Nightmare and paranormal dream experiences IV. Philosophical questions - Nightmare and trauma as Evil - Nightmare and trauma as metaphors - Nightmare in everyday life - Life as a nightmare - Nightmare and beauty - Attractiveness of nightmare and trauma - Attractiveness of trauma studies V. Representation of trauma and nightmare - Bearing witness of trauma - Testimonies and memories - Trauma and narrative - Trauma and fiction - Nightmare and horror - Trauma in literature - Trauma in film - Trauma in theatre - Trauma in visual arts - Traumatized authors - Traumatized readers/spectators - Writing as a traumatic experience - Writing as recovery from trauma - Trauma and creativeness VI. Institutionalization - Trauma and law - Trauma and politics - Trauma and religion - Trauma and medical treatment - Trauma and management - Trauma and punishment systems - Trauma and army - Trauma and school - Trauma and memory places - Trauma and museums Please submit abstracts (no longer than 300 words) of your proposed 20-minute presentations, together with a short biographical note, by 10 February 2019 both to: traumanightmare@gmail.com and nightmareoffice@tlen.pl Confirmation of acceptance will be sent by 15 February 2019.","date_start":"2019-03-21","date_end":"2019-03-22","important_dates":{"abstract":"","full":"2019-02-10","notification":"","final":""},"topics":["Arts & Humanities","Other","interdisciplinary"],"location":{"virtual":"","full":["Gdansk","Poland"],"name":"","street":"","city":"Gdansk","state":"","ZIP":"","country":"Poland"},"organizers":["INMIND SUPPORT"],"societies":[],"indexes":[],"emails":["traumanightmare@gmail.com","nightmareoffice@tlen.pl"]}