{"name":"18th Industrial Conference on Data Mining ICDM 2018","series":"","short":"","website":"www.data-mining-forum.de","content":"The Industrial Conference on Data Mining ICDM is held on yearly basis. Researchers from all over the world will present theoretical and application-oriented topics on Data Mining. Practicioners can present and discuss their ongoing projects in Industry Sessions. Industrial Exhibition · Best-Paper-Award for Talks and Posters · Workshops: Case-Based Reasoning CBR-MD, DM in Marketing DMM, B2ML I-Business to Manufacturing and LifeSciences - The Internet of Things and Services, and Forensic Forensic Data Analysis. The Aim of the Conference This conference is the thirteen conference in a series of industrial conferences on Data Mining that will be held on yearly basis. Experts from different fields will present their applications and the results obtained by applying data mining. Besides that, newcomers in the field can get a fast introduction to Data Mining by taking the tutorial running in connection with the conference. In a problem/solution hour you will have the opportunity to present your application and ask for support by others or for cooperation in solving the problem. Topics of the conference Paper submissions should be related but not limited to any of the following topics: Applications of Data Mining in ... Marketing Medicine E-Commerce (Mining Logfiles) Biotechnology Quality Management Multimedia Data (Image, Video, Text, Signals) Web-Mining Intrusion Detection in Networks Agriculture Meterology Theoretical and Application-oriented Topics in ... Case-Based Reasoning and Similarity-Based Reasoning Clustering Classification & Prediction Statistical Learning Association Rules Telecommunication Design of Experiment Strategy of Experimentation Capability Indices Deviation and Novelty Detection Control Charts Conceptional Learning Goodness Measures and Evaluation (e.g. false discovery rates) Inductive Learning Including Decision Tree and Rule Induction Learning Organisational Learning and Evolutional Learning Sampling Methods Similarity Measures and Learning of Similarity Statistical Learning and Neural Net Based Learning Visualization and Data Mining Deviation and Novelty Detection Feature Grouping, Discretization, Selection and Transformation Feature Learning Frequent Pattern Mining Learning and Adaptive Control Learning/Adaption of Recognition and Perception Learning for Handwriting Recognition Learning in Image Pre-Processing and Segmentation Mining Financial or Stockmarket Data Mining Motion from Sequence Subspace Methods Support Vector Machines Time Series and Sequential Pattern Mining Desirabilities Graph Mining Agent Data Mining Applications in Software Testing Knowledge Management Mining Social Media Online Targeting & Controlling Behavioral Targeting Meteorological Data Mining Data Mining in Logistics Data Mining in Energy Industry Business Intelligence and Data Mining Big Data and Algorithm for Big Data Legal Informatics and Data Mining Data Mining for Logistic and Supply Chain Management Authors can submit their paper in long or short version. Long Paper The paper must be formatted in the Springer LNCS format. They should have at most 15 pages. The papers will be reviewed by the program committee. Accepted long papers will be published by Springer Verlag in the LNAI Series in the book Advances in Data Mining, edited by Petra Perner. Please submit your Long Paper to the CMS-System. Short Paper Short papers are also welcome and can be used to describe work in progress or project ideas. They can have 5 to max. 15 pages, formatted in Springer LNCS format. Accepted short papers will be presented as poster in the poster session. They will be published in a special poster proceedings book. Please submit your Short Paper and your Industry Paper to the CMS-System. Industry Papers We encourage industrial people to show their applications and projects for data mining. This work can be presented as poster during the poster session in the special industry track. Please submit a one page abstract including title, name and affilation.","date_start":"2018-07-11","date_end":"2018-07-15","important_dates":{"abstract":"","full":"2018-02-16","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Big Data Mining & Analysis"],"location":{"virtual":"","full":["New York","New York","United States"],"name":"","street":"","city":"New York","state":"New York","ZIP":"","country":"United States"},"organizers":["Computer Vision and Applied Computer Sciences"],"societies":[],"indexes":[],"emails":[]}