{"name":"XXII International Conference on Material Handling, Constructions and Logistics - MHCL 2017","series":"","short":"","website":"www.mhcl.info","content":"The Material Handling, Constructions and Logistics (MHCL) Conference is a unique European scientific and professional event offering at least 5 sessions addressing research, development, strategy, best practices, emerging technologies and innovation ideas. The area of Material Handling, Constructions and Logistics is gaining a new momentum at the beginning of 21st century. Today, more then ever before, there is a need to readdress many aspects of design, modeling and controlling of complex material handling facilities and systems, construction and earthmoving machinery, and logistic systems in engineering and transport. Modern material handling and logistics systems and machinery employ advanced technologies that require deep interdisciplinary expertise for successful implementation. At the same time successful integration of technologies and functions require technical and functional breadth. The Conference will host a variety of contributed and invited plenary papers. The Conference is to address various interdisciplinary aspects of MHCL areas. Furthermore an emphasis of real applications will be given. Conference MHCL offers a unique opportunity for experts to meet people from different parts of the world and exchange ideas in this highly relevant and exciting field. Come and join with us at MHCL 2017, and your participation and contribution will further highlight the success of this great event!","date_start":"2017-10-04","date_end":"2017-10-06","important_dates":{"abstract":"","full":"2017-04-10","notification":"","final":""},"topics":["Engineering & Technology","Mechanical/Industrial","mechanical engineering"],"location":{"virtual":"","full":["Belgrade","Serbia"],"name":"","street":"","city":"Belgrade","state":"","ZIP":"","country":"Serbia"},"organizers":["Ministry for Education, Science and Technological Development, Republic of Serbia"],"societies":[],"indexes":[],"emails":[]}