{"name":"COMPUMAG International Conference on the Computation of Electromagnetic Fields","series":"","short":"","website":"www.compumag2019.com","content":"The 22nd Edition of the International Conference on the Computation of Electromagnetic Fields (Compumag 2019) will be held in Paris, France, from July 15 to 19, 2019\\. Important dates: 2-page digest: December 18, 2018 Notification of acceptance: March 1, 2019 Early bird registration: May 1, 2019 Final date for paper registration: June 1, 2019 4-page paper for IEEE TMAG publication: July 19, 2019 The aim of COMPUMAG 2019 is to discuss recent developments and practical applications in the numerical computation of electromagnetic fields for engineers and physicists engaged in the design and analysis of electromagnetic devices and systems. Reflecting the new trends and rapid progress in the field of topics listed in the conference website, authors worldwide are invited to submit original and previously unpublished contributions. With your valuable contribution and active participation, we believe that you will benefit from the excellent quality of technical presentations, have fruitful discussions, experience pleasant moments by meeting friends and establishing new scientific relationships, and have an enjoyable stay in Paris. The Organizers: Prof. Zhuoxiang Ren (L2E, France), chair Prof. Stéphane Clénet (L2EP, France), co-chair Prof. Lionel Pichon (GeePs, France), co-chair Prof. Kay Hameyer (RWTH, Aachen, Germany), editorial board chair Ass. Prof. Abdelkader Benabou (L2EP, France), editorial board co-chair Topics 1\\. Mathematical Modelling and Formulations 2\\. Static and Quasi-Static Fields 3\\. Wave Propagation 4\\. Electromagnetic Compatibility 5\\. Nano-Electromagnetic Computation 6\\. Bio-Electromagnetic Computation 7\\. Electromagnetic Sensors, Sensing and Metrology 8\\. Photonics and Optoelectronics 9\\. Material Modelling 10\\. Multi-Physics and Coupled Problems 11\\. Multi-Scale Modelling and Homogenization 12\\. Optimization and Design 13\\. Numerical Techniques 14\\. Software Methodology 15\\. Novel Computational Methods for Machines and Devices 16\\. Education","date_start":"2019-07-15","date_end":"2019-07-19","important_dates":{"abstract":"","full":"2019-06-01","notification":"","final":""},"topics":["Engineering & Technology","Other"],"location":{"virtual":"","full":["Paris","France"],"name":"","street":"","city":"Paris","state":"","ZIP":"","country":"France"},"organizers":["PremC"],"societies":[],"indexes":[],"emails":[]}