{"name":"Censorship, Politics and Oppression","series":"","short":"","website":"https://censorshipandpolitics.wordpress.com","content":"Organizers: Professor Wojciech Owczarski – University of Gdańsk (Poland) Professor Paulo Endo – University of Sao Paulo (Brazil) Marta Maciejewska – University of Gdańsk (Poland) Co-organizer: InMind Support There are various kinds of censorship, but most often this term is connected with some kind of political tense and oppression. However, many important intellectual or artistic movements have developed under censorship in various countries over the years. So does censorship have a positive or negative influence on people’s work and creation? Do people become more creative or intellectually fertile when they are oppressed in some way? In recent years – as it is often said – democracy throughout the world has seemed to collapse, and various political forces (e.g. ISIS or pro-Russian unrest in Ukraine) have oppressed people. Those who have decided to comment on current political situations have been punished for their words (as the journalists of Charlie Hebdo), and those who have broken national or political taboo have been incarcerated (as the members of a Russian feminist band Pussy Riot). When we live in such times, we start to think about the past – comparing it to presence – and ask ourselves numerous questions: Where does the freedom end, and where does the oppression start? What can we do to prevent such situations? How can we live under censorship and political oppression? We would like to share our queries with researchers with various experience, that is why we invite scholars interested and involved in: history, politics, psychology, sociology, anthropology, philosophy, economics, law, literary studies, theatre studies, film studies, fine arts, design, memory studies, migration studies, consciousness studies, dream studies, gender studies, postcolonial studies, medical sciences, psychiatry, psychoanalysis, cognitive sciences et al. We encourage scholars from various countries and cultures to visit our conference, so the intellectual experience we share is deeper and multi-level! Different forms of presentations are encouraged, including case studies, theoretical investigations, problem-oriented arguments, and comparative analyses. We will be happy to hear from both experienced scholars and young academics at the start of their careers, as well as doctoral students. We also invite all persons interested in participating in the conference as listeners, without giving a presentation. We hope that due to its interdisciplinary nature, the conference will bring many interesting observations on and discussions about the role of censorship in the past and in the present-day world. Our repertoire of suggested topics includes but is not restricted to: 1) Social life: • social effects of censorship • social effects of political oppression • societies living under oppression • minorities influenced by censorship • minorities influenced by political oppression • violating human rights under political oppression • migrations caused by political oppression • censorship and exile • censorship in the media • censorship in science and at universities • censorship in Church 2) Individual life: • living under political oppression • psychological effects of political oppression • influence of censorship on an individual’s life and creation • censorship and broken biographies • censorship as a stimulating factor • auto-censorship and its consequences • individual trauma caused by political oppression • discrimination caused by political oppression 3) Regimes: • political oppression nowadays • censorship nowadays • post-communist countries – living after political oppression • the revenge of the oppressed • political effects of regimes and dictatorship • political effects of censorship • escape from freedom • mechanisms of censorship • mechanisms of political oppression • political groups, actions or ideas dangerous for democracy • censor’s psychological portrait • dictator’s psychological portrait 4) Literature and art: • mechanisms of censorship in literature and art • literature and art about censorship • ways for omitting censorship in literature and art • politically engaged literature and art • influence of political oppression on literature and art • works of literature and art that could not be created or presented while political oppression • literature and art about political oppression • artistic or literary movevements developed under political oppression Please submit abstracts (no longer than 300 words) of your proposed 20-minute presentations, together with a short biographical note, by 15th January 2017 to Marta Maciejewska: censorship.conference@gmail.com The confirmation of acceptance will be sent by 20th January 2017\\. The conference language is English. A selection of papers will be published in a post-conference volume. Conference fee: EUR 140 or USD 170 or PLN 590","date_start":"2017-03-11","date_end":"2017-03-12","important_dates":{"abstract":"","full":"2017-01-15","notification":"","final":""},"topics":["Arts & Humanities","Other","interdisciplinary"],"location":{"virtual":"","full":["Gdańsk","Poland"],"name":"","street":"","city":"Gdańsk","state":"","ZIP":"","country":"Poland"},"organizers":["University of Gdańsk"],"societies":[],"indexes":[],"emails":["censorship.conference@gmail.com"]}