{"name":"International Conference on Tourism, Ethics and Global Citizenship: Connecting the Dots","series":"","short":"","website":"https://www.saxion.nl/ctd","content":"Only recently have we witnessed the inclusion of ethics and global citizenship in tourism debates. The freedom of movement, the right to travel and simultaneously the rise of a multitude of alternative forms of tourism provide sufficient justification to discuss the manifold relationships between tourism, ethics and global citizenship in more detail during this event. Although these concepts have been studied by various disciplines and as phenomena in their own right, in order to connect the dots in contemporary political and sociological thinking, it is important that scholars from different disciplines converse and debate in person. There is a need for understanding the relations and effects between the way we, as tourists or hosts, interact with each other and the environment and how people reflect on these encounters in terms of, for example, hospitality, inequality, human rights, and mobility. The conference aims to strengthen the academic and professional networks that are necessary to push forward the discussions of tourism’s manifold intersections with existing and emergent ethical approaches and forms of citizenship, and to discuss these concepts to apply new insights in our research, policy documents and daily practices. Therefore, we invite all those working in tourism and hospitality studies, philosophy, business and management, culture and media studies, education, anthropology, sociology, psychology, geography, sports and leisure studies, heritage studies and related fields to partake in this cross-disciplinary dialogue.","date_start":"2017-07-03","date_end":"2017-07-06","important_dates":{"abstract":"","full":"2016-12-01","notification":"","final":""},"topics":["Social Sciences","Sociology","Tourism and Hospitality"],"location":{"virtual":"","full":["Apeldoorn","Netherlands"],"name":"","street":"","city":"Apeldoorn","state":"","ZIP":"","country":"Netherlands"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}