{"name":"International Interdisciplinary Conference on Gender Studies and the Status of Women","series":"","short":"","website":"http://www.womenbeing.co.uk/conference","content":"THIS CONFERENCE OFFERS A PLATFORM FOR: - Discussion relating to the current status of women, with a special focus on the following categories that constitute potential challenges to gender equality and women’s rights: the UK’s decision to leave the EU, the refugee crisis, rising levels of (and political legitimisation of) sexual violence and misogyny, cuts in child-care and services for disabled people, lack of access to paid parental leave, tax and welfare reforms, the gender pay gap, sexual harassment and the rise of zero-contract hours. - International researchers and scientists from academia, industry and government to present their studies to a multi-disciplinary audience, exchange experiences, discuss proposals, and disseminate results on women’s and gender studies. - Raising awareness and encouraging dialogue on the proposed topics, with the aim of creating lasting productive partnerships between the participants. All submitted papers will be published in the conference proceedings, edited under the Creative Commons Licence (Attribution-NoDerivatives 4.0 International/CC BY-ND 4.0), which will also contain a report and catalogue of activities. This book will be available on the WomenBeing webpage to download for free, and it will also be freely distributed to schools, institutions, research centres and individuals who request it. The aim of this conference is to create an international forum for debate and exchange on the main challenges facing women in today’s society, and to reflect on the ways in which we can, individually and collectively, propose solutions to these problems. The conference begins on the 10th of October – Ada Lovelace day – which celebrates women of the present and the past, whose achievements have contributed so much to humanity. Like Ada Lovelace, there are many women fighting for equality, for their rights, and for peace. In the last year, there has been a growing awareness of the need to address the problems that women are experiencing, to speak and to take action. WomenBeing builds upon this momentum by providing a ‘loudspeaker’ for academics, civil servants, researchers, social activists, journalists and private individuals to make their voices heard on the main challenges that women are facing in 2017\\. Join us on the 10th and 11th of March in Edinburgh to enrich our discussions.","date_start":"2017-10-10","date_end":"2017-10-11","important_dates":{"abstract":"","full":"2017-09-10","notification":"","final":""},"topics":["Social Sciences","Gender/Sexuality","gender studies (and womens)"],"location":{"virtual":"","full":["Edinburgh","United Kingdom"],"name":"","street":"","city":"Edinburgh","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Queen Margaret University and WomenBeing Project"],"societies":[],"indexes":[],"emails":[]}