{"name":"P2P Financial Systems International Workshop 2018","series":"","short":"","website":"https://www.p2pfisy.com","content":"Call for Papers: https://easychair.org/cfp/p2pfisy2018 This 4th edition of the P2PFISY workshop will bring together scholars, regulators and practitioners interested in the P2P economics. The aim is to merging the gap between academics, technologists, policy makers and regulators engaged in the above-mentioned field, by providing a unique cross-sectoral perspective which allows to exhaustively address questions of practical importance on the following topics: - Digital Currencies and Blockchain Technologies; - P2P Lending and Crowdfunding; List of Topics Submissions should focus on (but are not limited to): Cryptographic protocols and P2P networks Central bank digital currencies (payment and monetary aspects) Threats / attacks / defences / security engineering of P2P systems Systemic risk of P2P systems Digital identification Fraud detection and financial crime prevention Legal aspects and regulatory issues Financial inclusion and market stability Socio-economic and monetary aspects of P2P systems Technology adoption and market dynamics New business models and novel applications Automatic Regulation and Automatic Compliance (RegTech) Innovative technology applied to the insurance industry model (InsurTech) Internet of Things, smart energy & utilities Smart contracts and decentralized government Scientific Committee: Dr. Chris Clack, University College London (UCL) Prof. Alexander Lipton, MIT Media Lab Dr. Ben R. Craig, FED Cleveland Dr. Primavera De Filippi, Harvard University Dr. Robleh Ali, MIT Media Lab Prof. Wei-Tek Tsai, Beihang University Prof. David Yermack, Stern School of Business NYU Prof. Tiziana di Matteo, King’s College Prof. Ben Shenglin, Zehijang University David Andolfatto, FED Saint Louis Dr. Wilko Bolt, De Nederlandsche Bank Dr. Ben Fung, Bank of Canada Dr. Pinar Emirdag, State Street Dr. David Kinitsky, Fidelity Dr. Nicolas Courtois, University College London (UCL) Dr. Marta Piekarska, Linux Foundation Dr. Katrin Assenmacher, European Central Bank For more information, please email: info@p2pfisy.com","date_start":"2018-07-26","date_end":"2018-07-27","important_dates":{"abstract":"","full":"2018-06-07","notification":"","final":""},"topics":["Business","Economics","Payments (digital, cyber, crypto)"],"location":{"virtual":"","full":["Cleveland","United States"],"name":"","street":"","city":"Cleveland","state":"","ZIP":"","country":"United States"},"organizers":["Federal Reserve Bank of Cleveland & UCL Centre for Blockchain Technologies"],"societies":[],"indexes":[],"emails":["info@p2pfisy.com"]}