{"name":"ESP Conference: Embracing ESP as World citizens across Disciplines and Cultures","series":"","short":"","website":"https://esptassociation.com/esp-conference-2019","content":"The 3rd international ESP conference welcomes ELT professionals and scholars from across the world to meet in Liverpool on 26-27 April 2019 for a premier conference experience. Scholars and educators will engage in professional development and explore a wide range of topics relevant to teaching and learning English in specific discourse communities: academic, professional, or otherwise specialized. Papers and workshops may address topics such as the following from the perspective of English for Specific Purposes: • The effectiveness of various approaches to language learning and teaching • Curriculum development and evaluation • Emerging digital technologies in language learning and teaching • Teaching and testing techniques • Assessment challenges • Teacher education and development • Materials preparation • Second language acquisition in specialized contexts • Needs assessment • Discourse analysis • Descriptions of specialized varieties of English • Educational policies and language learning and teaching • Migration and language learning and teaching • Future dimensions in English language learning and teaching Topics are not limited to above. A selection of papers full papers after peer review from the conference will be published by Vernon Press, Cambridge Scholars Publishing or ESP Professional. There will not be any additional fee for the publications. Paper Submissions: Presenters are requested to include for workshop and paper presentations: • their name, • affiliation, • email address (contact details) and • a short biography (30 words max) in the submitted MS-Word documents. It should be written in Times New Roman with 12 font size. Abstract should be 150 words in length including references.","date_start":"2019-04-26","date_end":"2019-04-27","important_dates":{"abstract":"","full":"2019-01-04","notification":"","final":""},"topics":["Social Sciences","Linguistics","linguistics"],"location":{"virtual":"","full":["Liverpool","United Kingdom"],"name":"","street":"","city":"Liverpool","state":"","ZIP":"","country":"United Kingdom"},"organizers":["International ESP Teachers Association"],"societies":[],"indexes":[],"emails":[]}