{"name":"Water and Society 2019 - 5th International Conference on Water and Society","series":"","short":"","website":"https://www.wessex.ac.uk/conferences/2019/water-and-society-2019","content":"Introduction The Water and Society Conference is to be reconvened in 2019 following the success of the previous meetings, the first of which was held in Las Vegas in 2011, followed by a meeting in 2013 in the New Forest, UK, home to the Wessex Institute; La Coruna, Spain (2015) and Seville, Spain (2017). Over the centuries, civilisations have relied on the availability of clean and inexpensive water. This can no longer be taken for granted as the need for water continues to increase due to the pressure from growing global population demanding higher living standards. Agriculture and industry, major users of water, are at the same time those that contribute to its contamination. Water distribution networks in urban areas, as well as soiled water collection systems, present serious problems in response to a growing population as well as the need to maintain ageing infrastructures. Many technologically feasible solutions, such as desalination or pumping systems are energy demanding but, as costs rise, the techniques currently developed may need to be re-assessed. The Conference will address the interaction between water and energy systems. This meeting will encourage trans-disciplinary communication on issues related to the nature of water, and its use and exploitation by society. The conference is motivated by the need to bridge the gap between the broad spectrum of social political sciences and humanistic disciplines and specialists in physical sciences, biology, environmental sciences and health, among others. The socio-political implications of a world short of clean, easily available water are enormous. It will lead to realignments in international politics and the emergence of new centres of power in the world. Policy makers need to be educated and advised on developing policies and regulations that will support the water systems of tomorrow. The role of society and its involvement with water is paramount. To meet the future demands for water, new standards, new training and additional support roles will best be delivered by those knowledgeable of the new technologies and direction of the industry. The intention of the Water and Society series of conferences is to review these issues, as well as the more technical aspects of water resources management and quality, to help put forward policies and legislation that will lead to improved solutions for all. The papers selected for presentation and included in the Conference book are permanently stored in the WIT eLibrary where they are permanently available to the international scientific community (see http://www.witpress.com/elibrary). Conference Topics The following list covers some of the topics to be presented at Water and Society 2019\\. Papers on other subjects related to the objectives of the conference are also welcome. Water resources management Water as a human right Water quality Water resources contamination Water, sanitation and health","date_start":"2019-10-02","date_end":"2019-10-04","important_dates":{"abstract":"","full":"2019-07-01","notification":"","final":""},"topics":["Business","Information-Technology","Water & Waste Treatment Reuse"],"location":{"virtual":"","full":["Valencia","Spain","Spain"],"name":"","street":"","city":"Valencia","state":"Spain","ZIP":"","country":"Spain"},"organizers":["Wessex Institute"],"societies":[],"indexes":[],"emails":[]}