{"name":"ARPM Bootcamp","series":"","short":"","website":"https://www.arpm.co/bootcamp","content":"6-day Intensive Quantitative Course 13-18 Aug 2018, New York University In 6 intense days, the Advanced Risk and Portfolio Management (ARPM) Bootcamp - Consolidates portfolio managers’ and risk managers’ expertise into a structured and rigorous quantitative framework - Empowers avid learners with background in hard sciences to gain the deep technical knowledge necessary to operate across the complex world of quantitative trading, asset management, and risk management Training Instruction: 50 hours of instruction (lectures and practice sessions). Topics include data science and machine learning; classical/Bayesian multivariate statistics and econometrics; financial analytics, market, credit & liquidity risk management; estimation error and model risk; factor modeling, alpha-beta signals, portfolio construction and optimization; algorithmic trading, systematic strategies, portfolio insurance, drawdown control; optimal trade execution; and much more Certifications: 40 CFA Institute CE credits; 40 GARP CPD; Academic credit with Partner Universities Networking Gala Dinner: you are cordially invited to dine with us, if one of the first 330 registrants, and engage in conversation with world-renowned quants and industry leaders. We will also share with you our charitable efforts. Social Mixer: mingle with hundreds of practitioners and academics. Chat, play, and share memories (and photos) From home Practice: revisit all topics and solidify your knowledge in the ARPM Lab, with all the code (Python and MATLAB), documentation, theory, case studies, exercises, simulation clips, slides, and more Video lectures: re-live the ARPM Bootcamp experience from home as It includes access to the ARPM MOOC In operation since 2007, with thousands of alumni globally including industry leaders and academics","date_start":"2018-08-13","date_end":"2018-08-18","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Finance","Risk Management"],"location":{"virtual":"","full":["New York","New York","United States"],"name":"","street":"","city":"New York","state":"New York","ZIP":"","country":"United States"},"organizers":["ARPM"],"societies":[],"indexes":[],"emails":[]}