{"name":"Blockchain 2019","series":"","short":"","website":"https://www.virtueinsight.com/technology/Blockchain-2019","content":"Blockchain 2019 11th April 2019, Sterlings Mac (Matthan Hotel), Bangalore, India Blockchain 2019 will be connecting over 100 industry leaders, business decision makers, tech innovators and investors. Based on unrivalled content and exceptional networking opportunities, take part and listen to class experts as they share their insights into the perils, pitfalls and promise of blockchain as it emerges. No co-located side events. Cutting-edge case studies offer a “how-to” approach to deploying Blockchain technologies across industries like finance, insurance, logistics, utilities, healthcare, gaming and entertainment, and more. A purely Blockchain focused audience. KEY SPEAKERS: • SRINIVASA SIVAKUMAR, Director - Digital & Design Led Innovation, Microsoft • NAVNEET HRISHIKESAN, Director & Head of Service Provider Legal, Cisco • SHEIK BILAL PEER MOHAMMED, Director – Public Services, Utilities & Telco Development, SAP • PETHURU RAJ, Chief Architect and Vice-President, Reliance Jio Cloud • SATHISH PARAMESHWARA, Engineering Director, American Express Big Data Labs • SHYAM DODDAVULA, Associate Vice President, Principal Product Architect, Blockchain CoE, Infosys • LUX RAO, Director & Leader, Digital Solutions, Digital Transformation & Consulting, Dimension Data • KRISHNA MARKANDE, Associate Vice President, Principal Technology Architect, Infosys • ASHISH BHATIA, Senior Director and Global Head - Presales, Harman (a Samsung Company) • PRANAV SAXENA, Sr. Director- Product Management, Flipkart • ANURAG JOSHI, Director - Technical Support, Cisco • GOKUL ALEX, Associate Director and Blockchain Strategy for Government and Public Sector, PwC • DEVESH RAJ, Data Scientist|Deep Learning|Artificial Intelligence|Machine Learning, Mercedes-Benz Research and Development • BIPIN PRADEEP KUMAR, Co-Founder, Gaia Smart Cities • UTTAM KUMAR, Head - IT & Innovations, Aircel • MUSTAMEER AHMED KHAN, Product Manager, SAP • RAMYA RAGHUVEERA, BlockChain Engineer, American Express Big Data Labs • GOUTHAM UPADHYAYA, Cloud Solutions Architect, Microsoft • SOORAJ KUMAR R, IIoT Solutions Product Management - Track & Trace, Supply Chain Management, Blockchain, Asset Performance Management, HCL Technologies • ALOK RANJAN, Practice Lead (Big Data), Teradata • MOHAN SATYARANJAN, Entrepreneur: Smart, Connected, Secure Systems for Sustainable Living (Energy, Blockchain, Smart Supply Chain, IoT, Taqanal Energy KEY THEMES DISCUSSED: • Digital transformation for blockchains – Trust based business networks • Cognitive thoughts for blockchain digital transformation • Blockchain and concentrated journal technology in business • How blockchain can contribute on the industries, applications, evolutions, networks and on the business reality • Building your business cost and time effective by understanding blockchain and its potential • Views on present province of blockchain industry and the path in which it is aiming • Amplifying smart contracts to simplify administration, transactional and legal costs • Possible interruption and possibility for innovation for the legal industry • How will blockchain technology transform financial servicesBanks business models - particularly across the bank’s back office functions • How blockchain is shaping the gaming industry • Developing platforms that allows a player, to sell virtual items in legit cash • Which industries will be mostly impacted by blockchain? • How blockchain can help organizations more businesslike • How blockchain will impact healthcare • Addressing blockchain’s key security concerns • Securing blockchain to store data with a high level of security • India’s current regulatory scenario and structure – what’s changed and what else to expect • Be part of a major networking opportunity WHO SHOULD ATTEND: Companies that had already implements the Blockchain technology is already seeing the best of it. Telecom, Technology, Banking, Insurance, Financial Services, Healthcare, Manufacturing, Government, Logistics, Property and Construction, Charity, Law and Policy, Energy and Utilities, Retail, Supply Chain Management, Transport, Music, Advertising, Education & More CONFERENCE SPONSORSHIP: E-mail - kavitha@virtueinsight.co.in Tel: +9144 24762472 Sponsor, Exhibition Stall (Booth) and a paid Speaker Slots are also available We also have some sponsorship opportunities available for the event, which gives you an opportunity to sponsor/speak/exhibit, and create brand awareness. In addition, the networking opportunities in focused and relevant industry gathering provide the personal contact necessary for business development efforts. CONFERENCE REGISTRATION PROCESS: E-mail - kavitha@virtueinsight.co.in Tel: +9144 24762472 • Early Bird Discount Price (Ends 25th February 2019) – (INR 8,000 + GST (18%) per delegate) • Standard Price (From 25th February 2019) – (INR 12,000 + GST (18%) per delegate) Get more from the event, with a broader scope bringing the whole communications value chain together. Enjoy and make the best out of our dedicated networking time, meet the leading international vendors showcasing the products of tomorrow in the co-located exhibition. Expand your knowledge of the latest business models and strategies in the high-level conference.","date_start":"2019-04-11","date_end":"","important_dates":{"abstract":"","full":"2019-04-10","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Biological Engineering & bioinformatics"],"location":{"virtual":"","full":["Bengaluru","India"],"name":"","street":"","city":"Bengaluru","state":"","ZIP":"","country":"India"},"organizers":[""],"societies":[],"indexes":[],"emails":["kavitha@virtueinsight.co.in"]}