{"name":"International Conference on Magnetic Fluids","series":"","short":"","website":"https://premc.org/conferences/icmf-magnetic-fluids","content":"International Conference on Magnetic Fluids – ICMF 2019 Since 1979 an International Conference on Magnetic Fluids is held every three years. This conference brings together the international scientific community involved in magnetic fluid science, at large, from liquid dispersions to more complex fluids such as magnetorheological fluids, ferrogels, ferronematics, ferropolymers, biocolloidal systems…. The last two conferences were held in New Delhi (India) January 7-11, 2013 and in Ekaterinburg (Russia) July 4-8, 2016\\. Next ICMF 15th will take place at Sorbonne Université in Paris (France) July 8-12, 2019\\. The conference will highlight synthesis and properties of innovative magnetic materials with a special emphasis on societal applications in the domain of energy, environment and biomedical. Topics Advanced design and synthesis of magnetic particles and magnetic fluids Active magnetic colloids and soft magnetic systems Theory, statistical mechanics and modeling of complex magnetic fluids Magnetic and physical properties of ferrofluids and soft magnetic matter Structures and rheology of magnetic fluids and suspensions Mass and energy transfer in magnetic colloids and complex fluids Free surface phenomena and ferrohydrodynamics Bio applications (imaging, drug delivery, magnetic hyperthermia, vectorization, tracking,..) Engineering applications for energy Environmental applications based of magnetic carriers Chairs Committee Prof. Christine Ménager, Sorbonne Université, France Prof. Régine Perzynski, Sorbonne Université, France Dr. Pierre Levitz, Sorbonne Université, France Plenary speakers Prof. Teresa Pellegrino, Istituto Italiano di Tecnologia, Italy Prof. Xuanhe Zhao, Massachusetts Institute of Technology, USA Prof. Pietro Tierno, University of Barcelona, Spain More Keynote speakers will be announced soon. Deadlines Early bird submission - Up to March 8, 2019 First notification to authors - March 29, 2019 Early bird registration - Up to April 19, 2019 Regular submission - Up to May 17, 2019 Final notification to authors - May 31, 2019 Regular registration - Up to June 19, 2019 Conference - July 8-12, 2019","date_start":"2019-07-08","date_end":"2019-07-12","important_dates":{"abstract":"","full":"2019-05-17","notification":"","final":""},"topics":["Physical Science & Math","Chemistry"],"location":{"virtual":"","full":["Paris","France"],"name":"","street":"","city":"Paris","state":"","ZIP":"","country":"France"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}