{"name":"European Studies Symposium at Kennesaw State","series":"","short":"","website":"https://sites.google.com/view/ksueust","content":"It is a pleasure to announce the 2018 Annual Symposium of Kennesaw State University's European Studies Program on September 17 - 18\\. The European Studies program at KSU is interdisciplinary and its goals are to expand knowledge of Europe and its cultures; to encourage students to study a broad range of topics; and to help them embrace a spirit of engaged inquiry at KSU and after graduation. It offers a minor that emphasizes critical thinking skills while encouraging the crossing of national and disciplinary boundaries. EUST faculty also organize an annual study abroad experience, \"Discover the Heart of Europe.\" The theme of our 2018 Symposium will be \"Europe: Communities in Contact.\" The organizing committee welcomes student-focused sessions in a variety of formats whose topics may include, but are not limited to: \\* Intercultural communication and transcultural competence \\* European literatures \\* Transatlantic issues \\* Brexit and what it means for students \\* European arts and fashions \\* Travel and study abroad \\* Employment opportunities and tips \\* European identity \\* Immigration in/to Europe Please send a 100 - 300-word abstract to nmclaugh@kennesaw.edu. Priority will be given to proposals that are interdisciplinary and interactive in nature. We will accept both full panels and individual proposals and team-taught sessions are highly recommended. The deadline for submissions is Friday, April 13, 2018\\. Successful proposals will be notified of acceptance by Friday, June 15, 2018.","date_start":"2018-09-17","date_end":"2018-09-18","important_dates":{"abstract":"","full":"2018-04-13","notification":"","final":""},"topics":["Arts & Humanities","Other","interdisciplinary"],"location":{"virtual":"","full":["Kennesaw","Georgia","United States"],"name":"","street":"","city":"Kennesaw","state":"Georgia","ZIP":"","country":"United States"},"organizers":["Kennesaw State University European Studies Program"],"societies":[],"indexes":[],"emails":["nmclaugh@kennesaw.edu"]}