{"name":"Fast, Slow & Reverse. Faces of Contemporary Film Narration","series":"","short":"","website":"https://fastslowreverse.wordpress.com","content":"Richness of contemporary cinema is perhaps most clearly visible in the diversity of forms and means of film narration. Dynamic transformations in this field apply both to mainstream cinema and to its alternatives: independent cinema, art-house cinema and various types of avant-garde. These two big currents of contemporary cinema interrelate, influencing but at the same time sharply opposing each other. The two extreme wings are the post-narrative Hollywood cinema of attractions on the one hand, and the atmospheric slow cinema, the most recent favourite of film festival audience, on the other. Just as contemporary film narration spans a rich field between two extremes, likewise the conference devoted to it will take place at two ends of Poland, forming a symbolic bridge between various phenomena and theoretical stances. The conference, organized jointly by University of Gdańsk, Nadbałtyckie Centrum Kultury and Jagiellonian University in Kraków, will take a shape of an unusual, two-part symposium, held in one week of May in Gdańsk and Kraków. First two days in Gdańsk (24th – 25th May) will be devoted to mainstream cinema of “fast” denomination. On the third day (26th May), the participants will travel to Kraków, where they will debate on the narration of art-house cinema, of slow kind and beyond. A detailed description of each part below: Part I: Gdańsk, 24th – 25th May, 2017 Mainstream Cinema – Change or Continuation? Over the last couple of years, the question of a fundamental change within narrative cinema has been hotly debated. As the film technology has undergone a profound change, digital recording replaced photographical, analogue techniques, and computer-generated imagery competes with traditional film technologies. Also the conditions of film viewing have changed, since the proliferation of digital formats made home (and mobile) watching more ubiquitous than ever. As a consequence, a contemporary film viewer differs significantly from his/her predecessor of the classical era. S/he can decide what, where and when s/he watches, and some people even claim that s/he is more active, rational and percipient than ever before. Many film researchers demonstrate how these overall changes go in hand with transformations of mainstream cinema narration. They have proclaimed an era of postclassical cinema in which norms of classical cinema are not in effect any more. Contemporary films don’t have to be fluid, observe the rules of continuity and be “excessively obvious”, and a contemporary viewer is not so strongly inclined to follow a story, preferring rather to seek attractions and visual spectacle. Other phenomena have also been pointed out, such as the rapid development of so called “puzzle films”, intertextuality, enhanced role of world-making, achieved both by means of set-designing and digital effects, more complex characters, development of alternative structures, like forking narratives or network narratives or multiple character films. Their proliferation and diversity attest to the view that the classical norms have ceased to apply to contemporary cinema. Not everybody agrees with that view, though. The opponents point out that almost all features that are ascribed to the new cinema were well known in the classical period, perhaps only in different proportions. The undoubted versatility of contemporary films notwithstanding, they all observe the rules that have been forged in the third and fourth decade of the 20th century, that is, in the dawn of the classical era. Who is right and who is wrong in this argument? Our conference’s aim is to describe transformations within mainstream cinema, compare them to the classical norms, and on this basis attempt to find the place of contemporary cinema on the classical/post-classical axis. The suggested topics are: - The viewer of contemporary cinema - The notion of mainstream cinema - The genre of puzzle films - Transformations of time and space in contemporary mainstream cinema - Intertextuality in mainstream cinema - Computer games and cinematic narrative structures - Network narratives and parallel worlds in contemporary mainstream cinema - Blind chances and coincidences - Paranoid narratives and unreliable narrators - Flawed heroes: characters in contemporary mainstream cinema. Part II: Kraków, 27th – 28th May, 2017 Art-house Cinema – Alternative Paths of Narration David Bordwell has consistently pointed out that if the borderline between mainstream cinema and so called art-house or independent cinema exists at all, it is marked off by a different use of film narration. Even though post-classical Hollywood cinema seeking new means of narration eagerly assimilates some forms and devices successfully tested on the ground of art and experimental cinema, it seems that the gap between mainstream and art cinema is now bigger than ever. Such trends as slack and contemplative slow cinema (labelled as “neomodernist” in Poland), somewhat akin to it atmospheric ambient cinema, branching off from the story line, opting for the “visual stains” instead, and diverse forms of intermediality and newmediality, which combine typical cinematic forms of expression with the ones derived from the visual arts – all of them in one way or another challenge the very notion of mass cinema. Their basic tools for undermining the formulas of mainstream cinema belong to the sphere of narration: unusual ordering of the story, derangement of dramaturgical rules, refined techniques of subjectivity, idiosyncratic transformations of time and space continuity, or emphasizing of means of expression at the cost of the story. All these features have become the trademarks of contemporary art-house cinema. Radical aesthetic choices and alternate narrative forms ensuing from them wouldn’t be possible, though, without a particular situation of contemporary filmmakers, in many cases the benefactors of art-house cinema institutional background and of new possibilities opened up by the digital revolution. Thus the economical, technological and political context cannot be neglected even when focusing on seemingly textual category of film narration. In the “Cracovian” part of our conference, devoted to narrative forms specific to contemporary art-house cinema, we would like to develop all the above mentioned topics and reflect on the wider dimension of analyzed narrative practices. We welcome abstracts which explore the following (and other relevant to the topic) questions: - Historical development of art-house cinema narrative patterns - Alternative narrative strategies: slow cinema, ambient cinema, “film-art” - Parametric narration in contemporary cinema - Reception strategies towards slow cinema films - Quantitative methods in narratology (average shot length, narrative schemas, big data, etc.) - Modern narratology and art-house cinema - Combinations of fiction and non-fiction in contemporary art-house cinema - Clear-cut authorial strategies versus historical aesthetic trends and schools - New media influences on contemporary art-house cinema - Cinema beyond cinema: art-house cinema narration and other artistic practices: installations, video-art, etc. - New forms of narration and sphere of production: technology, distribution, freedom of expression. The conference will be held in English. Envisaged talk length – 20 minutes for individual speaker or 1 hour for pre-constituted panels of up to four thematically related presentations. Abstracts of max. 250 words for individual submissions and max. 500 words for pre-constituted panels (including information on all the individual papers), together with short bio of the speaker (including academic affiliation and contact details) should be sent to the following e-mail: fastslowreverse@gmail.com Deadline is 26th February, 2017\\. Authors will be notified about the selection outcome no later than on 19th March, 2017\\. Please contact us in case of other questions: fastslowreverse@gmail.com After the conference, authors of selected papers will be invited to participate in a hard copy publication in English. Conference fee is 100 EUR, 450 PLN or 120 USD. All necessary payment details will be provided for accepted speakers. The fee includes a train ticket from Gdańsk to Kraków on 25th May and catering (lunches and coffee breaks).","date_start":"2017-05-24","date_end":"2017-05-28","important_dates":{"abstract":"","full":"2017-02-26","notification":"","final":""},"topics":["Arts & Humanities","Visual Arts","Film & Cinema"],"location":{"virtual":"","full":["Gdańsk//Kraków","Poland"],"name":"","street":"","city":"Gdańsk//Kraków","state":"","ZIP":"","country":"Poland"},"organizers":["University of Gdańsk, Jagiellonian University, Nadbałtyckie Centrum Kultury"],"societies":[],"indexes":[],"emails":["fastslowreverse@gmail.com"]}