{"name":"Asia-Singapore Conference on Sport Science","series":"","short":"ACSS 2019","website":"https://acss.ear.com.sg","content":"sia-Singapore Conference on Sport Science (ACSS 2019), themed “A Multidisciplinary Approach to Enhance Sport Performance”, the two-day Conference will offer participants the opportunity to learn about the latest trends and best practices in the world of Sport Science. Leading academic scientists, researchers and research scholars will attend to exchange and share their experiences and research results on all aspects of Sport Science. We encourage research papers and training approaches based on integrating different disciplines applied in Sport Science to enhance sport performance to be submitted to the conference. Expect presentations on the most recent innovations, trends, and concerns, as well as practical challenges encountered and solutions adopted in the fields of Sport Science. Join us for this exciting Conference in Singapore from 18th to 19th July 2019 at the Grand Copthorne Waterfront. Special theme for ACSS: ‘A Multidisciplinary Approach to Enhance Sport Performance’ We welcome all papers on the topic of Sport Science to be presented at ACSS 2019\\. What can you expect at ACSS 2019? • Ample interaction opportunities for ACSS delegates • Top Singapore hospitality for all attending delegates • An intellectually stimulating scientific program featuring more than 100 presentations by leading researchers, teachers, and practitioners • An opportunity for East-West science and practice collaborations at ACSS","date_start":"2019-07-18","date_end":"2019-07-19","important_dates":{"abstract":"","full":"2019-03-21","notification":"","final":""},"topics":["Medicine & Health","Other","sport science"],"location":{"virtual":"","full":["singapore city","Singapore"],"name":"","street":"","city":"singapore city","state":"","ZIP":"","country":"Singapore"},"organizers":["East Asia Research & Charles Darwin University"],"societies":[],"indexes":[],"emails":[]}