{"name":"The International Science and Technology Conference «Modern Network Technologies - 2018»","series":"","short":"","website":"http://monetec.ru/en","content":"The 2nd International Science and Technology Conference «Modern Network Technologies, MoNeTec - 2018» gathers representatives of the international scientific community, research departments of corporations, start-ups, representatives of industry and business, development institutions, and public authorities to discuss promising and relevant technologies in the field of computer networks, virtualization of network resources, and cloud computing. SDN (Software-Defined Networking) and NFV (Network Function Virtualization) are key technologies used to build modern computer networks and information infrastructures in general. Now, these technologies are used in practice in the World, including Russia. Nevertheless, many problems for research, development and practical application still remain. The Conference will also include the School for young scientists, senior students and postgraduates on the application of Russian solutions on the basis of SDN and NFV. Issues of modern computer networks 1\\. Algorithms, protocols and applications for wired and wireless communications. 2\\. Software-Defined Network monitoring and analysis. 3\\. SDN&NFV solutions architecture: effective network devices design (switches, routers), hardware network acceleration, distributed control plane, software-defined data plane. 4\\. Theory of SDN&NFV technologies. 5\\. Software-Defined infrastructure security. 6\\. SDN architecture for telecoms and enterprise networks. 7\\. Architectures for SDN control plane. 8\\. Optimized data transmission (transport protocols, route management, load balancing). 9\\. Control plane programming (libraries and applications) and customization of control plane, programmable control plane. 10\\. Novel offload and acceleration techniques to support SDN operations (e.g. using smart NICs, switch dev, FPGA and kernel or network stack bypass). 11\\. Performance and reliability issues, Service Level Agreement and QoS guarantees in the network layer. Service virtualization in SDN networks 1\\. Network function virtualization infrastructures. 2\\. Virtual services management in SDN networks. 3\\. Management and orchestration of virtualized services in SDN. 4\\. SDN&NFV in control of traffic processing stream: dynamic service chaining, orchestration policies, machine learning algorithms for service adaptation and state monitoring, reliability and automatic recovery issues etc. 5\\. Architectures, methods and tools for dynamic deployment of network services. Application of modern network technologies 1\\. SDN&NFV use-cases (SD-Wan, IoT, Smart cities, home, wireless, cellular, enterprise, data-center, backbone, and content distribution networks etc.). 2\\. Modern network technologies in real-time systems. Issues of cloud computations 1\\. Cloud computation architecture. 2\\. SDN solutions for Cloud computations (SDN in DC, inter-DC SDN). 3\\. Management and orchestration of cloud computations. 4\\. Cloud computations security. 5\\. Performance, scalability and reliability in cloud computing. 6\\. Cloud computing in the heterogeneous environment based on micro data centers. Application of cloud computing 1\\. Cloud computing: application and best practices. 2\\. Cloud computations as-a-service. 3\\. Cloud computing and bigdata. 4\\. Cloud computing economics. New economic models and environments based on SDN&NFV. ORGANIZERS AND SPONSORS • Lomonosov Moscow State University (MSU) (www.msu.ru) • Applied Research Center for Computer Networks (ARCCN) (www.arccn.ru) • Ryazan State Radioengineering University (http://www.rsreu.ru) • The Skolkovo Institute of Science and Technology (Skoltech) (www.skoltech.ru) • Innopolis University (http://www.innopolis.ru/) • National Research University \"Moscow Power Engineering Institute\" (http://www.mpei.ru/) PAPERS SUBMISSION The conference paper should present an original research result, which is not published before. The detailed requirements to papers and submission procedure will be published on the Conference site. Papers should be submitted through EasyChair system, the link will appear on the Conference site soon. The paper should not exceed 12 pages. Papers should follow the IEEE A4 template: http://www.ieee.org/conferences\\_events/conferences/publishing/templates.html . POSTER SESSION Presenting a poster is a good opportunity to get feedback on you (probably ongoing) work from experienced members of the scientific community. The place for a poster is 85x110 cm in size. For posters selection, the author should submit the poster abstract (pdf, 2 pages, in English). A poster abstract should contain the problem formulation, descrption of its impostance and nontriviality, the current results. Submitting is done as a regular paper, but please select «Poster abstract» in the «Category» field. SDN & NFV TUTORIAL The SDN&NFV tutorial will be organized before the conference, on Oct 24, 2018\\. The aim of this tutorial is to introduce these technologies, to show their advantages and to practice the features of Russian SDN controller RUMOS and MANO cloud platform C2\\. The registration link is available at the Conference site. The number of attendees is limited. IMPORTANT DATES 1\\. Full papers due July20, 2018.- prolonged! 2\\. Poster abstracts due Aug 31, 2018\\. 3\\. Review results due Sep 05, 2018\\. 4\\. Final paper due Sep 20, 2018\\. GENERAL INFO - Official language of the Conference is English. - Application for IEEE technical sponsorship is submitted, for publication of proceedings in the IEEE Xplore digital library. - Conference dates are October 25-26, 2018; venue is Skolkovo Institute of Science and Technology. - Visa support info will be published later.","date_start":"2018-10-25","date_end":"2018-10-26","important_dates":{"abstract":"","full":"2018-07-20","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Computer network systems"],"location":{"virtual":"","full":["Moscow","Russian Federation"],"name":"","street":"","city":"Moscow","state":"","ZIP":"","country":"Russian Federation"},"organizers":["Applied Research Center for Computer Networks (ARCCN)"],"societies":[],"indexes":[],"emails":[]}