{"name":"5th Annual Drug Discovery USA Congress 2018","series":"","short":"","website":"https://www.oxfordglobal.co.uk/discoveryusa-congress/download-agenda","content":"Join Oxford Global’s 5th Annual Drug Discovery USA Congress taking place on the 11-12 October 2018 in San Diego. Across the two days, over 40 expert speakers will provide you with insights into the latest technological innovations and strategic approaches in drug discovery and drug chemistry. View Agenda: https://bit.ly/2MIXuM8 The American biopharmaceutical research sector has been a world leader in the development of new medicines over the past 30 years and it continues to drive biopharmaceutical innovation. Our conference delivers an extensive look across the development process: from drug discovery innovation and strategies to computational chemistry and informatics for drug design. The conference will feature over 40 presentations from leading heads of the pharmaceutical industry and ensures you will benefit from the latest case studies and high level scientific debate. Topic discussion ranges across the latest validation and optimisation strategies in neuroscience, cardiology and oncology. Further talks look at approaches to phenotypic and genomic drug discovery design, as well as novel approaches to drug design: AI-based design, DNA Encoded Libraries and protein-protein interactions. Includes 4 Streams: • Day 1 Stream 1: Drug Discovery Innovation and Strategies • Day 2 Stream 1: Phenotypic and Genomic Drug Discovery • Day 1 Stream 2: Computational Chemistry and Informatics for Drug Discovery • Day 2 Stream 2: o Part 1: Novel Approaches to Drug Design o Part 2: DNA Encoded Libraries For more information contact g.alonso@oxfordglobal.co.uk or join the congress conversation on Twitter @DrugDiscoveryUS or our LinkedIn Group: Drug Discovery & Development Network","date_start":"2018-10-11","date_end":"2018-10-12","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Life Sciences","Biotechnology/ Bioinformatics"],"location":{"virtual":"","full":["San Diego","United Kingdom"],"name":"","street":"","city":"San Diego","state":"","ZIP":"","country":"United Kingdom"},"organizers":[""],"societies":[],"indexes":[],"emails":["g.alonso@oxfordglobal.co.uk"]}