{"name":"International Journal on Cloud Computing: Services and Architecture","series":"","short":"IJCCSA","website":"http://airccse.org/journal/ijccsa/index.html","content":"International Journal on Cloud Computing: Services and Architecture (IJCCSA) ISSN : 2231 - 5853 \\[Online\\] ; 2231 - 6663 \\[Print\\] http://airccse.org/journal/ijccsa/index.html Call for papers Cloud computing helps enterprises transform business and technology. Companies have begun to look for solutions that would help reduce their infrastructures costs and improve profitability. Cloud computing is becoming a foundation for benefits well beyond IT cost savings. Yet, many business leaders are concerned about cloud security, privacy, availability, and data protection. To discuss and address these issues, we invite researchers who focus on cloud computing to shed more light on this emerging field. This peer-reviewed open access Journal aims to bring together researchers and practitioners in all security aspects of cloud-centric and outsourced computing. Topics of interest include, but are not limited to, the following: Cloud Application, Infrastructure and platforms Design Tool for Cloud Computing Cloud Business Service-Oriented Architecture in Cloud Computing Cloud based, Parallel Processing Virtualization on Platforms in the Cloud Location Based Services, Presence, Availability, and Locality Mobile Clouds for new millennium, mobile devices Social Clouds (Social Networks in the Cloud) Maintenance and Management of Cloud Computing Cloud Computing Architecture Cloud Applications in Vertical Industries Cloud storage and file systems Networks within cloud systems, the storage area, and to the outside Virtualization in the context of cloud computing platforms System integration, virtual compute clusters Consolidation NoSQL data stores Performance, SLA management and enforcement Resource provisioning Security techniques for the Cloud Energy management and programming environments Data storage and management in Cloud computing Case Studies and Theories in Cloud Computing The Open Cloud: Cloud Computing and open source Paper Submission Authors are invited to submit papers for this journal through E-mail : ijccsajournal@airccse.org. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this Journal. Important Dates Submission Deadline : May 06, 2018 Notification : JUne 06, 2018 Final Manuscript Due : June 14, 2018 Publication Date : Determined by the Editor-in-Chief","date_start":"2018-06-14","date_end":"2018-06-16","important_dates":{"abstract":"","full":"2018-05-06","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","cloud storage & computing"],"location":{"virtual":"","full":["Australia"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":["ijccsa"],"societies":[],"indexes":[],"emails":["ijccsajournal@airccse.org"]}