{"name":"The Poetic Nuance in Literary Translation","series":"","short":"","website":"https://www.acla.org/poetic-nuance-literary-translation","content":"The task of translating a literary text often poses the challenge of choosing between content and form. This is, of course, conspicuous in the translation of poetry where meaning and form are indissoluble and constitute an organic whole. Prose translation can be equally exigent. Its narratological ingenuity and nuances in style demand not only verbal dexterity but also the ability to capture the magic concealed in the author’s imagery. In order to produce a version that is pertinent and meaningful to the modern reader, the translator of both poetry and prose takes certain liberties with regard to the source text but inevitably faces the challenge of fidelity to its original language and content. Hence, a question that arises in addressing the task of literary translation is whether its artistic nature should prevail over its scientific status or if a combination of the two can be viewed as the key solution to the problem of reconciliation between theoretical and practical premises. This question constitutes the starting point of our inquiry and invites further reflection on the status of the literary translator, the emergence of new paradigms and shifting viewpoints, the interchange between theory and practice, and the contribution of literary translation to the wider rapport between cultures. This seminar welcomes original approaches with regard to the translation of poetry and prose. Theoretical considerations and/or practical case studies can focus on either a descriptive, target-oriented, functional and systemic analysis of literary translation (Gideon Toury 1985; Dilek Dizdar 2009) or towards a normative, source-text oriented, linguistic and atomistic standpoint (Heidrun Gerzymisch-Arbogast 2006). Other possible approaches can examine the social constraints that condition the reception of literary translation (Gisele Sapiro 2008), the enunciatory process of cultural translation and its relation to the concept of hybridity (Homi Bhabha 1994), the hermeneutic motion and the battle between literal and symbolic meaning (George Steiner 1975), the element of resistance and the irresolution of translation (Walter Benjamin 1921), the claim of aesthetic autonomy (Lawrence Venuti 2012), the ethical turn in translation studies (Mary Snell-Hornby 2006), and the place of translations both within a given literature and in the intersection between literatures (Theo Hermans 1985). Reflections on literary translation through the prism of philosophy, sociology, poetics, studies on the imaginary or any other related field are also welcome. Scholars at any stage of their research are invited to submit their abstracts (100-250 words) before the 21st of September 2017\\. Submissions for this panel should be sent via the convention’s website: https://www.acla.org/annual-meeting For further information you can contact the organizer: bezari.christina@gmail.com","date_start":"2018-03-29","date_end":"2018-04-01","important_dates":{"abstract":"","full":"2017-09-21","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","literature"],"location":{"virtual":"","full":["Los Angeles","California","United States"],"name":"","street":"","city":"Los Angeles","state":"California","ZIP":"","country":"United States"},"organizers":[""],"societies":[],"indexes":[],"emails":["bezari.christina@gmail.com"]}