{"name":"The eCommerce Design Summit 2019, London, 4th and 5th April","series":"","short":"","website":"https://go.evvnt.com/325572-0?pid=4868","content":"www.ecommercedesignsummit.com The aim of the eCommerce Design Summit is to create greater dialogue across this specialist design community; by bringing together some of the world's most innovative brands and industry leaders to share and discuss their approach to customer-centricity within digital commerce platforms. With the focus being on commerce, the event will also highlight the value that design offers a company's business perspective; such as showing how to optimise user journeys in order to increase conversions! With 10 hand-picked eCommerce specialists speaking each day, we will share: product strategy, selling 'experience' to your business, how to approach the delivery of omni-channel experiences for your customer base, the role of data in the design process, the impact of emerging technology on the current and future state of commerce, plus much more. Some of the speakers so far include: Vanessa Kirby (Head of UX at Marks and Spencer), Kevin Lee (Head of Design at Visa), Vicky Carroll (Product and Design Team Manager at Hostelworld Group) and many more big names soon to be announced. We're big advocates for the power of shared discussion in an open forum, so also embedded into the agenda are two 45 minute panel discussions; to debate the most pressing issues in digital commerce today. This conference will pull together 500 Product/Experience/Design practitioners across two days. No matter the size of the company; if you are interested in understanding how some of the most successful brands approach the design of their eCommerce platforms, come along! Hosted at the stunning Cavendish Conference Centre, with plenty of networking breaks and a networking after-party, plus video access to all talks post-event; don't miss out on the world's only eCommerce conference full of \"take home\" content to help inspire the progression of your eCommerce Design. We are currently in SUPER DUPER early bird stage, so grab your tickets now at the best possible offer. URLs: Twitter: https://go.evvnt.com/325572-2?pid=4868 Tickets: https://go.evvnt.com/325572-3?pid=4868 Time: 09:00 to 18:00 Venue details: Cavendish Conference Centre, 22 Duchess Mews, Greater London, W1G 9DT, United Kingdom Prices: Super early bird one-day: GBP 200.0, Super early bird two-day: GBP 375.0 Speakers: Vanessa Kirby - Head of UX @ Marks and Spencer, Kevin Lee - Head of Design @ Visa, Mel McVeigh - Product and UX Director @ Opposite Days, Greg Tariff - Senior Manager of Product Design @ Groupon, Caroline Wiryadinata - Design Manager @ OpenTable, Vicky Carroll - Product and Design Team Manager @ Hostelworld Group, Supriyo Roy - Product Design Manager @ FLIPKART, Martyn Reding - Head of UX @ Virgin Atlantic, Yolanda Martin - Head of Platform Product Design @ Farfetch, Alex Tatner - Experience Design Lead @ TFL, Raymond Ho – Product Design Manager @ Zalando, (Many more big names soon to be announced!)","date_start":"2019-04-04","date_end":"2019-04-05","important_dates":{"abstract":"","full":"2019-04-03","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education, teaching"],"location":{"virtual":"","full":["Greater London","United Kingdom"],"name":"","street":"","city":"Greater London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Tech Circus"],"societies":[],"indexes":[],"emails":[]}