{"name":"THE BEST IN HERITAGE","series":"","short":"","website":"https://www.thebestinheritage.com/conference","content":"As a result of the long and devoted work of dozens of experts and professional juries, more than 40 major award schemes from around the world announced some 300 prize-winning museum, heritage and conservation projects in 2016\\. At The Best in Heritage conference, the featured, handpicked selection of the most innovative and inspiring candidates from this accumulation of quality will represent a balanced variety of best practices. The gathering will consist of two events: IMAGINES, a one day event where multimedia and new technology achievements will be presented; and the core event, with its packed two-day schedule. Over 40 projects from China, the United States, Japan, India, Australia, New Zealand, Canada, Russia and Europe will be presented. The conference is a rare international platform where official, private and civil society institutions & actions meet. The audience, moderators-judges, and the keynote speakers will vote for “The Project of Influence 2017”, for each part of the programme. The two representatives of the winning projects will have the privilege of delivering the key-note speeches at the 2018 conference, and will be invited to present their institutions projects at the EXPONATEC fair in Cologne, in November 2017\\. In addition to its global survey of best practices, the conference features rich social and cultural content organised with help of Dubrovnik Museums, Dubrovnik Archives, - all taking place in the Renaissance city centre of Dubrovnik, a UNESCO World Heritage Site. The dinner-receptions, all located in the historic palaces, will provide an inspiring and relaxed atmosphere, ideal for networking, discussing potential collaborations and getting to know prize-winning professionals in person. The conference is organised in partnership with EUROPA NOSTRA & the Endowment Fund of ICOM, with the local partnership of Dubrovnik Museums, the support of the City of Dubrovnik and Ministry of Culture of Croatia, and with sponsorship from Meyvaert Glass Engineering.","date_start":"2017-09-28","date_end":"2017-09-30","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Arts & Humanities","History"],"location":{"virtual":"","full":["Dubrovnik","Croatia"],"name":"","street":"","city":"Dubrovnik","state":"","ZIP":"","country":"Croatia"},"organizers":["EUROPA NOSTRA, ICOM, City of Dubrovnik, Ministry of Culture, Meyvaert Glass Engineering"],"societies":[],"indexes":[],"emails":[]}