{"name":"International Conference On Nanomedicine And Nanobiotechnology","series":"","short":"","website":"http://premc.org/conferences/iconan-nanomedicine-nanobiotechnology","content":"The International Conference On Nanomedicine And Nanobiotechnology is an annual event that hosts high-profile plenary speakers, world-class researchers, oral and poster presentations, workshops, sponsor exhibits and afterworks. It is a great opportunity to share your research findings with a wide audience, promote knowledge exchange, and network. TOPICS: Targeted drug delivery, organ biodistribution and nanocarriers Nanomedicine for immune system and cancer diagnosis & therapy Biological & medical nanodevices and biosensors 3D models, tissue engineering and regenerative nanomedicine Toxicology and risk assessment of nanomedicine systems Nano-Imaging for diagnosis, therapy and delivery in preclinical and clinical fields Nano and microsystems for artificial biology and biocatalysis Nanotechnology and translational medicine: from the bench to the bedside PLENARY SPEAKERS: Prof. Margherita Morpurgo, Padova University, Italy Dr. Paolo Bigini, Mario Negri Institute for Pharmacological Research, Italy Prof. Vicki Stone, Heriot-Watt University, UK Prof. Rainer Haag, Institut für Chemie und Biochemie, Freie Universität Berlin, Germany Anton Ussi, EATRIS, Netherlands Prof. Sophia Antimisiaris, Institute of Chemical Engineering FORTH/ICE-HT & University of Patras, Greece Prof. Francesco Stellacci, EPFL, Switzerland Prof. Luisa De Cola, University of Strasbourg, France Prof. Silvio Aime, University of Turin, Italy Prof. Rabah Boukherroub, Lille 1 University, France Dr. Xiaoyuan Chen, National Institute of Biomedical Imaging and Bioengineering (NIBIB), NIH, U.S.A. Prof. Albert Van Den Berg, University of Twente, The Netherlands","date_start":"2018-09-26","date_end":"2018-09-28","important_dates":{"abstract":"","full":"2018-06-27","notification":"","final":""},"topics":["Life Sciences","Biotechnology/ Bioinformatics"],"location":{"virtual":"","full":["Rome","Italy"],"name":"","street":"","city":"Rome","state":"","ZIP":"","country":"Italy"},"organizers":["PremC"],"societies":[],"indexes":[],"emails":[]}