{"name":"5th IARS International Conference: Youth-led solutions to Unemployment: The voices of young marginalised carers","series":"","short":"","website":"http://www.iars.org.uk/content/5thconference_youngcarers","content":"The IARS International Institute is pleased to announce its 5th Annual International Conference titled “Youth-led solutions to unemployment: The voices of young, marginalised carers” that will be held on the 27th April 2017 (9:00 – 16:00) at the Honourable Society of the Middle Temple, Middle Temple Lane, London EC4Y 9AT, UK. Persistent social inequalities and exclusion continue to perpetuate unequal access to labour markets and education for young people. Focusing on young carers, one of the most marginalised groups in Europe, this international event will explore youth-led solutions to unemployment with the ultimate objective of bringing barriers down and informing international policy and practice. Bringing together policy makers, practitioners, young people, researchers, academics and employers from across Europe, the conference will present cutting edge research and debate youth-led initiatives in the UK and other European countries. The conference proceedings will contribute to reforms required to better support young people into work, training and further education home and abroad. The conference is organised within the framework of Erasmus+ (KA2) and will draw from the research findings of the 2-year youth-led project Care2Work that explored the needs, challenges and opportunities of young BAME carers in their transition to responsible adulthood and their fair access to employment, education and training. The project is delivered in 4 European countries by Anziani e Non Solo (Italy), Linnaeus University (Sweden), KMOP (Greece) and is coordinated by the IARS International Institute.","date_start":"2017-04-27","date_end":"","important_dates":{"abstract":"","full":"2017-04-27","notification":"","final":""},"topics":["Social Sciences","Other","Education, teaching"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Erasmus+"],"societies":[],"indexes":[],"emails":[]}