{"name":"CCP CLEARING, RISK MANAGEMENT, RECOVERY AND RESOLUTION","series":"","short":"","website":"https://www.storm-7.com","content":"This new and unique two day conference will provide delegates with a comprehensive understanding of central counterparty (CCP) clearing models and operational frameworks in the European Union (EU). Delegates will receive in depth instruction on the EU CCP regulatory framework governed by the European Securities and Markets Authority (ESMA) and the European Market Infrastructure Regulation (EMIR). Delegates will be able to practically compare a range of key issues affecting CCP offerings in the EU. The course will also provide deep coverage of margining practices, clearing models and agreements, operational risks, and risk management frameworks affecting CCPs. Finally, delegates will be guided through the intricacies of effective CCP Recovery and Resolution Plans, and CCP Default Management, Recovery and Continuity Frameworks. Day 1 SESSION 1: The Central Counterparty (CCP) Clearing Model An Overview of the CCP Clearing Model (Functional Definition; CCP Ownership; CCP Advantages and Disadvantages; Novation; Cleared Products; Margining; Multilateral Netting; Risk and Default; Loss Mutualisation; Auctions; Portability). CCP Regulation v. 'Too Big To Fail'. Case Study: LCH.Clearnet Swapclear‎. SESSION 2: The EU CCP Regulatory Framework ESMA and CCP authorisation, recognition and supervision in the EU. CCP operating, clearing and reporting obligations under the EMIR framework. CCP Cleared Products, Reporting, Interoperability, Third Country CCPs. Basel III capital treatment/risk weightings for Qualifying and Non-Qualifying CCPs. SESSION 3: CCP Clearing Models and Agreements (Direct and Indirect) CCP and Client Clearing Documentation and common negotiated provisions (Margin, Termination Events, Pre-Default Porting). Customer clearing under modified Master Agreements. An Overview of ISDA® Clearing Agreements and Addendums (EU ISDA/FIA Cleared Derivatives Execution Agreement + Addendum). SESSION 4: Designing Effective CCP Default Management, Recovery and Continuity Frameworks The 2012 CPMI-IOSCO Principles for Financial Market Infrastructure. The ISDA® Principles for CCP Recovery and CCP Default Management, Recovery and Continuity. Developing new Total Loss Absorbing Capacity (TLAC) or bail-inable debt standards for CCPs. Developing Standardised Regulatory Stress Testing and Disclosure. Day 2 WORKSHOP 1: CCP Operational Risks Default risks: CCP Member default, Distress, or Resignations; Failed Auctions, Reputational. Non-default loss events: Fraud, Operational risk, Investment Risk, Legal risk, Model risk, Liquidity risk. WORKSHOP 2: CCP Risk Management Frameworks Membership Requirements, Transparency, Margin Methodology, Stress Testing, Risk Policy Issues, MiFID II Open Access. Mutualised Default Funds, Default Waterfall, Default Fund Margin, Skin in the Game, and Rights of Assessment. Recovery Tools (Default and Non-Default Losses). WORKSHOP 3: CCP Margining Practices CCP Margining Risks, Initial and Variation Margin, Interest Rates, Haircuts and Cross-Margining. CCP Margin Methodologies. Margin Segregation (omnibus, individual, legal segregation with operational commingling (LSOC)) and Re-hypothecation. EU two-day net margin v. U.S. one-day gross margin. WORKSHOP 4: CCP Recovery and Resolutions Plans Resilience Incentives, Initial and Variation Margin Haircuts. CCP Points of Non-Viability, Emergency Liquidity Arrangements, Auction Participation, Continuity of Service. CCP Resolution Powers, Loss Allocation Arrangements, and CCP Default Management Process. Cross-Border Cooperation and Coordination with Regulatory Authorities. Price: £1800.00","date_start":"2018-07-11","date_end":"2018-07-12","important_dates":{"abstract":"","full":"2018-06-27","notification":"","final":""},"topics":["Business","Finance"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Storm-7 Consulting"],"societies":[],"indexes":[],"emails":[]}