{"name":"The Future of Nonviolence","series":"","short":"","website":"https://www.ashland.edu/cas/ashland-center-nonviolence","content":"The Future of Nonviolence Multi-disciplinary conference will be held Saturday, February 23, 2019 on the campus of Ashland University in Ashland, Ohio Call for Papers Proposals Due November 10, 2018 The theory and practice of nonviolence includes a wide variety of philosophies, theologies, practices, and strategies. What does the future hold for these? Are the past successes of nonviolent movements adequately remembered and celebrated? Do they inspire fresh commitments and strategies? What do recent advances, realizations, and discoveries in all disciplines mean for reducing violent conflict, achieving nonviolent social change, and bringing about a just peace for more people and communities? What threats do present geopolitical realities pose to these prospects? What are the most relevant and enduring sources of nonviolence, both philosophically and historically? Have some forms of nonviolence become outmoded, unworkworkable, unwise, or untrue? Where does belief in and felicity with nonviolence need to be renewed? Historically, how have people’s commitment to nonviolence been revitalized? The goal of this one day conference is to address questions such as these by considering the future of nonviolence. In order to enhance the discussion, we are seeking presentations from a variety of academic disciplines. Both theoretical and practical considerations are welcome. Possible topics for individual papers and panels might include (but are not limited to): Struggles for civil rights and other human rights Nonviolence and specific moral issues such as capital (and other) punishment, suicide, war, abortion, immigration, euthanasia, health care, the economy, race, gender, and sexuality Philosophies of nonviolence and/or the key figures who have advanced them Historical evaluations of nonviolent tactics being used and/or important leaders and advocates in nonviolent movements in light of present-day struggles Philosophies of nonviolence and/or the key figures who have advanced them Religious, spiritual, or theological perspectives Histories of development and debate over the meaning and purpose of nonviolence, especially with a focus on change Sociological or political case studies Ethical debates about the moral meaning and purpose of nonviolence Nonviolence in the workplace and at home Nonviolence as a personal or communal virtue and how it is developed Practical training / workshop Abstracts of no more than 300 words should be submitted using the online submission form no later than November 10, 2018\\. Presenters should plan on a 35-minute paper or presentation with an additional 10 minutes for questions and discussion. We also welcome panel proposals. Presenters are welcome to engage in technical and academic debates, but they should avoid jargon and be aware that the conference audience will be diverse, including scholars from multiple disciplines, practitioners from many fields, students from various backgrounds, and community members. For questions, please contact Kim Chartier at kchartie@ashland.edu or (419)289-5313\\. Ashland Center for Nonviolence http://acn.nationbuilder.com/","date_start":"2019-02-23","date_end":"","important_dates":{"abstract":"","full":"2018-11-10","notification":"","final":""},"topics":["Education / Legal / Other","Other"],"location":{"virtual":"","full":["Ashland","United States"],"name":"","street":"","city":"Ashland","state":"","ZIP":"","country":"United States"},"organizers":["Ashland Center for Nonviolence"],"societies":[],"indexes":[],"emails":["kchartie@ashland.edu"]}