{"name":"“Pilgrimages and Tourism” International Conference","series":"","short":"","website":"http://tourism.lcir.co.uk","content":"Pilgrimages are ancient practices of humankind and are associated with a great variety of religious, spiritual and secular traditions. In today’s world the number of visits to sacred sites such as Santiago de Compostela (Spain), La Virgen de Guadalupe (Mexico), Matka Boska Czetochowska (Poland), secular places such as Graceland, home of Elvis Presley, Eifel Tower in Paris, Hiroshima Peace Museum and virtual pilgrimages, facilitated by video and satellite links is growing. With them, tourism both individual and in groups has been steadily increasing and changing. This conference seeks to explore, analyse and discuss the complex concepts of pilgrimages and tourism. What is a pilgrimage? Do pilgrimages contribute to the sense of community and belonging? Is tourism a transformative experience? How do souvenirs, memorabilia and travelogues facilitate imagination of other people and places? Conference presentations will be related, but not limited, to: History of pilgrimages and tourism Geography of pilgrimage and tourism Pilgrimages, tourism and religion Pilgrimages and theology Pilgrimages, tourism and philosophy Pilgrimages, tourism and literature Pilgrimages, tourism and media Pilgrimages, tourism and art Pilgrimages, tourism and economy Pilgrimages, tourism and politics Pilgrimages, tourism and culture Teaching tourism and pilgrimages The conference will bring together scholars from different fields including philosophy, religion, theology, sociology, anthropology, history, literature, art, economy, geography, cultural studies, political studies and others. Submissions may propose various formats, including: \\*Individually submitted papers (organised into panels by committee) \\* Panels (3-4 individual papers) \\* Roundtable discussions (led by one of the presenters) \\* Posters Proposals up to 250 words and a brief biographical note should be sent by 15 February, 2019 to: tourism@lcir.co.uk Download Paper proposal form: http://tourism.lcir.co.uk/ Selected papers will be published in the post-conference volume. Standard registration fee – 220 GBP Student registration fee – 180 GBP Conference venue: Lucy Cavendish College - University of Cambridge Lady Margaret Road Cambridge CB3 0BU","date_start":"2019-06-15","date_end":"2019-06-16","important_dates":{"abstract":"","full":"2019-06-15","notification":"","final":""},"topics":["Education / Legal / Other","Sport/Leisure","Tourism and Hospitality"],"location":{"virtual":"","full":["Cambridge","United Kingdom"],"name":"","street":"","city":"Cambridge","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["tourism@lcir.co.uk"]}