{"name":"ITU Kaleidoscope 2017: Challenges for a data-driven society","series":"","short":"","website":"http://www.itu.int/en/ITU-T/academia/kaleidoscope/2017/Pages/default.aspx","content":"Kaleidoscope 2017: Challenges for a data-driven society is the ninth in a series of peer-reviewed academic conferences organized by ITU to bring together a wide range of views from universities, industry and research institutions. The aim of the Kaleidoscope conferences is to identify emerging developments in information and communication technologies (ICTs) and, in particular, areas in need of international standards to aid the healthy development of the Information Society. Objective Kaleidoscope 2017 calls for original academic papers that offer innovative and bold approaches relevant to technology, business and policy aspects of data management and analysis and encourage the development of applications and services building on data technologies to improve society. Audience Kaleidoscope 2017 targets specialists in the fields of ICT and socioeconomic development, including researchers, academics, students, engineers, policymakers, regulators, innovators and futurists. Theme More data have been produced over the last two years than over the entire previous history of humanity. The volume of data that networks transport continues to soar to previously unimaginable heights. Emerging technological developments, specifically smart applications (e.g. smart cities and the smart grid) and the Internet of Things (IoT), will further fuel this trend. This exponential growth and availability of data, along with enhanced collecting, processing and analytics capabilities, have opened up new frontiers in sustainable development. But globally accepted standards are needed to avoid the development of incompatible data silos and to establish a universal, shared and integrated data ecosystem that allows the deployment of the accumulated data in a highly secure environment, for the benefit of all. The questions that need to be answered in this context include, among many others: - Which technical challenges need to be overcome to encourage data portability, to share and aggregate data and to eventually enable interoperability of different data ecosystems? - What are the legal frameworks required to build a universal, shared and integrated data ecosystem? - What are the technological advances required to make sense of the immense volume of data available? - What type of standards are needed for the analysis of the data and the interpretation of results? - Are (telecommunication/ICT) standards organisations qualified to address the problems associated with data production, dissemination and storage? - What are the synergies, if any, between the industry’s view of data as a source of competitive advantage and the public sector’s view of data as a public good? - How can end-users receive equitable value in return for generating data? - How can standards and regulation protect individual users’ data across multiple organisational and geographic boundaries? How can trust be established in the provided level of protection? Submission of papers Prospective authors from ITU Member States are invited to submit full, original papers. The submission should be within eight pages, including a summary and references, using the template available on the event website.All papers will go through a double-blind peer-review process. Submission must be made electronically; see http://itu.int/go/K-2017 for more details on online submission (EDAS). Paper proposals will be evaluated according to content, originality, clarity, relevance to the conference’s theme and, in particular, significance to future standards. Publication and presentation Accepted and presented papers will be published in the Conference Proceedings. In addition, extended versions of selected papers will be considered for publication in the International Journal of Technology Marketing, the International Journal of Standardization Research, or the Journal of ICT Standardization. Suggested (non-exclusive) list of topics Track 1: Network infrastructure and architecture for data - Network architecture design, data-driven networking - Distributed systems, parallel and distributed computing - Cloud computing techniques for data management - Data in mobile and pervasive computing - Data migration and backup - Data synchronization - Access control - Trusted computing, network security and privacy - Network performance analysis - Requirements for data storage and exchange - Functional architecture for big data as a service (DaaS) - Requirements for data quality and provenance - Requirements for open data platforms - Wireless sensor and actuator networks - Energy efficient, sustainable power management Track 2: Data applications and services - Data retrieval, processing, analysis, and analytics - Data semantics, interoperability, search and mining - E-services - Internet of Things (IoT) - Data as a service (DaaS) - Data for industry, government and society - Data for smart sustainable cities - Data for research, science and technology Track 3: Social, economic, legal, policy and environmental aspects of standards for data access, use and management - Data standardization, policies and regulation - Legal aspects of standards and standardization - Standardization management and strategies - Data ownership models, open data licensing - Business models for data and open data - Inclusiveness, affordability and access to data - Security and privacy issues - Green, energy-efficient models and sustainability issues for data - Open data for education, research and public good Hosted by Nanjing University of Posts and Telecommunications, China.","date_start":"2017-11-27","date_end":"2017-11-29","important_dates":{"abstract":"","full":"2017-06-19","notification":"","final":""},"topics":["Engineering & Technology","Other"],"location":{"virtual":"","full":["Nanjing","China"],"name":"","street":"","city":"Nanjing","state":"","ZIP":"","country":"China"},"organizers":["ITU & co-sponsored by IEEE, IEEE Communications Society & SIIT2017"],"societies":[],"indexes":[],"emails":[]}