{"name":"ACRID2017 EAI International Conference for Research, Innovation and Development for Africa","series":"","short":"","website":"http://www.eai.eu","content":"Full Paper Dealine 15 February 2017 The 6 Tracks of the Conference Call are: Mining, Transportation and Manufacturing Electronics Application Process and Motion Control for Industry Energy and Sustainable Development Information and Communication Technology Engineering Education, Science & Mathematical Modelling ........................................................................................................Here is good news for the ACRID Conference. First, our Guest Speaker will be Prof. Chetsanga, and we have high level Keynotes from UK, USA, Nigeria, South Africa. You can access the submission page from the Conference home page: http://acridconference.org/2017/show/home There you will see a link, Initial Submission, which takes you HERE: http://acridconference.org/2017/show/initial-submission You will find a link Confy, which takes you here: http://confy.eai.eu/entry.html There you click Register, which should take you here: https://account.eai.eu/register?service=http%3A%2F%2Fconfy.eai.eu%2Fentry.html There is a form to fill in your e-mail and conference password (advised not to use your e-mail account password, (try for example, acrid1998, where 1998 is your date of birth). Once registered once you submit the information an e-mail will be sent to the address you used. Click the link on the e-mail and you should be taken back to Confy where you can then use, SIGN IN / LOGIN and you will see all the Tracks. You can choose and submit to the track of your choice. Lets have as many of you submit! I have some words about the template. Very important: Basically Template have built in intelligence, even if the text looks dumb. I would like to advise authors of the need to stick to the template. You will see I have attached a word template. Its a good place to start. Just type over the text. If I am not sure, I usually place the text in between words. A more complete way to do it is to read the pdf, \"sv-Incs.pdf\" which gives almost all the commands you will need. Invoke them before you act! I have attached, for information a paper I am working on which is according to the template, except the references, spelling and grammar (this paper is based on a student project). If you have any queries or are facing any difficulties, please let me know. This is an international conference, supported by the FAMOUS SPRINGER of GERMANY, so make sure you submit a quality paper, which will be accepted and internationally recognized. Ed Chikuni ACRID General Chair Prof. Edward Chikuni, PhD (Wales), MSc (UMIST, Manchester), BEng, (USL) PrEng. (ECSA,RSA), CEng.(UK), MIET (London), MIEEE, Power & Energy Expert University of Zimbabwe Department of Electrical Power Engineering Mt Pleasant Drive Harare Zimbabwe Email: echikuni@ieee.org Web Email: chikuni@yahoo.com Cell: +263777606333 Important Dates • Full Paper Submission deadline 15 February 2017 • Notification and Registration opens 14 April 2017 • Camera-ready deadline 5 May 2017 • Start of Conference 20 June 2017 • End of Conference 21 June 2017","date_start":"2017-06-20","date_end":"2017-06-21","important_dates":{"abstract":"","full":"2017-02-15","notification":"","final":""},"topics":["Engineering & Technology","Electrical/ Electronic","call for papers"],"location":{"virtual":"","full":["Victoria Falls","Zimbabwe"],"name":"","street":"","city":"Victoria Falls","state":"","ZIP":"","country":"Zimbabwe"},"organizers":["European Alliance for Innovation"],"societies":[],"indexes":[],"emails":["echikuni@ieee.org","chikuni@yahoo.com"]}