{"name":"Technology and Education Fair","series":"","short":"","website":"www.TEF.istanbul","content":"Technology & Education Fair (TEF) which will be organized by EGİTEKDER ( Educational Technologies association) for the second time between 18-20 May 2018 in İstanbul Congress Center, brings together the products of companies from both Turkey and abroad working in educational technologies with its buyers. EGİTEKDER is in direct contact with more than 250.000 students+ and 15.000+teachers. Moreover, it is developing a cooperation with national and international educational technology enterprises. EGİTEKDER is also already contacting the neighbour countries education ministries and associates, to call them to visit show and events . EGİTEKDER plans to bring together members of this network and 100+ companies participating the fair and to offer the advantages listed below - Being able to introduce their products to thousands of students and teachers from both private and public schools - Being able to meet founders and principals - Being able to attend international events by the help of EGİTEKDER - Being able to find new representatives and evaluate success of the product - Being able to explore innovations and trends in technology It is planned that the fair will be carried out through domestic and foreign sectoral associations and fairs. The fair, where approximately 8000 visitors are expected, will host 100 sessions / panels / workshops and more than 100 Maker projects and other events. TEF EVENT WEB PAGES: Turkish Web Page : www.tef.istanbul English web page: https://www.tef.istanbul/copy-of-anasayfa TEF 2016 Event Photos : https://www.tef.istanbul/copy-of-tef-2016","date_start":"2018-05-18","date_end":"2018-05-20","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education","educational technology"],"location":{"virtual":"","full":["istanbul","Turkey"],"name":"","street":"","city":"istanbul","state":"","ZIP":"","country":"Turkey"},"organizers":["Egitekder"],"societies":[],"indexes":[],"emails":[]}