{"name":"Art and Conflict: Investigating Cross-Disciplinary Methodologies","series":"","short":"","website":"https://artconflict.wordpress.com","content":"Works of art speak truths about war and conflict in a way that cannot be easily articulated by disciplines such as law or political science. As a result, scholars in these disciplines are increasingly paying attention to art made during conflict as well as the ‘work’ which art does in its aftermath. There is a need, however, to foster cross-disciplinary conversation about the methods and approaches undertaken by scholarship in this area. This two-day workshop is a series of events aimed at beginning a dialogue around these issues by PhD Candidates and Early Career Researchers. CALL FOR PAPERS AND PARTICIPANTS ‘Art and Conflict: Investigating Cross-Disciplinary Methodologies’ Workshop 25 – 26 June 2018 VCA and Melbourne Law School, University of Melbourne Works of art speak truths about war and conflict in a way that cannot be easily articulated by disciplines such as law or political science. As a result, scholars in these disciplines are increasingly paying attention to art made during conflict as well as the ‘work’ which art does in its aftermath. There is a need, however, to foster cross-disciplinary conversation about the methods and approaches undertaken by scholarship in this area. This two-day workshop is a series of events aimed at beginning a dialogue around these issues by PhD Candidates and Early Career Researchers. Keynote Roundtable: Kathryn Brimblecombe-Fox (Artist); Professor Jon Cattapan (former Australian Official War Artist, Director of the Victorian College of the Arts); Professor Paul Gough (Artist, Pro-VC and Vice-President, College of Design and Social Context, RMIT); Ryan Johnston (University of Melbourne, former Head of Art, Australian War Memorial). Other events include a special exhibition of art works from the Keynote speakers and other artists at the VCA; film screening of Until They’re Gone (Dir. C Lockett ) and video Q & A with filmmakers; curatorial talk and session at the Ian Potter Museum of Art and workshop discussion around current works-in-progress. HOW TO APPLY There are two ways to take part in this workshop: 1\\. As a presenter; OR 2\\. As a participant (non-presenting). We encourage applications from PhD Candidates and Early Career Researchers from any discipline, including (but not limited to): Jurisprudence, Political Science, Art, Film, Art History, Cultural Studies, Philosophy, Anthropology, Gender and Sexuality Studies, and Sociology. 1\\. Presenters We invite submissions of papers that explore a methodological area that poses a challenge to the author's research. The workshop will be designed to work collaboratively on thinking through methodological problems and solutions. A limited number of small bursaries are available to contribute to domestic and international travel costs. Please indicate if you wish to be considered for a bursary. 2\\. Non-presenting participants We also invite interested scholars to attend as non-presenting participants. Please note that everyone attending is expected to read all papers in advance. Application Process To apply to be a presenter: Please submit: 1\\. Short bio and details of PhD project / current research project (250-500 words); 2\\. Abstract of paper to workshop (250-500 words). NB Full papers (approx. 3000 words) will be required approximately one month before the workshop. To apply to be a participant (non-presenting): Please submit: 1\\. Short bio and details of PhD project / current research project (250-500 words); 2\\. Short paragraph on your interest in art and conflict and cross-disciplinary work (250 words max.) There is no cost for the workshop, but the number of presenters and participants is limited. Due Date: Friday 6 April 2018 To apply and for further information, see our website: https://artconflict.wordpress.com Queries: artconflictworkshop@gmail.com Workshop Directors Federica Caso (UQ); Shawna Lesseur (UConn); Laura Petersen (Melbourne); Stacey Vorster (UvA/Wits).","date_start":"2018-06-25","date_end":"2018-06-26","important_dates":{"abstract":"","full":"2018-04-06","notification":"","final":""},"topics":["Arts & Humanities","Other","interdisciplinary"],"location":{"virtual":"","full":["Melbourne","Victoria","Australia"],"name":"","street":"","city":"Melbourne","state":"Victoria","ZIP":"","country":"Australia"},"organizers":["Universitas 21"],"societies":[],"indexes":[],"emails":["artconflictworkshop@gmail.com"]}