{"name":"International Conference on Computer Science Education : Innovation and Technology - CSEIT 2018","series":"","short":"","website":"http://cseducation.org","content":"Currently, computer science educators share educational material, but this process is unstructured and does not shared material for effective use. Current sharing of material takes the form of open access to uploaded lectures on Youtube, design models and source code on websites, and informal collaboration between local groups of educators. There is a need for identifying global commonalities in computer science curricula and establishing a framework of program/course outcomes that links to associated topics and material for teaching and assessment at the undergraduate level of university education. Such a proposed environment of sharable material will have applicability beyond small collaborative groups through broad-based international voluntary collaborative groups. There have been prior partial attempts at this goal but none has been sustainable or comprehensive, as need in today’s emerging computer science educational needs. Existing approaches are dated and lack incentives to stimulate large-scale and continuing usage. The creation of international partners and collaborative work will be at the heart of stimulating continue interest in delivering a successful framework. The content of such a framework should be dynamic and responsive to changing focus in computer science education. This dynamism should be sustained by the encouraged submission of artifacts by users of the framework. Ease of access to the framework should be achieved through an Internet-based interface that provides seamless accessibility to a relational database system. Annual workshops/conferences/webinars/tele-conferences for presentation of results from using the framework will ensure sustainability and growth of the environment.","date_start":"2018-10-22","date_end":"2018-10-23","important_dates":{"abstract":"","full":"2018-04-20","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Singapore","Singapore"],"name":"","street":"","city":"Singapore","state":"","ZIP":"","country":"Singapore"},"organizers":["Global Science & Technology Forum (GSTF)"],"societies":[],"indexes":[],"emails":[]}