{"name":"3rd EAI International Conference on Management of Manufacturing Systems","series":"","short":"","website":"http://manusystems.org","content":"Dear Sir/Madam, The conference aims at creating synergies of “practice and research” increasing the potential and commercial viability of research and development in the field of innovative technologies in management of manufacturing systems, Industry 4.0, logistics and traffic/transport system. We are pleased to invite you to submit your paper to MMS 2018\\. They should be in English, following the EAI Core formatting guidelines (see Initial Submission). Topics MMS 2018 targets four main areas: Industry 4.0 • ICT Support for Industry 4.0 • Case Studies with RFID Applications • Intelligent Manufacturing Systems and Applications • Enterprise Information Systems Management • Clusters in SME • Complexity of Supply Chain Management • Decision-making processes • Innovation and Knowledge Management New Trends in Materials and Technologies • Continuum Mechanics • Material Mechanics • Durability of materials • Destructive and non-destructive testing Traffic/transport systems • Information and Communication Networks and Innovative Services • Communication Security/e-Forensics • Travel and traffic information • Industrial and Smart Logistics Full list (http://manusystems.org/call-for-papers/) Publication All accepted papers will be submitted for publication in EAI Core proceedings and made available through European Union Digital Library (EUDL). Authors of selected best accepted and presented papers will be invited to submit an extended version to: Wireless Networks (Springer) (IF: 1.584) EAI Endorsed Transactions on Smart Cities Proceedings will be submitted for inclusion in leading indexing services, Ei Compendex, ISI Web of Science, Scopus, CrossRef, Google Scholar, DBLP, as well as EAI’s own EU Digital Library (EUDL). Important dates Full Paper Submission Deadline: June 1, 2018 Notification Deadline: August 1, 2018 Camera-ready deadline: September 15, 2018 Start of Conference: November 6, 2018","date_start":"2018-11-06","date_end":"2018-11-08","important_dates":{"abstract":"","full":"2018-07-31","notification":"","final":""},"topics":["Engineering & Technology","Transportation"],"location":{"virtual":"","full":["Dubrovnik","Croatia"],"name":"","street":"","city":"Dubrovnik","state":"","ZIP":"","country":"Croatia"},"organizers":["European Alliance for Innovation"],"societies":[],"indexes":[],"emails":[]}