{"name":"Real Estate, Bitcoin & Wealth Expo Featuring Sylvester Stallone","series":"","short":"","website":"https://go.evvnt.com/205147-0?pid=4868","content":"CANADA'S LARGEST MONEY-MAKING EXPO Self-Made Millionaires Teach You How To Make Money! Who You'll Meet: Hollywood Icon Sylvester Stallone; baseball legend, Alex Rodriguez, Shark Tank's Daymond John, Dragons' Den's Manjit Minhas; HGTV's Love It or List star Hilary Farr, Million Dollar Listing LA's Madison Hildebrand; Top Million Dollar Agent's real estate brokers Mike Donia & Jin Jiang; Home To Win's Sebastian Clovis, best-selling author of UNFU\\*CK YOURSELF Gary Bishop, and a special LIVE performance by Pitbull. You'll Learn: - Sales and peak performance training. - To flip properties; strategies to increase your income. - To find a home-based business that will give you an extra $3,000 a month income. - Bitcoin investing, Bitcoin mining, latest CryptoCurrencies. - To purchase discounted real estate in the white hot Toronto market with little money down. - To develop your millionaire mindset. - To buy & sell tax liens, income producing properties & commercial properties. Sample Goodies: - Fitness Trackers. - Finding, Fixing & Flipping Houses educational CD's. - Certificates of Real Estate Investing. - Chances to win raffle prizes up to $10,000 cash, Microsoft Surface Pros and iPhone X's!!! Venue Details: Metro Toronto Convention Centre, 222 Bremner Boulevard, Toronto M5V 2W6, Canada. Time: 12:00 pm - 10:45 pm. Category: Classes / Courses | Professional Training | Personal Development. Sub-Categories: Conferences | Education, Conferences. Artists / Speakers: Sylvester Stallone, Pitbull, Alex Rodriguez. Prices: Silver Seating: CAD 49, Gold Seating: CAD 199, VIP Seating: CAD 69, 2 VIP Seating: CAD 99.","date_start":"2018-04-07","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Toronto","Canada"],"name":"","street":"","city":"Toronto","state":"","ZIP":"","country":"Canada"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}