{"name":"Workshop “Concepts in Action: Representation, Learning, and Application”","series":"","short":"CARLA","website":"https://www.conceptuccino.uni-osnabrueck.de/carla_workshop/carla_2018.html","content":"The Institute of Cognitive Science at Osnabrück University (https://cogsci.uni-osnabrueck.de) is happy to announce the international workshop “Concepts in Action: Representation, Learning, and Application”. We invite the submission of extended abstracts to the workshop for oral or poster presentations. Time and Venue: ---------------------- August 11 and August 12, 2018, in Osnabrück (Germany). Invited Speakers: ---------------------- Nicholas Asher, Institut de Recherche en Informatique de Toulouse, France (https://www.irit.fr/\\~Nicholas.Asher/) Christiane D. Fellbaum, Computer Science Department, Princeton University, USA (https://www.cs.princeton.edu/\\~fellbaum/) Peter Gärdenfors, Department of Philosophy, Lund University, Sweden (http://www.fil.lu.se/en/person/PeterGardenfors) Robert L. Goldstone, Department of Psychological & Brain Sciences, Indiana University, USA (http://psych.indiana.edu/faculty/rgoldsto.php) Julie Hunter, Institut de Recherche en Informatique de Toulouse, France (http://www.juliejhunter.com/) Michael Spranger, Sony Computer Science Laboratories, Inc., Tokyo, Japan (https://sites.google.com/view/michaelspranger/) Call for Papers: -------------------- \"Concepts in Action: Representation, Learning, and Application\" (CARLA) is an international workshop aimed at fostering interdisciplinary exchange about research on concepts. It invites contributions from all fields related to cognitive science, including (but not limited to) linguistics, artificial intelligence, psychology, philosophy, logic, and computer science. Although the workshop is open for research on any aspect of concepts, there exists a set of core topics that are of special interest: Representation: How can we formally describe and model concepts? Learning: Where do concepts come from and how are they acquired? Application: How are concepts used in cognitive tasks? We invite the submission of extended abstracts (up to 500 words excluding references) to https://easychair.org/conferences/?conf=carlaws18 until May 20, 2018\\. We will send out acceptance notifications by May 31, 2018\\. Publication: --------------- We plan to invite a selection of presentations for publication after the workshop. Schedule: ------------ A detailed schedule of the workshop will be provided on our website in July 2018\\. Organizers: -------------- Lucas Bechberger, Ulf Krumnack, Kai-Uwe Kühnberger, Mingya Liu","date_start":"2018-08-11","date_end":"2018-08-12","important_dates":{"abstract":"","full":"2018-05-20","notification":"","final":""},"topics":["Social Sciences","Other"],"location":{"virtual":"","full":["Osnabrück","Germany"],"name":"","street":"","city":"Osnabrück","state":"","ZIP":"","country":"Germany"},"organizers":["Institute of Cognitive Science, Osnabrück University"],"societies":[],"indexes":[],"emails":[]}