{"name":"International Conference on Digital Humanities: “The Democratisation of History”","series":"","short":"","website":"http://digital.humanities.lcir.co.uk","content":"\"History is written by the victors\" according to a popular quote. Regardless of the accuracy of this statement, the fact is that history is commonly written by people with authority and bias, thus impeding any attempt to distill one single, objective, definitive truth and record it in immutable books. Moreover, history telling and analysis inevitably comes with different facets, based on context and the historian's background. Nevertheless, perspective cannot be regarded as a mere thorn for the discipline, but instead can provide invaluable material to enrich, retrospect and constructively investigate past events, so long as proper mechanisms are in place to guarantee the mitigation of deceitful behaviors. Recently there has been a rise of distributed systems as a viable means to democratise various aspects of our society. Blockchain has gained attention as the main technology behind Bitcoin and Ethereum, creating their own currency and promising simpler transactions that will replace the status quo financial systems. However, Blockchain potential is not limited to crypto-currencies and creating money out of thin air in an attempt to become rich overnight. Blockchain is the technology that may significantly benefit our lives in the near future by decentralizing governance, allowing peers to directly interact in a reliable and secure manner and empowering communities with the privilege and responsibility of defining their operation and evolution. Adopting Blockchain technologies appeals as a very promising direction towards the democratisation of History. As the name implies, Blockchain is a chain of blocks, each registered at some point in time, which is in line with History's linearity in terms of timeliness of events. What is written in each block, is a product of interactions among peers of the blockchain, who can all have access to the system, in a deterministic manner based on agreed predefined processes. How can History writing be mapped into a conversational process with the conclusions, as well as the reviews, discussions and links to facts, being printed on blocks of the Blockchain? How can access of all users to History reading and writing benefit the panoramicity and cultural inclusiveness into preserving our heritage? To which extent can a single reference system foster historical knowledge and awareness, while unleashing freedom of speech in event reporting and shedding light into the patterns of historical events? We invite proposals from various disciplines including history, political sciences, philosophy, sociology, anthropology, IT, media and communication, literature, linguistics, etc. Paper proposals up to 250 words and a brief biographical note should be sent by 1 February, 2019 to: digital.humanities@lcir.co.uk. Please download Paper Proposal Form: http://digital.humanities.lcir.co.uk/ Registration fee – 100 GBP Provisional conference venue: Birkbeck, University of London, 43 Gordon Square, London, WC1H 0PD","date_start":"2019-05-18","date_end":"","important_dates":{"abstract":"","full":"2019-05-18","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","interdisciplinary"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["digital.humanities@lcir.co.uk"]}