{"name":"Energy and Sustainability 2019 - 8th International conference on Energy and Sustainability","series":"","short":"","website":"https://www.wessex.ac.uk/conferences/2019/energy-and-sustainability-2019","content":"Introduction Energy and Sustainability 2019 is the 8th International Conference in a very successful series which started in the New Forest, UK, home of the Wessex Institute in 2007; followed by meetings in Bologna (2009); Alicante (2011); Budapest (2013); Kuala Lumpur (2014); Medellin, Colombia (2015); and Seville (2017). The world’s economy is fuelled by energy. Depletion of resources and severe environmental effects resulting from the continuous use of fossil fuels has motivated an increasing amount of interest in renewable energy resources and the search for sustainable energy policies. The changes required to progress from an economy mainly focussed on hydrocarbons to one taking advantage of sustainable renewable energy resources require considerable scientific research, as well as the development of new engineering systems. Energy policies and management are of primary importance to achieve the development of sustainability and need to be consistent with recent advances in energy production and distribution. In many cases, the challenges lie as much in the conversion from renewable energies (wind, solar etc) to useful forms (electricity, heat, fuel) at an acceptable cost including damage to the environment as in the integration of these resources into the existing infrastructure. The diverse topics covered by the Conference involve collaboration between different disciplines in order to arrive at optimum solutions, including studies of materials, energy networks, new energy resources, storage solutions, waste to energy systems, smart grids and many others. Conference Topics The following list covers some of the topics to be presented at Energy and Sustainability 2019\\. Papers on other subjects related to the objectives of the conference are also welcome. Energy policies Renewable energy resources Sustainable energy production Environmental risk management Sustainable buildings","date_start":"2019-07-03","date_end":"2019-07-05","important_dates":{"abstract":"","full":"2019-04-01","notification":"","final":""},"topics":["Business","Information-Technology","energy and sustainability"],"location":{"virtual":"","full":["Coimbra","Portugal"],"name":"","street":"","city":"Coimbra","state":"","ZIP":"","country":"Portugal"},"organizers":["Wessex Institute"],"societies":[],"indexes":[],"emails":[]}