{"name":"Summer School \"Linguistic Theory in Second and Foreign Language Teaching\"","series":"","short":"","website":"https://sites.google.com/site/linguisticsinbraunschweig","content":"The research school is an intellectual union in search for proper methods applicable to a multi-level phenomenon of foreign/second language acquisition. The program of the school embraces two side of the definition of “method” understanding it as 1) research methods associated with the mechanisms of language acquisition and 2) as methods of language teaching informed by research results and applied in the classroom. Thus, the school brings together the most successful practices in languages teaching and the findings from experimental linguistics. Providing a platform for fruitful discussion the school is aimed at elicitation the bidirectionality of the process of language teaching and acquiring/learning. To be more specific, the project answers the question how studies in language acquisition inform and shape language pedagogy, and, on the other hand, how the feedback from the application of most advanced teaching practices motivates further research and points to the understudied areas. The scope of the summer school includes but is not restricted to the following topics: methods of second language acquisition research; insights from theoretical research and their applicability in teaching (e.g. Fluency Research in Teaching Speaking), second and foreign language acquisition; third language acquisition; theories of grammar in language teacher training, language competence and language assessment, error correction and corrective feedback. We are inviting contributions to the participants' conference related to the general topic of the summer school. Interested Master and PhD students can present a piece of their own research for a discussion during a doctoral session by a group of peer discussants (and a responsible lecturer). Regular participants without a contribution are also welcome. We hope to have awakened your interest and are expecting to hear back from you till August 24th, 2018.","date_start":"2018-08-31","date_end":"2018-09-04","important_dates":{"abstract":"","full":"2018-07-31","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","Languages (human)"],"location":{"virtual":"","full":["Braunschweig","Germany"],"name":"","street":"","city":"Braunschweig","state":"","ZIP":"","country":"Germany"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}