{"name":"The 4th Laser and Optoelectronics Conference","series":"","short":"LOC 2018","website":"http://www.deconf.org/conference/LOC2018","content":"The 4th Laser and Optoelectronics Conference (LOC 2018) will be held from December 1-3, 2018 in Sanya, China. This Conference will cover issues on Laser and Optoelectronics. LOC 2018 dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods. Prof. W. J. Fan, Nanyang Technological University, Singapore Title: Band structure and optical properties of cubic CsSnBr3 perovskite Dr. Guanhao Wu, Tsinghua University, China Prof. BYOUNG S. HAM, School of Electrical Engineering and Computer Science, Gwangju Institute of Science and Technology, Republic of Korea Title: How optical phase conjugation works for quantum memories in solids Prof. Weitao Liu, National University of Defense Technology, China Prof. Cruz Meneses-Fabian, Physics and Applied Physics Bachelor, FCFM-BUAP, Mexico Title: Fitting background and modulation light to 2-D polynomials of degree K for self-calibrating phase-shifting interferometry Prof. Nanguang Chen, National University of Singapore, Singapore Title: Novel techniques for multi-dimensional imaging of biological samples in vivo Prof. Ping Xue, Tsinghua University, China Title: Ultrahigh speed optical coherence tomography Dr. K.N. Shinde, Département of Physics, N.S. Science and Arts College, Bhadrawati, India Title: Synthesis of red emitting vanadate nanophosphor Prof. Nader Mahdizadeh, Islamic Azad University, Iran Title: Power enhancement in a two-stream free electron laser Prof. Hongjun Zheng, School of Physics Science and Information Technology, Liaocheng University, China Title: Recent advances in few mode fibers for mode-division multiplexing Prof. Rich Mildren, Macquarie University, Australia Title: Diamond for extreme lasers, beam polarization manipulation and novel surface phenomena Dr. KE Lin, Institute of Materials Research & Engineering, Agency for Science Technology and Research, Singapore Prof. Baohong Yuan, University of Texas at Arlington (UTA), USA","date_start":"2018-12-01","date_end":"2018-12-03","important_dates":{"abstract":"","full":"2018-11-15","notification":"","final":""},"topics":["Physical Science & Math","Physics","Optics and Laser Science"],"location":{"virtual":"","full":["Sanya","China"],"name":"","street":"","city":"Sanya","state":"","ZIP":"","country":"China"},"organizers":["Engineering Information Institute"],"societies":[],"indexes":[],"emails":[]}