{"name":"12th International Annual Conference AUTOMOTIVE GLAZING EUROPE","series":"","short":"","website":"https://go.evvnt.com/244018-2?pid=4868","content":"Do you want to be a part of this unique automotive glazing expert network? The 12th International CTI Conference Automotive Glazing Europe on 15 - 16 November 2018 in Spain takes place at a particulary interesting time. The development in the automotive glazing industry is moving forward very quickly and is also gaining increasing importance in a connected world. Especially the requirements of \"Megacities\", where a high proportion of people live in, have totally different conditions to connectivity and alternative vehicle solutions than non-urban areas, where individual transport is still pre-dominant. Therefore it´s not only the outside or the character of the glass that will be focused, the conference also will have a look inside the different vehicles with their robot-assistance systems like radar-, camera-, lidar-, scanner-, warning- devices and its impact on automotive glazing. This year we have a special carefree offer for you. The conference ticket includes: 2 nights of accomodation + breakfast + transportation from and to the airports (Bilbao, San Sebastian, Biaritz) + evening event. Tickets https://go.evvnt.com/244018-0?pid=4868 Price: Carefree Ticket (inclusive: 2 nights of accomodation+breakfast+airport transport, evening event): EUR 2.3 Time: on Thursday November 15, 2018 at 9:00 am (ends Friday November 16, 2018 at 4:00 pm) Venue details: Parque Científico y Tecnológico de Gipuzkoa, Mikeletegi Pasealekua, 53, San Sebastián, 20009, Spain","date_start":"2018-11-15","date_end":"2018-11-16","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["San Sebastián","Spain"],"name":"","street":"","city":"San Sebastián","state":"","ZIP":"","country":"Spain"},"organizers":["CTI"],"societies":[],"indexes":[],"emails":[]}