{"name":"Annual Investment Meeting, Dubai 2019","series":"","short":"","website":"https://go.evvnt.com/260007-0?pid=4868","content":"The Annual Investment Meeting (AIM) is the World’s Leading Platform for Foreign Direct Investment (FDI). It is an initiative of the UAE Ministry of Economy, held under the patronage of His Highness Sheikh Mohammed Bin Rashid Al Maktoum, UAE Vice President, Prime Minister and Ruler of Dubai. AIM is the largest global investment gathering of corporate leaders, policy makers, businessmen, regional and international investors, entrepreneurs, leading academics and experts showcasing up-to-date information, strategies and knowledge on attracting FDI. It aims to connect businesses and countries willing to engage in sustainable partnerships with investors. The ninth edition of the Annual Investment Meeting will be held on April 8 – 10, 2019 at the Dubai, United Arab Emirates. The theme is ‘Mapping the Future of FDI: Enriching World Economies through Digital Globalization’. This will discuss the impact of digital globalization, how policies can be set in place to encourage an innovative investment atmosphere, the need to create long-term investment opportunities, and how to attract and develop skilled talents from across the world. For exhibition and sponsorship opportunities, please visit our website: www.aimcongress.com Tickets https://go.evvnt.com/260007-2?pid=4868 Prices: Early Bird - All Access USD 1500.0 Early Bird - 3 Day Access USD 1275.0 Early Bird - 1 Day Access USD 1050.0 Time: on Monday April 08, 2019 at 9:00 am (ends Wednesday April 10, 2019 at 6:00 pm) Venue details: Dubai World Trade Centre, Dubai, United Arab Emirates","date_start":"2019-04-08","date_end":"2019-04-10","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Economics"],"location":{"virtual":"","full":["Dubai","United Arab Emirates"],"name":"","street":"","city":"Dubai","state":"","ZIP":"","country":"United Arab Emirates"},"organizers":["Strategic Marketing Management, Exhibition, and Conference Organizers"],"societies":[],"indexes":[],"emails":[]}