{"name":"International Conference on Urban Studies \"Realities, Alternatives and Possibilities\"","series":"","short":"","website":"http://urbanstudies.lcir.co.uk","content":"Organised by London Centre for Interdisciplinary Research London, Paris, New York, Tokyo, Singapore, Hong Kong, Beijing, Sydney, Shanghai, Dubai are leading global hubs of finance and commerce, research and development, education and media, art and culture, entertainment and tourism. They consist of an intriguing and yet irresistible mixture of past and present, history and commercialism, monuments and leisure culture. Contrasts and paradoxes present these megacities as exceptional phenomena of artificiality and naturalness, livelihood and unpredictability, whose horizontal and vertical mobility has imposed an unmistakable tempo upon the course of the world and has shaped particular physical and mental geographies. The conference will explore the singular nature of the symbols that represent the world’s cosmopolitan metropoles. It will also focus on the fascination exerted by these large urban areas and their complex character as unrivalled sites of self-confidence and assertiveness, progress and sophistication. The main objective of the event is to bring together all those interested in examining the intersections between their professions and/or interests and some distinct aspects of metropolitan life, providing an integrated approach for the understanding of the mechanisms that lie behind the undisputed global centres. Topics include but are not limited to several core issues: supercities and the self past, present and future travel and transport art and architecture crime and conflict historical, cultural and tourist landmarks multiculturalism and exclusiveness urban legends landscapes and cityscapes wisdom and humour media representations Paper proposals up to 250 words and a brief biographical note should be sent by 1 February, 2018 to: urbanstudies@lcir.co.uk. Please download Paper proposal form: http://urbanstudies.lcir.co.uk/ Registration fee – 100 GBP Provisional conference venue: Birkbeck, University of London, Malet Street, Bloomsbury, London, WC1E 7HX","date_start":"2019-05-11","date_end":"","important_dates":{"abstract":"","full":"2019-02-01","notification":"","final":""},"topics":["Social Sciences","Other","Urban Studies, Planning & Design"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["urbanstudies@lcir.co.uk"]}