{"name":"Workshop on Simulation and EGSE for Space Programmes","series":"","short":"","website":"http://esaconferencebureau.com/2017-events/17c01","content":"For more than 20 years, the Workshop on Simulation for European Space Programmes (SESP) has been organised by ESA on a bi-annual basis. In 2010, the scope of SESP was widened to include the subject areas and organisational functions of the closely associated Workshop on Electrical Ground Support Equipment (EGSE). The overall context of the Workshop is Space Systems Design and Verification. The systems supporting this process include System Concept Simulators, Mission Performance Simulators, Functional Engineering Simulators, Software Verification Facilities, Integration and Test benches and associated EGSE. An important justification for bundling exactly these disciplines in a single Workshop is that they have significant commonalities (in terms of e.g. standards, databases, methods and tools) that are worth nurturing and exploiting. With regards to these subjects, the SESP workshop is a uniquely focused forum where representatives of Space Agencies and Industry can present and discuss the current state-of-the-art as well as future trends and needs. As such it also provides a rare opportunity for systems developers and users to meet outside of a contractual context, in order to share experiences with related tools, techniques and practices. Furthermore, the SESP workshop aspires to serve as a breeding ground for new ideas and to trigger and encourage plans for future work. On subject of industrial policy, ESA anticipates feedback from the National Agencies and Industry on new R&D activities, and on the expected role of ESA within the Simulation and EGSE professional community.","date_start":"2017-03-28","date_end":"2017-03-30","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Engineering & Technology","Other"],"location":{"virtual":"","full":["Noordwijk","Netherlands"],"name":"","street":"","city":"Noordwijk","state":"","ZIP":"","country":"Netherlands"},"organizers":["European Space Agency"],"societies":[],"indexes":[],"emails":[]}