{"name":"8th International Conference in Methodologies and Intelligent Systems for Techhnology Enhanced Learning","series":"","short":"","website":"https://www.mis4tel-conference.net","content":"Education is the cornerstone of any society and it serves as one of the foundations for many of its social values and characteristics. Knowledge societies offer significant opportunities for novel ICT tools and applications, especially in the fields of education and learning. In such a context, the role of intelligent systems, rooted in artificial intelligence, has become increasingly relevant to the field of Technology Enhanced Learning (TEL). New intelligent solutions can be stand-alone or inter-connected to others and can target not only cognitive processes but can also take care of motivational factors. Furthermore, more recently, makerspaces are also emerging as a central possibility to increase learning opportunities and outcomes, especially in the case of “fragile users”, as for example children, elderly people, people with special needs. The 8th edition of this conference expands the topics of the previous editions in order to provide an open forum for discussing intelligent systems for TEL, their roots in novel learning theories, empirical methodologies for their design or evaluation, stand-alone solutions or web-based ones, and makerspaces, also fostering entrepreneurship and increasing business startup ideas. It intends to bring together researchers and developers from industry, the education field and the academic world to report on the latest scientific research, technical advances and methodologies. MIS4TEL 2018 will be held in Toledo (Spain) on June 20th-22nd, 2018, in parallel with the PAAMS'18 International Conference. - MORE INFORMATION: https://www.mis4tel-conference.net/ - Contact: info@mis4tel-conference.net","date_start":"2018-06-20","date_end":"2018-06-22","important_dates":{"abstract":"","full":"2018-02-05","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Toledo","Spain"],"name":"","street":"","city":"Toledo","state":"","ZIP":"","country":"Spain"},"organizers":["Universtiy of Castilla-La Mancha"],"societies":[],"indexes":[],"emails":["info@mis4tel-conference.net"]}