{"name":"Free Trustee Training Workshops - Autumn 2018","series":"","short":"","website":"http://go.evvnt.com/257816-0?pid=4868","content":"8 DATES AVAILABLE INCLUDING HARROGATE, MANCHESTER, NEWCASTLE AND LONDON The programme, released nearer the date of the seminars, will cover: Setting the scene with the Charity Commission's current regulatory approach and the new Charity Governance Code, we will explore the need for trustees to take responsibility for their organisation and how boards are responding to recent intense scrutiny of the sector; The legal duties and responsibilities of charity trustees, looking at Board effectiveness and its role, how this role relates to the work of the Chief Executive, conflicts of interest, decision-making, minute taking and delegation to Chief Executives and committees; and Trustees' responsibilities for both external and internal financial reporting, examining key areas such as the different types of funds and how they can be spent and the linking of reserves policy to strategy. Our aim is to give practical tips to help improve your governance. The sessions will be presented by Ian Hempseed, Head of Charities and Social Enterprise at Hempsons, and Richard Weaver, Head of Charities and Not for Profit at haysmacintyre (specialist charity accountants) and other members of the Hempsons and haysmacintyre Charities teams. Richard is a Chartered Accountant and holds a degree in Law. Richard delivers internal and external audit work for charities of all shapes and sizes, and has a particular interest in governance and risk management processes in addition to the more technical financial systems and control environments operated by charities. \\*Places will be allocated on a first come, first served basis. However, as places are limited, a maximum of two trustees from any one charity will be entitled to attend per session. Speakers: Ian Hempseed, Richard Weaver Time: 9:45 am to 1:00 pm Venue Details: The Exchange, Station Parade, Harrogate, HG1 1TS, United Kingdom","date_start":"2018-09-25","date_end":"","important_dates":{"abstract":"","full":"2018-09-24","notification":"","final":""},"topics":["Business","Economics"],"location":{"virtual":"","full":["Harrogate","United Kingdom"],"name":"","street":"","city":"Harrogate","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Hempsons"],"societies":[],"indexes":[],"emails":[]}