{"name":"Symposium on the Science of Stories","series":"","short":"","website":"http://www.vermontcomplexsystems.org/events/science-of-stories","content":"During this intensive three-day professional education short course, we will explore the nature of narratives, how to extract them from data, how they move through time and space, and how to preserve them through communication. We will also explore how to communicate data-rich narratives to the public and how to tell a story using data visualizations. In this course, we will introduce participants to methods, tools, and theory at the forefront of complex systems science, cognitive science, sentiment analysis, network theory, information theory, digital humanities, literature, data visualization, and data analytics. Our professional education programs bring together a diverse network of academics, business professionals, innovators, investors, government and health practitioners, regulators, and educators. Our programs challenge participants to think about global issues from a new perspective, to expand their network beyond their field, and seek solutions to real world data-rich problems. No background in science or mathematics is required. We aim for this course to be an intimate experience, space is very limited and is available first-come-first-served. Topic Areas: Science of Stories, sentiment analysis, analysis of social media and other qualitative data, topic models, cognitive models of information theory, emotion and empathy in story, information flow on networks, recognizing patterns in a digitized corpus, detecting deceptive information in data, communicating data-rich narratives to the public, visualizations of data rich stories, cultural analytics, machine learning generative narratives","date_start":"2018-10-15","date_end":"2018-10-17","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Physical Science & Math","Statistics/Probability","Database Management Systems"],"location":{"virtual":"","full":["Burlington","Vermont","United States"],"name":"","street":"","city":"Burlington","state":"Vermont","ZIP":"","country":"United States"},"organizers":["Vermont Complex Systems Center"],"societies":[],"indexes":[],"emails":[]}