{"name":"\"The Aesthetics of Decay: Ghost Stories and Mysteries\" International Conference","series":"","short":"","website":"http://aesthetics.decay.lcir.co.uk","content":"Decay as a state of nature is inevitable, yet it is something that could be at least postponed: decay in art as the main decadent idea has been on the cultural front row long enough to make certain conclusions about its essential characteristics. Decay as a philosophical issue is much more complex than its natural incarnation: French Symbolists and, later, fin de siècle authors regarded decay as an inseparable part of any type of cultural cognition. Its original interpretations can be found in the ideas of Schopenhauer, Hartmann, Nietzsche, Wagner, Bergson’s intuitivism, modern scientific discoveries and folklore. The art of decay feels the need to justify its aesthetic principles, to explain to the public audience its goals and tasks. As Oswald Spengler says in his main work, “Der Untergang des Abendlandes” (“The Decline of the West”), “Civilizations are the most external and artificial states of which a species of developed humanity is capable. They are a conclusion, the thing-become succeeding the thing-becoming, death following life, rigidity following expansion, intellectual age and the stone-built, petrifying world-city following mother-earth and the spiritual childhood of Doric and Gothic. They are an end, irrevocable, yet by inward necessity reached again and again.” That being said, decay is always that other side of progress and the movement ahead. How shall we treat it then? Where do we spot it? How could it be perceived? What are the different approaches to conceive decay as an aesthetic phenomenon? Possible fields for discussions may include but are not restricted to: Decay: an aesthetic impasse or an impulse for a new creation? Decay as a matter of freedom in design and architecture; Decay as a psychological complexity in contemporary world; Decay as a literary conundrum (Gothic and neo-Gothic introductions); Decay as a hazard in extremities of political gambling. Proposals up to 250 words and a brief biographical note should be sent by 10 November 2018 to: aesthetics.decay@lcir.co.uk. Download the paper proposal form from the official website: http://aesthetics.decay.lcir.co.uk/. Registration fee – 100 GBP. Provisional conference venue: Birkbeck, University of London, Malet Street, Bloomsbury, London WC1E 7HX","date_start":"2019-02-23","date_end":"","important_dates":{"abstract":"","full":"2019-02-23","notification":"","final":""},"topics":["Arts & Humanities","Philosophy","interdisciplinary"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplenary Research"],"societies":[],"indexes":[],"emails":["aesthetics.decay@lcir.co.uk"]}