{"name":"Highbrow, Lowbrow, No-brow: Research and Aesthetic Values in the Humanities","series":"","short":"","website":"http://h-e-r-a.org/Conferences/2019%20Philadelphia/hera_philadelphia_2019_conference.htm","content":"The HERA conference peer review program committee invites proposals for presentations at the 2019 conference. The program committee’s theme is designed to incorporate any and all possible connotations. Our understanding of the tensions and implications of the “highbrow-lowbrow” continuum have existed for as long as the humanities. Although the terms are first associated with the 19th century, connotations of the humanities as possessing elevated, elite, upper class, or even sanctified religious ritual, intellectual, or cultural endeavor may be traced back to ancient times. Similarly, aspects of the humanities variously characterized as being lowly, crude or ordinary, lower class, or even pagan, anti-intellectual, or low class may also be traced back through the ages. Used widely in a vast variety of humanistic disciplines, the understanding and attribution of aesthetic values finds expression in terms that evoke the opposition between elevated treatment of the humanities and lowly derogatory devaluations. Are such oppositions necessary or even useful? If so, how? Should there be an inclusive approach to aesthetic values in the humanities? If so, how might value be ascribed? Are the humanities not engaged in all pursuits and expressions that represent humanity? The HERA conference program committee calls for disciplinary and interdisciplinary submissions that explore the stress points and continuities that inhabit the modes of ascribing aesthetic value in the humanities–from highbrow to lowbrow to no-brow. We call for papers that explore continuity and change, form and function, courage and fear, voices and unspoken presences from any individual fields of study or their connections. The 2019 HERA Conference theme is intentionally seeking disciplinary, interdisciplinary, and multi-disciplinary scholarship and creative work. At a time when the humanities themselves are threatened and often devalued, such explorations are not only a testament to the essential role of the humanities in culture, they are crucial to our importance and our survival. For 2019, HERA continues the HERA Undergraduate Research Prize, a prize of $1,000 awarded to the best undergraduate conference paper (or divided among a panel of papers), sponsored by an attending professor (with a $500 prize awarded to the professor). See HERA’s website for more details. Creative presentations, readings, and exhibitions are also welcomed. Submissions are encouraged from educators at all levels (including undergraduate/graduate students) as well as all those with an interest in the arts and humanities. Proposals for papers, panels, or workshops (150-200 words) must be submitted through the conference submission portal on the HERA website at www.h-e-r-a.org.","date_start":"2019-03-06","date_end":"2019-03-09","important_dates":{"abstract":"","full":"2019-01-25","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","Humanities"],"location":{"virtual":"","full":["Philadelphia","Pennsylvania","United States"],"name":"","street":"","city":"Philadelphia","state":"Pennsylvania","ZIP":"","country":"United States"},"organizers":["HERA Humanities Education and Research Association"],"societies":[],"indexes":[],"emails":[]}