{"name":"Blockchain Africa Conference 2019","series":"","short":"","website":"http://blockchainafrica.co","content":"Since 2015, Bitcoin Events’ annual Blockchain Africa Conferences have been the first of their kind in Africa. They’ve attracted international experts and thought leaders in the blockchain arena. These great minds have shared their insights on blockchain technology’s opportunities and challenges, as well as the latest trends seen around the world. The conferences have also provided a platform for attendees to network with like-minded individuals and learn about some of the most interesting blockchain use cases from a range of innovative companies and start-ups. The African continent has massive challenges with transactions and doing business that, with the help of blockchain technology, can be transformed into simpler and more efficient ways of working. The Blockchain Africa Conference 2019 will focus on moving Africa forward with the technology. It will discuss how the blockchain can simplify systems and processes to lower costs, reduce fraud, become highly secure and transparent, and remove human error and inefficiencies Since 2015, these conferences have attracted over 1 100+ individuals, 75+ speakers and 35+countries as well as blockchain experts and thought leaders from around the world. Our aim Moving Africa forward. The Blockchain Africa Conferences educate people by sharing insights into cryptocurrencies’ and blockchain technology’s revolutionary opportunities in Africa especially. Attendees should walk away feeling energised and equipped to take a step forward, and apply the tech knowledge in their lives and their organisations.","date_start":"2019-02-28","date_end":"2019-03-01","important_dates":{"abstract":"","full":"2018-08-31","notification":"","final":""},"topics":["Business","Finance","Banking finance fintech and regulations financial"],"location":{"virtual":"","full":["Johannesburg","South Africa"],"name":"","street":"","city":"Johannesburg","state":"","ZIP":"","country":"South Africa"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}