{"name":"Future of Education Technology Conference","series":"","short":"","website":"http://go.evvnt.com/216925-0?pid=4868","content":"The Future of Education Technology Conference (FETC), the largest, national, independent education technology conference, annually attracts thousands of education and technology leaders from around the world. Delivering strategies and best practices for student success and schoolwide advancement, FETC is known as one of the nation's premier education technology events! Recognized for its outstanding program year after year, FETC provides CTOs, CIOs, Innovation Directors, Special Ed/Pupil Services Directors, Early Childhood Directors, Media Specialists, Technologists, Administrators and other Educators, the opportunity to explore the most effective integration of technology across the curriculum - from preK-12 - through premium sessions, intensive workshops, various concurrent sessions, live demonstrations of several hundred hardware and software products, plus much more. URLs: Facebook: https://go.evvnt.com/216925-2?pid=4868 Twitter: https://go.evvnt.com/216925-3?pid=4868 Tickets: https://go.evvnt.com/216925-4?pid=4868 Prices: Premium: USD 980.0, Basic Plus: USD 760.0, Basic: USD 460.0 Speakers: Sal Khan, Rafranz Davis, Steve Dembo, Candice Dodson, Diane Doersch, Gail Lovely, Mike Marotta, Derek McCoy, Ann McMullan, Michael Meechin, Shannon Miller, Mary Schillinger, Eric Sheninger, Dr. Randy Ziegenfuss Time: 8:00 am to 5:00 pm Venue Details: Orange County Convention Center, 9800 International Drive, Orlando, 32819, United States","date_start":"2019-01-27","date_end":"2019-01-30","important_dates":{"abstract":"","full":"2019-01-26","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education, teaching"],"location":{"virtual":"","full":["Orlando","Florida","United States"],"name":"","street":"","city":"Orlando","state":"Florida","ZIP":"","country":"United States"},"organizers":["Brittney Scott"],"societies":[],"indexes":[],"emails":[]}