{"name":"ERES 2019 - 12th International Conference on Earthquake Resistant Engineering Structures","series":"","short":"","website":"https://www.wessex.ac.uk/conferences/2019/eres-2019","content":"ERES 2019 is the twelfth international conference in the series on Earthquake Resistant Engineering Structures organised by the Wessex Institute. The Meeting provides a unique forum for the discussion of basic and applied research in the various fields of earthquake engineering relevant to the design of structures. Major earthquakes and associated effects such as tsunamis continue to stress the need to carry out more research on those topics. The problems will intensify as population pressure results in buildings in regions of high seismic vulnerability. A better understanding of these phenomena is required to design earthquake resistant structures and to carry out risk assessment and vulnerability studies. The problem of protecting the built environment in earthquake-prone regions involves not only the optimal design and construction of new facilities, but also the upgrading and rehabilitation of existing structures including heritage buildings. The type of highly specialized retrofitting employed to protect the built heritage is an important area of research. This conference will address these problems continuing to expand on the development of previous meetings in the series. Papers presented at ERES are an invaluable record of the state of the art in this field. Most of them are now freely available on the Wessex Institute eLibrary (http://www.witpress.com/elibrary) where they are a permanent record demonstrating the quality of the research presented at the ERES conference series. The conference began in Thessaloniki, Greece in 1997, followed by Catania, Italy (1999); Malaga, Spain (2001); Ancona, Italy (2003); Skiathos, Greece (2005); Bologna, Italy (2007), Cyprus (2009), Tuscany, Italy (2011), A Coruña, Spain (2013), Opatija, Croatia (2015) and Alicante, Spain (2017). Conference Topics The following list covers some of the topics to be presented at ERES 2019\\. Papers on other subjects related to the objectives of the conference are also welcome. Seismic hazard and tsunamis Building performance during earthquakes Vulnerability Earthquake prediction Seismic isolation and energy dissipation","date_start":"2019-06-05","date_end":"2019-06-07","important_dates":{"abstract":"","full":"2019-04-01","notification":"","final":""},"topics":["Business","Information-Technology","environmental engineering"],"location":{"virtual":"","full":["Seville","Spain"],"name":"","street":"","city":"Seville","state":"","ZIP":"","country":"Spain"},"organizers":["Wessex Institute"],"societies":[],"indexes":[],"emails":[]}