{"name":"“Somewhere In Between: Borders and Borderlands” International Conference","series":"","short":"","website":"http://borders.lcir.co.uk","content":"In an ever changing world the problems of setting boundaries as well as the need to create meanings and establish understanding of diverse phenomena have always been of the utmost importance for humanity. Borders, boundaries, frontiers, and borderlands, naturally formed or man made, are grounded in various ethical traditions, and have always been associated with limits and restrictions. The ongoing process of globalisation is changing the role and stereotypes of borders, so that they are often seen as opportunities rather than constraints. However, in some cases they are still being militarized and conflicted. The conference will seek to identify and analyse the processes of border-making and border permeability in contemporary societies through aesthetic forms. We seek to explore the historical origins of borders, their role in today’s global environment and define the notion of borders, which includes not only territorial, geographical, and political borders, but also cultural and metaphorical borders, imagined spaces where interests and ideologies overlap and compete. Conference panels will be related, but not limited, to: border poetics border-crossing security versus openness of borders cultural hybridization cross‐border co‐operation processes of de‐bordering borders and refugees social, cultural or language differences between communities We invite proposals from various disciplines including political sciences, history, philosophy, sociology, anthropology, architecture, literature, linguistics, etc. Paper proposals up to 250 words and a brief biographical note should be sent by 10 December, 2018 to: borders@lcir.co.uk. Please download Paper proposal form from the official event page: http://borders.lcir.co.uk/. Registration fee – 100 GBP Provisional conference venue: Birkbeck, University of London, 43 Gordon Square, London, WC1H 0PD","date_start":"2019-04-06","date_end":"","important_dates":{"abstract":"","full":"2018-12-10","notification":"","final":""},"topics":["Arts & Humanities","Other","interdisciplinary"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplenary Research"],"societies":[],"indexes":[],"emails":["borders@lcir.co.uk"]}