{"name":"Distributed Computing in Data Science and Biomedical Engineering","series":"","short":"","website":"http://www.mipro.hr/MIPRO2019.DC/ELink.aspx","content":"Chairs: Karolj Skala (Croatia), Roman Trobec (Slovenia), Davor Davidović (Croatia) Steering Committee: Enis Afgan (Croatia), Lene Krøl Andersen (Denmark), Viktor Avbelj (Slovenia), Marian Bubak (Poland), Davor Davidović (Croatia), Matjaž Depolli (Slovenia), Tiziana Ferrari (The Netherlands), Montserrat Gonzalez (England), Aneta Karaivanova (Bulgaria), Zelika Klemenc-Ketiš (Slovenia), Dieter Kranzlmüller (Germany), Maria Lindén (Sweden), Tomislav Lipić (Croatia), Ludek Matyska (Czech Republic), Željka Mihajlović (Croatia), Jesús Carretero Pérez (Spain), Dana Petcu (Romania), Tonka Poplas Susič (Slovenia), Aleksandra Rashkovska Koceva (Slovenia), Karolj Skala (Croatia), Uroš Stanič (Slovenia), Ivan Tomašić (Sweden), Roman Trobec (Slovenia), Tibor Vámos (Hungary), Matjaž Veselko (Slovenia), Yingwei Wang (Canada), Roman Wyrzykowski (Poland) Scope: DC intends to gather the latest research & development results on Data and Life Sciences supported by Distributed Computing. It seeks high-quality original contributions, which demonstrate the theoretical and practical progress of Distributed Computing, Data Science and Biomedical Engineering as well as implementation experiences from researchers in the area, including but not limited to the following topics: Distributed Computing in Data Science: Science Methods, Tools and Platforms High-Performance Computing Big Data Computing Data and Visual Mining Cloud, Fog, Dew Computing Paradigms, and Applications Distributed and Parallel Programming Models and Tools Parallelization Strategies and Parallel Algorithms Scientific Visualization Methods and Tools Big Data Visualization Algorithms Heterogeneous Computing, Adaptive and Reconfigurable Computing Multicore and Manycore Technologies and Programming Distributed Mobile Applications Reliability, Security, and Quality of Service e-Science Technologies and Distributed Research Infrastructure Biomedical Computing, Technology, Engineering and Applications: Informatization, Management, and Organization of BME Environments Bioinformatics and Computational Biology in Medicine Advanced Bio-Signal Processing and Interpretation Monitoring of Vital Functions with Sensor and ICT Systems Wearable Sensors and Networks Telehealth, Telecare, Telemonitoring, Telediagnostics Robot technologies in medicine and healthcare Social Networking, Computing, and Education for Health Improved Therapeutic, Diagnostics and Rehabilitation Methods The official language is English. Important dates: Abstract submission: January 14, 2019 Paper submission: February 4, 2019 Author notification: March 11, 2019 Camera-ready version: March 25, 2019 All deadline times are anywhere on Earth. Registration / Fees: REGISTRATION / FEES Price in EUR Up to 6 May 2019 After 6 May 2019 Members of MIPRO and IEEE 200 230 Students (undergraduate and graduate), primary and secondary school teachers 120 140 Others 220 250 The discount doesn't apply to Ph.D. students. Contact: Karolj Skala Rudjer Boskovic Institute Center for Informatics and Computing Bijenicka 54 HR-10000 Zagreb, Croatia E-mail: skala@irb.hr SUBMISSION GUIDELINE: Submission will put at least 3 single-blind peer reviews. Accepted papers will be published in the ISBN registered conference proceedings and submitted for posting to IEEE Xplore. The IEEE reserves the right to exclude a paper from distribution after the conference (including its removal from IEEE Explore) if the paper is not presented at the conference. .......................................................... JOURNAL SPECIAL ISSUE Authors of the best scientific papers will be invited to submit an extended version of their work to the Scalable Computing: Practice and Experience (ISSN 1895-1767) Journal. Location: Opatija, with its 170 years long tourist tradition, is the leading seaside resort of the Eastern Adriatic and one of the most famous tourist destinations on the Mediterranean. With its aristocratic architecture and style, Opatija has been attracting renowned artists, politicians, kings, scientists, sportsmen as well as business people, bankers, managers for more than 170 years. The tourist offering of Opatija includes a vast number of hotels, excellent restaurants, entertainment venues, art festivals, superb modern and classical music concerts, beaches and swimming pools and is able to provide the perfect response to all demands. Opatija, the Queen of the Adriatic, is also one of the most prominent congress cities on the Mediterranean, particularly important for its international ICT conventions MIPRO that have been held in Opatija since 1979 gathering more than a thousand participants from more than forty countries. These conventions promote Opatija as the most desirable technological, business, educational and scientific center in Southeast Europe and the European Union in general.","date_start":"2019-05-20","date_end":"2019-05-24","important_dates":{"abstract":"","full":"2019-01-14","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Opatija","Croatia"],"name":"","street":"","city":"Opatija","state":"","ZIP":"","country":"Croatia"},"organizers":["Croatian Society for Information and Communication Technology, Electronics and Microelectronics - MI"],"societies":[],"indexes":[],"emails":["skala@irb.hr"]}