{"name":"\"Quality & Reliability Engineering: Trends and Future Directions\" in Journal of Universal Computer Science","series":"","short":"","website":"http://www.jucs.org/ujs/jucs/info/special_issues/JUCS_Quality_and_Reliability_Engineering_2018_CfP.pdf","content":"\"Quality & Reliability Engineering: Trends and Future Directions\" in Journal of Universal Computer Science Background Look at virtually any industry – automotive, avionics, oil, telecommunications, banking, semiconductors, pharmaceuticals – all these are highly dependent on computing for their basic functioning. Science and Technology demand high-performance hardware and high-quality software for making improvements and breakthroughs. Like machinery replaced craftsmanship in the industrial revolution, computers and intelligent parts are quickly pushing their mechanical counterparts out of the market. Contemporary examples of highly complex hardware/ software systems can be found in projects undertaken by Defense, Telecommunications and a variety of other industries. The demand for complex hardware/software systems has increased more rapidly than the ability to design, implement, test and maintain them. When the requirements for and dependencies on computers increase, the possibility of crises from computer failures also increases. Needless to say, the reliability of computer systems has become a major concern for our society. Recent literature is replete with horror stories of projects gone awry, generally as a result of problems traced to software. It makes us wonder whether the software is reliable at all, whether we should use the software in safety-critical embedded applications. With processors and software permeating the safety-critical embedded world, the reliability of software is simply a matter of life and death. Are we embedding potential disasters while we embed software into systems? ============================================================================ Paper Submission and Evaluation Procedure Authors are invited to submit original and unpublished papers in areas of reliability, quality, safety and risk analysis. The papers for J.UCS (http://www.jucs.org/) should be suitable for experts in the respective fields, but also accessible to wider academic audience. Furthermore, it is expected that authors cite relevant articles from the Journal of Universal Computer Science in their papers. Only original research contributions toward the mentioned topics will be considered. (see http://www.jucs.org/jucsinfo/aims). ============================================================================ Topics The Special Issue is devoted to reliability, quality, testing, safety and risk analysis. It offers an opportunity for researchers and practitioners to identify new promising research directions as well as to publish recent advances in this area. The scope of this issue includes, but is not limited, to the following topics: • Reliability & Maintenance Model • Quality • Safety • Risk Analysis • Testing • System Reliability • Software Reliability • Software Security • Vulnerability • Multi-Criteria Decision Making (MCDM) Guest Editors: Alok Mishra, Atilim University, Turkey, Sunil Kumar Khatri, Amity University, India, P K Kapur, Amity University, India and Uday Kumar, Luleå University of Technology (LTU), Sweden Deadline for submissions: January 31, 2018\\. Please see details at the following: http://www.jucs.org/ujs/jucs/info/special\\_issues/in\\_preparation.html","date_start":"2018-12-17","date_end":"2018-01-31","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Austria"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":["Journal of Computer Science (J.UCS)"],"societies":[],"indexes":[],"emails":[]}