{"name":"The Presence of Women Editors in the Press Industry (1850-1950)","series":"","short":"","website":"https://www.cfplist.com/nemla/Home/S/16676","content":"The Presence of Women Editors in the Press Industry (1850-1950). This panel examines the active participation of women in the public dialogue through the prism of their periodical publications. The rise of the periodical press has been recognized as a key factor in the formation of the public sphere in the nineteenth century (Habermas 1962). Studies of twentieth-century editorship, however, tend to take the institutionalization of editorship for granted. Male editors are often known by name, and they are studied in the light of their impact on the socio-political landscape of their time. Historically, however, editorship (and women’s editorship in particular) was often anonymous or pseudonymous and even explicitly staged as performance. Therefore, this panel encourages a thorough study of the common strategies and the cross-cultural networks that women editors developed in order to make their voice heard. More particularly, this panel outlines possible avenues for theoretical reflection on editorship by shedding light on periodical publications across linguistic, socio-cultural and historical boundaries. Transnational perspectives on female editorship are particularly welcome because they offer a comparative viewpoint and a complementary insight into women’s determination to position themselves in the public arena as makers of culture, arbiters of social values and proponents of their rights. Last but not least, this panel draws attention to the influence that female editorship exerted on the political, cultural, and aesthetic evolution which would come to shape and define modernity. Scholars at any stage of their research are welcome to submit their abstracts (100-250 words) before the 30th of September 2017\\. Submissions for this panel can be sent via the convention’s website: https://www.cfplist.com/nemla/Home/S/16676 For further information you can contact the organizer: bezari.christina@gmail.com","date_start":"2018-04-12","date_end":"2018-04-15","important_dates":{"abstract":"","full":"2017-09-30","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","Journalism"],"location":{"virtual":"","full":["Pittsburgh","United States"],"name":"","street":"","city":"Pittsburgh","state":"","ZIP":"","country":"United States"},"organizers":[""],"societies":[],"indexes":[],"emails":["bezari.christina@gmail.com"]}