{"name":"6th Edition of International Conference on Pharmacognosy and Medicinal Plants with a theme on Theme: Medicinal Plants: Modifying Contrast in Health Care Sy","series":"","short":"","website":"http://pharmacognosy.euroscicon.com","content":"EuroSciCon takes pleasure in inviting the scientific community across the globe to attend the 6th Edition of International Conference on Pharmacognosy and Medicinal Plants during April 16- 17, 2018 at Amsterdam, Netherlands with a motto to Explore Innovations in Ayurveda, Herbal Drug Discovery, Biotechnology, Organic Cosmetics, Medicinal Plants in Disease treatment. This Pharmacognosy program includes the dissertation of providing statistics of physical, biological and chemical properties of drugs and products that are obtained from natural source. This deals with all the parameters of medicinal, traditional and also herbal plants. Natural products from different plant sources will be discussed with their analytical designs. The Toxicological consequences of plants and products obtained by natural source are examined by the anticipation of plants called phytomedicine .This phytotherapy acts as a key in prevention of toxicological and adverse effects of plants. An advanced and modern techniques are initiated which helps in plant research many innovative plant extraction methods were developed which helps in other streams like genetics, plant science, genomics. The extraction method also plays a main role in formulation and standardization of natural products including plant medicine. Pharmacognosy 2018 Conference will encourage Young Researcher’s Forum, scientists and the researchers in their early stage of career graph to widely discuss their outcome so as to enrich and develop the idea. The ‘Best Poster Award’ is meant to encourage students in taking active part in the International Science platform to sharpen their skills and knowledgebase. The important tracks that are part of Pharmacognosy 2018 includes, Natural Products of Medicinal Interest, Traditional Medicine, Pharmacognosy, Analytical Methods For Natural Products, Toxicological Studies of PlantProducts, Phytomedicine, Phytochemistry, Plant Biotechnology and Tissue Culture, Innovative Plant Extraction Methods, Applied Plant Sciences, Complementary And Alternative Medicine, Applications Of Natural Products, Natural Products in Medicines, Analytical Techniques In Phytochemistry, Standardization Of Herbal Drugs, Formulation and Manufacture of Plant Medicines, Clinical pharmacognosy and Aromatic Medicinal Plants, Natural Products in Cancer Prevention and Therapy, Marine Drugs, Ethnopharmacology, Medicinal Plant Chemistry . Pharmacognosy 2018 is comprised of 21 tracks designed to offer comprehensive sessions that address current issue. For more scientific sessions and abstract submission, please visit: http://pharmacognosy.euroscicon.com/abstract-submission The Abstracts that are accepted for presentations are published in the proceedings of the Journals Grab the opportunity to participate by registering through following link: http://pharmacognosy.euroscicon.com/registration For further details, please contact: Regards Veronika Rockova | Program Manager Pharmacognosy 2018 Euroscicon ltd., | Highstone House, 165 High Street, Barnet, Hertfordshire EN5 5SU, UK Direct: (+44) 020 3807 3712 E: pharmacognosy@eurosciconmeetings.com","date_start":"2018-04-16","date_end":"2018-04-17","important_dates":{"abstract":"","full":"2017-09-25","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Amsterdam","Netherlands"],"name":"","street":"","city":"Amsterdam","state":"","ZIP":"","country":"Netherlands"},"organizers":["Self Sponsor"],"societies":[],"indexes":[],"emails":["pharmacognosy@eurosciconmeetings.com"]}