{"name":"2019 3rd International Conference on Environmental and Energy Engineering (IC3E 2019)","series":"","short":"","website":"http://www.ic3e.net/ ","content":"EI/Scopus-IC3E : 2019 3rd International Conference on Environmental and Energy Engineering (IC3E 2019) Call For Papers 2019 3rd International Conference on Environmental and Energy Engineering (IC3E 2019)-CFP Apr. 25-27, 2019| Qingdao, China Web: http://www.ic3e.net/ 2019 3rd International Conference on Environmental and Energy Engineering (IC3E 2019) is co-organized by Shandong University, International Society for Environmental Information Sciences (ISEIS) and Asia Pacific Institute of Science and Engineering(APISE), sponsored by Xiamen University of Technology. The conference will be hosted in Qingdao, China from Apr. 25-27, 2019! ●Publication and Indexing All the registered and presented papers will be published in the IOP Conference Series: Earth and Environmental Science, which will be indexed by EI Compendex, Scopus, Conference Proceedings Citation Index-Science (CPCI-S)(Thomson Reuters, Web of Science), Inspec and other indexing organizations. Selected papers with great extension will be recommended to publish in international journals. . ●Topics(for more topics: http://www.ic3e.net/CFP.html) Ecology and Biodiversity Conservation Environmental Pollution & Management Renewable Energy Sources Computational Techniques Solid waste management Air pollution control and equipment Pollution prevention in industry Environmental management systems Solar electricity and PV applications Solar cell technology, Solar cell materials, testing and efficiency Nanotechnology applications to RE Solar thermal applications Wind energy NG as fuel for rural transportation Hydrogen and fuel cells Hybrid and electric vehicles Bio-diesel fuels Fuel additives ●Paper Submission Submission Email:ic3e@apise.org Electronic submission system: https://cmt3.research.microsoft.com/IC3E2019 ●Call for participants 1, Presenter: If you are interested in giving presentation on conference, without publishing your paper in the proceeding, you need to submit the abstract and title of your presentation to us:cceai@apise.org 2, Listener: You are welcome to attend this great event. You need to complete the registration as Listener before the registration deadline. 3, Invited Speakers: If you are interested in being an invited speaker, to share your ideas in the felid of Control Engineering and Artificial Intelligence, you are welcome to join us! Please send your CV to us. 4, Reviewer: We sincerely welcome professors, associate professors, teachers and other experts in the areas of Machine Vision and Information Technology join the conference as a reviewer. ●Contact Us Ms. Yury Yu E-mail: ic3e@apise.org Tel:+852-30506939( Hong Kong) Web: http://www.ic3e.net/","date_start":"2019-04-25","date_end":"2019-04-27","important_dates":{"abstract":"","full":"2018-08-10","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental"],"location":{"virtual":"","full":["Qingdao","China"],"name":"","street":"","city":"Qingdao","state":"","ZIP":"","country":"China"},"organizers":["APISE"],"societies":[],"indexes":[],"emails":["ic3e@apise.org","cceai@apise.org"]}