{"name":"Главная выставка зарубежного образования QS, Москва 2 октября","series":"","short":"","website":"https://go.evvnt.com/265982-0?pid=4868","content":"Приглашаем посетить бесплатную международную выставку магистерских и PhD программ, от создателей престижного рейтинга университетов - QS World University Rankings. Мероприятие пройдет 2 октября с 15.00 до 20.00, Рэдиссон Славянская в Москве. Регистрация открыта - bit.ly/2LpeI3c Не упустите возможность всего за один день получить достоверную информацию из первый уст и заручиться поддержкой директоров приёмных комиссий, которые будут курировать ваше поступление. В выставке примут участие более 30 университетов из 15 стран, включая Великобританию, США, Францию, Италию, Китай: King's College, UCL, LSE, Cass, Rotterdam Erasmus, BI Norwegian, Bocconi, University of California Los Angeles, Singapore Management University, Hanken School of Economics и многие другие. - Узнайте о 1000 программах обучения в области естественных наук, технологий, инжиниринга, математики, финансов, экономике, менеджменте, маркетинге, IT и др.; - Примите участие в семинарах по подготовке к IELTS и TOEFL; - Получите рекомендации по составлению резюме от Career.ru; - Подайте заявку на стипендию от QS и университетов партнеров. Общий фонд $7 млн.; - Выиграйте курс подготовки к IELTS, TOEFL, карьерную консультацию, бизнес книги и др.; - Сделайте бесплатное профессиональное фото для резюме. URLs: Tickets: https://go.evvnt.com/265982-1?pid=4868 Facebook: https://go.evvnt.com/265982-2?pid=4868 Time: 3:00 pm to 8:00 pm Venue details: Radisson Slavyanskaya, 2 Europe Square, Moscow, 121059, Russia Price: Free entry : RUB 0.0","date_start":"2018-10-02","date_end":"","important_dates":{"abstract":"","full":"2018-10-01","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Moscow","Russian Federation"],"name":"","street":"","city":"Moscow","state":"","ZIP":"","country":"Russian Federation"},"organizers":["QS World Grad School Tour"],"societies":[],"indexes":[],"emails":[]}