{"name":"The International Workshop on Applied Modeling and Simulation","series":"","short":"WAMS 2018","website":"http://www.msc-les.org/conf/wams2018","content":"he 11th WAMS concentrates on Applications of Simulation and Computer Technologies. Indeed the new 11th edition in 2018 will result another great opportunity for the International Simulation Community to meet together in the beautiful framework of Praha (Czech Praha) in Czech Republic, one of most popular destinations in Europe In facts, WAMS is a workshop very effective in networking and very useful to set up new proposals and projects. Worldwide specialists have the opportunity to participate and to interact within this important International Forum on Applied M&S. The audience will include both users, vendors and scientists operating in applying advanced techniques to the main application areas and sectors including Industry, Business, Logistics Environment, Services & Defense. WAMS started as a series of international workshops organized in Latin America, AMS2004 (Rio de Janeiro) and AMS2006 (Buzios); these events were focusing on Application and Theory of Modeling & Simulation. In the following years, WAMS was organized in both side of Atlantic Ocean (i.e.Rio de Janeiro, Italian Riviera), while in 2011, WAMS was co-located with the International Marine Defense Show in St.Petersburg Russia organized in Joint Cooperation with SPIIRAS Russian Academy of Science. In 2012, WAMS was held in Rome in connections with the NATO CAX Forum. The WAMS 2013 was back in Latin America and it attracted scientists, technicians and experts from world leading Universities, Institutions, Agencies and Companies; indeed WAMS 2013 edition was held in Buenos Aires, Argentina and was attended by all Latin America Countries as well as by scientists from Europe, North America, Asia and Australia. In 2014, WAMS moved in the wonderful framework of the Bosphorous (Istanbul, Turkey) in co-location with the NATO CAX Forum. Therefore WAMS returned in Italy in 2015 (Bergeggi), 2016 (Cagliari) and 2017 Florence.","date_start":"2018-10-17","date_end":"2018-10-19","important_dates":{"abstract":"","full":"2018-05-15","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Biological Engineering & bioinformatics"],"location":{"virtual":"","full":["Prague","Czech Republic"],"name":"","street":"","city":"Prague","state":"","ZIP":"","country":"Czech Republic"},"organizers":["Cal-tek S.r.l."],"societies":[],"indexes":[],"emails":[]}