{"name":"Globalization and Federations","series":"","short":"","website":"http://www.glocalismjournal.net/calls_for_papers/issues/call-for-papers-2018--2--globalization-and-federations.kl","content":"GLOCALISM JOURNAL OF CULTURE, POLITICS AND INNOVATION CALL FOR PAPERS \"Glocalism\", a peer-reviewed, open-access and cross-disciplinary journal, is currently accepting manuscripts for publication. We welcome studies in any field, with or without comparative approach, that address both practical effects and theoretical import. All articles should be sent to: p.bassetti@globusetlocus.org and davide.cadeddu@unimi.it Articles can be in any language and length chosen by the author, while its abstract and keywords have to be in English. Deadline: April 30, 2018\\. This issue is scheduled to appear at end-June 2018\\. Website: http://www.glocalismjournal.net/ Direction Committee: Arjun Appadurai (New York University); Seyla Benhabib (Yale University); Sabino Cassese (Scuola Normale Superiore, Pisa); Manuel Castells (Universitat Oberta de Catalunya, Barcelona); Fred Dallmayr (University of Notre Dame); David Held (Durham University); Robert J. Holton (Trinity College Dublin); Sheila Jasa-noff (Harvard University); Alberto Martinelli (Università degli Studi di Milano); Anthony McGrew (La Trobe Uni-versity, Melbourne); Alberto Quadrio Curzio (Università Cattolica del Sacro Cuore, Milano); Roland Robertson (University of Aberdeen); Saskia Sassen (Columbia University); Amartya Sen (Harvard University); Gayatri Chakravorty Spivak (Columbia University); Salvatore Veca (Istituto Universitario di Studi Superiori di Pavia). the topic of this issue GLOBALIZATION AND FEDERATIONS Today's federal societies are going through a period of rapid and significant transformation. The phenomena of political modernization have contributed to changing not only the internal institutional architecture of federal states, but also to redefining their behaviour in the international field. This is evidenced by the direction of new diplomatic, military and financial strategies by the most well known and powerful federations. The processes of globalization are also exerting formidable tensions on every consolidated configuration of federations' internal borders as well as between the regional and national identities and cultures that coexist with-in them. The internal instability of many multinational and multi-ethnic federations manifests itself, for example, in the continuous formation of new popular movements and in the appearance of new expressions of political, cul-tural and linguistic opposition. These centrifugal impulses are countered by cases of social homologation and the strengthening of a common identity which are certainly favoured by the growing economic and technological in-terdependence that defines the global age. These tendencies moving towards the strengthening of political unity extend beyond the borders of existing federal states to include the sphere of international relations where there is no lack of new integration experi-ments of federal form on a regional and continental scale. Although their prospects of future success are ques-tioned by many observers, the European Union, the Association of Southeast Asian Nations and other suprana-tional confederal systems are increasingly becoming alternative institutional models for the classic nation state. These integration processes indicate uncertain and contradictory characteristics which are linked to other funda-mental problems of political modernity such as the increase in inequalities between countries, the presence of democratic deficit in various levels of government and the inability of central institutions to find a solution to com-mon political challenges. Understanding these dynamics seems to require analysis and an extended reflection on the relationship be-tween globalization and federalism aimed at identifying empirical peculiarities or developing multidisciplinary the-oretical models that are innovative and of vast scientific scope.","date_start":"2018-04-30","date_end":"","important_dates":{"abstract":"","full":"2018-04-30","notification":"","final":""},"topics":["Social Sciences","Political-Science","interdisciplinary"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["Glocalism. Journal of Culture, Politics and Innovation"],"societies":[],"indexes":[],"emails":["p.bassetti@globusetlocus.org","davide.cadeddu@unimi.it"]}