{"name":"Disney Data and Analytics Conference","series":"","short":"","website":"www.disneydataconference.com","content":"The Disney Data and Analytics Conference 2018 August 28-29, 2018 Disney’s Contemporary Resort, Orlando, Florida Registration pricing: • Early Bird Pricing (available through 6/1/18): $1,995 • Early Bird Group Pricing (available through 6/1/18): $1795 (groups of three or more) • Group Pricing: $1,995 (groups of three or more) • Standard Pricing: $2395 The Disney Data & Analytics Conference 2018 will bring together over 1,300 executives, managers, and analysts representing over 200 companies and universities, plus all segments of The Walt Disney Company, including Parks & Resorts, Media Networks, Studio Entertainment, and Consumer Products & Interactive Media. Attendees represent an array of analytic disciplines including Revenue Management, Pricing, Forecasting, Marketing Analytics, CRM, Research, Technology, Data Management, and Decision Science. Join this group of analytics professionals and varied industries to: • Learn from Disney and Industry leaders: DDAC keynotes & sessions are led by some of the top leaders in the industry. This is your opportunity to learn from their years of real-world experience. • Discover emerging trends: Learn the latest trends and techniques in analytical tool development, scientific approaches, and extracting • Network: DDAC 2018 will bring together over 1,300 professionals from over 135 industries and academia, and we’ll showcase some of our industry partners and Disney teams in the Vendor Showcase. Evening and other social events are an exciting way to engage with conference attendees and sponsors with a touch of Disney Magic! • Find Solutions: Identify practical solutions to complex business problems regardless of industry. You’ll leave with specific skills, best practices, and strategies you can put to work immediately. This Conference will provide you with the tools and training to integrate advanced decision-making techniques into business processes that center on the experience of your customers, clients, and guests. While the specific methods and integration may change from industry to industry, the science and techniques remain the same. We’re confident you’ll see examples of how data-based, analytical decisions work in all areas of business. To register, please visit disneydataconference.com/register. Registration includes full access to all events including keynote presentations, breakout sessions, special events and the expo floor. Rooms are available at a convention rate at Disney’s Grand Floridian Resort and Spa, Disney’s Contemporary Resort, and Disney’s Wilderness Lodge. Room booking occurs after registration has been completed.","date_start":"2018-08-28","date_end":"2018-08-29","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Economics","Big Data Mining & Analysis"],"location":{"virtual":"","full":["Orlando","Florida","United States"],"name":"","street":"","city":"Orlando","state":"Florida","ZIP":"","country":"United States"},"organizers":["The Walt Disney Company"],"societies":[],"indexes":[],"emails":[]}