{"name":"2017 International Conference on Artificial Intelligence, Automation and Control Technologies","series":"","short":"AIACT 2017","website":"http://www.aiact.net","content":"Welcome to 2017 International Conference on Artificial Intelligence, Automation and Control Technologies (AIACT 2017). AIACT 2017 is organized by China University of Geosciences (Wuhan). It will be held in Wuhan from April 7th-9th, 2017\\. Technical Sponsored by York Universty, Beijing Jiaotong Univeristy, HKSME. ●Publication and Indexing All the registered and presented papers will be included in the conference proceeding, which will be indexed by Ei Compendex, SCOPUS, Inspec, Conference Proceedings Citation Index – Science (CPCI-S)(Thomson Reuters, Web of Science)and other databases. ●Confirmed Speakers: Prof. Dan Zhang (ASME Fellow), York University, Canada Prof. Han Xiong Li (IEEE Fellow), the City University of Hong Kong, Hong Kong Prof. Songyi Dian，Sichuan University, China Prof. Johan Potgieterm, Massey University, New Zealand ●Papers are invited to submit to AIACT 2017 in the following (non-exclusive) topics: \\*\\*Control and Automation Control theory & applications optoelectronics Artificial Intelligence tools & Applications CAD Design & Testing Flexible Manufacturing Systems Fuzzy Logic Fuzzy and Neural Systems Heuristic and AI Planning Strategies and Tools Industrial Process Control Computational Theories of Learning Instruments and Vibration Control ●Paper Submission 1, Papers can be submitted as PDF via EasyChair: http://www.easychair.org/conferences/?conf=aiact2017 2, You can also choose to submit your paper directly to aiact@smehk.org 3, Contributions must be written in English and report on original, unpublished work not submitted for publication elsewhere. Submissions not adhering to the above specified constraints may be rejected without review. ●CONTACT US Ms. Molly Peng Email: aiact@smehk.org Website: http://www.aiact.net/","date_start":"2017-04-07","date_end":"2017-04-09","important_dates":{"abstract":"","full":"2017-03-07","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Biological Engineering & bioinformatics"],"location":{"virtual":"","full":["Wuhan","China"],"name":"","street":"","city":"Wuhan","state":"","ZIP":"","country":"China"},"organizers":["York Universty, Beijing Jiaotong Univeristy, HKSME"],"societies":[],"indexes":[],"emails":["aiact@smehk.org"]}