{"name":"ECOSUD 2019 - 12th International Conference on Ecosystems and Sustainable Development","series":"","short":"","website":"https://www.wessex.ac.uk/conferences/2019/ecosud-2019","content":"Introduction ECOSUD 2019 is the 12th International Conference in the well-established series on Ecosystems and Sustainable Development. The meetings provide a unique forum for the presentation and discussion of recent work on different aspects of ecosystems and sustainable development, including physical sciences and modelling. The aim of the Conference is to encourage and facilitate interdisciplinary communication between scientists, engineers, socio-economic specialists and other professionals working in ecological systems and sustainable development. Emphasis will be given to those areas that will most benefit from the application of scientific methods for sustainable development, including the conservation of natural systems around the world. The conference seeks to integrate thermodynamics, ecology and economics. A current area of particular interest is the study of distributed systems in order to avoid transport recovery and waste reduction. This successful series first started in Peñíscola, Spain (1997) and continued in Lemnos, Greece (1999); Alicante, Spain (2001); Siena, Italy (2003); Cadiz, Spain (2005); Coimbra, Portugal (2007); Chianciano Terme, Italy (2009), Alicante, Spain (2011), Bucharest, Romania (2013), Valencia, Spain (2015) and Cadiz, Spain (2017). The papers presented at this conference as well as all preceding meetings in the series have been permanently stored in the Wessex Institute eLibrary as WIT Transactions (see http://www.witpress.com/elibrary) where they are easily accessible to the scientific community. They contribute a whole record of the state of the art in ecosystems and related fields. The conference books are produced in paper and digital format and widely distributed throughout the world. Conference Topics The following list covers some of the topics to be presented at ECOSUD 2019\\. Papers on other subjects related to the objectives of the conference are also welcome. Energy systems and the environment Sustainable development and planning Ecosystem modelling Environmental innovative approaches Natural resources management","date_start":"2019-06-19","date_end":"2019-06-21","important_dates":{"abstract":"","full":"2019-03-19","notification":"","final":""},"topics":["Business","Information-Technology","Sustainable Development and Engineering"],"location":{"virtual":"","full":["Valencia","Spain","Spain"],"name":"","street":"","city":"Valencia","state":"Spain","ZIP":"","country":"Spain"},"organizers":["Wessex Institute"],"societies":[],"indexes":[],"emails":[]}