{"name":"Human Rights, Violence and Dictatorship - 2nd International Interdisciplinary Conference in Gdansk, Poland","series":"","short":"","website":"http://rightsviolence.ug.edu.pl","content":"In the time when human rights are violated on a regular basis, violence triumphs, and feeble democracies ever more often back down before authoritarian rule, there obviously arises the need to reflect on the possible ways of counteracting such phenomena. Our interdisciplinary conference is intended as a fitting opportunity for this reflection. We would like to look at various manifestations of dictatorship, violence and human rights violation, whether historical or current. We will describe them in political, social, psychological, cultural and many other terms. We also want to devote considerable attention to how the situation of human rights and dictatorship is represented in artistic practices: in literature, film, theatre or visual arts. We invite researchers representing various academic disciplines: history, politics, psychology, sociology, anthropology, philosophy, literary studies, theatre studies, film studies, fine arts, design, memory studies, migration studies, consciousness studies, dream studies, gender studies, postcolonial studies, medical sciences, psychiatry, psychoanalysis, cognitive sciences, economics, law and other. Different forms of presentations are encouraged, including case studies, theoretical investigations, problem-oriented arguments, and comparative analyses. We will be happy to hear from both experienced scholars and young academics at the start of their careers: doctoral students, graduate and undergraduate students. We also invite all persons interested in participating in the conference as listeners, without giving a presentation. We hope that due to its interdisciplinary nature, the conference will bring many interesting observations on and discussions about the role of human rights and dictatorship in the past and in the present-day world.","date_start":"2018-06-07","date_end":"2018-06-08","important_dates":{"abstract":"","full":"2018-05-10","notification":"","final":""},"topics":["Social Sciences","Psychology","interdisciplinary"],"location":{"virtual":"","full":["Gdańsk","Poland"],"name":"","street":"","city":"Gdańsk","state":"","ZIP":"","country":"Poland"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}