{"name":"18th IFAC Conference on Technology Culture and International Stability TECIS 2018","series":"","short":"","website":"www.tecis18.org","content":"\\*Organizers: - Azerbaijan Robotics and Automation Society (ARAS) -Vienna University of Technology, IHRT \\*Partners: -Ministry of Education of Azerbaijan Republic -Azerbaijan National Academy of Sciences -Ministry of Transport, -Communication and High Technologies of the Azerbaijan Republic \\*Sponsors: -International Federation of Automatic Control (IFAC) - IFAC TC 9.5 Technology, Culture and International Stability \\*\\*\\*TOPICS\\*\\*\\* The scope of the conference will cover but is not limited to: • Control and Automation to Improve Stability • Young Engineers in Control • Automation and Control in Oil and Gas Industry • Social Aspects of Oil and Gas Engineering • Developments in Petrochemical Industry • Development of Regions, Countries • Social Networks • Managing the Introduction of Technological Change to Improve Stability • Technology in Post-conflict Regions • Innovation Management • Open Innovation and Applications • Enterprise Integration and Networking, Software • Cost Oriented Automation (COA) • SME-oriented Automation • Decision Support Systems for SME's • Semi-Automated Assembly and Disassembly (EoL) • Intelligent Systems and Applications • Mechatronic Systems and Robotics • Robotics and Handling Devices • Artificial Intelligence and Applications • Retrofitting of Automation Devices • Engineering Ethics • Tele-medical Systems • Cross-cultural Aspects of Engineering (TRIZ theory, etc.) • Control & Political Stability • Models & Simulation • Sustainable Design and Control • Control of Security and Privacy • Human aspects of safety and risk engineering • Biomedical Systems \\*Survey papers will be given by: F. Allgöwer (Stuttgart University, Germany; IFAC President) T. Duda (Emerson Automation, Switzerland) N. Jesse (QuinScape, Germany) P. Groumpos (University of Patras, Greece) L. Stapleton (Waterford Institute of Technology, Ireland) F. Aliyev (Institute of Applied Mathematics, BSU, Azerbaijan) T. Aliyev (Institute of Control Systems, ANAS, Azerbaijan) M. Sarfraz (Kuwait University, Kuwait) \\*Important Dates: Draft papers submission deadline 31.05.2018 Extended Draft Paper Submission Deadlines 06.06.2018 Notification of acceptance 15.07.2018 Early registration deadline 01.08.2018 Full paper submission 15.08.2018 Preconference activities 12.09.2018 Conference dates 13.-15.09.2018 Post Conference activities 16.09.2018 \\*Registration fees: - Early Regular € 200 - Early Student/retired € 50 - Late Regular € 250 - Late Student/retired € 50 - On site Regular € 300 - On site Student/retired € 70 \\*Paper submission: “All publication material submitted for presentation at an IFAC-sponsored meeting (Congress, Symposium, Conference, Workshop) must be original and hence cannot be already published, nor can it be under review elsewhere. The authors take responsibility for the material that has been submitted. IFAC-sponsored conferences will abide by the highest standard of ethical behaviour in the review process as explained on the Elsevier webpage (http://www.elsevier.com/journal-authors/author-rights-and-responsibilities ), and the authors will abide by the IFAC publication ethics guidelines (http://www.ifac-control.org/events/organizersguide/PublicationEthicsGuidelines.pdf/view ). Accepted papers that have been presented at an IFAC meeting will be published in the proceedings of the event using the open-access IFAC-PapersOnLine series hosted on ScienceDirect (http://www.sciencedirect.com). To this end, the author(s) must confer the copyright to IFAC when they submit the final version of the paper through the paper submission process. The author(s) retain the right to use a copy of the paper for personal use, internal institutional use at the author(s)’ institution, or scholarly posting at an open web site operated by the author(s) or their institution, limited to noncommercial use. Any other use of the paper requires approval by IFAC.” Authors are encouraged to submit papers, invited sessions, pre-conference workshops & tutorials, as well as exhibitions & posters from industrial companies or institutions. Prospective authors are invited to submit papers of maximum six pages. All contributions must be formatted according to IFAC style and must be submitted via the Paper Plaza Conference Manuscript Management System. The PDF file is limited to 2MB in size. Authors are encouraged to follow IFAC guidelines for paper formatting. Please consult the TECIS 2018 website for more information. Submitted papers at TECIS 2018 must be original and hence cannot be already published, nor can they be under review elsewhere. Prospective authors are expected to present their papers at the conference. For each accepted paper at least one of the authors should register (full registration) before uploading the final version of the paper. Each paper is uniquely identified by a DOI (Digital Object Identifier), the current standard for electronic papers citation. IFAC proceedings are indexed by Scopus, the Thomson Reuter’s Web of Science (WoS), Google Scholar and etc. A proposal for an invited session must include titles, abstract, authors of either one survey and four regular or six regular papers, a one-page description for the special session including session outline, contact information of the proposer. The best IFAC young author award (IFAC, YAA) will be granted to a PhD student and/or a student less than 30 years as the first author and presents the paper at TECIS 2018\\. Shortlisted nominees will get a travel grant. During the event technical and cultural visits will be scheduled, e.g. temple of fire, Heydar Aliyev Culture Centre, Old town center, Sumgayit Technology Park, swimming oil fields – Oil Rocks, Jumeirah Beach, Sumgayit city and others. Baku is in the middle of Europe and Asia, on the ancient Silkway, easy accessible from both continents with railways and direct flights from most capitals worldwide, or low-cost flights through Istanbul, Kiew, Moscow and a lot more destinations.","date_start":"2018-09-13","date_end":"2018-09-15","important_dates":{"abstract":"","full":"2018-06-06","notification":"","final":""},"topics":["Engineering & Technology","Mechanical/Industrial","environmental engineering"],"location":{"virtual":"","full":["Baku","Azerbaijan"],"name":"","street":"","city":"Baku","state":"","ZIP":"","country":"Azerbaijan"},"organizers":["Azerbaijan Robotics and Automation Society"],"societies":[],"indexes":[],"emails":[]}