{"name":"2019 4th International Conference on Design Engineering and Science","series":"","short":"ICDES 2019","website":"http://www.icdes.org","content":"2019 4th International Conference on Design Engineering and Science (ICDES 2019) Feb. 22-24, 2019/Nice, France Web: http://www.icdes.org/ 2019 4th International Conference on Design Engineering and Science (ICDES 2019) . 2019 4th International Conference on Design Engineering and Science (ICDES 2019) will be hosted in Nice, France during Feb.22-24, 2019, in conjunction with IC4M 2019\\. ICDES 2019 is organized by Hong Kong Society of Mechanical Engineers, technical sponsored by Gent University, IQS and other organizations. With the continous success of ICDES, we believe that ICDES 2019 will be more exciting and obviously the main annual Design Engineering and Science conference aimed at presenting current research. The idea of the conference is for the scientists, scholars, engineers and students from the universities all around the world and the industry to present ongoing research activities, and hence to foster research relations between the universities and the industry.Publication Information ●Publication Information 1) All the registerd and presented papers of ICDES 2019 will be included in MATEC web of Conferences (ISSN:2261-236X), which will be indexed by Ei compendex, Scopus and Conference Proceedings Citation Index (Web of Science), etc. 2) High quality papers\\* will be recommended to publish in Journal of Remanufacturing (ISSN: 2210-464X (Print) 2210-4690 (Online)) 3) High quality papers\\* will be recommended to publish in International Journal of Advanced Materials and Production (IJAMP),ISSN 2520-436X( Online). ●Topics(for more topics: http://www.icdes.org/cfp.html) Design Methodology Design process Design and Development Design of mechanical elements Design and Production Design management Computer graphics CAD/CAM/CAE Accuracy and Measurement ●Paper Submission Submission Email:icdes@smehk.org Submission System: https://cmt3.research.microsoft.com/ICDES2019 ●Call for participants 1,Presenter:If you are interested in giving presentation on conference, without publishing your paper in the proceeding, you need to submit the abstract and title of your presentation to us: icdes@smehk.org 2,Listener:You are welcome to attend this great event. You need to complete the registration as Listener before the registration dealdine. Send email to icdes@smehk.org for further information. 3,Reviewer:We sincerely welcome experts in the areas of Design Engineering and Science join the conference as reviewer. ●Contact Us Ms. Amber Email: icdes@smehk.org Tel:+852-30697937( Hong Kong) Web: http://www.icdes.org/","date_start":"2019-02-22","date_end":"2019-02-24","important_dates":{"abstract":"","full":"2019-01-20","notification":"","final":""},"topics":["Engineering & Technology","Design"],"location":{"virtual":"","full":["Nice","France"],"name":"","street":"","city":"Nice","state":"","ZIP":"","country":"France"},"organizers":["HKSME"],"societies":[],"indexes":[],"emails":["icdes@smehk.org"]}