{"name":"International Conference on (Neo)Victorian Studies:","series":"","short":"","website":"http://neo-victorian.studies.lcir.co.uk","content":"Organised by: London Centre for Interdisciplinary Research The Victorian Era was a complex period marked by prosperity and wealth. It was a world characterised by speed and compression of time and space, a world radically different from anything ever known in the past. The exceptional times of national growth and global expansion had a huge impact on the life of the nation and the rapid advances in science and technology facilitated the access to information, which triggered a revolution in the human mind as it increased self-awareness and self-confidence, and stimulated the spirit of (ad)venture. On the other hand, the extreme individualism of the age generated questions, doubts and inner conflicts that nurtured self-indulgence and intemperance. Charles Dickens captured the contradictory nature of the Victorian times in A Tale of Two Cities: “It was the best of times, it was the worst of times, it was the age of wisdom, it was the age of foolishness, it was the epoch of belief, it was the epoch of incredulity, it was the season of light, it was the season of darkness, it was the spring of hope, it was the winter of despair.” The same dual attitude is obvious in the new Millennium, when the economic, social, political, ideological and cultural changes has generated an ethos of individual dispersion and indecisive oscillation between progress and decadence, optimism and depression, hope and cynicism. In Britain, as everywhere else in the world, the schizoid nature of the present has created poles of objectivity and subjectivity that need re-engagement with a specific set of long-lasting values. Thus, the appeal to challenge the current state of affairs by returning to the insular sensitivity, ambition and intelligence forged by the Victorian period is not suprising, as there is an urgent need to reinterpret and reposition its essential concepts and notions from the perspective of the new insular realities. As 2019 marks the 200th anniversary of Queen Victoria's birth, the main objective of the conference is to bring together all those interested in exploring the intersections between their professions and/or interests and some distinct aspects of Neo-Victorianism, the aesthetic movement based on the deconstruction and reconstruction of the cultural framework shaped between 1837 and 1901\\. The event will focus on building and strengthening the dialogue with the past, extending it beyond Queen Victoria's 63 years of reign to the 21st-century aspects of British identity in terms of national loyalty and individual relevance. Topics include but are not limited to several core issues: Victorian principles and practices - continuity and disruption the Industrial Revolution and individual freedom the Victorian novel: adaptations and variations the Dickensian formula of neo-realism the Victorian Romance Victorian poetic emotions Victorian anxieties and insecurities the Victorian Debate: civil society and gender justice women of distinction: reformers, activists, campaigners, environmentalists and Educationalists in the Victorian era and after the legacy of Queen Victoria: between potent imperialism and postcolonial nostalgia the Neo-Victorian ethos: re-visiting Victorian and Edwardian values in the new Millennium Victoriographies and 21st-century reinterpretations (Neo)Victorian philosophies: from Utilitarianism to Steampunk (Neo)Victorian science, technology and religion: idealism and wisdom morals and morality: affections, devotions and abjections (Neo)Victorian poetry: science and sensibility decadent generations: from Oscar Wilde and Algernon Swinburne to Will Self and Joe Stretch public and private realms: fashion, design and architecture patterns of pastimes and entertainment: the public house, the theatre, the music hall, The circus Victorian and Neo-Victorian representations in the arts (Neo)Victorianism in cinema and television Victorian and Neo-Victorian visions of London The conference is addressed to academics, researchers and professionals with a particular interest related to the conference topic. We invite proposals from various disciplines including history, sociology, political studies, anthropology, culture studies and literature. Proposals up to 250 words and a brief biographical note should be sent by 10 February, 2019 to: neo-victorian.studies@lcir.co.uk. Download Paper proposal form: http://neo-victorian.studies.lcir.co.uk/ Standard registration fee – 140 GBP Student registration fee – 120 GBP Conference venue: Birkbeck, University of London, Bloomsbury, Malet Street, London, WC1E 7HX Valentines Mansion, Emerson Rd, Ilford, IG1 4XA","date_start":"2019-07-09","date_end":"2019-07-10","important_dates":{"abstract":"","full":"2019-03-20","notification":"","final":""},"topics":["Arts & Humanities","History","interdisciplinary"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["neo-victorian.studies@lcir.co.uk"]}