{"name":"2019 3rd International Conference on Control Engineering and Artificial Intelligence","series":"","short":"CCEAI 2019","website":"http://www.cceai.org/ ","content":"Scopus-CCEAI: 2019 3rd International Conference on Control Engineering and Artificial Intelligence (CCEAI 2019) Call For Papers 2019 3rd International Conference on Control Engineering and Artificial Intelligence (CCEAI 2019)-CFP JAN.24-26, 2019|Los Angeles, USA Web: http://www.cceai.org/ 2019 3rd International Conference on Control Engineering and Artificial Intelligence (CCEAI 2019)will be held in Los Angeles, USA during Jan.24-26,2019.CCEAI 2019 is organized by Asia Pacific Institute of Science and Engineering, technical sponsored by HKSME. CCEAI 2019 is a not-to-be-missed opportunity that distills the most current knowledge on a rapidly advancing discipline in one conference. Join key researchers and established professionals in the field of Control Engineering and Artificial Intelligence as they assess the current state-of-the-art and roadmap crucial areas for future research. ●Publication and Indexing All the accepted papers will be included in the volume of Journal of Physics: Conference Series (JPCS)(ISSN: 1742-6588), which will be indexed by Ei Compendex, SCOPUS, Inspec, Conference Proceedings Citation Index – Science (CPCI-S)(Thomson Reuters, Web of Science), NASA Astrophysics Data System, and other databases. Selected papers with great extension will be recommended to publish in international journals. ★CCEAI 2017/2018 conference proceeding has been Indexed by Ei/SCOPUS Compendex. ●Speakers Prof. Naira Hovakimyan University of Illinois at Urbana-Champaign, USA Professor of Mechanical Science and Engineering at UIUC, director of Intelligent Robotics Lab of CSL at UIUC,AIAA Mechanics and Control of Flight award and SWE Achievement Award, Humboldt priz, UIUC Engineering Council award. AIAA Fellow, IEEE Fellow, and member of SIAM, AMS, SWE, ASME and ISDG. cofounder and chief scientist of IntelinAir. Prof. Dan Zhang a Kaneff Professor and Tier 1 York Research Chair in Advanced Robotics and Mechatronics, the Chair of the Department of Mechanical Engineering at York University.a Professor and Canada Research Chair in Advanced Robotics and Automation, and a founding Chair of the Department of Automotive, Mechanical, and Manufacturing Engineering at the University of Ontario Institute of Technology. Prof. Pierre Larochelle Ph.D., Mechanical Engineering, University of California at Irvine the Department Head and a Professor of Mechanical Engineering at the South Dakota School of Mines & Technology. Previously he served as an Associate Dean and Professor of Mechanical Engineering at the Florida Institute of Technology. Prof. Sabri Cetin University of Illinois at Chicago, USA Prof. Wilson Q. Wang (Invited Speaker) Lakehead University, Canada Fellow, International Society for Engineering Asset Management. IEEE Fellow (Institute of Electrical and Electronic Engineers), ASME Fellow (American Society of Mechanical Engineers) Prof. Xiaofeng Wang (Invited Speaker) University of South Carolina, Associate Editor of Journal of The Franklin Institute, USA Assistant Professor, Electrical Engineering College of Engineering and Computing Research Interests: Networked Real-Time Control Systems Fault-Tolerant Control Cooperative Control Optimization System Verification Nonlinear System Design ●Topics(for more topics: http://www.cceai.org/CFP.html) Artificial Intelligence Artificial Intelligence tools & Applications Bioinformatics Natural Language Processing CAD Design & Testing Computer Vision and Speech Understanding Heuristic and AI Planning Strategies and Tools Computational Theories of Learning Intelligent System Architectures Software and Hardware Architectures Web Intelligence Applications and Search Control and Automation Automated Guided Vehicles Industrial Process Control Instruments and Vibration Control Intelligent and AI Based Control Intelligent Automation Sensor networks and networked control Robotics Mechatronics ●Paper Submission Submission Email:cceai@apise.org Electronic submission system: https://cmt3.research.microsoft.com/CCEAI2019 ●Call for participants 1,Presenter:If you are interested in giving presentation on conference, without publishing your paper in the proceeding, you need to submit the abstract and title of your presentation to us:cceai@apise.org 2,Listener:You are welcome to attend this great event. You need to complete the registration as Listener before the registration deadline. 3,Invited Speakers: If you are interested in being an invited speaker, to share your ideas in the felid of Control Engineering and Artificial Intelligence, you are welcome to join us! Please send your CV to us. 4,Reviewer: We sincerely welcome professors, associate professors, teachers and other experts in the areas of Machine Vision and Information Technology join the conference as a reviewer. ●Contact Us Ms. Beca Feng Email: cceai@apise.org Tel:+852-30506939( Hong Kong)","date_start":"2019-04-25","date_end":"2019-04-27","important_dates":{"abstract":"","full":"2018-08-10","notification":"","final":""},"topics":["Physical Science & Math","Mathematics"],"location":{"virtual":"","full":["Qingdao","China"],"name":"","street":"","city":"Qingdao","state":"","ZIP":"","country":"China"},"organizers":["APISE"],"societies":[],"indexes":[],"emails":["cceai@apise.org"]}