{"name":"2017 2nd International Conference on Advanced Materials Research and Manufacturing Technologies","series":"","short":"","website":" http://www.amrmt.org","content":"Welcome to 2017 2nd International Conference on Advanced Materials Research and Manufacturing Technologies (AMRMT 2017). AMRMT 2017 is organized by HKSME(Hong Kong Society of Mechanical Engineers). It will be held in Phuket, Thailand, from August 2-5, 2017\\. ●Publication and Indexing All the accepted papers related to Materials will be published in the volume of Key Engineering Materials (ISSN: 1662-9795),which will be indexed by Elsevier: SCOPUS,Index Copernicus Journals Master List, Google Scholar, Ei Compendex (CPX), Cambridge Scientific Abstracts (CSA), Inspec (IET, Institution of Engineering Technology), SCImago Journal & Country Rank (SJR), EBSCO,Thomson Reuters (WoS), all volumes are submitted and selected ones will be indexed. Journal: 1.Journal of Materials and Manufacturing Processes: Online ISSN: Online ISSN: 1532-2475 2.Journal of Surface Engineering: Online ISSN: 1743-2944 3\\. International Journal of Smart and Nano Materials: Online ISSN: 1947-542X ●Confirmed Speakers: 1\\. Prof. Shiv G. Kapoor： Affiliation: Grayce Wicall Gauthier Chair Professor Department of Mechanical Science&Engineering, University of Illinois, Urbana-Champaign Position: USA Editor-in-chief for the Journal of Manufacturing Processes 2\\. Prof. Alan Kin-Tak Lau: Affiliation: Swinburne University of Technology Melbourne Australia Position: International Vice Prsident of the Institution of Mechanical Engineers; European Academy of Sciences and Arts Prof-Vice-Chancellor; Associate Editor for Structural Health Monitoring. 3\\. Prof. Yong Tang: Affiliation: Shanghai institute of Organic Chemistry Position: Academician, Chinese Academy of Sciences ●Committee: 1\\. Conference Chairman Prof. Alan Kin-Tak Lau, Pro Vice Chancellor, Swinburne University of Technology, Australia 2\\. Advisory Committee Prof. Rossi Setchi, Cardiff University, UK Prof. Jennifer Loy, Griffith University, Australia Prof. Shaoyun Fu, Chongqing University, China Prof. Min Wang, The University of Hong Kong, Hong Kong SAR Prof. Jae-Won Choi, The University of Akron, USA And so on… For more: http://www.amrmt.org/com.html 3\\. International Technical Committee Prof. Teik-Thye Lim, Nanyang Technological University, Singapore Prof. Christopher Cheeseman, Imperial College London, UK Prof. Zhongwen Yao, Queen's University, Canada Dr. Mihai Caleap, University of Bristol, UK And so on…For more: http://www.amrmt.org/com.html ●Topics of interest for submission include, but are not limited to: 3D scanning and printing technologies Advanced machining technologies Advanced manufacturing processes Advanced materials Biomaterials Composite materials and repairs Energy materials and composites Laser, microwave and thermal processing Materials characteristics Mechanical properties of materials Modeling and simulations ●Paper Submission 1, Papers can be submitted as PDF via EasyChair: http://www.easychair.org/conferences/?conf=amrmt2017 2, You can also choose to submit your paper directly to amrmt@smehk.org 3, Contributions must be written in English and report on original, unpublished work not submitted for publication elsewhere. Submissions not adhering to the above specified constraints may be rejected without review.","date_start":"2017-08-02","date_end":"2017-08-05","important_dates":{"abstract":"","full":"2017-02-10","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Phuket","Thailand"],"name":"","street":"","city":"Phuket","state":"","ZIP":"","country":"Thailand"},"organizers":["HKSME"],"societies":[],"indexes":[],"emails":["amrmt@smehk.org"]}