{"name":"MENA Pharmaceutical Manufacturing Congress","series":"","short":"","website":"http://www.pharmamanufacturingmena.com","content":"Many governments in the region have started encouraging more investments in the local pharmaceutical manufacturing, either through building new pharmaceutical industrial areas, or through attracting more foreign direct investment. Some of the biggest European and American Pharmaceutical companies have ongoing projects establishing new pharmaceutical plants in the MENA region, including Saudi Arabia which is expected to be the leading pharma manufacturing hub in the region. That’s why the The MENA Pharmaceutical Manufacturing Congress will set a unique platform by gathering the pioneers from the local and international pharmaceutical companies; CEOs, plant managers, production managers, supply chain managers, quality assurance managers, regulators affairs managers, and engineers. In addition to the leading technology providers who will showcase the latest technologies and developments in pharmaceutical manufacturing. The congress will include case studies, presentations, and interactive panel discussions which will focus on issues like the obstacles fronting the pharmaceutical industry, the integration between the different concerned entities, and the future of the industry in the region. The conference will also be accompanied by an exhibition that features the latest machineries and technologies used during the different pharmaceutical manufacturing stages, raw materials suppliers, and the regional manufacturers in the country. Prices : From USD 199 to 2349","date_start":"2018-11-27","date_end":"2018-11-29","important_dates":{"abstract":"","full":"2018-09-27","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal","Manufacturing and Industrial Engineering"],"location":{"virtual":"","full":["Riyadh","Saudi Arabia"],"name":"","street":"","city":"Riyadh","state":"","ZIP":"","country":"Saudi Arabia"},"organizers":["Maarefah Management"],"societies":[],"indexes":[],"emails":[]}