{"name":"International Conference on Education, Pedagogy, Teaching & Learning-Dubai","series":"","short":"","website":"http://globalbizresearch.org/Dubai_Conference_2018_oct3","content":"Dear & Esteemed Colleagues, Greetings! Science and technology have brought about a lot of changes in the way teaching and learning happen in the classroom. The traditional method of ‘chalk & talk’ model is slowly getting phased out, today. Tablets, smart-boards, ipads and smart phones have made an indelible impact on teaching and research. In addition, E-books, podcasts, wikis, blogs, twitter, video conferencing, E-portfolios and Learning Management System (LMS) have changed the entire landscape across universities, colleges and schools. Educators, of late, have realized the growing influence of technology on the instructional methods and related aspects. An interesting outcome of technology-based teaching is that it makes learning a ‘fun’. Also, it prepares our students for the future. Undoubtedly, technology greatly helps in ‘flip learning’ and students can learn the lessons at their own phase. On the same tone, it helps teachers to get an idea of individual’s ability and modify the instructional strategy, accordingly. Panel Discussion! As a part of the conference, it is our avowed objective to offer a greater experience for the delegates by organizing panel discussions, invited presentations on topics of interest to the academic community. Topic: “Technology and Your Class” – Changing Scenario! A 10% Group Discount on the ‘registration fee’ available for a group comprising three members. Free Cruise Dinner for (1+1): Delegate + Spouse or Friend or Child! Also, Free Pick-up & Drop from Roda Al Murooj Down Town Dubai Hotel on October 6, 2018 – 7.30 pm & 10.30 pm","date_start":"2018-10-06","date_end":"2018-10-07","important_dates":{"abstract":"","full":"2018-09-30","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education, teaching"],"location":{"virtual":"","full":["Dubai","United Arab Emirates"],"name":"","street":"","city":"Dubai","state":"","ZIP":"","country":"United Arab Emirates"},"organizers":["Greater Vision Conferences & Seminars Organizing"],"societies":[],"indexes":[],"emails":[]}