{"name":"The 2nd International Conference on “Plant Development: Systems Approach”","series":"","short":"","website":"http://viscea.org/plant-development-systems-approach-february-11-12-2019","content":"This two-day event will provide the leading academy and industry scientists with a platform to communicate recent advances in “Plant Development”, and an opportunity to establish multilateral collaboration. The 2nd International Conference on “Plant Development: Systems Approach” will cover the following research topics: • Seed Development, Dormancy and Germination • Plant Organ Development (Shoot, Root, Leaf) • Making Plant Flower • Modeling and Systems Biology of Plant Development • Plant Male and Female Gametophyte Development • Plant Zygotic and Somatic Embryogenesis and Regeneration • Hormones and Plant Development • Signaling in Plant Development • Plant Cell Fate, Totipotency, Lineage and Polarity • Epigenetics and Plant Development Approximately 350 participants are expected to attend this exciting scientific forum including almost 40 lectures delivered by worldwide known invited speakers and young, talented speakers selected from submitted abstracts. The program combines plenary lectures, poster sessions, a unique Conference Dinner Party and sightseeing tours of Vienna. Vienna International Conference Series 2019 also offers a great opportunity to get a FREE REGISTRATION, if you attract 5 more colleagues to attend the meeting, independent on the institution and location. Finally, if you are not able to attend the Conference, you can still submit your abstract and we are happy to publish it in the abstract book for just 60 €!","date_start":"2019-02-11","date_end":"2019-02-12","important_dates":{"abstract":"","full":"2018-11-01","notification":"","final":""},"topics":["Life Sciences","Plant-Biology"],"location":{"virtual":"","full":["Vienna","Austria"],"name":"","street":"","city":"Vienna","state":"","ZIP":"","country":"Austria"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}