{"name":"Microbial Corrosion (MIC), Hydrotesting, Hydrants","series":"","short":"","website":"http://www.miceglobal.com.sg/events/256.html","content":"Workshop Overview: There are two approaches towards microbial corrosion cases: ” study of the case as per the system” and “study of the case as per the material”. In other words, if one knows under what conditions, for instance, carbon steel corrodes by microbes, it doesn’t matter if the system in which carbon steel has been used in , is a pipeline or a tank and whether it is in a power plant or a gas refinery. Therefore understanding the MIC mechanism is not dependent on the particular system of interest. It is only necessary to know under what conditions a certain material would corrode by MIC mechanisms and the particular working conditions and the system in which the material has been used would dictate the factors that would affect the severity of MIC. Hydrotesting (or alternatively, Hydrostatic testing) is an industrial practice that is of frequent use in industry. The main characteristic of Hydrotesting is that it is a “leak” and “strength” test. There are many factors that can be involved in making a system vulnerable to microbiologically influenced corrosion (MIC). Of the four principle corrosion mechanisms that can be expected to see, MIC is the most probable/ important one in a post-Hydrotest failure. Moreover, when pigging is done (intelligent pigging for instance), it is quite possible that it will increase the risk of MIC as well. Water can enter into the pipelines in various ways, either at pre-commissioning phase (via Hydrotesting) or during commissioning. Even if the operating temperature may be above the dew point, one must not forget that due to factors, such as but not limited to, existing of low points and temperature fluctuation and operation age of the line, water can be collected inside the pipe. It is also interesting to note that as long as water exists (even as water pockets) within the line, the likelihood of both electrochemical and electrochemical-microbial corrosion in the form of internal corrosion, manifested as pitting, will highly increase. It follows that in emergency fire water lines (Hydrants) the same MIC mechanisms will also be operative due to the stagnant conditions of the water inside the ring. Contrary to similar workshops, Dr. Javaherdashti’s workshop is practice-oriented and the emphasis is on applied aspects of corrosion fundamentals. It is this approach by Dr. Javaherdashti that, as a proven engineering approach towards MIC over his years of experience in different engineering disciplines and various countries, will enable the attendees to tailor make their solutions for their existing specific problems and apply their solutions in a way that is both feasible and applicable. In this workshop, after reviewing some underlying facts about electrochemical corrosion –as the basis of understanding MIC- the measures to recognise and control MIC with their pros and cons are explained. Then Hydrotesting in terms of its risk assessment to failure mainly by MIC is discussed. The MIC mechanisms in Hydrant systems along with practical measures in this regards will also be reviewed and explained.","date_start":"2018-10-23","date_end":"2018-10-25","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Engineering & Technology","Other","petroleum & petrochemicals (oil & gas)"],"location":{"virtual":"","full":["Indonesia","Indonesia"],"name":"","street":"","city":"Indonesia","state":"","ZIP":"","country":"Indonesia"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}