{"name":"7th Annual Cell Culture & Bioprocessing Congress","series":"","short":"","website":"https://www.oxfordglobal.co.uk/cellculture-congress/download-agenda","content":"Oxford Global is proud to present the 7th Annual Cell Culture & Bioprocessing Congress to be held on the 25-26 of October 2018 in London, UK. Over 40 presentations, case studies and panel discussions focussing on the key issues in cell line optimisation, 3D cell culture and bioprocessing technologies. View the agenda here >> https://bit.ly/2s1Ng0J 4 interactive streams: • Cell Line Development o PART 1: Early Cell Culture & Cell Line Engineering o PART 2: 3D Cell Culture Models & Applications • Process Development: Upstream Bioprocessing and Analytics • Cell Line Development: Late Stage Cell Line Development, Stability, Data & Assay Data Development • Cell Culture and Downstream Bioprocessing Together with our prestigious collocated, 5th Annual Stem Cell & Regenerative Medicine Congress, 4th Annual Cell & Gene Therapy Congress and Biobanking Congress, over 400 senior level experts from pharmaceutical and biotechnology companies will meet to discuss the most recent developments and key challenges within the industry. Free Pre-Congress Live Webinars High-Density Cell Cryopreservation Hosted by Mona Bausch, Scientist, Cell Culture Media Development, Merck KGaA Register for free today: https://bit.ly/2Lw2q5D Can’t make the date? Register today and the recording of the webinar will be sent to you afterwards. For further information on the congress and to receive prices and booking details, please contact Guillaume Alonso at g.alonso@oxfordglobal.co.uk or call +44 (0)1865 248 455","date_start":"2018-10-25","date_end":"2018-10-26","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Life Sciences","Other"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":[""],"societies":[],"indexes":[],"emails":["g.alonso@oxfordglobal.co.uk"]}