{"name":"POSTCOLONIALISM, POSTCOMMUNISM AND POSTMODERNISM - 2nd International Interdisciplinary Conference","series":"","short":"","website":"http://postpostpost.ug.edu.pl","content":"CFP: In our postmodern world there are a lot of questions that should be re-considered and re-defined. What does it mean to fight against colonialism and racism in the world of migration crisis and xenophobic attitudes towards minorities? What does it mean to be a postcommunist country in the face of the common nostalgia for order and rules? How is it possible to have a national identity being aware of the relative character of every national feature? We want to examine the notions of postcolonialism, postcommunism and postmodernism as thoroughly as possible, from many perspectives and in variable aspects: in politics, society, psychology, culture, and many more. We also want to devote considerable attention to how these phenomena are represented in artistic practices: in literature, film, theatre or visual arts. We invite researchers representing various academic disciplines: history, politics, psychology, sociology, anthropology, philosophy, economics, law, literary criticism, theatre studies, film studies, fine arts, memory studies, migration studies, consciousness studies, dream studies, gender studies, postcolonial studies, medical sciences, psychiatry, psychoanalysis, cognitive sciences et al. Different forms of presentations are encouraged, including case studies, theoretical investigations, problem-oriented arguments, and comparative analyses. We will be happy to hear from both experienced scholars and young academics at the start of their careers, as well as doctoral students and undergraduate students. We also invite all persons interested in participating in the conference as listeners, without giving a presentation. We hope that due to its interdisciplinary nature, the conference will bring many interesting observations on and discussions about postcolonialism, postcommunism and postmodernism. Our repertoire of suggested topics includes but is not restricted to I. Postcolonialism - postcolonial politics - postcolonial philosophy - postcolonial societies - history of (post)colonialism - postcolonialism and orientalism - postcolonialsim and Islampophobia - postcolonialism and anti-Semitism - postcolonialism and terrorism - postcolonialism and racism - postcolonialism and political correctness - postcolonialism and cosmopolitism - postcolonilism and religion II. Postcommunism - postcommunism and democracy - postcommunism and liberalism - postcommunism and capitalism - nostalgia for communism - communism and conformism - postcommunism and revolution - postcommunist countries in the European Union - postcommunist generations III. Postmodernism - modernism and postmodernism - postmodern philosophy - postmodern psychology - postmodern identity - postmodern lifestyle - postmodernism and nationalism - postmodernism and human rights - postmodernism and authority IV. Literature and the Arts - postcolonialism, postcommunism and postmodernism in literature - postcolonialism, postcommunism and postmodernism in film - postcolonialism, postcommunism and postmodernism in theatre - postcolonialism, postcommunism and postmodernism in fine arts - postcolonial narratives - postcommunist memoirs - postmodern conventions Please submit abstracts (no longer than 300 words) of your proposed 20-minute presentations, together with a short biographical note, by 28 February 2019 to: inconferenceoffice@gmail.com Notification of acceptance will be sent by 03 March 2019.","date_start":"2019-04-11","date_end":"2019-04-12","important_dates":{"abstract":"","full":"2019-02-28","notification":"","final":""},"topics":["Social Sciences","Other","interdisciplinary"],"location":{"virtual":"","full":["Gdansk","Poland"],"name":"","street":"","city":"Gdansk","state":"","ZIP":"","country":"Poland"},"organizers":["INMIND SUPPORT"],"societies":[],"indexes":[],"emails":["inconferenceoffice@gmail.com"]}