{"name":"2017 International Symposium on Aviation and Aerospace System Engineering","series":"","short":"SAASE 2017","website":"http://www.saase.org","content":"Welcome to 2017 International Symposium on Aviation and Aerospace System Engineering (SAASE 2017). SSASE 2017 is organized by Hong Kong Society of Mechanical Engineers (HKSME), sponsored by Beijing Jiaotong University. The conference will be held in Beijing Jiaotong University, Beijing, China, from 12-14, May, 2017! ●Publication and Indexing All the registered and presented papers will be published on the conference proceeding of SAASE 2017, indexed by Elsevier: SCOPUS, Index Copernicus Journals Master List, Google Scholar, Ei Compendex (CPX), Cambridge Scientific Abstracts (CSA), Inspec (IET, Institution of Engineering Technology) , SCImago Journal & Country Rank (SJR), EBSCO, Thomson Reuters (WoS). ●Confirmed Speakers: Prof. Xiaoping Liu, Beijing Jiaotong University, China Prof. Xin Zhang, Hong Kong University of Science and Technology, Hong Kong ●Papers are invited to submit to SAASE 2017 in the following (non exclusive) topics: \\*\\* Adaptive control Advanced modulation theory Aerodynamics & Flight Mechanics Aeronautical engineering Aerospace & electronics systems Aircraft Navigation Astrodynamics & Orbital Mechanics Astronomical Image Processing Ionospheric Techniques ●Paper Submission 1, Papers can be submitted as PDF via EasyChair: http: http://www.easychair.org/conferences/?conf=saase2017 2, You can also choose to submit your paper directly to saase@smehk.org 3, Contributions must be written in English and report on original, unpublished work not submitted for publication elsewhere. Submissions not adhering to the above specified constraints may be rejected without review. ●CONTACT US Ms. Tiffany Chang Tel:+852-30697937 Email: saase@smehk.org Website: http://www.saase.org/","date_start":"2017-05-12","date_end":"2017-05-14","important_dates":{"abstract":"","full":"2017-04-12","notification":"","final":""},"topics":["Physical Science & Math","Astronomy/Astrophysics","Aviation, Aeronautical, Aerospace Aircraft systems"],"location":{"virtual":"","full":["Beijing","China"],"name":"","street":"","city":"Beijing","state":"","ZIP":"","country":"China"},"organizers":["Beijing Jiaotong University"],"societies":[],"indexes":[],"emails":["saase@smehk.org"]}