{"name":"Challenges of the knowledge society","series":"","short":"","website":"http://cks.univnt.ro","content":"CKS 2018 – “CHALLENGES OF THE KNOWLEDGE SOCIETY” THE 12TH INTERNATIONAL CONFERENCE CALL FOR PAPERS 11th -12th MAY 2018, BUCHAREST The main purpose of this International Scientific Conference – organized by “Nicolae Titulescu” University and \"Nicolae Titulescu\" Foundation for Law and International Relations, Complutense University of Madrid and Deusto University of Bilbao – is to provide an opportunity to international specialists in social sciences and other related fields to meet and exchange opinions. In addition, CKS also provides a place for specialists with cross-disciplinary interests related to social sciences to exchange their views and interact with members inside and outside their own particular fields of study. The conference language is English. CONFERENCE WEB PAGE: http://cks.univnt.ro/ TOPIC AREAS 1\\. Juridical Sciences (Law); 2\\. Economic Sciences; 3\\. Administrative and Political Sciences; 4\\. Innovation in Mediation. Investments; 5\\. IT in Social Sciences. Interested participants are invited to submit research papers (of minimum 3,000 and maximum 12,000 words). Papers will be evaluated for originality, significance, clarity and contribution. Each paper will be subjected to a double blind peer review. Summary of review feedback/reports will be sent back to the author(s). All comments and suggestions should be addressed in the final submission. Papers must NOT have been previously published and they must NOT be currently submitted for publication elsewhere. ONLINE SUBMISSION For online submission, fill in the form at: http://cks.univnt.ro/formular\\_de\\_inregistrare.html IMPORTANT DEADLINES Online Submission January 31st, 2018 Final Papers Submission March 10th, 2018 Notification of Final Papers Acceptance April 10th, 2018 Fee\\* Payment April 15th-30 th, 2018 Final Program publication on the web page May 1st, 2018 CKS 2018 May 11th – 12th May PUBLICATION OPPORTUNITIES All accepted papers will be included in the CKS 2018-eBook, proceedings with ISSN number, published “Nicolae Titulescu” University Publishing House. The CKS eBook is currently indexed in EBSCO CEEAS, DOAJ, Index Copernicus and Ulrich’s Databases. FEES The fee for participating in the 12th Edition of the “Challenges of the Knowledge Society” International Conference is Euro 100/for the publication of a paper (or the equivalent in RON calculated according to the currency rate). Each author (co-authors) can submit no more than two papers. Participation with one paper or maximum 2 papers is charged Euro 100\\. The conference fee covers: the publication of the paper in CKS 2018-eBook; a Conference Bag: conference documents (the Conference Program, CKS 2018-eBook) and other promotional accessories. The fee also covers the coffee break and CKS 2018 certificate of attendance. Additional costs, representing lunch and dinner served on the conference day, as indicated in the online subscription form, include: - lunch: EURO 20 (or the equivalent in RON according to the rate of exchange). Lunch can be served at Salt and Pepper Restaurant, which is located in the neighbourhood of “Nicolae Titulescu” University.(http://www.sare-piper.ro/) - EURO 30 – ceremonial dinner. FOR ANY ENQUIRIES, PLEASE WRITE TO US ON: conference@univnt.ro","date_start":"2018-05-11","date_end":"2018-05-12","important_dates":{"abstract":"","full":"2018-01-31","notification":"","final":""},"topics":["Business","Economics","Law and legal studies"],"location":{"virtual":"","full":["Bucharest","Romania"],"name":"","street":"","city":"Bucharest","state":"","ZIP":"","country":"Romania"},"organizers":[""],"societies":[],"indexes":[],"emails":["conference@univnt.ro"]}