{"name":"The Future of Education International Conference - 8th edition","series":"","short":"","website":"https://conference.pixel-online.net/FOE/index.php","content":"The 8th edition of the Future of Education International Conference will take place in Florence, Italy, on 28 - 29 June 2018\\. The objective of the Future of Education Conference is to promote transnational cooperation and share good practice in the field of education. The Future of Education conference is also an excellent opportunity for the presentation of previous and current education projects and initiatives. The Call for Papers is addressed to teachers, researchers and experts in the field of education as well as to coordinators of teaching and training projects. Experts in the field of education are therefore invited to submit an abstract of a paper to be presented in the conference. Important dates: • 26 April 2018: Last Extended Deadline for submitting abstracts • 3 May 2018: Notification of Acceptance / Rejection for Abstracts • 8 May 2018: Deadline for final submission of papers • 28 - 29 June 2018: Dates of the conference There will be three presentation modalities: oral, poster and virtual presentations. All accepted papers will be included in the Conference Proceedings published by LibreriaUniversitaria with ISBN and ISSN (2384-9509) codes. This publication will be sent to be reviewed for inclusion in SCOPUS (https://www.elsevier.com/solutions/scopus). Papers will also be included in ACADEMIA.EDU (https://www.academia.edu/) and Google Scholar. For further information, please contact us at the following address: foe@pixel-online.net or visit the Future of Education conference website: http://conference.pixel-online.net/FOE/","date_start":"2018-06-28","date_end":"2018-06-29","important_dates":{"abstract":"","full":"2018-04-26","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education, teaching"],"location":{"virtual":"","full":["Florence","Italy"],"name":"","street":"","city":"Florence","state":"","ZIP":"","country":"Italy"},"organizers":["Pixel Association"],"societies":[],"indexes":[],"emails":["foe@pixel-online.net"]}