{"name":"Coastal Cities 2019 - 3rd International Conference on Coastal Cities and their Sustainable Future","series":"","short":"","website":"https://www.wessex.ac.uk/conferences/2019/coastal-cities-2019","content":"Introduction The International Conference on Coastal Cities and their Sustainable Future was held for the first time in 2015 in the New Forest, home of the Wessex Institute. Following its success, it was decided to reconvene the event after the second conference being held in Cadiz, Spain in 2017\\. The growth of world population and the preference for living in coastal areas has resulted in their ever-increasing development. Coastal areas are the most common destination, which brings in economic growth but implies additional urban development and increases the need for resources, infrastructure and services. The strategic location of coastal cities for instance, facilitates transportation and the development of related activities, but this requires the existence of large ports, with the corresponding increase in maritime and road traffic and all its inherent negative effects. The above-mentioned activities and others common to coastal cities require the development of well-planned and managed urban environments, not only for reasons of efficiency and economics, but also to avoid inflicting environmental degradation that causes the deterioration of natural resources, quality of life and human health. To mitigate these problems it is necessary to consider coastal cities as dynamic complex systems which need energy, water, food and other resources in order to work and generate diverse activities, with the aim of offering a better socio-economic climate and quality of life. As a consequence, the integrated management and sustainable development of coastal cities is essential, with science, technology, architecture, socio-economics and planning, all contributing to provide support to decision makers. Conference Topics The following list covers some of the topics to be presented at Coastal Cities 2019\\. Papers on other subjects related to the objectives of the conference are also welcome. The coastal city and its environments Landscape and urban planning Infrastructures and eco-architecture City heritage and regeneration Urban transport and communications","date_start":"2019-09-11","date_end":"2019-09-13","important_dates":{"abstract":"","full":"2019-06-11","notification":"","final":""},"topics":["Business","Information-Technology","Sustainable Development and Engineering"],"location":{"virtual":"","full":["Rome","Italy"],"name":"","street":"","city":"Rome","state":"","ZIP":"","country":"Italy"},"organizers":["Wessex Institute"],"societies":[],"indexes":[],"emails":[]}