{"name":"Summer School “Concepts in Action: Representation, Learning, and Application”","series":"","short":"CARLA","website":"https://www.conceptuccino.uni-osnabrueck.de/carla_summer_school/overview.html","content":"The Institute of Cognitive Science at Osnabrück University (https://cogsci.uni-osnabrueck.de) is happy to announce the summer school “Concepts in Action: Representation, Learning, and Application” (CARLA), funded by the Volkswagen Foundation. The summer school will bring together researchers from different disciplines with the goal of providing participants with knowledge about concept research outside of their own fields and to initiate interdisciplinary exchanges and research. A subsequent and co-located workshop provides an excellent opportunity to present and discuss ongoing research on concepts. Both events will focus on (but not be restricted to) three core questions: How can we formally describe and model concepts? Where do concepts come from, and how are they acquired? How are concepts used in cognitive tasks? Time and Venue: --------------------- August 06 to August 10, 2018, in Osnabrück (Germany). Lecturers and Classes: ---------------------------- Nicholas Asher (https://www.irit.fr/\\~Nicholas.Asher/) and Julie Hunter (http://www.juliejhunter.com/): “Concepts and Conceptualization: From the Lexicon to Situated Conversation” Christiane D. Fellbaum (https://www.cs.princeton.edu/\\~fellbaum/): “A Linguistic Perspective on Concepts” Peter Gärdenfors (http://www.fil.lu.se/en/person/PeterGardenfors): “Where Do Conceptual Domains Come From?” Robert L. Goldstone (http://psych.indiana.edu/faculty/rgoldsto.php): “The Learning and Use of Concepts by Humans” Michael Spranger (https://sites.google.com/view/michaelspranger/): “Co-acquisition of Concepts and Language: Computational Models and Robot Experiments” Schedule: ------------ The schedule includes both lectures and interactive discussion sessions. Details can be found on our website: https://www.conceptuccino.uni-osnabrueck.de/carla\\_summer\\_school/preliminary\\_program.html Costs: -------- The school is fully funded and does not charge a registration fee. Meals are included in the funding and will be provided to the participants free of charge. The number of participants is limited to 25\\. If your institution is not able to cover your travel expenses, we can reimburse accommodation costs as well as travel costs up to 150 € for participants from Germany, 350 € for participants from non-German European countries, and 800 € for participants from elsewhere. How to Apply: ------------------ We invite applications from PhD students and postdocs working on or being interested in concepts from a variety of fields, including (but not restricted to) linguistics, philosophy, psychology, artificial intelligence, logic, computer science, and cognitive science. Highly interested advanced master students may be allowed in exceptional cases. We strongly encourage applications from individuals who are under-represented in their respective fields. If you are interested in participating, please submit your application until April 30, 2018 under https://easychair.org/conferences/?conf=carlass18\\. Your application should consist of a single pdf file including a single-page CV and a short motivation letter of up to 300 words stating your research interests and why you want to attend the summer school. If you need a visa to enter Germany, please indicate this in your application so that we can prepare invitation letters for you in time. If you need financial support for travel and accommodation expenses, please also indicate this in your application. We will notify you about the selection results by May 7, 2018\\. Should you have any questions, please contact us anytime at concepts@uni-osnabrueck.de. Organizers: -------------- Lucas Bechberger, Ulf Krumnack, Kai-Uwe Kühnberger, Mingya Liu","date_start":"2018-08-06","date_end":"2018-08-10","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Social Sciences","Other"],"location":{"virtual":"","full":["Osnabrück","Germany"],"name":"","street":"","city":"Osnabrück","state":"","ZIP":"","country":"Germany"},"organizers":["Volkswagen Foundation"],"societies":[],"indexes":[],"emails":["concepts@uni-osnabrueck.de"]}