{"name":"2019 4th International Conference on Advanced Materials and Applications","series":"","short":"AMA 2019","website":"http://www.ama2019.org","content":"2019 4th International Conference on Advanced Materials and Applications(AMA 2019) April 10-13, 2019/Ningbo, China Web: http://www.ama2019.org/ 2019 4th International Conference on Advanced Materials and Applications(AMA 2019). ICMSNT, the predecessor of AMA, has been successfully held for 3 years, and has gained a lot of attentions in the previous success comummunications. From now on, to take more focus on Advanced material field, ICMSNT is officially named as AMA in the coming year. AMA 2019 will be held in Ningbo, China from April 10-13, 2019, which is co-organized by Ningbo Institute of Materials Technology and Engineering, CAS, Southwest Jiaotong University, Swinburne University of Technology, Hong Kong Society of Mechanical Engineers(HKSME). AMA 2019 is an international forum for the presentation of technological advances and research results in the fields of Materials Science and Nanotechnology. The conference will bring together leading researchers, engineers and scientists in the domain of interest from around the world. We warmly welcome prospected authors submit your new research papers to AMA 2019, and share the valuable experiences with the scientist and scholars around the world. ●Publication Information All the papers will be peer reviewed. Selected presented papers with good quality will be recommended to publish in the special issues of following SCI indexed journals: 1.International Journal of Modern Physics B; 2.Surface Engineering; 3.Tribology International; ●AMA 2019 Speakers 1.Prof. Stephen M. Hsu,Fellow of STLE, Fellow of ASME,The George Washington University, USA Chair Professor, Head of Manufacturing Engineering and Engineering Management Dept., City University of Hong Kong Adjunct Professor, Institute of Physical Science & Technology, University of Maryland,Professor Stephen Hsu's Energy Efficiency Lab and Nanomaterials Lab conducts research on renewable energy and energy efficiency technologies in buildings, transportation, and machinery. Current projects include surface textures for friction control; multiscale multifunctional surface designs including ultrahydrophobic, ominphobic, icephobic, and self-adaptive surface properties; wind energy; self-repairing gear technology; and nanocomposites. Most projects are conducted with industrial partners and government agencies. 2.Prof. Qunji Xue,Academician of Chinese Academy of Engineering.Ningbo Institute of Materials Technology and Engineering, CAS, China Prof. Xue is one of the major academic leaders in materials science and special lubricating materials in China and has been engaged in the research on special lubricating materials and material chemistry for years. He has presided over or participated in the research on special lubricating materials of LICP in the past 20 years, which provided over 20 key lubricating materials and techniques for aeronautics, astronautics and other major national high-tech projects. All of these have made the research and application in this area of China reach the world level. He has accumulated abundant experience and reached a high level in the design and preparation of new materials, and material tribology as well as tribochemistry. He has been invited to present the invited talk entitled “Tribochemistry of Ceramics Lubrication” during the Gordon Conference held in America in 1994\\. 3.Prof. Wei Gao,Fellow of the Royal Society NZ, Fellow of IPENZ,University of Auckland, New Zealand Dr Wei Gao, Officer of New Zealand Merit, is a Professor of Materials Science & Engineering at the University of Auckland, Fellow of the Royal Society NZ and Fellow of Engineering NZ. Received his DPhil from Oxford University UK, he worked at MIT for 5 years as a Research Fellow and Lab Director. His active research covers Nanomaterials, Thin films and coatings, Electronic materials, Corrosion and oxidation, Light alloys, and Photocatalysis. He has 780 scientific publications including 460 SCI journal papers, and received a number of prestigious awards, including “Scott Medal”, “James Cook Award”, “Shorland Medal”, and “Distinguished Materials Scientist of China”. 4.Prof. Sybrand van der Zwaag Sybrand van der Zwaag, distinguished professor, holds a full time position at the Faculty of Aerospace Engineering of the Delft University of Technology in the Netherlands where he leads the group Novel Aerospace Materials. He is member of the Royal Society for Science in the Netherlands, and the fellow of the (British) Institute of Materials, Minerals and Mining. He also holds a position as professor at the School of Materials Science and Engineering at Tsinghua University. He obtained his MSc in 1978 after completing his graduation project at the Dutch Nuclear Research Centre. He then joined the Cavendish Laboratory at Cambridge University (UK) and studied the impact damage in glass and infrared transparent ceramics, and obtained his PhD in 1981\\. He is director of the Delft Centre for Materials and chairman of the national IOP program on Self Healing Materials, and also the scientific director of the Dutch Polymer Institute (DPI). He was one of the founding fathers of the Netherlands Institute for Metals Research NIMR (now M2i). His research is focused on the development of new materials with outstanding properties. His research focusses on metals, polymers, smart materials and self healing materials. He has published over 500 journal publications and successfully supervised 50 PhD students. 5.Prof. Alan LAU Kin Tak,Swinburne University of Technology, Australia Professor Lau is a practical engineer, academic and manager in both the academic and commercial sectors. He received 4-year craft apprentice training in an engineering company in Hong Kong beginning in 1987\\. He went on to obtain bachelor’s and master’s degrees in Aerospace Engineering from RMIT University, Australia in 1996 and 1997, respectively. He received his Doctor of Philosophy (PhD) from the Hong Kong Polytechnic University (PolyU) in 2001\\. He was appointed Assistant Professor at PolyU in 2002 and promoted to Associate Professor and then Full Professor in 2005 and 2010, respectively. In 2013, he was appointed Associate Dean (Industrial Relations) of the Faculty of Engineering in the same university. Due to his strong connection with the Hong Kong product design and development industry, he was also appointed as Alex Wong/Gigi Wong Endowed Professor in Product Design Engineering in the same year. Currently, he is Pro Vice-Chancellor (Research Performance and Development) of Swinburne University of Technology, Australia. 6.Prof. Jenq-Gong Duh,National Tsing Hua University, Taiwan JENQ-GONG DUH received B.S. in Nuclear Engineering from National Tsing Hua University, Taiwan in 1974, and Ph.D in Material Engineering from Purdue University, U.S.A. in 1983\\. He has joined the Department of Material Science and Engineering, NTHU since 1983, and now is the Chair Professor.His research interests involve multifunctional coating and surface modification, fabrication of cathode and anode material for Li-battery, solder joint reliability in microelectronic package, as well as the characterization of material by electron microscopy. His current interest is focused on the employment of plasma technology in the exploration of multi-functional coating and advanced energy material development. 7.Dr. Mostafa El Sayed,Director of the Aerospace Materials and Structures Laboratory (AMS-Lab).Carleton University, Canada Dr. Mostafa El Sayed is the Director of the Aerospace Materials and Structures Laboratory (AMS-Lab) in the Department of Mechanical and Aerospace Engineering at Carleton University. He received his B.Sc. (1997) and M.Sc. (2002) from the Military Technical College and his Ph.D. (2010) from McGill University. He was a postdoctoral fellow at Massachusetts Institute of Technology. From 2011 to 2015, Dr. El Sayed was an Aircraft Loads Engineering Specialist at Bombardier Aerospace. He was involved in all of Bombardier’s new development programs, as well as in the Research and Development of the company’s strategic technologies and future aircraft concepts. His contributions included the implementation of a wide range of dynamic loads analyses for aircraft structural design and optimization. ●Topics(for more topics: http://www.ama2019.org/cfp.html) Materials science advanced coatings Self-adaptive materials Self-healing materials Tribology Drag reduction materials Icephobic materials Corrosion resistant materials Multifunctional materials ●Paper Submission Submission Email:ama@smehk.org Submission System: https://cmt3.research.microsoft.com/AMA2019 ●Call for participants 1,Presenter:If you are interested in giving presentation on conference, without publishing your paper in the proceeding, you need to submit the abstract and title of your presentation to us:ama@smehk.org 2,Listener:You are welcome to attend this great event. You need to complete the registration as Listener before the registration dealdine. Send email to ama@smehk.org for further information. 3,Reviewer: We sincerely welcome professors, associate professors, teachers and other experts in the areas of Advanced Materials and Applications join the conference as a reviewer. Welcome to send email to ama@smehk.org for further information. ●Contact Us Ms. Amber Email: ama@smehk.org Tel:+852-30697937( Hong Kong) Web: http://www.ama2019.org/","date_start":"2019-04-10","date_end":"2019-04-13","important_dates":{"abstract":"","full":"2019-03-10","notification":"","final":""},"topics":["Engineering & Technology","Material/Nanotechnology"],"location":{"virtual":"","full":["Ningbo","China"],"name":"","street":"","city":"Ningbo","state":"","ZIP":"","country":"China"},"organizers":["HKSME"],"societies":[],"indexes":[],"emails":["ama@smehk.org"]}