{"name":"international conference on intelligent machines","series":"","short":"","website":"http://www.babafaridgroup.com/icim2019","content":"International Conference on Intelligent Machines (ICIM'19) aims to achieve a multi-disciplinary balance between research advancements in theories and methods associated with Artificial Intelligence, Internet of Things (IoT) and Robotics. ICIM'19 is devoted to addressing the research areas that deepen the understanding of logical, cognitive, and computational foundations of the future perspectives and exploring the most essential issues and innovations in Applied AI, IoT, and Robotics in three simultaneous tracks. The prime objective of the conference is to bring together the research scholars, scientists and industrialists from all across the world to a common platform. The conference will provide participants with a review of the latest and upcoming trends in conference tracks the next few years. Moreover, this conference helps to expose the audience to the need for more development and research for innovation and provide the delegates to share their new ideas and the application experiences face to face. The Extended versions of selected papers will be submitted for publication in MTAP-Springer. Selected Extended papers of the Conference will be published in below mentioned Scopus/ESCI indexed Journals based on subject area: “Multimedia Tools and Applications” An International Journal (Special issue on “Multimedia Big Data Processing in Sensor-Based Applications \\[SCI Indexed Impact factor - 1.541\\] International Journal of “EAI Endorsed Transactions on Scalable Information System” (Special issue on “Intelligent and Smart Computing Techniques & their Applications) \\[ESCI Indexed\\] International Journal of Reasoning-based Intelligent System (Special issue on \"Advances in Machine Learning & Intelligent Systems - Challenges & Solutions\") \\[Scopus Indexed\\] International Journal of Natural Computing Research (IJNCR) \\[ACM, DBLP Indexed\\] Journal of Computer Science \\[Scopus Indexed\\] Original contributions from researchers describing their original, unpublished, research contribution which is not currently under review by another conference or journal and addressing state-of-the-art research are invited to share their work in all areas of the conference tracks. The papers submitted should be relevant to conference tracks as listed. Papers will be peer-reviewed by the Technical Program Committee and can be theoretical, practical and application oriented.","date_start":"2019-03-15","date_end":"2019-03-16","important_dates":{"abstract":"","full":"2018-12-31","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Robotics"],"location":{"virtual":"","full":["Online Event","India"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"India"},"organizers":["Springer"],"societies":[],"indexes":[],"emails":[]}