{"name":"The New Zealand Breast Cancer Symposium - United for a Cure Through Research","series":"","short":"","website":"http://www.nzbcs.org.nz","content":"NZBCS-2017, 12-14 Nov, Auckland, New Zealand: The New Zealand Breast Cancer Symposium. 12th November 2017 at 8:00 - 14th November 2017 at 16:30 (GMT+12:00) Auckland. Register today and attend the inaugural New Zealand Breast Cancer Symposium (NZBCS-2017) during 12-14 November 2017 in Auckland. There are over 150 oral and poster presentations delivered by top researchers, clinicians and health professionals from 25 countries. Do not miss this opportunity to meet experts in breast cancer. Come and share the ideas for finding a cure for breast cancer. Registered participants are eligible for CPD (Continuing Professional Development) credits. For more information and preliminary programme, please visit http://www.nzbcs.org.nz. Breast cancer is the most common cancer in women worldwide with approximately 1.67 million new cases each year. Research has played a critical role in reducing breast cancer mortality. However, despite accelerated treatment options, more than half a million breast cancer patients still die from this disease. The NZBCS-2017 is the New Zealand’s first breast cancer symposium with a vision of “United for a Cure Through Research”, making women with breast cancer live longer. It aims to promote basic and clinical research on breast cancer, stimulate domestic and international collaborations, and expedite the translation of laboratory discoveries into clinical applications, for improved treatment and life quality of those with breast cancer. We are so pleased that Professor Sir David Lane, Professor Geoffrey Lindeman, and \\*Assistant Professor Andrew Green are going to deliver keynote speeches during the conference. In addition, many other clinicians and research scientists have already confirmed their attendance (see the website: www.nzbcs.org.nz). The oral presentations and posters will cover all aspects of clinical, translational, and basic research on breast cancer. The meeting will provide a unique and ideal forum for a broad spectrum of researchers, clinicians, health professionals and those with a special interest in breast cancer to discuss research and share ideas for finding a cure for breast cancer. In collaboration with Breast Cancer Foundation NZ, a free public education seminar will run on Sunday 12th November 2017 during the conference. New Zealand is one of the top holiday destinations in the world. Auckland, a major city in the north of New Zealand’s North Island, has been among the top 10 most liveable cities in the global liveability survey of 140 cities. November is a good time to come and explore what Auckland city is able to offer. I, on behalf of the Organising Committee of NZBCS-2017, welcome your participation and hope you enjoy the conference. I look forward to meeting you in November 2017 at the NZBCS-2017, Auckland, New Zealand. Yours sincerely, A/Prof Dong-Xu Liu, on behalf of the Organising Committee of the NZBCS-2017","date_start":"2017-11-12","date_end":"2017-11-14","important_dates":{"abstract":"","full":"2017-09-30","notification":"","final":""},"topics":["Medicine & Health","Medical-Speciality"],"location":{"virtual":"","full":["Auckland","New Zealand"],"name":"","street":"","city":"Auckland","state":"","ZIP":"","country":"New Zealand"},"organizers":["Auckland University of Technology"],"societies":[],"indexes":[],"emails":[]}