{"name":"4th Workshop on the Security of Industrial Control Systems & of Cyber-Physical Systems","series":"","short":"","website":"http://www.ds.unipi.gr/cybericps2018","content":"\\========================================================================================= Call for Papers 4th Workshop On The Security Of Industrial Control Systems & Of Cyber-Physical Systems (CyberICPS 2018) In Conjunction With ESORICS 2018 3-7 September, 2018 / Barcelona, Spain http://www.ds.unipi.gr/cybericps2018/ ========================================================================================= CyberICPS is the result of the merging of the CyberICS and WOS-CPS workshops that were held for the first time in conjunction with ESORICS 2015\\. Cyber-physical systems (CPS) are physical and engineered systems that interact with the physical environment, whose operations are monitored, coordinated, controlled and integrated by information and communication technologies. These systems exist everywhere around us, and range in size, complexity and criticality, from embedded systems used in smart vehicles, to SCADA systems in smart grids to control systems in water distribution systems, to smart transportation systems, to plant control systems, engineering workstations, substation equipment, programmable logic controllers (PLCs), and other Industrial Control Systems (ICS). These systems also include the emerging trend of Industrial Internet of Things (IIoT) that will be the central part of the fourth industrial revolution. As ICS and CPS proliferate, and increasingly interact with us and affect our life, their security becomes of paramount importance. CyberICPS intends to bring together researchers, engineers and governmental actors with an interest in the security of ICS and CPS in the context of their increasing exposure to cyber-space, by offering a forum for discussion on all issues related to their cyber security. Topics of Interest ================== CyberICPS invites submissions that present innovative ideas, proof of concepts, use cases, and results from a variety of topics relevant to ICS and CPS, including (but not limited to) the following ones: Security governance - Security policies - Risk analysis and management - Vulnerability assessment and metrics - Awareness, training and simulation - ICS/CPS security standards - Privacy and Anonymity in ICS/CPS System and network security - Threat modeling - Security architectures - Access control - Malware and cyber weapons - Intrusion detection and visualisation - Defense in depth - Monitoring and real time supervision - Applied cryptography - Perimeter security - Safety-security interactions - Cyber security engineering - Secure communication protocols - Formal models for ICS/CPS security - Hardware Security - Resilient ICS/CPS - Application Security - Secure Firmware Incident Response and Digital Forensics for ICS/CPS - Forensics in ICS - Incident Response - Accountability Case Studies - Case studies in the energy, utility, chemical, transportation, manufacturing, and other industrial and critical infrastructure sectors.","date_start":"2018-09-03","date_end":"2018-09-07","important_dates":{"abstract":"","full":"2018-06-24","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Barcelona","Spain"],"name":"","street":"","city":"Barcelona","state":"","ZIP":"","country":"Spain"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}