{"name":"5th INTERNATIONAL SYMPOSIUM ON PHILOLOGY","series":"","short":"","website":"https://www.asoscongress.com/Filoloji/en","content":"We would like to invite you to the “5th INTERNATIONAL SYMPOSIUM ON PHILOLOGY ” (www.asoscongress.com) that will be hosted by Yıldız Technical University on October 25-27, 2018 in İstanbul, Turkey. The 5th International Symposium on Philology aims to make a significant contribution to the studies and researches of academicians in terms of quality and form an interdisciplinary academic environment to share experiences, theoretical and practical knowledge and to discuss current issues in the field of educational sciences. The first of the symposium was hosted by Fırat University in Elazığ, the second one was hosted by Alanya Alaaddin Keykubat University in Alanya, the third one was hosted by Sütçü İmam University in Kahramanmaraş and the last one was hosted by Alanya Alaaddin Keykubat University in Alanya.The 5th International Symposium on Philology will be held in Yıldız Technical University. The accepted abstracts of symposium will be published in the “Book of Abstracts” and the full papers of symposium proceedings will be published in internationally peer-reviewed journals (chosen by the author) free of charge after completing peer-review process. The full papers of authors can also be published in the e-book of symposium. All proceedings will be indexed by Sobiad database. The papers will be presented in English or Turkish. Participants are welcome to submit their studies as a 15 minute oral presentation. All papers will be assessed by double -blind peer review. Within the scope of symposium, papers in the fields of Contemporary Turkish Dialects and Literatures, Translation Studies, World Languages and Literatures, Ancient Languages and Cultures, Comparative Literature, Classical Turkish Literature, Turkish Language, Turkish Folklore, Turkey Turkish Dialects, Modern Turkish Literature will be accepted. Poster presentation sessions will also take place in the symposium. Please click for guidelines of poster presentation preparation. We welcome the academicians, administers, education experts, teachers, graduate students and civil society organization and representatives working internationally or nationally in the field of educational sciences. We look forward to see you in İstanbul, Turkey at the 5th International Symposium on Philology . Start of Abstract Submission: 15.5.2018 Deadline of Abstract Submission: 25.8.2018 Notification of Abstract Acceptance: 30.8.2018 Deadline of Payment for Symposium: 20.9.2018 Announcement of Symposium Program: 30.9.2018 Symposium Start Date: 25.10.2018 Symposium Completion Date: 27.10.2018","date_start":"2018-10-25","date_end":"2018-10-27","important_dates":{"abstract":"","full":"2018-08-25","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","Language and Literature"],"location":{"virtual":"","full":["İstanbul","Turkey"],"name":"","street":"","city":"İstanbul","state":"","ZIP":"","country":"Turkey"},"organizers":["Yildiz Technical University"],"societies":[],"indexes":[],"emails":[]}