{"name":"Workshop on \"Why Cyber Security is a Strategic Issue?\"","series":"","short":"","website":"http://biz-strategy.org","content":"7th Annual International Conference on Business Strategy in the Age of Disruption – BizStrategy 2017 Full Paper Submission Deadline (Extended): 16 July 2017 Early Bird Registration Deadline: 31 July 2017 Late Registration Deadline: 6 August 2017 Conference Dates: 21 - 22 August 2017 By Prof. the Hon. Dr. Stephen Martin - Chairman, Bank of China (Australia), Former Speaker Parliament of Australia, Former Deputy Vice Chancellor (Strategy and Planning), Curtin University of Technology, Former Pro Vice Chancellor International, Victoria University, Australia This workshop will provide businesses with detailed information on the strategic importance of cyber-security and highlight the critical need to maintain robust protection measures. Prof Martin will provide insights on what works from a strategic perspective, and discuss implications for the economy.Workshop on \"Why Cyber Security is a Strategic Issue?\" By Prof. the Hon. Dr. Stephen Martin - Chairman, Bank of China (Australia), Former Speaker Parliament of Australia, Former Deputy Vice Chancellor (Strategy and Planning), Curtin University of Technology, Former Pro Vice Chancellor International, Victoria University, Australia This workshop will provide businesses with detailed information on the strategic importance of cyber-security and highlight the critical need to maintain robust protection measures. Prof Martin will provide insights on what works from a strategic perspective, and discuss implications for the economy. For more information, please visit: http://biz-strategy.org/ For inquiries, kindly email secretariat@biz-strategy.org","date_start":"2017-08-22","date_end":"","important_dates":{"abstract":"","full":"2017-07-16","notification":"","final":""},"topics":["Business","Information-Technology"],"location":{"virtual":"","full":["singapore","Singapore"],"name":"","street":"","city":"singapore","state":"","ZIP":"","country":"Singapore"},"organizers":[""],"societies":[],"indexes":[],"emails":["secretariat@biz-strategy.org"]}