{"name":"International Conference \"Mirror, Mirror: Perceptions, Deceptions, and Reflections in Time\"","series":"","short":"","website":"http://mirror.lcir.co.uk","content":"Since ancient times, mirrors have been viewed as place where the dual worlds of soul and self merge. In ancient Mexico, polished obsidian mirrors were viewed as magical portals through which sorcerers traveled to reach the world of the gods. The fictitious mirror of 18th-century author, Oliver Goldsmith, revealed the inner workings of the mind rather than the surface. In the 21st century, our reflections may obscure rather than uncover the truths we once searched for. Through technology, we can recreate ourselves and the world around us. We see our altered, perfected reflections in our photos, on our web cams, and in advertising. Images may come to show not necessarily our realities, but visions of the world that we prefer. Indeed, altered visions and the falsehoods they purvey may serve as instruments for political gain, for the accumulation of personal wealth, and as a means of repression. This conference explores how our virtual concepts and reconstructed worlds impact humanity, the arts, and nature in the age of rising anthropocentrism. Papers are invited on topics related, but not limited, to: Illusion and the ancient world-mirrors and other artifacts and their elite metaphysical uses Specific cultural beliefs related to mirrors, truth, soul, and self Physical science: knowledge and beliefs relating to mirrors both ancient and modern Studies of writers, artists, and others who emphasize reality and illusion in their creative works (Lewis Carrol, Oliver Goldsmith, and others) Trompe l’oeil (Early and Modern Visual Art) Truth, illusion, and delusion in the age of the Internet--You Tube and other Media The reinvented self: modern or historical The dangers of deception (social and environmental concerns) Specific perspectives on truth and illusion as symbolized or addressed in the visual arts, creative writing, new historical narratives, architecture, and other media How altered vision can have far reaching impacts on culture, society, and the environment Paper proposals up to 250 words and a brief biographical note should be sent by 15 November, 2018 to: mirror@lcir.co.uk. Please download paper proposal form from the official event page: http://mirror.lcir.co.uk/. Registration fee – 100 GBP Provisional conference venue: Birkbeck, University of London, Bloomsbury, London","date_start":"2019-03-09","date_end":"","important_dates":{"abstract":"","full":"2018-11-15","notification":"","final":""},"topics":["Arts & Humanities","Philosophy","physics"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplenary Research"],"societies":[],"indexes":[],"emails":["mirror@lcir.co.uk"]}