{"name":"The 2nd Sirindhorn Conference","series":"","short":"","website":"http://scgi.gistda.or.th/scgi2018","content":"Call for Papers The 2nd Sirindhorn Conference on Geo-informatics (2018) is held at Centra by Centara Government Complex Hotel & Convention Centre, Chaeng Wattana, Bangkok, Thailand, during February 1-2, 2018\\. This conference is organized by Sirindhorn Center for Geo-Informatics (SCGI), which supported by the Ministry of Science and Technology of the Kingdom of Thailand and Wuhan University of the People’s Republic of China. The 2nd Sirindhorn Conference on Geo-informatics aims to provide a forum to exchange ideas and experiences on space technology and geo-informatics through applications, study cases and practical experiences. This would improve and enhance the collaboration and cooperation between the intellectuals, professional and government bodies in achieving a common vision towards knowledge sharing of geo-informatics across discipline. All abstracts should be submitted in the theme of “Space Technology and Geo-informatics” and we also encourage submission on research and applications of the new technologies in multidisciplines involve our theme. Abstract and Full Paper Format You are kindly invited to submit electronically original, English-language research contributions or experience reports not concurrently submitted elsewhere. Abstracts should be submitted firstly and must not be exceeded 300 words. Abstracts are better typed in Word for Windows PC format. Abstract must include: - The abstract is restricted to 300 words (excluding the title, author information and affiliations) and tables, graphs or figures are not allowed. - Only abstracts submitted in English will be reviewed. - Abstracts must consist of background/aim, method, result and conclusion. - Title and authors by surname followed by initials and indicate the presenter by underlining their name. - Author’s contact details (company name, department, full address, telephone, fax and E-mail) Critical Dates - Abstract Submission Deadline : 27 November 2017 - Abstract Acceptance : 4 December 2017 - Full Paper Submission Deadline : 10 January 2018 Registration Fee 100 USD for normal registration fee includes permission to all technical session, a flash drive include all accepted abstract and full papers, food, welcome banquet and coffee breaks. More Information http://scgi.gistda.or.th/scgi2018/","date_start":"2018-02-01","date_end":"2018-02-02","important_dates":{"abstract":"","full":"2017-11-27","notification":"","final":""},"topics":["Physical Science & Math","Atmospheric/Meteorology","geography & GIS"],"location":{"virtual":"","full":["bangkok","Thailand"],"name":"","street":"","city":"bangkok","state":"","ZIP":"","country":"Thailand"},"organizers":["Ministry of Science and Technology of the Kingdom of Thailand"],"societies":[],"indexes":[],"emails":[]}