{"name":"International Journal of Data Mining & Knowledge Management Process","series":"","short":"IJDKP","website":"http://airccse.org/journal/ijdkp/ijdkp.html","content":"International Journal of Data Mining & Knowledge Management Process (IJDKP) ISSN: 2230 - 9608\\[Online\\]; 2231 - 007X \\[Print\\] http://airccse.org/journal/ijdkp/ijdkp.html Scope & Topics Data mining and knowledge discovery in databases have been attracting a significant amount of research, industry, and media attention of late. There is an urgent need for a new generation of computational theories and tools to assist researchers in extracting useful information from the rapidly growing volumes of digital data. This Journal provides a forum for researchers who address this issue and to present their work in a peer-reviewed open access forum. Authors are solicited to contribute to the Journal by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in the following areas, but are not limited to these topics only. Data mining foundations Parallel and Distributed Data Mining Algorithms, Data Streams Mining, Graph Mining, Spatial Data Mining, Text video, Multimedia Data Mining, Web Mining, Pre-Processing Techniques, Visualization, Security and Information Hiding in Data Mining Data mining Applications Databases, Bioinformatics, Biometrics, Image Analysis, Financial Modeling, Forecasting, Classification, Clustering, Social Networks, Educational Data Mining Knowledge Processing Data and Knowledge Representation, Knowledge Discovery Framework and Process, Including Pre- and Post-Processing, Integration of Data Warehousing, OLAP and Data Mining, Integrating Constraints and Knowledge in the KDD Process , Exploring Data Analysis, Inference of Causes, Prediction, Evaluating, Consolidating and Explaining Discovered Knowledge, Statistical Techniques for Generation a Robust, Consistent Data Model, Interactive Data Exploration/Visualization and Discovery, Languages and Interfaces for Data Mining, Mining Trends, Opportunities and Risks, Mining from Low-Quality Information Sources Paper submission Authors are invited to submit papers for this journal through e-mail ijdkpjournal@airccse.org. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this Journal. Important Dates • Submission Deadline : May 12, 2018 • Notification : June 12, 2018 • Final Manuscript Due : June 20, 2018 • Publication Date : Determined by the Editor-in-Chief For other details please visit http://airccse.org/journal/ijdkp/ijdkp.html Contact Us Here's where you can reach us: ijdkpjournal@yahoo.com or ijdkpjournal@airccse.org","date_start":"2018-06-20","date_end":"2018-06-22","important_dates":{"abstract":"","full":"2018-05-12","notification":"","final":""},"topics":["Engineering & Technology","Mining/Mineral"],"location":{"virtual":"","full":["India"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":[""],"societies":[],"indexes":[],"emails":["ijdkpjournal@airccse.org","ijdkpjournal@yahoo.com"]}