{"name":"DMCIT 2018 : 2018 2nd International Conference On Data Mining, Communications And Information Technology","series":"","short":"","website":"http://www.dmcit.net","content":"Call for paper 2018 2nd International Conference On Data Mining, Communications And Information Technology (DMCIT 2018) May 25-27, 2018 │Shanghai, China Website: http://www.dmcit.net/ 2018 2nd International Conference On Data Mining, Communications And Information Technology (DMCIT 2018) will be held in Shanghai, China during May 25-27, 2018\\. DMCIT 2018 is a not-to-be-missed opportunity that distills the most current knowledge on a rapidly advancing discipline in one conference. Join key researchers and established professionals in the field of Data Mining, Communications and Information Technology as they assess the current state-of-the-art and roadmap crucial areas for future research. ●Publication and Indexing All the papers will be peer reviewed by 2-3 experts. The review result comes out in 25-30 days. If the paper needs revising, the revised copy should be submitted again for peer review. All the registered and presented papers will be published in conference proceeding (Online publishing) , which will be indexed by Ei Compendex, Scopus, CPCI, IET and other academical databases. # DMCIT 2017 proceeding has been included in ACM Digital Library! # ●Keynote Speaker Prof. Arbee L.P. Chen Vice President at Asia University, Taiwan. ●Topics (for more topics: http://www.dmcit.net/cfp.html) Data Pre-Processing Data Transformation and Dimensionality Reduction Convergence of Data Mining and Intelligent IT Applications How Data Mining Techniques have been used in IT Applications Communication Networks Wireless Communications Machine learning for multimedia Human computer interaction ●Paper Submission 1, Electronic submission system: https://cmt3.research.microsoft.com/DMCIT2018 2, You can choose to submit your paper directly to dmcit@apise.org ●Call for participants 1,Presenter:If you are interested in giving presentation on conference,without publishing your paper in the proceeding,you need to submit the abstract and title of your presentation to us:dmcit@apise.org 2,Listener:You are welcome to attend this great event. You need to complete the registration as Listener before the registration dealdine.Send email to dmcit@apise.org for further information. 3,Reviewer:We sincerely welcome experts in the areas of Power and Electrical Engineering join the conference as reviewer. ●Contact Us Ms. Linda Lee Tel: +852-30506939 ( Monday-Friday, 9:00am-12:00pm; 2:00pm-5:00pm) Email:dmcit@apise.org Website:http://www.dmcit.net/","date_start":"2018-05-25","date_end":"2018-05-27","important_dates":{"abstract":"","full":"2018-04-20","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Big Data Mining & Analysis"],"location":{"virtual":"","full":["Shanghai","China"],"name":"","street":"","city":"Shanghai","state":"","ZIP":"","country":"China"},"organizers":[""],"societies":[],"indexes":[],"emails":["dmcit@apise.org"]}