{"name":"International Conference on Mobile, Secure and Programmable Networking (MSPN'2017)","series":"","short":"","website":"http://cedric.cnam.fr/workshops/mspn2017/index.html","content":"The rapid deployment of new infrastructures based on network virtualization and Cloud computing triggers new applications and services that in turn generate new constraints such as security and/or mobility. The International Conference on Mobile, Secure and Programmable Networking aims at providing a top forum for researchers and practitioners to present and discuss new trends in networking infrastructures, security, services and applications while focusing on virtualization and Cloud computing, network programming, Software Defined Networks, Internet of things, and their security. Position papers are also welcome and should be clearly marked as such. Authors are invited to submit complete unpublished papers, which are not under review in any other conference or journal, including, but not limited to, the following topic areas: Software Defined Networks (tools, software, concepts) Virtualization and Cloud computing Networks and Cloud computing Mobile computing and Mobile Cloud computing Security, Privacy and Trust in Networks, Services and Applications Green computing and networking Ubiquitous Computing and Sensor Networks System design and testbeds Cross-Layer Design and Optimization Modeling and performance evaluation Social networks Cooperative networking and Self-Organizing networks Distributed sensing, actuation, and control in cyber-physical systems Internet of Things Vehicular networks and Connected Cars Crowdsourcing Datacenter networking Smart cities","date_start":"2017-06-29","date_end":"2017-06-30","important_dates":{"abstract":"","full":"2017-04-15","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Networks, networking & communications"],"location":{"virtual":"","full":["Paris","France"],"name":"","street":"","city":"Paris","state":"","ZIP":"","country":"France"},"organizers":["Springer, Safran, CNAM, University of Limoges"],"societies":[],"indexes":[],"emails":[]}