{"name":"ARWA Conference 2017","series":"","short":"","website":"http://ww5.psy.cuhk.edu.hk/arwa","content":"**The Association for Reading and Writing in Asia (ARWA) was founded in February 2016, based on a series of meetings led by Professor Akira UNO and others in Asia (e.g., Professors Jeung-Ryeul CHO, Kevin CHUNG, Li-Yu HUNG, and Taeko WYDELL) since 2013\\. We are dedicated to understanding reading and writing of scripts and languages in Asia, a particularly eclectic region of the world with regard to literacy learning. We welcome anyone with research interests in expert, developing, or disabilities in literacy to join ARWA. Our members have diverse backgrounds but share a common dedication to understanding reading and writing across scripts, languages, and cultures. The first ARWA meeting will be held at The Education University of Hong Kong on 24-25 February 2016, and we already have plans for meetings in Japan, India, and other Asian regions in subsequent years.** _The first ARWA Conference will provide an excellent opportunity for participants to exchange ideas and experience with regard to:_ ^Reviewing findings from recent and leading policy, practice and research on reading and writing; ^Discussing current issues, concerns, and prospects concerning policy making, practice, research and development, internationally and with particular reference to the Asian regions; ^Identifying research and development priorities in reading and writing from the perspective of different countries, institutions and education agencies; and ^Exploring possibilities for collaborative activities. _The two-day Conference will feature the following activities:_ ^Keynote Sessions: a one-hour speech by invited speakers ^Paper Presentation: 15-minute oral highlight; 3-4 papers for a one-hour session ^Poster Presentation: requires presence of author; poster size 900 x 1200 mm ^Panel Symposium: one-hour interactive discussion led by a group of panellists Influential education policymakers, researchers, and practitioners, will be drawn locally and internationally, to participate in the Conference.","date_start":"2017-02-24","date_end":"2017-02-25","important_dates":{"abstract":"","full":"2016-11-20","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Hong Kong"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":[""],"societies":[],"indexes":[],"emails":[]}