{"name":"Research-2-Practice Forum on Energy, Water Security and Climate Change in Africa","series":"","short":"","website":"http://pauwes-cop.net/res2prac","content":"Research-2-Practice Forum on Energy, Water Security and Climate Change in Africa 23-25 April 2018 Venue: Tlemcen, Algeria. (West of Algeria) Audience: Scientists, engineers, Practitioners, innovators, professionals and policy makers, in the areas of renewable energy, water, and climate change Organisers: •Pan African University Institute of Water and Energy Sciences (including Climate Change) (PAUWES) •United Nations University Institute for Environment and Human Security (UNU-EHS), •Center for Development Research (ZEF) at the University of Bonn •Institute for Technology and Resources Management in the Tropics and Subtropics (ITT) at the Cologne University of Applied Sciences (TH Koln) •University Abou Bekr Belkaid,Tlemcen (UoT) Deadline: Extended abstract submission 8th January 2018 Contact: res2prac@pauwes-cop.net Background The guiding vision of the Agenda 2063 of the African Union is “An integrated, prosperous and peaceful Africa, an Africa driven and managed by its own citizens and representing a dynamic force in the international arena”. The call for action of the Agenda 2063 with regards to energy refers to “harnessing all \\`African energy resources to ensure modern, efficient, reliable, cost effective, renewable and environmentally friendly energy to all African households, businesses, industries and institutions, through building the national and regional energy pools and grids,”. The Africa Water Vision 2025 and aspiration seventeen of the Agenda 2063 focus on the fact that “Africa shall have equitable and sustainable use and management of water resources for socio-economic development, regional cooperation and the environment”. With regards to climate change, aspiration seventeen of the Agenda 2063 requires that “Africa shall address the global challenge of climate change by prioritizing adaptation in all our actions, drawing upon skills of diverse disciplines and with adequate support (affordable technology development and transfer, capacity building, financial and technical resources) to ensure implementation of actions for the survival of the most vulnerable populations, including islands states, and for sustainable development and shared prosperity.” A key role of PAUWES is seen in providing scientific and technological solutions to support a sustainable socio-economic development in the continent, science-based advice to policy makers on a local, national, regional and Pan-African level. PAUWES not only provides scientific knowledge for existing strategies but also acts as a think tank and thought leader in shaping future strategies. The African Union Science, Technology and Innovation Strategy for Africa 2024 (STISA-2024) places science, technology and innovation at the epicentre of Africa’s socio-economic development and growth. Research, particularly applied research, can be considered as a tool and an enabler for achieving continental socio-economic development goals in order to accelerate Africa’s transition to an innovation led, knowledge based economy. The lack of institutional networking is still a major challenge in the African research and educational landscape. The PAU as a whole aims to contribute to the establishment of networks in Africa and PAUWES aims to be the hub of a Pan-African research network in the area of energy, water and climate change. Linking research and development as contributions to achieve goals of the Agenda 2063 is a priority for the Pan African University of the African Union. Applied research, networking and cooperation with strategic partners are essential pillars in this endeavour. In order to promote and support applied and practice-oriented research and strategic partnerships on renewable energy, water and climate security in Africa, the Pan African University Institute for Water and Energy Sciences (PAUWES) with support from the German Government and in cooperation with a consortium of German universities (UNU-EHS, ZEF and ITT) led by UNU-EHS and the University Abou Bekr Belkaid in Tlemcen are jointly organizing an international forum in Tlemcen, Algeria from 16-18 April 2018\\. The event builds on the integration of the following complementary components: -Research components in line with the support of the German Federal Ministry for Education and Research to support synergies with institutions dealing with research questions addressed by ongoing research projects and priorities of the research agenda at PAUWES. -Strategic networking components in line with the support of the German technical cooperation of the German Federal Ministry of Economic Cooperation and Development though the “Deutsche Gesellschaft für Internationale Zusammenarbeit (GIZ) GmbH” to support institutional development of the institute. Main objectives and outcomes The Research-2-Practice forum aims to provide a platform for experts/scientists, education leaders, decision makers, entrepreneurs, private and public sector, policy makers, civil society actors and institutions interested or active in applied and practice-oriented research for development to discuss state of the art, challenges and innovative solutions in the areas of renewable energy, water and climate security and build strategic partnerships in Africa. The forum is in line with actions for the implementation of the cooperation and research strategy which further complements African Union goals to promote and support knowledge sharing and cooperation to addressing development challenges including leveraging opportunities for innovation. The goals of the forum are: -To discuss and exchange on the state of the art, challenges, practical and innovative solutions with regards to energy, water, and climate security in Africa in the frame of research questions addressed by ongoing projects and priorities of the research agenda at PAUWES -To promote worldwide exchange of knowledge and cooperation between research and practice, beyond traditional “north-south” schemes whereby topics for joint research, collaboration initiatives and projects can be identified -To assess and discuss practitioners’ approaches and solutions to challenges, lessons learned, best practices, and innovative models developed, etc. for cooperation between research and the private/public sectors(university/research and industry, science and policy) -To explore modalities for multifaceted collaboration between researchers, policy makers and business based on learnings from notable cases, inventive research questions that have gained ground and understanding the partnership mixes/models that are compelling -To strengthen the cooperation between PAUWES, African and international research institutions, Pan-African and international institutions, the private sector and civil society active in PAUWES related topics -To support the integration of PAUWES into scientific networks in Africa and beyond and support the establishment of PAUWES as a Pan-African (and beyond) hub/platform for the topics of water, energy, climate change and their nexus -To provide a platform for students to present scientific inputs in line with teaching and research activities at PAUWES and to expand their network to Pan African and international experts, institutions and companies especially in the fields of energy, water and climate change Results and recommendations from the forum will be integrated into ongoing and future activities at PAUWES such as the consolidation and upscaling of results of ongoing research projects, initiation of joint project proposals for the implementation of the research agenda at PAUWES, the establishment of a Pan-African network and knowledge hub on the Water-Energy and Climate Change nexus. Furthermore the results and recommendation will be followed up and further discussed with regional and Pan-African institutions such as the African Union, African Development Bank, NEPAD and regional commissions. Contributions The call for extended abstracts aims to create vertical and horizontal linkages between the research and practice stakeholders in the priority areas below. Fundamentally, the forum provides researchers and practitioners in civil society, private sector and public institutions an opportunity to feed into each other’s value chain where practice informs new knowledge and research informs change at various societal and institutional levels. Research / Scientific Contributions The main topics of the extended abstract should fit within the following areas which are in line with ongoing projects and priorities of the research agenda at PAUWES as contribution to the Agenda 2063 of the African union: -Energy oEnergy resources assessment oTechnological development: from raw materials to systems, including smart-grid and off-grid oEnergy stakeholders and society oEnergy economics and governance oCurrent and future urban energy supply systems in African cities -Water oWater and food security (production and sustainable livelihoods) oWater management (basin water management and urban water management) oWater and environment (water related hazard, health, etc.) oWater economics and governance (policy, education, planning, economy, cultural, etc.) oTransboundary water and resources management (conflict or cooperation, etc.) oCurrent and future urban water supply systems in African cities -Climate Change oClimate impact modelling (data and appropriated infrastructure, prediction models and services) oRisk, vulnerability and impact assessment (environmental sustainability of renewable energy projects, etc.) oAdaptation and mitigation strategies to climate change security in Africa oRisk assessment and reduction strategies for sustainable urban resources supply in Sub-Saharan African cities oMitigation research -Energy, Water and Climate Change Nexus oWater-Climate nexus oEnergy-Climate nexus oWater-Energy nexus oEnergy, water, food security and climate change nexus Research-2-Practice Contributions The call for Research-2-Practice contributions aims to showcase existing collaboration between practitioners in private sector, policy makers, financial institutions, civil society and beyond with academic, scientific or research institutions. The contributions should exhibit research interaction with practice guided by the following priority areas: -Research-2-Private Sector oCurrent state in Africa, challenges and perspectives oLessons learned for research to private sector cooperation in Africa oInnovative and sustainable funding models for research to private sector cooperation in Africa -Research-2-Policy makers oRole/contribution of African research centres to Agenda 2063 oExpectation of Pan-African actors and needs analysis for research within water, energy and climate change oEvidence based policy making, planning and Innovative tools/solutions oGlobal and finance policy dialogue, possibilities, realities and consequences for research in Africa. -Research-2-NGOs/Civil Society oResearch and NGOs/Civil society partnerships for transformation, action and sustainable development oOpen innovation/ participatory research and action in energy, water and climate change oApplied research and innovation for social entrepreneurship Practice and Non-Scientific Contributions Within these broad themes, forum organisers further encourage non-academic participants/stakeholders interested or involved in practise and applied oriented initiatives to send a submission linked to the areas below. These participants may be seeking knowledge, strategic partnerships, funding strategies or merely an opportunity to showcase their work based on real-life scenarios and practice within the priority areas of this call. Knowledge -Private sector corporations oShowcase initiated or supported activities of interest to the organisation in line with priority areas of this call (These initiatives may be requiring on the ground support or scientific lenses) oContribution from private sector and non-formal research environment (AfriLabs) to sciences and innovation in Africa oCan be extended with new focus area - -NGOs/Civil Society oCivil society movements/NGOs involved with grassroots work which might be of potential interest to private or public sector funding oGrass root work needs to be within the priority areas of this call. oCivil society movements/NGOs seeking knowledge partners to study their new societal initiatives of experimental or innovative nature which may be of interest to researchers oShare data and studies from the ground with practical real case problems, which may feed into academic theory or contribute to research. NGOs would thereby gain knowledge or even generate interest from funding institutions. -Funding oPresentation of research grants available for researchers oGrants needs to promote research specifically in the priority areas of this call. oPresentation of funding initiatives available for supporting research2practice work Accepted extended abstracts will be compiled in a stand-alone publication with ISBN and distributed among the participants as output of the forum. The opportunity to publish selected high quality papers in a special issue of a scientific journal will be investigated. All forum participants will have an opportunity to vote for the best contribution and best poster (online voting) and the winner(s) will be announced during the closing session Best paper award The contributing authors or organizations stands a chance to win an award which will be presented during the Research-2-Practice Forum. The selection of the best paper will be done by the conference organizers in collaboration with the committee of experts. How to apply Contributions must be submitted in accordance with the related form (refer to “Submission template”) and written in English. The deadline for the submission of extended abstracts is 8th January 2018\\. Proposals must be uploaded via https://easychair.org/conferences/?conf=res2prac The selection process will be carried out by a Scientific Committee of international experts presented below. Notification of acceptance will be in March 2018\\. For more information on the forum, visit http://pauwes-cop.net/res2prac/","date_start":"2018-04-16","date_end":"2018-04-18","important_dates":{"abstract":"","full":"2018-01-08","notification":"","final":""},"topics":["Social Sciences","Geography","Climate Change"],"location":{"virtual":"","full":["Tlemcen","Algeria"],"name":"","street":"","city":"Tlemcen","state":"","ZIP":"","country":"Algeria"},"organizers":["Pan African University Institute of Water and Energy Sciences (including Climate Change) (PAUWES), U"],"societies":[],"indexes":[],"emails":["res2prac@pauwes-cop.net"]}