{"name":"Excellence, Innovation, & Creativity in Basic-Higher Education & Psychology","series":"","short":"","website":"www.icieconference.net","content":"This International Conference will provide a conference programme with the highest calibre of: Nobel Prize winners, keynote speakers, invited speakers, and a large number of scholars and presenters alongside a selection of exhibitors. The ICIE conferences are milestones in the journey towards leadership, creativity and innovation in basic-higher education and psychology. Conference Categories: Excellence in Education: Basic & Higher Education; Gifted Education; Creativity & Innovation; Educational Technology; Psychology, including all branches (e.g., applied psychology; cognitive psychology; organizational psychology; developmental psychology; experimental psychology; clinical psychology; educational psychology; cross-cultural psychology; positive psychology; social psychology; comparative psychology); Innovative Learning Environment: standards and curricula, tasks and materials, and communication; Instructors and Teacher: competencies, innovative teaching methods, and staff development; Learner: competencies, individual differences, intervention and development; Programme Development: Examples, planning models and components, implementation and evaluation; Global Education for Peace; Organizational & Social Issues in Education; Integrated Services: guidance and counselling, community services, parenting and caring; and mentorship; and Future Trends: Globalisation and networking, civic education, ethical issues; and building creative climates.","date_start":"2019-07-16","date_end":"2019-07-19","important_dates":{"abstract":"","full":"2019-06-25","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Houston","Texas","United States"],"name":"","street":"","city":"Houston","state":"Texas","ZIP":"","country":"United States"},"organizers":["ICIE"],"societies":[],"indexes":[],"emails":[]}