{"name":"The Teaching of English Language and Literature: Critical Perspectives","series":"","short":"","website":"http://www.gitam.edu/home/news","content":"We invite interested students, researchers and faculty to participate and present papers in this conference. Select papers will be published by GITAM University Press in an anthology with ISBN. Teaching of English Language Sub-themes: • Teaching of English language skills • Creative use of technology for language teaching/learning • Literature and Language classroom • Content and Language Integrated Learning in Higher Technical Education • Professional development for English teachers – Aspirations and Opportunities • Literature as a socio-political comment • Children literature • Gender sensitization: Issues and challenges • Theatre pedagogy • Ecocriticism Guidelines for Abstract Submission: • Abstracts of proposed papers will be accepted until 30 March 2017\\. • Abstracts should be no longer than 250 words in English and should clearly identify the paper's topic and its relevance to the conference. Submission details ¬ Use a standard font (such as 12 point Times New Roman) to format the text. ¬ Submit your abstract as a Microsoft Word file to the following address: engconf2017.gitamhyd@gmail.com ¬ All abstracts will be peer reviewed. The first page of the submission should not bear any marks that would identify the author or authors. It should contain only two items: • The title of the abstract. If possible and relevant, please include in the abstract title the name of the country that the proposal is discussing. • The abstract. The abstract should be no longer than 250 words in English and should clearly identify the paper's topic and its relevance to the conference. The second page should contain: • Title of the abstract • Name of the author/authors • Author title/s (Mr/Mrs/Ms/Dr, etc.) • Author/s gender • Author/s affiliation/s • Author/s position/s • Email address/es, and • Preferred conference sub-themes. Submit your paper to engconf2017.gitamhyd@gmail.com","date_start":"2017-08-11","date_end":"2017-08-12","important_dates":{"abstract":"","full":"2017-03-30","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","Education, teaching"],"location":{"virtual":"","full":["Hyderabad","India"],"name":"","street":"","city":"Hyderabad","state":"","ZIP":"","country":"India"},"organizers":["GITAM, University"],"societies":[],"indexes":[],"emails":["engconf2017.gitamhyd@gmail.com"]}