{"name":"International Conference On Emerging Trends In Computing, Communication & Automation Technology -2018","series":"","short":"ICETCCAT 2018","website":"http://www.srividyaengg.ac.in/icetccat2018","content":"Topics Cloud Computing, Computer Engineering, Computer Games, Computer Networks, Computer Science, Computer Security, Computer Vision, Computing, Elections and Voting Behavior, Electrical, Electrical and Computer Engineering, Electrical Drives, Electrical Engineering, Electrical Machines, Electronic Engineering, Electronics, Embedded Systems, Human Computer INteraction, Computer Science & ICT, computer hardware, Computer Based Education, Computer, Electrical Engineering and Technology, Embedded Wireless Systems, Smart Embedded Computing, VLSI Design and Automation Call for Papers ABOUT THE CONFERENCE The Conference is an ideal forum for researchers to share their findings and thoughts with their fellow researchers across the world. This conference will serve as a platform for fruitful interaction among Research Scholars, Scientists, Academicians and Practicing Engineers to present and discuss the most recent innovations, trends, concerns, practical challenges encountered and the solutions adopted in the field of Information, Communication, Automation and Engineering Technologies. Research papers are invited for the following topics, but not limited to: Big Data Analytics Mobile / Parallel / Grid / Cloud / Nano Computing Storage Virtualization/ Information Storage Management and Data Retrieval Cryptography and Network security Artificial Intelligence and Neural Networks Parallel and Distributed computing ICT and IoT Wireless and Sensor Networks Application of Power Electronic & Solid State Devices Analog and digital signal processing Image and Speech processing Embedded System & VLSI Technologies RF antenna design and modeling Radar and satellite communication Optical communication IMPORTANT DATES Full Paper with Abstract Submission : 17.02.2018 Acceptance of Paper : 5 days of Submission Last Date for Fee Registration : 28.02.2018 REGISTRATION FEE International Delegates : USD 70 /- National Delegates : INR 2000 /- Faculty members & Research Scholars : INR 1500 /- UG & PG Students : INR 1000 /- Registration can be done by submitting the Bank Demand Draft in favour of “The Principal, Sri Vidya College of Engineering and Technology”, payable at Virudhunagar. GUIDELINES FOR PAPER SUBMISSION A paper submission should report on original, previously unpublished research work that is not being concurrently considered for publication in a journal or conference. Each author(s) is required to submit one page abstract and full manuscript in IEEE format (MSword document) not exceeding 8 pages. https://www.facebook.com/icetccat2018/","date_start":"2018-03-09","date_end":"","important_dates":{"abstract":"","full":"2018-02-17","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer engineering"],"location":{"virtual":"","full":["Virudhunagar","India"],"name":"","street":"","city":"Virudhunagar","state":"","ZIP":"","country":"India"},"organizers":["Sri Vidya College of Engineering & Technology, Virudhunagar, Tamilnadu,India"],"societies":[],"indexes":[],"emails":[]}