{"name":"2017 International Conference on Computer Graphics and Digital Image Processing (CGDIP 2017)--Ei&Scopus","series":"","short":"","website":"http://www.cgdip.org","content":"Call For Paper 2017 International Conference on Computer Graphics and Digital Image Processing (CGDIP 2017)--Ei&Scopus July 1-3, 2017 │Prague, Czech Website: http://www.cgdip.org/ The 2017 issue of the International Conference on Computer Graphics and Digital Image Processing (CGDIP 2017) will be hosted in Prague, Czech from July 1-3, 2017\\. CGDIP 2017 is a not-to-be-missed opportunity that distills the most current knowledge on a rapidly advancing discipline in one conference. Join key researchers and established professionals in the field of Computer Graphics and Digital Image Processing as they assess the current state-of-the-art and roadmap crucial areas for future research. ●Speakers: Prof. Reinhard Klette, Auckland University of Technology (AUT), New Zealand ●Publication and Indexing All the accepted papers will be included in the conference proceeding, which will be indexed by Ei Compendex, CPCI, Scopus, IET and other academical databases. Selected papers with great extension will be recommended to publish in international journals. ●Topics (for more topics: http://www.cgdip.org/cfp.html) Rendering Modeling and animation Visualization Interaction Images processing and computer vision ●Paper Submission 1, Papers can be submitted as PDF via EasyChair: https://www.easychair.org/conferences/?conf=cgdip2017 2, If you have any questions, please feel free to contact us. 3, Contributions must be written in English and report on original, unpublished work not submitted for publication elsewhere. Submissions not adhering to the above specified constraints may be rejected without review. ●Contact Us Ms. Crystal Email: cgdip@apise.org Tel:+852-30506939( Hong Kong)","date_start":"2017-07-01","date_end":"2017-07-03","important_dates":{"abstract":"","full":"2017-06-01","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Prague","Czech Republic"],"name":"","street":"","city":"Prague","state":"","ZIP":"","country":"Czech Republic"},"organizers":["APISE"],"societies":[],"indexes":[],"emails":["cgdip@apise.org"]}