{"name":"International Conference on Well-being in Education Systems","series":"","short":"","website":"http://www2.supsi.ch/cms/wellbeing","content":"Education systems perform specific functions for their communities and the social and cultural contexts in which they operate. They gather together a number of diverse actors who are part of the system or are involved in different ways: students, teachers, non-teaching staff, but also families, territorial services, communities and institutions. Well-being is meant to include both a eudemonic and a hedonistic perspective, as the pursuit of a positive psychological state, and the expression of human virtues and the realisation of individual and social potential. In addition, well-being is seen as the result of a dynamic process of constant interaction between individual factors and environmental, cultural and social factors, as well as a desirable condition for groups, organisations, communities and society. The International conference on well-being in education systems draws on the theoretical framework of positive psychology to investigate the role of individual-context interactions in the individual development and along the life cycle, the mutual adaptation of individuals to organisational contexts and vice versa and the adaptation of organisations and education systems to social and cultural macro systems. The main goal of the conference is to help build a community of thought on the subject of well-being in education systems where views and contributions are developed and shared over time. It also aims to expand and consolidate relationships between the different actors at national and international level, while creating the opportunity for academics and practitioners to meet and exchange ideas and experiences. Hopefully, that would promote a positive culture for the study of social contexts – including education systems – in the belief that this is a real opportunity for improving life, educational and work contexts of individuals. The International conference on well-being in education systems wishes to offer a setting where academics and practitioners can share their thoughts, practices and results on topics such as: • Monitoring well-being in school communities; • Prevention policies and activities; • Methodological approaches and instruments for measuring well-being; • The well-being of students, teachers and school personnel; • School climate and well-being; • Physical school environment and well-being; • Well-being and transitions through education systems and beyond; • Experiences and practices in promoting well-being at school. Proposals are welcome from all fields of research, especially education, positive psychology and well-being. In order to encourage exchanges between scientific research and practical experiences and their integration, calls have been organised both for academic research contributions (Call for Papers) and contributions on experiences and practices for the well-being in education systems (Call for Experiences). The conference topics will be introduced by four keynote speakers: • Emanuele Berger Director of the School Division and Coordinator of the Department of education culture and sport of the Canton of Ticino • Fabian Gander Post-Doc researcher, Psychologisches Institut - Persönlichkeitspsychologie und Diagnostik, Universität Zürich • Laura Nota Associate Professor of developmental and educational psychology, Department of philosophy, pedagogy and applied psychology (FISPPA), Università degli studi di Padova • Michel Janosz (TBC) Full Professor and Dean of the School of Psychoeducation and of the Research group on education environments, Université de Montréal, Canada The official conference languages are English and Italian; simultaneous interpreting in both languages will be provided for plenary sessions.","date_start":"2017-11-20","date_end":"2017-11-22","important_dates":{"abstract":"","full":"2017-05-31","notification":"","final":""},"topics":["Social Sciences","Psychology"],"location":{"virtual":"","full":["Locarno","Switzerland"],"name":"","street":"","city":"Locarno","state":"","ZIP":"","country":"Switzerland"},"organizers":["DFA"],"societies":[],"indexes":[],"emails":[]}