{"name":"The Junior College Multi-Disciplinary Conference: Research, Practice and Collaboration.","series":"","short":"","website":"https://www.jc.um.edu.mt/conference","content":"The University of Malta Junior College shall be hosting the second edition of The Junior College Multi-Disciplinary Conference: Research, Practice and Collaboration from Monday 17 to Thursday 20 September 2018\\. This year’s edition, with the theme of “Breaking Barriers”, encourages learning through difference, particularly through the breaking or affirming of paradigms in the following areas of study: the social, natural and human sciences; arts and the humanities; education; business; technology and the environment. All the great scientific discoveries and critical theories in these subject areas have encouraged out-of-the-box thinking; they have helped enrich our own reasoning; they have contributed to the expansion of each other’s viewpoints. Hence, breaking down barriers, becomes not only an individual activity, but also a collective one. Many scholars and practitioners today appear to depart from traditional research intent on feeding one’s own particular discipline; many try to engage in multi-disciplinary projects addressing the broader questions raised by society. In essence, many scholars are often seeking answers to questions that lie beyond the confines of their own discipline, thus breaking traditional barriers and reaching new grounds. In an era of change, we are obliged to ask ourselves which are the discoveries, concepts or theories that have changed perspectives, challenged stereotypes, and illuminated issues. The multi-disciplinary nature of breaking down barriers can thus provide us with a universal language that breaks down cultural differences allowing us to peer through the prejudices that separate us as different ethnicities, different nationalities, and different religions. The exercise of breaking down barriers could thus be utilised to form more inclusive and more tolerant identities in our societies. Confirmed keynote speakers for this year are eminent scholar Professor Maurizio Ferraris (Torino), Professor Marisa Michelini (Udine), Mr Ludvic Zrinzo (UCL), Dr Anne-Marie Callus (Malta) and Professor Joseph M. Brincat (Malta). Other keynote speakers will be announced at a later stage. The proceedings of last year’s edition of the conference with the theme “Connections”, are currently in print. This year our academic event shall also be hosting two separate pre-conference events: a Philosophy symposium which shall be chaired by Professor Ferraris, and a Physics workshop under the guidance of Professor Michelini. These activities shall be addressing specialised issues pertaining to the disciplines of ontology and the didactics of Physics, respectively. The pre-conference activities shall be held on 17 September 2018 at the same venue of the conference. For more information about the conference, please visit https://www.jc.um.edu.mt/conference The “Call for Papers” may be downloaded from https://www.jc.um.edu.mt/\\_\\_data/assets/pdf\\_file/0008/338732/Callforpapers.pdf For submission and registration, please visit https://www.um.edu.mt/jc/conference/submissionandregistration For any other queries, kindly contact us by email: mdconf.jc@um.edu.mt","date_start":"2018-09-17","date_end":"2018-09-20","important_dates":{"abstract":"","full":"2018-06-30","notification":"","final":""},"topics":["Education / Legal / Other","Education","Multidisciplinary Research"],"location":{"virtual":"","full":["MSIDA","Malta"],"name":"","street":"","city":"MSIDA","state":"","ZIP":"","country":"Malta"},"organizers":["University of Malta Junior College"],"societies":[],"indexes":[],"emails":["mdconf.jc@um.edu.mt"]}