{"name":"“Complexities, Appeals, and Paradoxes of Language” International Conference","series":"","short":"","website":"http://language.lcir.co.uk","content":"Those scholars committed to an inter-disciplinary perspective on human experiences confront centuries-old divisions between and among the natural sciences, social sciences and the humanities, competing investigative methods, descriptive foci, and explanatory emphases. Bolstered by specialization, administrative demarcations, professionalization, and expertise, the discontinuities generate trajectories of intellectual enrichment and progress. On the other hand, have scholars within these intellectual spheres, disciplines, and area studies become passing ships in the night? What would constitute evidence of this condition, if this is, indeed, the case? Have scholars not been displaced from public discourse and social media? Are their prescriptive inputs vitiated by political and personal denunciations? Nevertheless, amid the welter of divergences and disputes, language stands out as an omnipresent commonality. Disputants appear to subscribe to universally obligatory presuppositions and protocols within “speech acts” and “communicative action.” Is there agreement even in disagreements? Does the philosophy of language hold the cure or is language itself an agent provocateur? Answers lie in further reflective endeavors on thinking, language, reasoning, argumentation, philosophies of action, and explanations that are themselves language in action. The Conference invites scholars from the humanities and social sciences to explore whether language is, indeed, a meta-narrative that orderly homogenizes intellectual endeavors and contains self-validating, universal, prescriptive principles, or is itself replete with differences that reflect disciplinary, cultural, gender, ideological, and political interests. Is language, indeed, bewitching human intelligence? What can scholars prescribe for an apparent paradox: Disputes and conflicts are couched in language and, at the same time, language is the axis of their resolution?","date_start":"2018-11-17","date_end":"","important_dates":{"abstract":"","full":"2018-08-31","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","interdisciplinary"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":[]}