{"name":"International Conference on Education, Teaching and Learning “Interdisciplinarity in a Knowledge-based Society”","series":"","short":"","website":"http://education.lcir.co.uk","content":"Interdisciplinarity is considered to be the twentieth century term, which was marked by the industry-based society, but, only in the 21st century, we are progressing into a knowledge-based society. However accumulation and creation of knowledge are not made automatically. While the academic endeavours of researchers in various fields result in the quantitative development of knowledge, the paradigm shift achieved through communication among and convergence of diverse academic fields brings about the qualitative creation of knowledge. The focus on the concept of interdisciplinarity has solved the problem of excessive specialization. As diverse individuals and institutions across society continue to call for increased interdisciplinarity, it is important to consider more fully and systemically the various types of structural barriers that may be impending fruitful collaboration across disciplines. This requires to review the established cultures of work, recognition, and organization that have evolved independently over many years in most academic institutions. The conference invites scholars from various fields to explore interdisciplinarity in education, teaching and learning. Papers are invited on topics related, but not limited, to: Childhood Education Adult Education Home Education Special Education Education Policy and Leadership Academic Advising and Counselling Work Employability e-Learning and e-Testing Distance Learning Blended Learning IT in Education Teaching Methodologies Education Management Proposals up to 250 words and a brief biographical note should be sent by 20 August, 2018 to: education@lcir.co.uk. To download the official paper proposal form please visit our event website http://education.lcir.co.uk/. Standard registration fee – 160 GBP Student registration fee – 140 GBP Conference venue: Birkbeck, University of London, Malet Street, Bloomsbury, London, WC1E 7HX","date_start":"2018-10-06","date_end":"2018-10-07","important_dates":{"abstract":"","full":"2018-08-20","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education, teaching"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["http://www.lcir.co.uk/"],"societies":[],"indexes":[],"emails":["education@lcir.co.uk"]}