{"name":"The 4th International Conference on Sustainable Business in Asia","series":"","short":"COSA 2018","website":"http://www.esdfocus.org/sustainable-business-development-asia-conference","content":"Welcome to the 4th Conference on Sustainable Business in Asia (COSA 2018). This international, peer-reviewed event will be held in partnership with the 3rd Pacific Rim and Energy Conference (PRESCO 2018) and the 3rd Asian Conference on Urban Planning and Sustainable Cities (UP-City 2018). Early Registration is only 25,000 JPY. All registered participants will be invited to the welcome reception and provided with a free, guided tour of Hiroshima Peace Park. The first 10 registrants will also receive a free ticket to the Miyajima Shrine Island Tour, which includes roundtrip transportation, park entrance fee and cake with tea at a traditional Japanese teahouse. About COSA 2018 At the heart of the concept of sustainable business lie two interrelated challenges: how to address our growth needs, in particular those of the developing countries, given the limitations imposed by the state of business, technology and social organization on our ability to meet present and future needs. What type of governance structures, business practices, technological innovations, legal agreements or policy tools can best bridge the needs-limitation gap in order to facilitate and accelerate sustainable business? The rapid economic growth of the developing countries in Asia in the recent decades has added a new dimension to this process, by shifting the leverage of change from the West to the East. Designing infrastructure, products, enterprises and processes with sustainability in mind can have an enormous impact on environmental and social systems. COSA 2018 offers a platform for scholarly and applied conversations among a wide variety of stakeholders concerned with the continual challenge of advancing the sustainable business agenda: people, planet, and growth. Because this is an emerging paradigm, there is much research and exploration that is needed. Academics, researchers, students and representatives from industry, government and non-governmental organizations need to both share their findings and learn from each other, in order to facilitate the transformation in how economic activity is conducted, allowing human societies to be sustained and to thrive. The range of research submissions may include conceptual, empirical, experimental, and case studies. We particularly invite papers making empirical and theoretical contributions about the social and economic processes impacting on sustainable development; global environmental governance, business and public policy approaches; technological innovations; climate change adaptation & mitigation; renewable energy development. Submit a proposal of 250 words in English on the following streams by Friday, March 2, 2018: ◾Corporate Social Responsibility ◾Environmental Law and Policy ◾Finance and Micro-finance ◾Sustainable Business, Production and Consumption ◾Sustainable Development ◾Sustainable Tourism ◾Other Areas (Please Specify)","date_start":"2018-04-26","date_end":"2018-04-27","important_dates":{"abstract":"","full":"2018-03-02","notification":"","final":""},"topics":["Business","Management / Leadership","Law and legal studies"],"location":{"virtual":"","full":["Hiroshima","Japan"],"name":"","street":"","city":"Hiroshima","state":"","ZIP":"","country":"Japan"},"organizers":["INTESDA"],"societies":[],"indexes":[],"emails":[]}