{"name":"The 14th IEEE International Conference on Advanced and Trusted Computing","series":"","short":"","website":"http://ieee-smartworld.org/2017/atc","content":"\\============================================= IEEE ATC 2017 ================================================= The 14th IEEE International Conference on Advanced and Trusted Computing August 4-8, 2017, San Francisco, USA http://ieee-smartworld.org/2017/atc/ contact: ieee-atc2017@googlegroups.com Paper Submission Deadline: March 10, 2017 Workshop/Special Session Proposal Due: January 30, 2017 ============================================================================================================== Computing systems are growing in capability and complexity including hardware, software, communications, networks, platforms, services, etc. Advanced computing (AC) aims to study and develop novel computing theories, models, technologies, systems and applications. At the same time, computing must be trustworthy to engender confidence that systems will remain secure and available. Trusted computing (TC) aims at making computing and communication systems and services, available, predictable, accountable, controllable, sustainable, dependable, reliable, and secure. ATC conferences have taken a leading role in addressing these challenges and achieving practical advanced computing systems with truly trustworthy services. Started in 2005, the series of ATC conferences have been held at Nagasaki (Japan), Vienna (Austria), Three Gorges (China), Hong Kong (China), Oslo (Norway), Brisbane (Australia), Xi'An (China), Banff (Canada), Fukuoka (Japan), Vietri sul Mare (Italy), Bali (Indonesia), Beijing (China) and Toulouse (France). ATC 2017 will include a highly selective program of technical papers, accompanied by workshops, panel discussions, and keynote speeches. Established as a premier venue in the area of advanced and trusted computing, ATC 2017 will offer a forum for researchers to exchange ideas and experiences in the most innovative research and development related to Advanced Computing (AC) and Trusted Computing (TC). The ATC 2017 topics include, but are not limited to: - High Performance Computing and Networking - Service Computing and Engineering - Cloud Computing and Fog Computing - Software Defined Networking and Systems - Green Computing and Communications - Mobile and Wearable Computing - IoT/IoE Technologies and Applications - Big Data Analytics and Technologies - Advanced Cognitive Computing and Machine Learning - Advanced Virtual/Augmented Reality (VR/AR) - Advanced Affective Computing and Robotics - Advanced MENS/NEMS and Their Applications - Trust Specifications, Models and Standards - Trust Management in Distributed systems - Security and Privacy in Smart Systems - Cyber Life, Society and Intelligence - Cyber Physical Systems and Their Safety ============================================================================================================== Contact: ieee-atc2017@googlegroups.com More information is at http://ieee-smartworld.org/2017/atc/","date_start":"2017-08-04","date_end":"2017-08-08","important_dates":{"abstract":"","full":"2017-03-10","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Cybersecurity & digital forensics"],"location":{"virtual":"","full":["San Francisco","California","United States"],"name":"","street":"","city":"San Francisco","state":"California","ZIP":"","country":"United States"},"organizers":[""],"societies":[],"indexes":[],"emails":["ieee-atc2017@googlegroups.com"]}