{"name":"15th International Conference on Practical Applications of Agents and Multi-Agent Systems","series":"","short":"","website":"http://paams.net","content":"Research on Agents and Multi-Agent Systems has matured during the last decade and many effective applications of this technology are now deployed. PAAMS provides an international forum to present and discuss the latest scientific developments and their effective applications, to assess the impact of the approach, and to facilitate technology transfer. PAAMS started as a local initiative, but has since grown to become the international yearly platform to present, to discuss, and to disseminate the latest developments and the most important outcomes related to real-world applications. It provides a unique opportunity to bring multi-disciplinary experts, academics and practitioners together to exchange their experience in the development and deployment of Agents and Multi-Agent Systems. PAAMS intends to bring together researchers and developers from industry and the academic world to report on the latest scientific and technical advances on the application of multi-agent systems, to discuss and debate the major issues, and to showcase the latest systems using agent based technology. It will promote a forum for discussion on how agent-based techniques, methods, and tools help system designers to accomplish the mapping between available agent technology and application needs. Other stakeholders should be rewarded with a better understanding of the potential and challenges of the agent-oriented approach. Contact: info@paams.net","date_start":"2017-06-21","date_end":"2017-06-23","important_dates":{"abstract":"","full":"2017-01-30","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Porto","Portugal"],"name":"","street":"","city":"Porto","state":"","ZIP":"","country":"Portugal"},"organizers":[""],"societies":[],"indexes":[],"emails":["info@paams.net"]}