{"name":"International Conference on European Studies: “Brexit – Europe without the UK”","series":"","short":"","website":"http://europe.lcir.co.uk","content":"International Conference on European Studies: “Brexit – Europe without the UK” 30 March 2019 – London, UK organised by London Centre for Interdisciplinary Research On 23 June 2016 51.9% of the British population voted the withdrawal of the UK from the European Union. The referendum came as a shock not only to the Continent but to the whole world, and has divided the country and the nation. The Brexiteers argue in favour of autonomous economy, independent politics and sovereign society, forecasting ‘a very, very bright future’ for the reinvented country. However, Remainers advance the gloomy prospect of economic uncertainty, political instability and social unrest triggered by any of the strategies for dealing with the decision to leave the European Union. Either ‘soft Brexit’, ‘hard Brexit’ or ‘no Brexit’, the impact is still difficult to predict. The conference is aimed to explore the national and regional effects and consequences of the UK’s disengagement from Europe and the European structures. It will also focus on the causes and conditions that led to Euroscepticism and the anti-European majority vote. The main objective of the event is to bring together all those interested in examining the intersections between their professions and/or interests and some distinct aspects of Brexit, providing an integrated approach for the understanding of the process within the current European context. Topics include but are not limited to several core issues: Challenges and opportunities Between nationalism and nativism Migration and immigration Politics and policy-making after 29 March 2019 Trade, commerce and business Post-Brexit free movement The Irish border The European Union without the UK The role of London in Brexit Perceptions of Brexit in popular culture Paper proposals up to 250 words and a brief biographical note should be sent by 1 February, 2019 to: europe@lcir.co.uk. Please download paper proposal form Registration fee – 100 GBP","date_start":"2019-03-30","date_end":"","important_dates":{"abstract":"","full":"2019-02-01","notification":"","final":""},"topics":["Social Sciences","Political-Science","European Studies"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["europe@lcir.co.uk"]}