{"name":"8th International Scientific Conference on Idealized Design: Challenges and Opportunities in Education of the XXIst Century","series":"","short":"","website":"http://jacko.econ.uj.edu.pl/Konf/IdealizedDesign/8","content":"We are going to discuss directions of cultural and technological development of Western societies. In this context, we intend to identify the main challenges of and opportunities for education. We invite scientists and educators, who can share their research and experience of changes in education. Speakers can justify forecasts in empirical knowledge or design solutions according to some normative assumptions. Lectures or poster presentations can report the state of theoretical or empirical research, formulate hypotheses or research questions. We want to devote special attention to the didactic mission of universities. Already Socrates and Plato have outlined it. According to them, it is to evoke critical thinking of students. As these philosophers show, it is a precondition for the security of democratic state: people need to think on their own, be critical and analytical to avoid the deception of demagogues and political charlatans. As it seems, educational programs tend to marginalize this mission. Therefore, we intend to discuss this mission in the context of the coming changes. We also would like to discuss the impact of technological development on education. General questions: 1\\. How will education change within a millennium? 2\\. How should education change within a millennium? Exemplary particular problems: 3\\. New possibilities and dimensions of collaboration between industry and academia 4\\. Perspectives to use new technologies in education: - three-dimensional visualization technologies - interactive programs (for example, Minecraft) - new media (like YouTube) - new social media (for example, Facebook) 5\\. New technological possibilities for remote education 6\\. Globalization and new paradigms of cross-cultural education 7\\. The impact of artificial intelligence on education 8\\. New prospects for lifelong learning 9\\. Artificial intelligence in education 10\\. Virtual and augmented learning environments 11\\. Gamification for learning 12\\. Game-based and simulation-based learning 13\\. Immersive learning 14\\. Tools for educational communication and collaboration 15\\. Cloud-based learning and assessment","date_start":"2018-11-29","date_end":"2018-11-30","important_dates":{"abstract":"","full":"2018-11-20","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education, teaching"],"location":{"virtual":"","full":["Cracow","Poland"],"name":"","street":"","city":"Cracow","state":"","ZIP":"","country":"Poland"},"organizers":["Faculty of Management and Social Communication of the Jagiellonian University (Poland/Europe). Insti"],"societies":[],"indexes":[],"emails":[]}