{"name":"14th International Conference on Mass Data Analysis of Images and Signals MDA 2019","series":"","short":"","website":"www.mda-signals.de","content":"14th International Conference on Mass Data Analysis of Images and Signals with Applications in Medicine, r/g/b Biotechnology, Food Industries and Dietetics, Biometry and Security, Agriculture, Drug Discover, and System Biology The Scope of the Conference The automatic analysis of images and signals in medicine, biotechnology, System Biology, chemistry, biometry, drug discovery and information robots is a challenging and demanding field. Signal-producing procedures by microscopes, spectrometers and other sensors have found their way into wide fields of medicine, biotechnology, economy and environmental analysis. With this arises the problem of the automatic mass analysis of signal information. Signal-interpreting systems which generate automatically the desired target statements from the signals are therefore of compelling necessity. The continuation of mass analyses on the basis of the classical procedures leads to investments of proportions that are not feasible. New procedures and system architectures are therefore required. The scope of conference is to bring together researcher, praticioners and industry people who are dealing with mass analysis of images and signals to present and discuss recent research in these fields. « top The goals of this conference are to: provide a forum for identifying important contributions and opportunities for research on mass data analysis on microscopic images, promote the systematic study of how to apply automatic image analysis and interpretation procedures to that field show case applications of mass data analysis in biology, medicine, and chemistry. « top Topics of interest include (but are not limited to): Applications in Medicine, r/g/b Biotechnology, Food Industries and Dietetics, Biometry and Agriculture Techniques and developments of signal and image producing procedures Object matching and object tracking in microscopic and video microscopic images 1D, 2D and 3D shape analysis and description 1D, 2D and 3D feature extraction of texture, structure and location Algorithms for 1D, 2D and 3D signal analysis and interpretation Image segmentation algorithms Parallelization of image analysis and interpretation algorithms Semantic tagging of microscopic images Applications in medicine, biotechnology, chemistry and others Applications in crystallography Applications in proteomics Applications in 2D and 3D cell images analysis Image Acquisition procedures for mass data analysis Methods and solutions for biometrical systems (Face-, Iris and Fingerprint Recognition) Recognition methods for moving objects (face, iris, body) Methods for data encryption (e.g. crypotographic methods, watermarking)","date_start":"2019-07-13","date_end":"2019-07-16","important_dates":{"abstract":"","full":"2019-03-15","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Biological Engineering & bioinformatics"],"location":{"virtual":"","full":["New York","United States"],"name":"","street":"","city":"New York","state":"","ZIP":"","country":"United States"},"organizers":["Institute of Computer Vision and Applied Computer Sciences IBaI"],"societies":[],"indexes":[],"emails":[]}