{"name":"SBE19 BRUSSELS – BAMB-CIRCPATH - BUILDINGS AS MATERIAL BANKS – A PATHWAY FOR A CIRCULAR FUTURE","series":"","short":"","website":"https://www.bamb2020.eu/final-event","content":"The Horizon 2020 EU-funded project BAMB – Buildings as Material Banks - brings 15 partners from 7 European countries throughout Europe together for one mission: Enabling a systemic shift in the building sector by creating circular solutions. Since the end of 2015, BAMB has been developing and integrating tools that will enable the shift to a circular built environment: Reversible Building Design tools and Materials Passports – supported by new business models, policy suggestions, management and decision-making models. In addition to testing the developed BAMB tools, the environmental and economic benefits of circular buildings have been investigated through six real-life pilot projects. The BAMB Consortium invites you to participate in the 3 days of the BAMB-CIRCPATH event. This event has three activities (not overlapping): - The 5th of February will be an industry day during which the Consortium will show the results of the project through interactive sessions. This day will be an opportunity for all stakeholders of the construction sector to learn more about what BAMB has achieved, provide feedback, exchange views on what is next and share the steps achieved on the pathway towards a circular future. Have a look to the draft agenda and proceed to our free registration here: https://www.bamb2020.eu/final-event/industry-day/ - A site visit to the BAMB pilot Circular Retrofit Lab, that investigates and demonstrates how Reversible Building Design can prevent demolition waste when refurbishing existing buildings will be made during the morning of the 6th of February. Proceed to our free visit registration here: https://www.bamb2020.eu/final-event/site-visit/ - An international conference part of the worldwide prestigious SBE19 Conference Series for researchers and industry experts to exchange their ideas and research and showcase advanced innovative technologies and methodologies for the built environment will occur on the 6th of February (afternoon) and the 7th February 2019\\. More information and registration here: https://www.bamb2020.eu/final-event/research-days/ For more information have a look to the BAMB-CIRCPATH webpage: https://www.bamb2020.eu/final-event/ Venue The conference will be held at: Brussels Environment (IBGE) Site de Tour & Taxis Avenue du Port 86C/3000 1000 Brussels, Belgium","date_start":"2019-02-05","date_end":"2019-02-07","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental"],"location":{"virtual":"","full":["Bruxelles","Belgium"],"name":"","street":"","city":"Bruxelles","state":"","ZIP":"","country":"Belgium"},"organizers":["BAMB - Buildings As Material Banks"],"societies":[],"indexes":[],"emails":[]}