{"name":"CfP 8th International Conference 'Europe Inside-Out: Europe and Europeanness Exposed to Plural Observers', Lucca, 28 – 30 September 2018","series":"","short":"","website":"http://euroacademia.eu/conference/8eio/ ","content":"The 8th International Conference ‘Europe Inside-Out: Europe and Europeanness Exposed to Plural Observers’ 28 – 30 September 2018, Lucca, Italy CALL FOR PANELS AND PAPERS DEADLINE FOR PAPER PROPOSALS: 15th of July 2018 Conference Description Europe became in the 20th century an elaborated yet contested notion as the particular field of European studies emerged while extensive and diverse research was directed recently towards an intensified search for what Europe is about. The creation of the European Union made things even more specialized and increased the stake of methodological rigor as more and more Europeans are affected by the decisions taken in Brussels. The number, diversity and quality of research projects focused on European issues is unprecedented, yet, as it is usually the case with specialization, it gradually led to discursive communities that rarely meet and debate their approaches in open floors together with peers from other continents, academic traditions and cultures. It is the aim of this conference to build a bridge among specialists from different regions, academic traditions and cultures that share a common interest in studying and addressing Europe as a reflexive concern. The 8th Global Conference ‘Europe Inside-Out: Europe and Europeanness Exposed to Plural Observers’ aims exactly to refresh a broader approach and understanding of Europe by enlarging the platform of regular conferences and workshops for a wider arena of participants and disciplinary backgrounds in order to put on stage a worldwide monadology for such concerns. The conference aims also to enable critical alternatives to the disciplinary orthodoxies by creating a framework for interaction and dissemination of diversity that has to become once more a European trademark. What is Europe and its place in the world? Is there something particular that sedimented in time and through a controversial history a European way? How does Europe see itself and how do others see it? Is Europe inclusive or club-based exclusive? Is Europe becoming a normative power or just envisages itself as one? Is the European multiculturalism a fact or an ideal? Is the European Union a reflection of Europe or an appropriation of it? Is Europe becoming a post-national cosmopolitan order or a persisting community of national states? How does the current political context after the US presidential elections challenges Europe? Is the EU able to resist the rise of populist and nationalist movements? These are just few questions out of an enormous space for inquiry that are to be addressed and confronted within the topic of the conference. Join us! The conference is organized yet by no means restricted to the following tentative panels: Theorizing Europe: Thinking Europe and Europeanness \\~ Europe as would be world power \\~ Europe and its internal and external others/outsiders \\~ Europe and identities \\~ Fortress Europe? \\~ EU and appropriations of Europe \\~ Europe and the Mediterranean assortment \\~ Europe and the inclusive/exclusive nexus \\~ Europe and the US \\~ Europe and anti-Americanism \\~ Europe as seen from its Eastern neighbors \\~ Europe as viewed from far away: narratives of the Europeans outside \\~ Europe as viewed from Asia \\~ Europe and Africa \\~ Non-familiar faces of Europe \\~ Knowing Europe in a different way: from Latin America to Australia \\~ Europe and the EU as a normative power \\~ EU regulatory practices in context \\~ The multiple faces of Europeanization as a process \\~ Europe and the persistence of the East-West Slope \\~ Europe and crises \\~ Europe and cosmopolitanism \\~ Europe and the post-national orders \\~ Europe in the world \\~ European narratives of the past: the mnemonic/amnesic nexuses \\~ Europeanization versus globalization \\~ Europe and conflict resolution \\~ European social models: welfare states and neoliberal suspicions \\~ Europe and innovation \\~ The politicization of Europe \\~ Europe and the Trump ‘Era’ \\~ Assessments of the European security Participant’s Profile The conference is addressed to academics, researchers and professionals with a particular research interest on Europe from all parts of the world. Post-graduate students, doctoral candidates and young researchers are welcome to submit an abstract. Representatives of INGOs, NGOs, Think Tanks and activists willing to present their work with impact on or influenced by specific understandings of Europe are welcomed as well to submit the abstract of their contribution. Euroacademia favors multidisciplinary approaches, critical thinking and new research methodologies. The conference will take place in the conference premises of the Agora Cultural Centre, centrally located in the historic heart of Lucca, within a walking distance from all major cultural attractions. Deadline: 15th of July 2018 For on-line applications and complete details of the event before applying please see the conference website: http://euroacademia.eu/conference/8eio/","date_start":"2018-09-28","date_end":"2018-09-30","important_dates":{"abstract":"","full":"2018-07-15","notification":"","final":""},"topics":["Social Sciences","Political-Science","call for papers"],"location":{"virtual":"","full":["Lucca","Italy"],"name":"","street":"","city":"Lucca","state":"","ZIP":"","country":"Italy"},"organizers":["Euroacademia"],"societies":[],"indexes":[],"emails":[]}