{"name":"Guerrilla Tactics 2018","series":"","short":"","website":"https://go.evvnt.com/256641-0?pid=4868","content":"Expanding Practice: Navigating the architecture of planning, procurement and property Tuesday 13 November 2018: Conference Day and Speed-Mentoring Evening Wednesday 14 November 2018: CPD Day The Conference Day - Tuesday 13 November 2018 For many small practices, planning, procurement and economic viability are barriers to creativity. This increasingly complex bureaucracy now takes up the majority of an architect's time and is fundamental to the success of a project - but it is still seen as secondary to design. Instead of constraints, could these processes be seen as opportunities for architectural creativity in their own right? Expanding Practice: Navigating the architecture of planning, procurement and property will help small practices learn how to navigate the system. It will explore the hidden iceberg of regulations, rules and forces that define the everyday realities of practice. It will demystify the planning process, turn the tables on public procurement, and shine a light on the dark art of viability. The conference will equip small practices with the insights, tools and tactics to engage with the system earlier upstream and see constraints as an opportunity to creatively expand their practice. Keynote: Sadie Morgan, dRMM Dan Hill, ARUP Other speakers include: Tony Travers, LSE Alice Lester MBE, LB Brent Rae Whittow-Williams, LSA Tina Jadav, GLA Speed-Mentoring Evening - Tuesday 13 November 2018 The conference day ticket encompasses an evening drinks reception and the highly successful Speed-Mentoring Evening. This affords delegates the opportunity to pair up with inspiring role models. A full programme of mentors, including leading clients and contractors as well as architects, will be emailed to all booked delegates prior to the event. The CPD Day - Wednesday 14 November 2018 The CPD day will offer a full day of 21 seminars covering all ten RIBA Core Curriculum topics, with engaging sessions from expert practitioners on relevant issues. URL: Booking: https://go.evvnt.com/256641-2?pid=4868 Time: 9:30 am to 5:00 pm Prices: 2 Day Early-Bird RIBA Member: GBP 179.0, 2 Day Early-Bird Non-RIBA Member: GBP 225.0, Early Bird RIBA Member - Conference Day only: GBP 97.0, Early Bird RIBA Member - CPD Day only: GBP 97.0, Early Bird Non-Member - Conference Day only: GBP 138.0, Early Bird Non-Member - CPD Day only: GBP 138.0, 2 Day Student: GBP 97.0, Student Conference Day only: GBP 50.0, Student CPD Day only: GBP 50.0 Venue Details: Royal Institute of British Architects, 66 Portland Place, Greater London, W1B 1NT, United Kingdom","date_start":"2018-11-13","date_end":"2018-11-14","important_dates":{"abstract":"","full":"2018-11-12","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Greater London","United Kingdom"],"name":"","street":"","city":"Greater London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["RIBA"],"societies":[],"indexes":[],"emails":[]}