{"name":"International Workshop on Architectures for Future Mobile Computing and Internet of Things (FMCIoT 2018)","series":"","short":"","website":"http://fmciot2018.lacl.fr","content":"Mobile phones and Internet of Things (IoT) devices are the top two largest categories of connected devices in 2018\\. With more than 15% compound annual growth rate, they are considered as one of today's hottest trends in both academia and industry. Both Mobile phones and IoT devices integrates different major technologies such as cloud services, big data, cloud computing, and wireless networking (Bluetooth, Wi-Fi, 5G, …) in one platform that services the end users. According to Ericsson, there will be a total of approximately 28B connected devices worldwide by 2021 fairly distributed between Mobile phones and IoT devices. Despite this rapid growth, many issues at the intersection of Mobile computing and IoT are still challenging and need to be addressed. These challenges are related to the underlying communication networks, interaction with cloud services, security, the required Quality of Service, the availability of services, integration with next generation internet technologies, and many others. Held in conjunction with MoWNet The International Workshop on Architectures for Future Mobile Computing and Internet of Things (FMCIoT 2018) Symposium will be held in conjunction with the 7th IEEE International Conference on Selected Topics in Mobile & Wireless Networking (MoWNet'18). The FMCIoT 2018 Symposium aims at soliciting original ideas on the broad area of Mobile and IoT architectures including challenges and opportunities, concepts and applications and future trends that addresses the aforementioned challenges. The Symposium aims to facilitate discussions among academics and industry to bridge Mobile Computing and IoT practitioners and make positive contributions to the field. Submission Authors are invited to submit original, unpublished manuscripts. Submitted papers should be in accordance with IEEE format, and will be reviewed by at least two expert reviewers in terms of relevance, originality, contribution, correctness, and presentation. Submission and acceptance deadlines: Submission deadline: March 20, 2018 Paper notifications: April 20, 2018 Paper camera ready due: May 05, 2018 You are invited to submit original papers of up to 8 pages, written in English and compliant with the IEEE standard (8.5″x11″, two-column). The Conference Publishing Services will publish the proceedings. Submissions must be PDF files in IEEE format. Accepted paper will be published in IEEE digital library. Submission link: https://edas.info/newPaper.php?c=24592&track=90016​","date_start":"2018-06-20","date_end":"2018-06-22","important_dates":{"abstract":"","full":"2018-03-20","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Tangier","Morocco"],"name":"","street":"","city":"Tangier","state":"","ZIP":"","country":"Morocco"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}