{"name":"THE INTERNATIONAL CONFERENCE ON MODELLING AND APPLIED SIMULATION","series":"","short":"MAS 2018","website":"http://www.msc-les.org/conf/mas2018","content":"The MAS Conference concentrates on applied Modeling & Simulation (M&S) and computer technologies. Application fields include logistics, supply chain management, production control, business and industrial organization. In 1996 DIP was driving the European Simulation Symposium into the Simulation in Industry Event for demonstrating the potential of M&S applied in real world; in a similar way, MAS is an International Conference in M&S Applications. MAS was established in 2002 as a joint event toHMS2002 Bergeggi, Italy in order to provide an opportunity for Project Meetings (i.e. IEPAL, LESNEX, WILD). Several edition was held of MAS event during the past years (MAS2003 as a stand-along event, MAS2004 as part of I3M2004 Multiconference, MAS2005 in joint cooperation with I3M Conference in Marseille and MAS2006). The MAS2007 was a joint event in cooperation with I3M2007 Multiconference. In 2008 the conference moved to South Italy in Calabria and it is a joint event in I3M2008, co-locating HMS2008, EMSS2008 and MAS2008\\. In 2009 MAS was successfully organized in Tenerife, Canary Island, Spain,in 2010 MAS was held in Fes, Morocco and in 2011 was held in Rome,Italy. In 2012 and 2013 the conference was held in Vienna (Austria) and Athens, respectively, while in 2014 the conference moves to Bordeux (France) and it is organized in cooperation as joint event in I3M2014, co-locating HMS2014, EMSS2014, DHSS 2014, I-WISH 2014 and SESDE 2014\\. In this framework, worldwide specialist have the opportunity to present new advanced applications as well to work forward for establish new international co-operation and projects. This event is the ideal framework for setting up European Community and International Projects and it could be used as a framework for hosting project review meeting and project exploitation. The audience includes both users, vendors and scientists operating in applying advanced techniques to industry, business and services.","date_start":"2018-09-17","date_end":"2018-09-19","important_dates":{"abstract":"","full":"2018-05-15","notification":"","final":""},"topics":["Business","Other"],"location":{"virtual":"","full":["Budapest","Hungary"],"name":"","street":"","city":"Budapest","state":"","ZIP":"","country":"Hungary"},"organizers":["Cal-tek S.r.l."],"societies":[],"indexes":[],"emails":[]}