{"name":"International Conference on Human Capital and Knowledge Management","series":"","short":"","website":"http://globalbizresearch.org/Thailand_Conference_2018_feb2/index.php","content":"Dear & Esteemed Colleagues, May we extend a warm welcome to you to be part of the upcoming academic research conference in Human Capital and Knowledge Management (IC18Thailand Conference) which will be held in Ambassador Hotel Bangkok, Bangkok-Thailand. You are welcome to submit your abstracts/full paper/case studies in all areas of research in business studies. Panel discussions and invited lectures are always a part of our academic research conferences which are widely appreciated by the delegates attending the event. Invited lectures will be arranged on selected topics closely synchronized with the conference theme and topics related to Human Capital and Knowledge Management. Panel Discussion! Topic: How to hone the skillsets of your students? We invite everyone of you to be part of this discussion on the above topic. Business Analysis, Business Intelligence, Communications Management, Change Management, Conflict Management, Crisis Management, Cost Management, Competitor Analysis, Corporate Analysis, Decision Sciences, Group Behavior, Industrial Relations, Individual Behavior, Innovation, Information Technology Management, Knowledge Management, Leadership, Motivation, Management of change, Management Science, Organizational Development, Production and Organizations, Production/Operations Management, Public Relations, Public Responsibility and Ethics, Project Management, Risk Management, Resource Management, Strategy, Stress Management, System Management, Systems Thinking, Strategic Management, Strategic Management Policy, Supply Chain Management, Strategic Planning, Time Management, Technological Change; Research and Development, Technology & Innovation, Task Analysis, Work-Life Balance.","date_start":"2018-02-16","date_end":"2018-02-17","important_dates":{"abstract":"","full":"2018-02-05","notification":"","final":""},"topics":["Business","Human-Resources","Human Resource Management"],"location":{"virtual":"","full":["Bangkok","Thailand","Thailand"],"name":"","street":"","city":"Bangkok","state":"Thailand","ZIP":"","country":"Thailand"},"organizers":["Greater Vision Conference supported by J.A. Alpha Business Research & Publishers Pvt. Ltd.,"],"societies":[],"indexes":[],"emails":[]}