{"name":"18th IFAC International Conference on Technology, Culture and International Stability TECIS 2018","series":"","short":"","website":"https://tecis18.org","content":"18th IFAC International Conference on Technology, Culture and International Stability TECIS 2018 Important Dates Proposals for invited sessions 15.05.2018 Draft papers submission deadline 31.05.2018 Notification of acceptance 15.07.2018 Early registration deadline 01.08.2018 Full paper submission 15.08.2018 Description TECIS 2018 aims to bring together researchers and practitioners from industry and academia to give an overview of the state of the art, to present new research results and to exchange ideas and experiences in the fields of technology and international stability. Technology development leads to dramatic changes in international stability. It has never been so important to examine system stability. Currently and during the recent years social international and national systems of control have been shown to be inadequate and prone to be fundamental and most basic instable. Many basic assumptions are no longer certain and are definitely questioned. This event will systematically examine these topics. Another goal of the TECIS conference is to propose new approaches in dealing with globalization effects, as studying complexity and knowledge management. Topics The scope of the conference will cover but is not limited to: • Control and Automation to Improve Stability • Young Engineers in Control • Automation and Control in Oil and Gas Industry • Social Aspects of Oil and Gas Engineering • Developments in Petrochemical Industry • Development of Regions, Countries • Social Networks • Managing the Introduction of Technological Change to Improve Stability • Technology in Post-conflict Regions • Innovation Management • Open Innovation and Applications • Enterprise Integration and Networking, Software • Cost Oriented Automation (COA) • SME-oriented Automation • Decision Support Systems for SME's • Semi-Automated Assembly and Disassembly (EoL) • Intelligent Systems and Applications • Mechatronic Systems and Robotics • Robotics and Handling Devices • Artificial Intelligence and Applications • Retrofitting of Automation Devices • Engineering Ethics • Tele-medical Systems • Cross-cultural Aspects of Engineering (TRIZ theory, etc.) • Control & Political Stability • Models & Simulation • Sustainable Design and Control • Control of Security and Privacy • Human aspects of safety and risk engineering • Biomedical Systems Authors are encouraged to submit papers, invited sessions, pre-conference workshops & tutorials, as well as exhibitions & posters from industrial companies or institutions. Prospective authors are invited to submit papers of maximum six pages. All contributions must be formatted according to IFAC style and must be submitted via the Paper Plaza Conference Manuscript Management System. The PDF file is limited to 2MB in size. Authors are encouraged to follow IFAC guidelines for paper formatting. Please consult the TECIS 2018 website for more information. Submitted papers at TECIS 2018 must be original and hence cannot be already published, nor can they be under review elsewhere. Prospective authors are expected to present their papers at the conference. For each accepted paper at least one of the authors should register (full registration) before uploading the final version of the paper. With full registration two papers with reduced registration fee one paper can be uploaded. A proposal for an invited session must include titles, abstract, authors of either one survey and four regular or six regular papers, a one-page description for the special session including session outline, contact information of the proposer. The best IFAC young author award (IFAC, YAA) will be granted to a PhD student and/or a student less than 30 years as the first author and presents the paper at TECIS 2018\\. Shortlisted nominees will get a travel grant.","date_start":"2018-09-13","date_end":"2018-09-15","important_dates":{"abstract":"","full":"2018-05-31","notification":"","final":""},"topics":["Engineering & Technology","Other","Robotics"],"location":{"virtual":"","full":["Baku","Azerbaijan"],"name":"","street":"","city":"Baku","state":"","ZIP":"","country":"Azerbaijan"},"organizers":["Organizers: Azerbaijan Robotics and Automation Society (ARAS), Vienna University of Technology, IHR"],"societies":[],"indexes":[],"emails":[]}