{"name":"World Anti-Bullying Forum 2019","series":"","short":"","website":"https://go.evvnt.com/247594-2?pid=4868","content":"Friends International Centre Against Bullying, the National Anti-Bullying Research and Resource Centre and the International Bullying Prevention Association is excited to bring you the world’s largest and most important gathering of people interested in understanding and tackling bullying, cyberbullying, harassment and online safety issues among children and young people. We will bring together teachers, youth workers, researchers, policy makers, politicians, NGOs, scientists, parents groups, and students to explore the causes of bullying, cyberbullying, harassment and online safety as well as showcasing innovative programmes and initiatives to eliminate bullying, cyberbullying and promote online safety among children and young people. WABF2019 promises an eclectic programme of lectures, workshops and social events for a worldwide and world-class meeting in Dublin. ABC's organising committee will bring you an amazing programme including keynote speakers of worldwide repute. In addition, there will be an opportunity to meet experts in a variety of areas in smaller sessions. There have been amazing innovations in this field in recent years and many of the people involved have agreed to share their experiences with you. Also our partners from government, social media companies, technology and education organisation, who have supported the advances being made, are already signing up and helping to make this a world class event. It will be a truly multidisciplinary event. So please join us to celebrate and look ahead to an exciting future of innovations and developments in this important area which is integral to eliminating bullying and cyberbullying from the lives of children and young people. If you would like to find out more information on becoming a sponsor or exhibitor, please contact: Colm O'Grady at Colm@conferencepartners.ie Prices: Registration Fee (Before 28th February 2019): EUR 435.0, Registration Fee (After 28th February 2019): EUR 525.0, Student Fee (Before 28th February 2019): EUR 295.0, Student Fee (After 28th February 2019): EUR 395.0 URL: Tickets: https://go.evvnt.com/247594-0?pid=4868 Speakers: Professor Christina Salmivalli - Turku University, Finland, Professor Dorte Marie Sondergaard - Aarhus University, Denmark, Professor Susan M. Swearer - University of Nebraska, Lincoln, USA, Professor Shelley Hymel - University of British Columbia, Canada, Dr. Kevin Kumashiro - Consulting, USA, Dr. Shoko Yoneyama - University of Adelaide, Australia, Professor Rene Veenstra - University of Groningen, Netherlands, Dr. Christian Berger - Pontifical Catholic University of Chile, Chile, Professor Michael Kyobe - University of Cape Town, South Africa, Professor Eva Romera - University of Cordoba, Spain, Professor Peter Smith - (Plenary Chair) Goldsmiths University, UK Venue details: The Helix, Dublin, DCU, Collins Avenue, Whitehall, Dublin, Dublin 9, Ireland Time: 9:00 am - 5:30 pm","date_start":"2019-06-04","date_end":"2019-06-06","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Dublin","Ireland"],"name":"","street":"","city":"Dublin","state":"","ZIP":"","country":"Ireland"},"organizers":["conference Partners International"],"societies":[],"indexes":[],"emails":["colm@conferencepartners.ie"]}