{"name":"The second international gender and sexuality studies conference, 2017","series":"","short":"","website":"www.uco.edu/thecenter","content":"Call for Papers ABSTRACT submission Due date: May 7th 2017 Venue: Skirvin Hilton Hotel 1 Park Ave, Oklahoma City, OK 73102 September 28 – 30, 2017 The International Gender and Sexuality Studies Conference is hosted by the Women’s Research Center and the BGLTQ+ Student Center at the University of Central Oklahoma. “The Center” hopes to promote intellectual engagement with Women’s, Gender, and Sexuality issues by hosting annual conferences. The Center invites proposals for presentations at the Second International Gender and Sexuality Studies Conference. This international interdisciplinary conference welcomes proposals for presentations in a variety of formats that address issues of gender and sexuality in the social sciences, humanities, fine arts, and STEM fields. We invite students, faculty, staff, scholars, and activists to propose papers, panels, roundtable discussions, and poster presentations. We also welcome proposals to present or perform creative work including creative writing, drama, music, and visual art. Instructions for submission Paper, workshop, panel and round table discussion submission guidelines: 1\\. Initial submissions should include a 350-word abstract.This ABSTRACT is due May 7, 2017 2\\. You may submit your abstract in Word or PDF format. 3\\. If The Center has questions on the proposal, we will reach out to you via email. 4\\. Include your name, affiliation, phone number, and email address in your document. Creative art submission guidelines: 1\\. Creative art includes art displays, writing, drama, music and visual arts. 2\\. If your work falls into one of the above categories, you are required to submit a 350- word description of your creative artwork. 3\\. If The Center has questions on the proposal, we will reach out to you via email. 4\\. You may submit your abstract in Word or PDF format. This ABSTRACT is due May 7, 2017 5\\. Include your name, affiliation, phone number, and email address in your document. General instructions 1\\. Abstracts should be submitted to thecenteratuco@gmail.com. 2\\. The deadline to submit your ABSTRACT for consideration is May 7, 2017, Sunday, before 11:59PM. 3\\. The Center’s decision is final. For more questions, please reach out to Dr. Lindsey Churchill, Director of the Women’s Research Center and the BGLTQ+ Student Center, at lchurchill@uco.edu.\"","date_start":"2017-09-28","date_end":"2017-09-30","important_dates":{"abstract":"","full":"2017-05-07","notification":"","final":""},"topics":["Social Sciences","Gender/Sexuality","gender studies (and womens)"],"location":{"virtual":"","full":["Oklahoma City","Oklahoma","United States"],"name":"","street":"","city":"Oklahoma City","state":"Oklahoma","ZIP":"","country":"United States"},"organizers":["The women's research center and BGLTQ+ student center"],"societies":[],"indexes":[],"emails":["thecenteratuco@gmail.com","lchurchill@uco.edu"]}