{"name":"TEDxWarwick 2018: Dare to Defy","series":"","short":"","website":"https://go.evvnt.com/201781-0?pid=4868","content":"We invite renowned speakers from around the world from to share and spark deep, meaningful conversations: from technology, business, and sciences, to their extraordinary experiences and beyond. Defiance. Refusing to obey. Striding into the unknown. In today's society, we face a plethora of expectations, stereotypes, and standards which impede the development of our individuality. But what if we rejected these externally imposed conditions? What if we defied societal standards? What if we chose to live free of expectations? Celebrating its 10th anniversary, TEDxWarwick honours those who have revolutionised our society and continue to do so. Those who have redefined 'the possible'. Those who have taken risks and acted against the norm. Our aim is simple: to spread the ideas of these daring individuals and to inspire you to go beyond the ordinary. This year, we choose to outclass the orthodox, surpass the standard, and challenge the conventional. Will you join us? We dare you. Venue Details: Warwick Arts Centre, University of Warwick, Gibbet Hill Road, Coventry CV4 7AL, United Kingdom. Time: 10:00 am - 6:00 pm. Category: Arts | Visual Arts | New Media. Sub-Categories: Conferences | Education, Kids / Family. URLs: Tickets: https://go.evvnt.com/201781-1?pid=4868 Facebook: https://go.evvnt.com/201781-2?pid=4868 Twitter: https://go.evvnt.com/201781-3?pid=4868 Prices: Early Bird (SOLD OUT): GBP 18, Student: GBP 20, Standard: GBP 25, Premium: GBP 28, Friends of TEDxWarwick: GBP 35.","date_start":"2018-03-03","date_end":"","important_dates":{"abstract":"","full":"2018-03-03","notification":"","final":""},"topics":["Arts & Humanities","Visual Arts"],"location":{"virtual":"","full":["Coventry","United Kingdom"],"name":"","street":"","city":"Coventry","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Ahmed Sorour"],"societies":[],"indexes":[],"emails":[]}