{"name":"Education Forum Northamptonshire November 2018","series":"","short":"","website":"https://go.evvnt.com/256620-2?pid=4868","content":"The Education Forum is a unique event for senior education procurement professionals, and the suppliers who service them. It is focused around connecting buyers with suppliers covering all areas of the sector - from Catering to IT and Technology; Building Initiatives to Maintenance; Furniture to Security and Risk Management; and beyond. Benefits include: • Free for education professionals to attend. • Education procurement executives are matched with suppliers for a series of face-to-face, pre-arranged meetings based on mutual requirements. • Insightful and inspirational seminars hosted throughout the two days. • Opportunity to network with like-minded peers. • All hospitality - including overnight accommodation, all meals and refreshments, plus an invitation to the gala dinner with entertainment - is entirely complimentary for education professionals. • £millions of new business has been generated via these 'meet the buyer' events URLs: Tickets: https://go.evvnt.com/256620-0?pid=4868 Twitter: https://go.evvnt.com/256620-3?pid=4868 Time: 08:00 to 13:00\\. Venue details: Whittlebury Hall Hotel, West Park House Towcester, Whittlebury, NN12 8QH, United Kingdom. Speakers: Chris Phillips, Managing Director, The International Protect and Prepare Security Office (IPPSO), Martin Smith, Specialist Training Consultant, ITC Consulting LTD, Ian Phillips, Assistant Head/ Director of ICT, The Haberdashers' Aske's Boys' School, Duncan Mckee, Music Educator and Founder, Bambajam, Sadie Sharp, Transformational Developer, Sharp Transformations","date_start":"2018-11-12","date_end":"2018-11-13","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Whittlebury","England","United States"],"name":"","street":"","city":"Whittlebury","state":"England","ZIP":"","country":"United States"},"organizers":["Forum Events Ltd"],"societies":[],"indexes":[],"emails":[]}