{"name":"Floortime Fridays Online Course for Parents of Autistic Children","series":"","short":"","website":"https://go.evvnt.com/224877-0?pid=4868","content":"This is a 6 session live online programme, 11th,18th, 25th May and 8th, 15th, 22nd June 2018, 9.30-11.30am. DIR®/Floortime™ is a comprehensive, relationship-based Model of intervention for families with autistic children. Delivered by ICDL Training Leader Denise Wilson. She is an occupational therapist and play therapist. The course is interactive and aims to answer parents questions. DIR® stands for Developmental, Individual Differences, Relationship-Based: Developmental – The course gives an overview of Greenspan's Functional Emotional Developmental Capacities 1-6\\. These are the capacities a child must master for healthy emotional and intellectual growth. The capacities are, 1\\. To be regulated and interested in their surroundings. 2\\. To engage with others and deepen attachment bonds. 3\\. To initiate and respond in two-way purposeful communication. 4\\. To communicate in more complex ways. 5\\. To be imaginative. 6\\. To build bridges between ideas, and so, become a logical thinker. Individual Differences - Each child has their own unique profile which needs to be taken into account. Improving our knowledge of each child's Individual Differences, helps us to understand the child's unique experience within their bodies and their perception of their world. These differences may be in the following areas, Motor function Sensory processing Environment factors Health factors Family factors, including attachment Relationship-Based - The warm, loving interactions between the child and their caregivers are at the core of the Model. The child develops an understanding of themselves and the world through long chains of back and forth interactions with their caregivers. Floortime - Through video examples and discussion, course participants will see how Floortime play supports the D, I and R, so that the child can evolve towards independent thinking and sustaining warm, loving relationships. Time: 9:30 am to 11:30 am Price: Family attendence: GBP 85.0 Speaker: Denise Wilson Venue Name: Online","date_start":"2018-05-11","date_end":"2018-06-22","important_dates":{"abstract":"","full":"2018-05-10","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Wantage","United Kingdom"],"name":"","street":"","city":"Wantage","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Connecting Through Play"],"societies":[],"indexes":[],"emails":[]}