{"name":"Materials Electrochemistry Conference: Advancements and Breakthroughs","series":"","short":"","website":"https://materialselectrochemistry.conferenceseries.com","content":"Electrochemistry is a branch used to study the electrochemical properties of molecules and to explore the chemical reactions involving electron transfer, the kinetic measurement of parameters and to establish the reaction mechanism for the electro-synthesis of desired product. The conference is structured in a manner so as to bring out the recent research topics and interests among the scientific community to the forum by distinguished speakers. The conference gives a platform where Science can meet Technology as a result of the presence of revered personalities from the academic and industrial field. The revolutionary field of utilizing conventional energy resources requires efficient Energy conversion and storage system. In the light of which various high energy density materials have been developed. The energy storage and conversion system has turned over a new page in its development by adopting evolving design and manufacturing techniques of new materials. The design, synthesis, self-assembly and functionalization of carbon based nanomaterial like graphene, fullerene, CNT show promising energy storage capacities .These high energy density materials can easily replace the Platinum catalyst which is economically costly and become unstable in the long run, this in turn reduces the fuel cell cost. The next generation materials with self- healing capability, Energy and power density, rate capability, and cycling life of batteries, fuel cells, and supercapacitors can be engineered by altering the structure, composition, morphology, and architecture of the electrode and electrolyte materials.","date_start":"2018-09-20","date_end":"2018-09-21","important_dates":{"abstract":"","full":"2018-09-20","notification":"","final":""},"topics":["Physical Science & Math","Chemistry"],"location":{"virtual":"","full":["Dubai","UAE","United Arab Emirates","United Arab Emirates"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":["ME Conferences"],"societies":[],"indexes":[],"emails":[]}