{"name":"2019 3rd International Conference on Aeronautical Materials and Aerospace Engineering","series":"","short":"AMAE 2019","website":"http://www.amae2019.org","content":"2019 3rd International Conference on Aeronautical Materials and Aerospace Engineering (AMAE 2019). 24-26, May, 2019./Shanghai, China Web: http://www.amae2019.org/ 2019 3rd International Conference on Aeronautical Materials and Aerospace Engineering (AMAE 2019). 2MAE, the predecessor of AMAE, has been successfully held for 2 years, and has gained a lot of attentions in the previous success comummunications. From now on, to take more focus on Aeronautical Materials and Aerospace Engineering field, 2MAE is officially named as AMAE in the coming year. AMAE 2019 is organized by Hong Kong Society of Mechanical Engineers( HKSME). The conference will be held in Shanghai, China, from 24-26, May, 2019\\. ●Publication Information Author can submit full paper to publish in the volume of Conference Proceeding , which will be indexed by EI Compendex, Scopus, Thomson Reuters (WoS), Inspec, and other indexing organizations. #The Conference Proceeding of 2MAE 2017 was Indexed by EI Compendex ●Topics(for more topics: http://www.amae2019.org/cfp.html) Advanced theoretical models Advances in aerospace technology Aeroelasticity and loads Aerodynamic’s fundamental concepts Aerospace robotics and mechatronics Flight software engineering and testing Aerostructures and composites Aircraft systems ●Paper Submission Submission Email:amae@smehk.org Submission System: https://cmt3.research.microsoft.com/AMAE2019 ●Call for participants 1,Presenter:If you are interested in giving presentation on conference, without publishing your paper in the proceeding, you need to submit the abstract and title of your presentation to us:amae@smehk.org 2,Listener: If you are interested in attending the conference to participant this gathering on the field of Aeronautical Materials, Aerospace Engineering, you are welcome to join us and share your ideas! 3,Reviewer:Experts in the area of Aeronautical Materials, Aerospace Engineering are welcome to join the conference as reviewer. Send your CV to: amae@smehk.org ●Contact Us Ms.Sophia Liu Email: amae@smehk.org Tel:+852-30697937( Hong Kong) Web: http://www.amae2019.org/","date_start":"2019-05-24","date_end":"2019-05-26","important_dates":{"abstract":"","full":"2019-04-25","notification":"","final":""},"topics":["Engineering & Technology","Material/Nanotechnology"],"location":{"virtual":"","full":["Shanghai","China","China"],"name":"","street":"","city":"Shanghai","state":"China","ZIP":"","country":"China"},"organizers":["HKSME"],"societies":[],"indexes":[],"emails":["amae@smehk.org"]}