{"name":"ELTU Conference 2019: Alternative Approaches to English Language Learning and Teaching","series":"","short":"","website":"www.eltu.cuhk.edu.hk/conference2019","content":"The ELTU Conference on Alternative Approaches to English Language Learning and Teaching will be held on 27-28 May 2019 at The Chinese University of Hong Kong. This conference aims to explore the creative and innovative ways that English is taught at a tertiary level around the world. We welcome academics and educators who research or practice English Language Teaching to attend or present at the conference. In our rapidly changing society, creativity and flexibility are highly valued and embraced. This trend is reflected vividly in the English Language Teaching (ELT) context, where catering to the growing diversity of learners has become a real challenge. This conference provides a platform for ELT practitioners and other interested parties in the field to share their insights and experiences on the design, development, and implementation of innovative and novel approaches to learning and teaching English as a second / foreign language at the tertiary level. Through sharing and exchanging ideas, participants can reflect on their own current practices and explore alternative ways to enrich / complement / supplement their teaching methods and course / curriculum development. We are currently accepting proposals for paper presentations, workshops, colloquiums or poster presentations. For further information about the sub-themes of the conference or how to submit an abstract for consideration please visit the conference website. We look forward to welcoming you at the ELTU Conference 2019.","date_start":"2019-05-27","date_end":"2019-05-28","important_dates":{"abstract":"","full":"2018-12-31","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","higher education"],"location":{"virtual":"","full":["Hong Kong"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":[""],"societies":[],"indexes":[],"emails":[]}