{"name":"Disaster Management 2019 - 6th International Conference on Disaster Management and Human Health Risk: Reducing Risk, Improving Outcomes","series":"","short":"","website":"https://www.wessex.ac.uk/conferences/2019/disaster-management-2019","content":"Introduction The International Conference on Disaster Management is being reconvened following the success of the previous meetings, held at Wessex Institute in the New Forest in 2009, the University of Central Florida in Orlando, USA in 2011, A Coruña, Spain in 2013, Istanbul Technical University, Turkey in 2015 and Seville, Spain, 2017\\. This series of conferences originated with the need for academia and practitioners to exchange knowledge and experience on the way to handle the increasing risk of natural and human-made disasters. Recent major earthquakes, tsunamis, hurricanes, floods and other natural phenomena have resulted in huge losses in terms of human life and property destruction. A new range of human-made disasters have afflicted humanity in modern times; terrorist activities have been added to more classical disasters such as those due to the failure of industrial installations for instance. It is important to understand the nature of these global risks to be able to develop strategies to prepare for these events and plan effective responses in terms of disaster management and the associated human health impacts. The conference provides a forum for the exchange of information between academics and practitioners, and a venue for presentation of the latest developments. The corresponding volume of WIT Transactions containing the papers presented at the meetings are published in paper and digital format and widely distributed around the world. The papers are also archived in the WIT elibrary (http://www.witpress.com/elibrary) where they are available to the international community. Conference Topics The following list covers some of the topics to be presented at Disaster Management 2019\\. Papers on other subjects related to the objectives of the conference are also welcome. Disaster analysis Disaster monitoring and mitigation Emergency preparedness Risk mitigation Risk and security","date_start":"2019-09-25","date_end":"2019-09-27","important_dates":{"abstract":"","full":"2019-06-01","notification":"","final":""},"topics":["Business","Information-Technology"],"location":{"virtual":"","full":["Ancona","Italy"],"name":"","street":"","city":"Ancona","state":"","ZIP":"","country":"Italy"},"organizers":["Wessex Institute"],"societies":[],"indexes":[],"emails":[]}