{"name":"24th International Conference of Functional Food Center","series":"","short":"","website":"http://functionalfoodscenter.net/24th-int--conference-of-ffc.html","content":"Functional Food Center is pleased to announce its 24th International Conference \"Functional Foods, Nutrition and Chronic Diseases: Science and Practice.\" The conference will be held in Joseph B. Martin Conference Center at Harvard Medical School Boston, the USA on September 20-21, 2018\\. This conference will bring together experts in medicine, biology, and the food industry to discuss the functional foods with bioactive compounds as dietary interventions for chronic diseases. Conference organized by FFC and Nutrition/Metabolism Laboratory at Department of Surgery, Beth Israel Deaconess Medical Center / Harvard Teaching Hospital. Session Topics: Functional Food Definition and the Status of Functional Foods in Japan, US and other Countries Nutrition, Functional Foods, and Obesity Nutrition, Functional Foods, and Diabetes Nutrition, Functional Foods, and Neurological Diseases Nutrition, Functional Foods, and Cardiovascular Diseases (CVD) Nutrition, Functional Foods, and Cancer Functional Foods with Bioactive Compound(s): Prevention and Management of Non-communicable Diseases Safety of the Bioactive Compounds and Functional Foods Biomarkers , Functional Foods, and Chronic Disease Special Session: Functional Food, Microbiome and Cancer Special Session: Dietary Exosomes and their Cargos Special session: Engineering bioaccessibility and bioavailability of bioactive compounds Current Research and Development of New Functional Food Products","date_start":"2018-09-20","date_end":"2018-09-21","important_dates":{"abstract":"","full":"2018-09-03","notification":"","final":""},"topics":["Medicine & Health","Medical-Speciality","Food Science & Safety"],"location":{"virtual":"","full":["Boston","Massachusetts","United States"],"name":"","street":"","city":"Boston","state":"Massachusetts","ZIP":"","country":"United States"},"organizers":["Functional Food Center"],"societies":[],"indexes":[],"emails":[]}