{"name":"NAFLD summit 2018","series":"","short":"","website":"https://go.evvnt.com/219939-0?pid=4868","content":"NAFLD has become a leading cause of chronic liver disease globally given the rise in levels of obesity and type 2 diabetes mellitus. It presents unique challenges to the liver community given the complex multi-factorial origins of obesity and the metabolic syndrome and also the presence of multiple co-morbidities in many patients with NAFLD. There also remain many challenges such as the identification of at-risk individuals, the development of lifestyle and pharmacological therapies and ultimately the assessment of their cost-effectiveness. This summit will cover the whole spectrum of basic and translational/clinical aspects of NAFLD, including views from patients groups and the latest advances in new therapeutic developments. Unlike other NAFLD meetings, this summit will also feature multiple case conferences exploring the key issues in the management of patients, with keynote speakers providing the evidence to support decision making resulting in a series of consensus statements to support best practice. Central to the meeting is the concept of multi-disciplinarity which is of major importance in NAFLD. There is also significant representation by industry partners and presentations will be delivered by both academia and industry leaders to stimulate our joint efforts in addressing the key challenges across the spectrum of NAFLD. Active audience participation will be encouraged, with the aim of fostering greater research collaborations between academia and industry. In addition, there will be the opportunity to submit abstracts of ongoing basic and translational research, and these will be accepted as e-posters. Tickets https://go.evvnt.com/219939-1?pid=4868 Prices: EASL Member early fee: EUR 300.0 EASL Member full fee: EUR 450.0 Non Member early fee: EUR 450.0 Non Member full fee: EUR 550.0 Speakers: Prof. Elisabetta Bugianesi, Italy, Prof. Philip N. Newsome, United Kingdom, Prof. Vlad Ratziu, France Time: on Thursday September 20, 2018 at 2:00 pm (ends Saturday September 22, 2018 at 5:00 pm) Venue details: Starling Hotel Geneva, 34 Route François-Peyrot, Le Grand-Saconnex, 1218, Switzerland","date_start":"2018-09-20","date_end":"2018-09-22","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Le Grand","Saconnex","Switzerland"],"name":"","street":"","city":"Le Grand","state":"Saconnex","ZIP":"","country":"Switzerland"},"organizers":["EASL The Home of Hepatology"],"societies":[],"indexes":[],"emails":[]}