{"name":"12th Annual ISDSI Conference 2018","series":"","short":"","website":"https://dsiindia.org","content":"About ISDSI2018 SPJIMR, a top ranked school of management in India that works with the mission of Influencing Practice and Promoting Value Based Growth, will host the 12th Annual ISDSI Conference from December 27-30, 2018 at its campus in Mumbai. The theme of this international conference is “Data Driven Decision Making in the Digital Age”. Topics and Humanitarian Operations 19\\. Healthcare Management 20\\. Travel and Tourism Management Call for Papers Decision-making is at the heart of leadership. As organisations wrestle with deep and fundamental change across the business landscape, how must they prepare to take decisions that are relevant, efficient and effective? Leaders must make the best use of available resources to leverage traditional strengths and capacities to the fullest. Alongside, a host of technical, cultural, behavioural, social and environmental interdependencies can throw up new challenges and opportunities for leaders. Emerging trends and evolving technologies, among them IoT, big data analytics, AI and blockchain, will continue to disrupt current business processes, making the task of managers charged with taking decisions even more complex. In this context, SPJIMR, a top ranked school of management in India that works with the mission of Influencing Practice and Promoting Value Based Growth, will host the 12th Annual ISDSI Conference from December 27-30, 2018 at its campus in Mumbai. The theme of this international conference is “Data Driven Decision Making in the Digital Age”. The main objective of this conference is to provide a platform for academicians, researchers and practitioners to: disseminate research, providing insights into the challenges, opportunities, emerging strategies and analytical tools in the domain of decision making; present case studies on application of tools and techniques; explore cutting- edge ideas, results and share experiences. List of Tracks The conference presentation tracks include, but not limited to the following: 1\\. Business Analytics and Big Data 2\\. Decision Sciences in Practice 3\\. Accounting and Finance 4\\. Economics 5\\. Entrepreneurship and Strategic Management 6\\. Information Systems and Technology 7\\. Innovation & Design Thinking 8\\. Logistics and Transportation Management 9\\. Production Management 10\\. Marketing and Consumer Behaviour 11\\. Organisational Behaviour and Human Resource Management 12\\. Procurement and Sourcing 13\\. Project Management 14\\. Public Policy Issues and Management 15\\. Quality Management and Lean Operations 16\\. Service Operations 17\\. Supply Chain Performance 18\\. Sustainability, CSR, and Humanitarian Operations 19\\. Healthcare Management 20\\. Travel and Tourism Management Doctoral Colloquium The doctoral colloquium provides an opportunity for students who are pursuing their PhD / FPM to present their research to other students and experts in the field. A panel of distinguished researchers will offer feedback and provide valuable insights that can help students improve their research work. It is a platform for research scholars to exchange ideas in a relatively informal setting. The aim of the doctoral colloquium is to contribute towards a transformative journey for a doctoral scholar, who will learn about nuances of a research journey, besides receiving feedback on their research and publications. Extended abstract of 1500 words submitted to the doctoral colloquium will be reviewed, and top three research papers presented at the colloquium will be considered for award of the “Best Doctoral Paper”. Keynotes / Workshops / Panel Discussions One of the special attractions of the conference will be the high quality workshops and panel discussions led by experts from industry and academia, on the following themes, in addition to the keynotes and a new faculty colloquium. 1\\. Navigating job market and early career challenges for PhD scholars 2\\. Enhancing teaching and learning effectiveness 3\\. Converting dissertation to papers 4\\. Global accreditations and its impact 5\\. Women in decision sciences 6\\. Publishing in high quality journals 7\\. New faculty colloquium 8\\. Design thinking 9\\. Pedagogy, engaging in active learning with industry 10\\. Humanitarian operations 11\\. Digital transformation 12\\. Promoting inclusivity in decision making Important Dates Submission of Abstract 31st August 2018 Notification of Acceptance of Abstract 15th September 2018 Submission of Full-paper (optional) 31st October 2018 Early-Bird Registration 31st October 2018 Late Registration 30th November 2018 Conference Registration Fee\\* https://dsiindia.org/registratration For more details, please visit https://dsiindia.org/ Email: isdsi@spjimr.org","date_start":"2018-12-27","date_end":"2018-12-30","important_dates":{"abstract":"","full":"2018-12-27","notification":"","final":""},"topics":["Education / Legal / Other","Education","Big Data Mining & Analysis"],"location":{"virtual":"","full":["Mumbai","Maharashtra","India"],"name":"","street":"","city":"Mumbai","state":"Maharashtra","ZIP":"","country":"India"},"organizers":["ISDSI, SPJIMR"],"societies":[],"indexes":[],"emails":["isdsi@spjimr.org"]}