{"name":"International Conference on London Studies \"Versions of Londonness\" I Please note: Selected papers will be published in the post-conference e-Book.","series":"","short":"","website":"http://londonstudies.lcir.co.uk","content":"International Conference on London Studies \"Versions of Londonness\" Date and location: 24 November, 2018 – London, UK Organised by: London Centre for Interdisciplinary Research Since its beginnings, London has been regarded as the epitome of progress and advancement even in times of profound crisis and discord, exerting the charm of the vast setting that concentrates most, if not all, human experiences. From ancient Londinium to the 21st-century metropolis, the ever expanding urban settlement has emerged as a complex heterogeneous entity forging a particular code of conduct governed by imagination and originality, talent and vision that generate almost endless significations of the self. The conference will explore the particular spirit of the English conurbation, one of the most influential cities in the world, aiming to identify some of the features that make up its distinctive personality. It will promote an interdisciplinary perspective on the various issues related to the process of making London into a powerful centre of social, political, economic, scientific, cultural, artistic and literary authority. The conference will also focus on the distinctive symbolism of the city and the particular states of mind generated by the interaction with the insular megalopolis, and the way in which people - Londoners either by birth or adoption, as well as temporary residents and transient visitors - translate geographically recognisable sites into culturally constructed places. Topics include but are not limited to several core issues: London ages: from prehistory to the 21st century London and the rest of Britain myths, legends and tales of the city iconic symbols and landmarks metropolitan landscapes and identity the city and its people: whose London? what is a Londoner? the language(s) of the city representations of London in the arts utopian/dystopian visions of the metropolis walking and talking in the city old and new secrets of the city love and death in London fun in London, funny London the senses of London the alternative metropolis post-Brexit London the Thames and the lost rivers of London Paper proposals up to 250 words and a brief biographical note should be sent by 15 September, 2018 to: londonstudies@lcir.co.uk. Selected papers will be published in the post-conference e-Book. Please download paper proposal form (http://londonstudies.lcir.co.uk/). Registration fee – 100 GBP Provisional conference venue: Birkbeck, University of London, Bloomsbury, London WC1E 7HX","date_start":"2018-11-24","date_end":"","important_dates":{"abstract":"","full":"2018-09-15","notification":"","final":""},"topics":["Education / Legal / Other","Other","interdisciplinary"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["londonstudies@lcir.co.uk"]}