{"name":"Management International Conference \"Managing the Global Economy\"","series":"","short":"","website":"www.mic.fm-kp.si","content":"Distinguished Colleagues, we would like to cordially invite you to participate in the Management International Conference (MIC) 2017 to be held in the Villa Fiorita, Park Hotel, Monastier di Treviso (Venice), Italy, 24 - 27 May 2017\\. The traditional conference MIC will be organized as a Joint International Conference in co-operation with five partner institutions: the University of Primorska, Faculty of Management (Slovenia), the Moscow School of Economics, Moscow State University (Russian Federation), the Juraj Dobrila University of Pula, Faculty of Economics and Tourism \"Dr. Mijo Mirković\" (Croatia), the Association for the Study of East European Economies and Cultures (USA) and the Society for the Study of Emerging Markets (USA). The conference theme is Managing the Global Economy, which will be discussed in five tracks: management, economics, finance, tourism and energy. The special feature of this year's conference is a programme track on Challenges in the Digital Economy. The conference programme features: • keynote addresses, • high-quality research paper presentations in concurrent sessions, • poster presentations, • editors' panel and exhibition of Journals, supporting the conference, • doctoral students’ workshop and other thematic workshops. Submission and Registration The paper submission process is organized in two steps: 1\\. Abstract submission before the conference starts. 2\\. Full Paper submission after the conference for MIC 2017 Conference Proceedings or special issues of journals supporting the MIC 2017\\. The submission and review process takes place online, http://srvopenconf01.fm-kp.si/. Important Dates • Abstract submission deadline: 28 February 2017 • Notification of acceptance: 10 March 2017 • Registration and Payment Deadline: 24 March 2017 (early bird); late registration: 14 April 2017 • Conference: 24 - 27 May 2017 • Full Paper submission for Journals' Special Issues: 30 June 2017 • Full Paper submission for Conference Proceedings: 15 September 2017 Conference Fee Early bird registration and payment (by 24 March 2017): • participant: 350 EUR • PhD student: 150 EUR • accompanying person: 150 EUR Late registration and payment (25 March – 14 April 2017): • participant: 400 EUR • PhD student: 200 EUR • accompanying person: 200 EUR Contact E-mail: mic@fm-kp.si Website: www.mic.fm-kp.si MIC 2017 Organising Committee","date_start":"2017-05-24","date_end":"2017-05-27","important_dates":{"abstract":"","full":"2017-02-28","notification":"","final":""},"topics":["Business","Managerial Economics","Economics & econometrics"],"location":{"virtual":"","full":["Monastier di Treviso","Venice","Italy"],"name":"","street":"","city":"Monastier di Treviso","state":"Venice","ZIP":"","country":"Italy"},"organizers":[""],"societies":[],"indexes":[],"emails":["mic@fm-kp.si"]}