{"name":"Executive Program in Hospital Management","series":"","short":"","website":"http://www.gsdhealthcare.ae/?course=executive-program-in-hospital-management","content":"The Executive program in hospital management is targeted on multiple professional profiles wherein the common denominator is the search for competencies, skills and managerial tools to understand and personally manage, coordinate or head care healthcare provider institutions or departments, units and services. The full executive program is made up of 5 modules of 3 days face-to-face training, plus workshop on-site and a final field project. At the end, SDA Bocconi School of Management provides a certificate of advanced training in hospital management. Each module can be attended separately, and attendance will be certified. The full executive program will be accredited by Dubai Health Authority. Module 1: Organization and Leadership, 27 - 29 September 2018 Module 2: Clinical Management & Operations, 15 - 17 November 2018 Module 3: Budgeting and Performance Management, 17 - 19 January 2019 Module 4: Quality, Risk Management and Audit, 7 - 9 March 2019 Module 5: Innovation and Technologies, 11 - 13 April 2019 During each module, a workshop with key note speakers from the government, the academy and the health industry will be organised. The workshops will explore breakthrough issues for each module. Workshops provide the opportunities of a close discussion with key opinion leaders and players in the market and reinforce the set-up of a professional community. The workshop will take place after classes, during the first or second day of each module. The full program will be available. To register email us on info@gsdhealthcare.ae, For more information about the academic program email us on verdiana.morando@unibocconi.it","date_start":"2019-09-27","date_end":"2019-04-13","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Public-Health","Healthcare"],"location":{"virtual":"","full":["Dubai","United Arab Emirates"],"name":"","street":"","city":"Dubai","state":"","ZIP":"","country":"United Arab Emirates"},"organizers":["GSD Healthcare"],"societies":[],"indexes":[],"emails":["info@gsdhealthcare.ae","verdiana.morando@unibocconi.it"]}