{"name":"Singapore Health & Biomedical Congress 2018","series":"","short":"","website":"http://www.shbc.com.sg","content":"The National Healthcare Group (NHG) is proud to present the 16th Edition of the Singapore Health & Biomedical Congress 2018\\. Held from 25th to 26th October 2018 at MAX Atria, Singapore Expo. The venue for 27th October 2018 will be held at Lee Kong Chian School of Medicine (Novena Campus). SHBC 2018 is the Largest Medical Congress in Singapore with an expected record 4,000 delegates! Since 2002, it has grown exponentially to become the Largest and Most Important Healthcare & Scientific Congress in Singapore. SHBC has established itself to become a must-attend vital platform for healthcare professionals, research scientists, academics, industry experts and key stakeholders to share and discuss ideas and breakthrough strategies with the ultimate goal of advancing healthcare to the next level. Every year, healthcare delegates convene from the Asia Pacific and other regions including Australia, Japan, Korea, Russia, USA, Switzerland, Netherlands & United Kingdom; adding to the ever expanding international diversity represented at SHBC. A record 3,500 delegates converged at SHBC 2017 after the major re-clustering across Singapore’s Healthcare Clusters. For the first time, SHBC expanded its programme to 2.5 days to cater to the overwhelming demand for more quality tracks. The SHBC Scientific Competition remains the most prestigious and recognised among abstract submitters, attracting about 600 submissions from all over the world. Further breaking new grounds is the increased presence of exhibitors cutting across different sectors of healthcare, offering a diverse variety of showcase not found anywhere else. Healthcare defines itself as the maintenance or improvement of health. In line with NHG’s vision, the focus is back on the primary objective of providing a patient-centric, accessible and seamless care for the patients, thus forming the SHBC 2018 theme “Back to Basics: Adding Years of Healthy Life”. By highlighting the progress and advancements in healthcare throughout the years, this year’s congress aims to invoke the potential of healthcare professionals to further improve current healthcare systems to rise to the present challenges and needs of the population. SHBC 2018 continues to be the key platform for delegates to learn, share and equip themselves with extended knowledge, to be able to provide more than just medical care for our patients. SHBC 2018 is excited to present distinguished local and overseas speakers to discuss the ‘3 Beyonds’ – ‘Beyond Quality to Value, Beyond the Hospital to the Community & Beyond Healthcare to Health’. Expert Keynote speakers from United Kingdom and Australia will share their expertise and world class knowledge on the current healthcare solutions and deliberate over the potential future solutions that seek to provide additional years of healthy life to the population. SHBC 2018 courses over three days, hosting well-received tracks such as Population Health, Mental Health, Diabetes, Preventive Medicine, Geriatric Medicine and Rehabilitation. The highly established Primary Care Forum continues to take its place as one of the most important highlights of SHBC. Adding diversity to the congress is the ever-expanding SHBC Exhibition which features renowned exhibitors from various disciplines, displaying cutting-edge products, technology and services. Delegates can look forward to being rewarded with series of surprises at the exhibition! Anticipate the Freemium sessions which will bring you informative, refreshing presentations during your breaks to top off a holistic congress experience. For more information, visit http://www.shbc.com.sg/ or contact us at SHBC\\_Secretariat@nhg.com.sg","date_start":"2018-10-25","date_end":"2018-10-27","important_dates":{"abstract":"","full":"2018-06-27","notification":"","final":""},"topics":["Medicine & Health","Public-Health","Healthcare"],"location":{"virtual":"","full":["Singapore","Singapore"],"name":"","street":"","city":"Singapore","state":"","ZIP":"","country":"Singapore"},"organizers":["National Healthcare Group"],"societies":[],"indexes":[],"emails":["_secretariat@nhg.com.sg"]}