{"name":"Advances in Materials Science and Engineering: An International Journal","series":"","short":"MSEJ","website":"http://airccse.com/msej/index.html","content":"Advances in Materials Science and Engineering: An International Journal (MSEJ) ISSN : 2394 – 0824 http://airccse.com/msej/index.html Call for papers Advances in Materials Science and Engineering: An International Journal (MSEJ) is a quarterly open access peer-reviewed journal that publishes articles which contribute new results in all areas of the Materials Science and Engineering. The journal is devoted to the publication of high quality papers on theoretical and practical aspects of Materials Science and Engineering. The goal of this journal is to bring together researchers and practitioners from academia and industry to focus on Materials Science and Engineering advancements, and establishing new collaborations in these areas. Original research papers, state-of-the-art reviews are invited for publication in all areas of Materials Science and Engineering. Topics of Interest include, but are not limited to, the following Art Conservation Science Biomaterials, tissue engineering Ceramics Composites Corrosion Diffraction studies Energy Fracture of materials Magnetic Materials Materials for Electronics and Photonics Materials Synthesis & Processing Materials Theory, Computation, and Design Mechanical properties Metals and alloys Nanomaterials, Nanoparticulates and nanocomposites Polymers Self-Assembly Solar energy Surfaces and Interfaces Paper Submission Authors are invited to submit papers for this journal through E-mail: msejjournal@yahoo.com or msejjournal@airccse.com. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this Journal. Important Dates Submission Deadline : May 12, 2018 Notification : June 12, 2018 Final Manuscript Due : June 20, 2018 Publication date : Determined by the Editor-in-Chiefin-Chief","date_start":"2018-06-20","date_end":"2018-06-22","important_dates":{"abstract":"","full":"2018-05-12","notification":"","final":""},"topics":["Engineering & Technology","Material/Nanotechnology","mechanical engineering"],"location":{"virtual":"","full":["Online Event","Australia"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Australia"},"organizers":[""],"societies":[],"indexes":[],"emails":["msejjournal@yahoo.com","msejjournal@airccse.com"]}