{"name":"MTC18Geneva International Conference on Tourism, Marketing & Hospitality","series":"","short":"","website":"http://globalbizresearch.org/Geneva_Conference_2018_july2/index.php","content":"Dear & Esteemed Colleagues, Greetings! Greetings! We are extremely pleased to welcome you to our upcoming International Conference on Marketing & Tourism (MTC18Geneva Conference) which will be held in the beautiful city of Geneva, Switzerland. Please submit your research papers/abstracts/case studies in all areas of business studies. In addition to paper presentations, you would also get an opportunity to listen to some of the best academicians as we organize invited lectures, brain-storming sessions on selected topics affecting higher education that are aligned to the conference theme and topics pertaining to Global Business, Marketing & Tourism topics. A 15% Group Discount on the ‘registration fee’ available for a group comprising three members. (Not applicable to one-day attendance). A 5% discount is applicable for those who register and complete conference fee payment on or before the deadline- April 10, 2018\\. For more details please visit: www.globalbizresearch.org E-mail: genevaconf@globalbizresearch.org Panel Discussion! It has been planned to organize a panel discussion on the following topic on day 1 of the conference. We are sure, the discussions would certainly add greater value to the academic fraternity participating at the conference. Topic:The relevance of teaching life-long learning skills to our students! Why and how??","date_start":"2018-07-09","date_end":"2018-07-11","important_dates":{"abstract":"","full":"2017-12-31","notification":"","final":""},"topics":["Business","Marketing/Social-Networking","Tourism and Hospitality"],"location":{"virtual":"","full":["Geneva","Switzerland"],"name":"","street":"","city":"Geneva","state":"","ZIP":"","country":"Switzerland"},"organizers":["SDMIMD"],"societies":[],"indexes":[],"emails":["genevaconf@globalbizresearch.org"]}