{"name":"CFP MobiQuitous 2017, Melbourne, November 6-9, 2017","series":"","short":"","website":"http://mobiquitous.org/2017/show/home","content":"CFP MobiQuitous 2017, Melbourne, November 6-9, 2017 ---- The fourteenth Annual International Conference on Mobile and Ubiquitous Systems: Computing, Networking and Services (MobiQuitous 2017) aims to provide a forum for presenting and discussing top-notch quality research. MobiQuitous 2017 fosters research collaboration through focused discussions, interaction and exchange of experiences that will designate future research efforts and open new leading directions for innovation and cutting-edge technologies. Areas addressed by the conference include the intersection of mobile and ubiquitous computing systems with social networks, Internet of things, middleware, networking, data management and services, domain-specific applications, user behaviour, models and algorithms. We solicit technical papers describing original, previously unpublished research, not currently under review by another conference or journal, pertaining to the broadly conceived Ubiquitous Systems. Contributions describing an overall working system and reporting real world deployment experiences are particularly of interest. Topics of interest include, but are not limited to, the following: · Internet of Things – Systems, Data Analytics, and Applications · Mobile User Experience · Security and Privacy · User behaviour analysis and modelling · Crowdsourcing – Platforms and Applications · Urban/mobile crowd-sensing · Participatory Sensing · Wireless Access Technologies · Performance analysis, modelling and measurement of mobile networks · Networked Sensing and Applications · Mobile Device Architectures · Mobile Systems and Applications · Mobile Data Management and Analytics · Mobile Multimedia · Mobile User Interfaces and Interaction Technologies · Toolkit and Languages for Mobile Computing · Energy Aware Mobile Computing · Mobile Cloud Computing · Semantic Web Technologies · Localization and Tracking · Social Network Applications to Mobile Computing · Context and Location-based Applications and Services. · Positioning and tracking in mobile networks · Wearable Computing · Body Area Networks · Mobile data analysis and mobile platforms PUBLICATIONS We reserve the right to exclude papers accepted but not presented from the conference proceedings submitted for archiving and indexing. All accepted papers will be published by Springer and made available through SpringerLink Digital Library, one of the world's largest scientific libraries. The proceedings are submitted for inclusion to the leading indexing services: DBLP, Google Scholar, Thomson Scientific ISI Proceedings, EI Elsevier Engineering Index, CrossRef, Scopus, as well as ICST's own EU Digital Library (EUDL). SUBMISSION Papers should be submitted through EAI 'Confy' system at Confy, and have to comply with the SPRINGER format (see Author's kit section). For more information about submission, please visit Submission section. IMPORTANT DATES Full Paper Submission deadline 30 June2017 23:59 PST Notification and Registration opens 15 August 20017 Camera-Ready deadline 15 September 2017 Workshop 7 November, 2017 Conference date 8-10 November, 2017 Please contact the TPC chair, Prof Dali Kaafar via Dali.Kaafar@data61.csiro.au","date_start":"2017-11-06","date_end":"2017-11-09","important_dates":{"abstract":"","full":"2017-06-30","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Quality Management"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":[""],"societies":[],"indexes":[],"emails":["dali.kaafar@data61.csiro.au"]}