{"name":"International Conference on Renewable Energy","series":"","short":"","website":"https://premc.org/conferences/icren-renewable-energy","content":"Research for a better future Renewable Energy forms one of the pillars for delivering global sustainable environment and the commitment to climate change targets. The renewable energy industry has matured, with huge investments being ploughed into it globally. Global new investment in renewable energy (excluding large hydro-electric projects) was around US$241.6 billion in 2016, with over 138.5GW of added renewable power capacity worldwide. This capacity is equivalent to 55% of all the generating capacity and was approximately double that in fossil fuel generation in 2016\\. International Conference on Renewable Energy series addresses research and development in renewable energy technologies including energy efficiency. It is an annual meeting planned to be held in a different countries, initially within Europe, with Asia, Middle East, Africa and Latin America being highlighted as target regions for the conference. The next in the series of the International Conference on Renewable Energy is the ICREN2019 focusing on international participation including experienced and young researchers with interest in renewable energy studies. The conference will be held at the UNESCO Headquarters in Paris, France providing an unsurpassed venue to nurture debate in this globally important area. ICREN2019 will include articles and presentation on the latest research on renewable energy technologies, grid interactions, energy efficiency, data analytics, economics and finance, environmental and social impact as well as policy and climate change implications. The program will be interactive and a great opportunity for participants to network. This edition will include 3 forums: Energy Access Forum, Energy and Cities Forum and Transitioning Supply Energy to Low Carbon as well as 3 special project events at the end of each day. Topics Renewable Energy technologies – solar, wind, wave, tidal, geothermal, bioenergy, hydropower Energy storage concepts and materials Renewable energy integrations and energy networks Innovation in energy efficiency and architecture Energy access, gender and development Economics social and environmental and policy aspects Energy and climate change Chairman Prof. AbuBakr S. Bahaj University of Southampton, UK Deadlines Early bird submission - November 21st, 2018 Early bird registration - December 21st, 2018 Regular Submission - February 15th, 2019 Regular Registration - March 15th, 2019 Conference - April 24-26, 2019","date_start":"2019-04-24","date_end":"2019-04-26","important_dates":{"abstract":"","full":"2019-02-15","notification":"","final":""},"topics":["Life Sciences","Ecology","Energy Storage"],"location":{"virtual":"","full":["Paris","France"],"name":"","street":"","city":"Paris","state":"","ZIP":"","country":"France"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}