{"name":"BIM 2019 - 3rd International Conference on Building Information Modelling (BIM) in Design, Construction and Operations","series":"","short":"","website":"https://www.wessex.ac.uk/conferences/2019/bim-2019","content":"Introduction The first International Conference on Building Information Modelling (BIM) in Design, Construction and Operations took place in Bristol, UK in 2015 and reconvened in Alicante, Spain in 2017\\. The modern construction industry and built environment disciplines have been transformed through the development of new and innovative BIM tools and techniques. These have fundamentally altered the manner in which construction teams operate; the processes through which designs are evolved; and the relationships between conceptual, detail, construction and life cycle stages. BIM is essentially value-creating collaboration throughout the entire life-cycle of an asset, underpinned by the data attached to them. BIM has far and reaching consequences on both building procurement and infrastructure. This recent emergence constitutes one of the most exciting developments in the field of the Built Environment. These advances have offered project teams multi-sensory collaborative tools and opportunities for new communication structures. The conference fulfils the vital task of bringing together experts from industry, practice and academia to debate those key topics, to develop innovative solutions, and predict future trends. The conference includes a range of presentation forums, including plenary papers, workshops, seminars, and panel sessions. Papers presented at this conference series as well as others sponsored by the Wessex Institute are permanently available to the International Scientific Community through the e-library of the Institute http://www.witpress.com/elibrary Conference Topics The following list covers some of the topics to be presented at BIM 2019\\. Papers on other subjects related to the objectives of the conference are also welcome. BIM in design coordination BIM in construction operations BIM in building operation and maintenance BIM and sustainability BIM and collaborative working and practices BIM-Facilities management integration","date_start":"2019-10-09","date_end":"2019-10-11","important_dates":{"abstract":"","full":"2019-07-01","notification":"","final":""},"topics":["Business","Information-Technology","industrial engineering & design"],"location":{"virtual":"","full":["Seville","Spain"],"name":"","street":"","city":"Seville","state":"","ZIP":"","country":"Spain"},"organizers":["Wessex Institute"],"societies":[],"indexes":[],"emails":[]}