{"name":"The 4th International Conference on Artificial Intelligence and Robots","series":"","short":"AIR 2019","website":"http://www.confjuly.org/conference/AIR2019","content":"The 4th International Conference on Artificial Intelligence and Robots (AIR 2019) Conference Date: July 19-21, 2019 Conference Venue: Guilin, China Website: http://www.confjuly.org/conference/AIR2019/ Online Registration System: http://www.confjuly.org/RegistrationSubmission/default.aspx?ConferenceID=1122 If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open access journal related to Computer and Communications Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: intelconf@163.com Tel: +86 132 6470 2250 QQ: 3025797047 WeChat: 3025797047 Conference Topics Topics: The conference is soliciting state-of-the-art research papers in the following areas of interest: Machine Learning Adaptive Control Artificial Neural Networks Bayesian Networks and Bayesian Reasoning Fuzzy Sets and Soft Computing Data Mining and Integration Information Retrieval and Fusion Intelligent Information Systems Robotics, Perception and Computer Vision Robot Sensing and Mobile Sensor Networks Human-Machine Interaction / Presence Intelligent User Interfaces Signal and Image Processing Speech and Natural Language Processing Agent and Multi-Agent Systems Cognitive Systems Knowledge Representation, Reasoning and Logic Artificial Intelligence Applications Multidisciplinary Topics and Applications","date_start":"2019-07-19","date_end":"2019-07-21","important_dates":{"abstract":"","full":"2019-06-19","notification":"","final":""},"topics":["Engineering & Technology","Electrical/ Electronic","Robotics"],"location":{"virtual":"","full":["Guilin","China"],"name":"","street":"","city":"Guilin","state":"","ZIP":"","country":"China"},"organizers":["Engineering Information Institute"],"societies":[],"indexes":[],"emails":["intelconf@163.com"]}