{"name":"Trustee Governance Training in Liverpool","series":"","short":"","website":"http://go.evvnt.com/258561-0?pid=4868","content":"The contribution of charities and other non-for-profit organisations is of crucial importance to both the economy and society. With key responsibility for governing and directing the organisation, the role of the Trustee has never been more important. Trustees play a vital role and must therefore be aware of all the obligations and challenges their duty entails. This highly practical course is especially designed to provide you with a clear understanding of good governance and the key aspects of running a charity. You will gain both the knowledge and skills necessary to ensure that your organisation complies with the law and meets its aims effectively, ultimately enhancing the delivery of the mission as well as the welfare of your beneficiaries and of your donors. On completion of this one day programme you will leave with a profound understanding of the key ethical and legal issues every not-for-profit body has to face. You will: . Be able to improve your board’s efficiency and make better strategic decisions that ensure a transparent use of resources, maximising your organisation’s contribution to the public benefit . Understand how to better manage public relations and improve your organisation’s reputation and accountability . Gain an understanding of governance standards and models that you can apply to improve the relationship with all of your stakeholders (including donors and beneficiaries) . Fully grasp the responsibilities of a trustee, including liabilities and possible conflicts of interest, and receive fresh insight on the legislation regulating charities and fundraising . Benefit from the expertise of valuable course leaders with years of experience at board level, both in the charitable sector and in the corporate world, who will use real-life examples and case scenarios to stimulate discussion Prices: Members: GBP 500.0, Non-members: GBP 600.0 URL: Inquiries: https://go.evvnt.com/258561-2?pid=4868 Venue details: Radisson Blu Hotel, Liverpool, 107 Old Hall Street, Liverpool, L3 9BD, United Kingdom Time: 9:30 am - 5:00 pm","date_start":"2018-09-14","date_end":"","important_dates":{"abstract":"","full":"2018-09-13","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Liverpool","United Kingdom"],"name":"","street":"","city":"Liverpool","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Institute of Directors"],"societies":[],"indexes":[],"emails":[]}