{"name":"11th South-Eastern European Economic Research Workshop organized by the Bank of Albania","series":"","short":"","website":"https://www.bankofalbania.org/web/pub/boa_call_for_papers_11th_see_workshop_9729_1.pdf","content":"Invitation and Call for Papers 11th South-Eastern European Economic Research Workshop Bank of Albania has the pleasure to announce its 11th SEE Economic Research Workshop, hosted on 4 and 5 December 2017 in Tirana, Albania. The workshop welcomes research papers submissions from central bankers, academic community and market practitioners to discuss the key developments in money markets, monetary policy implementation and central bank operational frameworks and to develop long-term collaborative relationships. Ten years into serving as a cooperation bridge the workshop is intended to provide a forum for discussing innovative research and to foster exchanges of views between researchers and policymakers in the region and beyond. Suggested topics We welcome theoretical and empirical contributions on topics including: • Theoretical and empirical aspects of monetary phenomena and monetary policy; • Competition, banking supervision and financial stability; • Financial market infrastructure, dynamics and uncertainty; • Coordination of macro-prudential and monetary policies; • Theoretical and empirical aspects of international trade and finance; • Exchange rate dynamics and their implications for prices and financial stability; • Economic modeling as an important aspect in the decision-making process of the central banks. Paper Submission Process: Authors are welcomed to submit extended abstracts (300 – 500 words including the title, keywords, JEL classification, authors’ names and affiliation and the email address) or, preferably, full drafts of papers and a short bio by 15 October 2017 to Dr. Altin Tanku, Director of the Research Department (atanku@bankofalbania.org) and to Drita Malutaj, Specialist in the Research Department (dmalutaj@bankofalbania.org). Submitted papers will be reviewed by a Selection Committee, which will notify you for the paper acceptance by the end of October. Final papers and the PowerPoint Presentations should be sent no later than 15 November 2017 to dmalutaj@bankofalbania.org. Workshop Schedule Information: The Workshop is expected to be structured in a number of sessions, depending on the papers submitted by participants. Papers exploring similar topics will be grouped together and presented during separate sessions. For each paper, time will be allocated to and split between the presentation of the paper by the author/s (in PowerPoint), the presentation of the respective discussion by another pre-selected researcher, and a panel discussion. Participants will be given a final schedule of the Workshop after the collection of the papers. Expenses: Please note that there is no fee of registration/participation, all expenses related to travel and accommodation are expected to be borne by the participants. Coffee breaks and two lunches will be covered by the Bank of Albania. An interesting social program will be also organized on the occasion of this event.","date_start":"2017-12-04","date_end":"2017-12-05","important_dates":{"abstract":"","full":"2017-10-15","notification":"","final":""},"topics":["Business","Economics"],"location":{"virtual":"","full":["Tirana","Albania"],"name":"","street":"","city":"Tirana","state":"","ZIP":"","country":"Albania"},"organizers":["Bank of Albania"],"societies":[],"indexes":[],"emails":["atanku@bankofalbania.org","dmalutaj@bankofalbania.org"]}