{"name":"IAPTI 5th Conference for Translators and Interpreters - Valencia","series":"","short":"SPAIN","website":"https://go.evvnt.com/246296-0?pid=4868","content":"IAPTI 2018, Another congress aimed at experienced professionals, giving practical, applicable presentations on many facets of the profession while debating current trends with some of the best translation and interpreting professionals from around the world. Meet your colleagues in a town by the beach while enjoying its great food and sights. The birthplace of \"paella\", Valencia nestles among market gardens, paddy fields and coastline to produce some of the best fresh cuisine you'll ever taste. Wander with your fellow linguists around the old Roman town and architectural gems throughout the ages until today's astounding City of Arts and Sciences. Or just wind down with a coffee on a terrace and watch the Mediterranean world go by in the pleasant climate. There are many picturesque excursions nearby, too, like the Albufera Natural Park with its wildlife and stunning sunsets over the lagoon, the wine region of Utiel-Requena, various mountain ranges and countless orange, olive and almond groves. The land made famous by the likes of Blasco Ibanez and Joanot Martorell also has many cultural sites to visit. We look forward to seeing you in Valencia this year! The IAPTI Team. URLs: Tickets: https://go.evvnt.com/246296-2?pid=4868 Facebook: https://go.evvnt.com/246296-3?pid=4868 Time: 08:00 to 19:30\\. Venue details: ADEIT Centre, Plaza Virgen de la Paz, 3 Near Plaza del Ayuntamiento and Plaza de la Reina, Valencia, 46001, Spain. Prices: IAPTI Members: EUR 240.0, Non Members: EUR 280.0, Students: EUR 220.0, Members of Partner Associations: EUR 260.0\\. Speakers: David Crystal, Emily Wilson, Xose Castro, Fernando Navarro, Ralf Lemster","date_start":"2018-09-29","date_end":"2018-09-30","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Valencia","Spain"],"name":"","street":"","city":"Valencia","state":"","ZIP":"","country":"Spain"},"organizers":["International Association of Professional Translators and Interpreters"],"societies":[],"indexes":[],"emails":[]}