{"name":"15th International Conference on Distributed Computing and Artificial Intelligence","series":"","short":"","website":"https://www.dcai-conference.net","content":"The 15th International Conference on Distributed Computing and Artificial Intelligence 2018 is an annual forum that will bring together ideas, projects, lessons, etc. associated with distributed computing and artificial intelligence, and their application in different areas. This meeting will be held in Toledo within PAAMS'18 in 20st-22rd June, 2018\\. Nowadays, most computing systems from personal laptops/computers to cluster/grid /cloud computing systems are available for parallel and distributed computing. Distributed computing performs an increasingly important role in modern signal/data processing, information fusion and electronics engineering (e.g. electronic commerce, mobile communications and wireless devices). Particularly, applying artificial intelligence in distributed environments is becoming an element of high added value and economic potential. Research on Intelligent Distributed Systems has matured during the last decade and many effective applications are now deployed. The artificial intelligence is changing our society. Its application in distributed environments, such as the Internet, electronic commerce, mobile communications, wireless devices, distributed computing, and so on is increasing and is becoming an element of high added value and economic potential, both industrial and research. These technologies are changing constantly as a result of the large research and technical effort being undertaken in both universities and businesses. The exchange of ideas between scientists and technicians from both academic and business areas is essential to facilitate the development of systems that meet the demands of today's society. The technology transfer in this field is still a challenge and for that reason this type of contributions will be specially considered in this symposium. DCAI'17 is sponsored by the IEEE Systems Man and Cybernetics Society Spain Section Chapter and the IEEE Spain Section (Technical Co-Sponsor). - MORE INFORMATION: https://www.dcai-conference.net/ -Contact: info@dcai-conference.net","date_start":"2018-06-20","date_end":"2018-06-22","important_dates":{"abstract":"","full":"2018-02-05","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Biological Engineering & bioinformatics"],"location":{"virtual":"","full":["Toledo","Spain"],"name":"","street":"","city":"Toledo","state":"","ZIP":"","country":"Spain"},"organizers":["Universtiy of Castilla-La Mancha"],"societies":[],"indexes":[],"emails":["info@dcai-conference.net"]}