{"name":"EducationInvestor Global MENA, 19 September, Dubai","series":"","short":"","website":"http://go.evvnt.com/253234-2?pid=4868","content":"With growing youth populations and a need to diversify their economies, improving education is a strategic necessity for governments across the region for securing future prosperity. Key challenges include the consistent delivery of foundational skills, how should education meet the future needs of employment and how technology can be leveraged to support traditional learning methods. EducationInvestor Global's MENA event explores the growing demand for education in the region and how different governments are engaging the private sector to help meet that demand. The event will focus attention on where investors are finding scalable investment opportunities in nurseries, K12 and higher education. Providing essential insights into the socio-economic drivers, changing politics and regulatory dynamics affecting investment in the region, the event will focus on how innovations in Edtech are opening up new solutions to improving both quality and equity. Prices: Early bird ticket: USD 395.0 Standard ticket: USD 445.0 URLs: Tickets: https://go.evvnt.com/253234-0?pid=4868 Website: https://go.evvnt.com/253234-3?pid=4868 Website: https://go.evvnt.com/253234-4?pid=4868 Speakers: Fawad Akber, Chief executive, Allied Investment Partners PJSC, Ross Barfoot, Partner, Clyde and Co, Nalini Cook Business, Development Manager for Europe, Middle East and Africa, ISC Research, Joseph Cortas, Founder and Partner, Progressia Education, Imad Ghandour,Co-founder and Managing Director, CedarBridge, Zahra Hamirani, Chief executive, Blossom Education, David Hansom, Partner, Clyde and Co, Marion Henriot, Commercial Director,Evolvence Knowledge Investments, Sheena Maerevoet, Middle East Research Consultant, ISC Research, Rosamund Marshall, Chief executive, Taaleem, Thea Myhrvold, Founder and Chief executive, TeachMeNow, Jeremy Panacheril, Partner, EY Venue details: The Address Dubai Marina, Al Marsa Street, 66, Dubai Marina, Dubai, United Arab Emirates Time: 9:00 am - 5:00 pm","date_start":"2018-09-19","date_end":"","important_dates":{"abstract":"","full":"2018-09-18","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Dubai","United Arab Emirates"],"name":"","street":"","city":"Dubai","state":"","ZIP":"","country":"United Arab Emirates"},"organizers":["EducationInvestor Global"],"societies":[],"indexes":[],"emails":[]}