{"name":"20th Pharmacovigilance 2019","series":"","short":"","website":"https://www.virtueinsight.com/pharma/20th-Pharmacovigilance-2019","content":"20th Pharmacovigilance 2019 07th November 2019, Kohinoor Continental Hotel, Mumbai, India 20th Pharmacovigilance 2019 Conference provides the strongest context, background, updates, new developments, and future direction for regulations and guidance on safety, pharmacovigilance, and risk management strategies that cannot be found in any other meeting. The content of this event is developed by top experts from the biopharmaceutical industry and global regulatory agencies, and Virtue Insight will convene the best speakers from around the world to discuss the current challenges and issues that matter most to professionals working in the field. Please contact me on KAVITHA at Email: kavitha@virtueinsight.co.in or Call: +91 44 24762472\\. SPONSORS: • Silver Sponsor: ELSEVIER Sponsor, Exhibition Stall (Booth) and a paid Speaker Slots are also available. Sponsorship opportunities available for the event give you an opportunity to sponsor/speak/exhibit, and create brand awareness. In addition, the networking opportunities in focused and relevant industry gathering provide the personal contact necessary for business development efforts. Please contact us on E-mail - kavitha@virtueinsight.co.in in Tel: +91 44 24762472 CONFERENCE DELEGATE REGISTRATION: In order to register please contact us on E-mail - kavitha@virtueinsight.co.in in Tel: +91 44 24762472 Or M: +91 9940791115 Please note that this is a PAID event and NOT A FREE event (no complimentary passes available). Any invite, email or tickets issued mentioning it as a free pass or free ticket to this event through any third party site will strictly not be accepted by the organizer and entry won’t be granted at the event. • Early Bird Discount Price (Valid until 20th September 2019) – 1 Delegate – (INR 10,000 + GST (18%) per delegate) • Standard Price (Valid From 21st September 2019) – 1 Delegate – (INR 15,000 + GST (18%) per delegate) • For Bulk Booking of More Than 5 Delegates – Please let us know your interests. KEY SPEAKERS • RUBINA BOSE, Deputy Drugs Controller(India), CDSCO (WZ) • OMPRAKASH S. SADHWANI, Former Joint Commissioner and controlling Authority, Food and Drug Administration (Maharashtra state) • DEEPA ARORA, Director, CLINEXEL Life Sciences • UJWALA NAIK, Country Head-Pharmacovigilance, Johnson & Johnson • JAMAL BAIG, Country Head- Pharmacovigilance, Merck Sharp & Dohme • NARESH TONDARE, Senior Director - National Regulatory Affairs, Biocon • SHIVANI ACHARYA, Associate Director – Clinical Development & Pharmacovigilance, Abbott • ARUN BHATT, Consultant – Clinical Research & Development • GURPREET SINGH, Global Head, Pharmacovigilance Operations, Novartis • SRIRUPA DAS, Director - Medical Affairs, Abbott • RANJIT BARSHIKAR, QbD / CGMP Consulting, Member Editorial Board Journal of Generic Medicines, England • CHIRAG TELI, Head of Medical Services, Alkem Laboratories • MANALI AGRAWAL, Head Regulatory Affairs, Bayer • DHANARAJ E, Pharmacovigilance Lead, Biocon • PRAVIN GHADGE, Head of Clinical Research Services, Reliance Life Sciences • ANANT PATIL, Asst Professor Department of Pharmacology, Dr DY Patil Medical College • SOFI JOSEPH, Head of Regulatory Affairs and Pharmacovigilance, Serdia Pharmaceuticals • JYOTSNA PATWARDHAN, Head Development QA, Novartis • PRANJAL BORDOLOI, AVP - Medical Affairs and Pharmacovigilance, Veeda Clinical Research • SAKHARAM GARALE, Head South-East Asia Operations ACMA & Managing Partner, RENOVARE Healthcare Solutions • PRASHANT BODHE, Director, CliniSearch Plus many more KEY THEMES DISCUSSED: • Pharmacovigilance and social media: An industry view • Addressing a number of technical, regulatory and ethical challenges • Traditional medicines and herbal of pharmacovigilance: Solutions and innovations • Herbal medicines uses: Developing reliable information on safety • Discussing on the global pharmacovigilance system for India • Recent development of pharmacovigilance system in India • Insure safe use of medicines and minimizing the risks related to the medicinal product • Data generated during clinical trials to provide information about the common adverse events • Pharmacovigilance: Guidance of biologics and biosimilars • Monitoring the safety of biologics and biosimilars • Pharmacovigilance Analytics: The hype of big data for pharmacovigilance • Establishing the age of big data in pharmacovigilance • Real-world example of the development of a successful risk management plan • How to write a successful risk management plan • The current regulatory framework and its global impact • Implications for the global environment • Understanding the global regulatory developments and updates • New regulatory policy, development, and review • Be part of a major networking opportunity WHO SHOULD ATTEND: Vice Presidents, Directors, CRO’s, Heads and Managers of: Pharmacovigilance Strategy, Drug Safety/Risk Management, Information and Clinical Data Management, Clinical Research, Research & Development, Product Safety/Assurance Assessment, Patient Safety & Outcomes Research & Data Analysis, Epidemiology project management, Regulatory Affairs and Compliance, Sales & Marketing, Biotech manufacturers, Pharmaceutical organizations, Generic pharmaceutical companies, Contract research organizations, Patient recruitment companies, Government- Department of health, Non-profit organizations/ Association, Consultants Get more from the event, with a broader scope bringing the whole communications value chain together. Enjoy and make the best out of our dedicated networking time, meet the leading international vendors showcasing the products of tomorrow in the co-located exhibition. Expand your knowledge of the latest business models and strategies in the high-level conference.","date_start":"2019-11-07","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal","Drug development & safety"],"location":{"virtual":"","full":["Mumbai","Maharashtra","India"],"name":"","street":"","city":"Mumbai","state":"Maharashtra","ZIP":"","country":"India"},"organizers":["Elsevier"],"societies":[],"indexes":[],"emails":["kavitha@virtueinsight.co.in"]}