{"name":"Chief Data and Analytics Officers, Financial Services | 15-16 October, London","series":"","short":"","website":"https://go.evvnt.com/482205-2?pid=4868","content":"Chief Data and Analytics Officers, Financial Services (CDAO) Europe arrives in London, 15-16 October 2019 for two days of networking and top level discussion. Whilst regulation remains a core ongoing focus for data and analytics leaders in financial services, innovative organisations are now driving the agenda for creating business value from data and analytics tools and bringing people on the journey. Chief Data and Analytics Officer Financial Services 2019 brings together Data, Analytics and Business End-User champions to focus on practical data and analytics strategies for optimising decision-making and enhancing business value. In addition, people and culture challenges around embedding data within organisations remains a number one challenge. The meeting will focus on enabling transformation across different levels of maturity, with technology as the enabler. Featuring 50 expert speakers from across the financial services industry, such as HSBC, Nomura, BAML, Societe Generale, AON, Investec and many more, CDAOI Financial Services, Europe presents a multifaceted agenda and an audience of over 100 leaders working within a range of departments generating a cross-functional collaboration. With an agenda designed with networking at the heart, 2019 will allow you to experience the unique Corinium discussion groups providing a platform to share ideas and experiences as well as enjoy content-led keynote presentations, case studies and panel discussions. URL: Tickets: https://go.evvnt.com/482205-0?pid=4868 Price: Tickets from: GBP 799.0 Time: 09:00 - 17:00","date_start":"2019-10-15","date_end":"2019-10-16","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Economics","Business and Economics"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Corinium Global Intelligence"],"societies":[],"indexes":[],"emails":[]}