{"name":"2nd Global Summit and Expo on Magnetism and Magnetic Materials","series":"","short":"GSEMMM2022","website":"https://www.thescientistt.com/magnetism-magnetic-materials/2022","content":"Dear Collegues, It is a great pleasure to announce that The Scientistt will host the 2nd Global Summit and Expo on Magnetism and Magnetic Materials (GSEMMM2022) will be held in Copenhagen, Denmark during June 13-15, 2022\\. GSEMMM2022 aims to bring together the renowned researchers, scientists and scholars to exchange ideas, to present sophisticated research works and to discuss hot topics in the field and share their experiences on all aspects of Magnetism and Magnetic Materials. The GSEMMM2022 will be a 3 days event that means to gather the key players of the Magnetism and Magnetic Materials community and related sectors. This event is launched with the aims to become an established event, attracting global participants, intent on sharing, exchanging and exploring new avenues of Magnetism and Magnetic Materials-related scientific and commercial developments. A wide-ranging scientific program consisting of plenary lectures, keynote lectures, Invited lectures, parallel sessions, as well as poster sessions for young scientists covering all topics in Magnetism and Magnetic Materials will be scheduled. This conference provides a wonderful opportunity for you to enhance your knowledge about the newest interdisciplinary approaches in Magnetism and Magnetic Materials. Moreover, the conference offers a valuable platform to create new contacts in the field of Magnetism and Magnetic Materials, by providing valuable networking time for you to meet great personnel in the field. We look forward to seeing you at GSEMMM2022 in Copenhagen, Denmark.","date_start":"2022-06-13","date_end":"2022-06-15","important_dates":{"abstract":"","full":"2022-06-13","notification":"","final":""},"topics":["Physical Science & Math","Physics"],"location":{"virtual":"","full":["Copenhagen","Denmark","Denmark"],"name":"","street":"","city":"Copenhagen","state":"Denmark","ZIP":"","country":"Denmark"},"organizers":["The Scientistt"],"societies":[],"indexes":[],"emails":[]}