{"name":"2nd International Workshop on Architectures for Future Mobile Computing and Internet of Things","series":"","short":"","website":"http://fmciot2019.lacl.fr","content":"Mobile phones and Internet of Things (IoT) devices are the top two largest categories of connected devices in 2018\\. With more than 15% compound annual growth rate, they are considered as one of today's hottest trends in both academia and industry. Both Mobile phones and IoT devices integrates different major technologies such as cloud services, big data, cloud computing, and wireless networking (Bluetooth, Wi-Fi, 5G, …) in one platform that services the end users. According to Ericcson, there will be a total of approximately 28B connected devices worldwide by 2021 fairly distributed between Mobile phones and IoT devices. Despite this rapid growth, many issues at the intersection of Mobile computing and IoT are still challenging and need to be addressed. These challenges are related to the underlying communication networks, interaction with cloud services, security, the required Quality of Service, the availability of services, integration with next generation internet technologies, and many others. The FMCIoT 2019 Workshop aims at soliciting original ideas on the broad area of Mobile and IoT architectures including challenges and opportunities, concepts, applications, and future trends that address the aforementioned challenges. The Workshop aims to facilitate discussions among academics and industry to bridge Mobile Computing and IoT practitioners and make positive contributions to the field. Topics: ======= \\* Emerging concepts of Mobile Computing and IoT \\* Design methodologies for Mobile Computing and IoT \\* Novel services and applications of IoT to facilitate environmental responsibility \\* Mobile Cloud Computing and IoT Pricing and billing models. \\* IoT and Mobile Social benefits/impact \\* Emerging IoT and Mobile Computing integration business models and process changes \\* Communication systems and network architectures for the IoT and Mobile Computing \\* Future perspective for Mobile and IoT integration: Challenges and Open Issues \\* Cloudlet based computing \\* Fog based computing \\* Lightweight authentication mechanisms in Mobile Computing and IoT architectures \\* Information-Centric Networking for Mobile and IoT \\* Software-Defined Networking for Mobile and IoT \\* Mobile Computing and IoT Quality of Service (QoS) improvements techniques. \\* Mobile and IoT architecture features and evolution. \\* Mobile Cloud Computing and IoT Networking and Communication considerations \\* Security of mobile commerce and mobile IoT \\* IoT and Data Management \\* Disaster recovery in mobile and IoT \\* Applications of Internet of things \\* Emerging applications and interaction paradigms for everyday citizens \\* Big data for Mobile and IoT \\* Cloud Computing and IoT","date_start":"2019-07-14","date_end":"2019-07-17","important_dates":{"abstract":"","full":"2019-03-15","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","IOT Internet of Things (IoT)"],"location":{"virtual":"","full":["Atlanta","United States"],"name":"","street":"","city":"Atlanta","state":"","ZIP":"","country":"United States"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}