{"name":"The 7th Combinatorics and Graph Theory Conference","series":"","short":"CGT 2022","website":"https://www.maymeeting.org/conference/CGT2022","content":"The 7th Combinatorics and Graph Theory Conference (CGT 2022) Conference Date: May 27-29, 2022 Conference Venue: Xi'an, China Website: https://www.maymeeting.org/conference/CGT2022/ Online Registration System: https://www.maymeeting.org/RegistrationSubmission/default.aspx?ConferenceID=1475 Email: wsconf5@163.com The 7th Combinatorics and Graph Theory Conference (CGT 2022) will be held in Xi'an, China, during May 27-29, 2022\\. The aim of CGT is to provide a stage for researchers, engineers, academicians as well as industrial professionals from all over the world to present their research results and development activities in Algebraic graph theory, Applications of combinatorics and graph theory, Coding theory, Combinatorial algorithms, Combinatorial designs, Combinatorial matrix theory, Combinatorial optimization, Cryptography, Enumerative combinatorics, Finite geometry, Structure graph theory, Topological graph theory, etc. CGT 2022 will be a valuable and important platform for inspiring international and interdisciplinary exchange at the forefront of Combinatorics and Graph Theory. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal，please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: wsconf5@163.com Tel: +86 132 6470 2250 (From Monday to Friday) QQ: 1349406763 WeChat: 3025797047 Official Account: Academic Communications Attendance Methods 1.Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Algebraic graph theory Applications of combinatorics and graph theory Coding theory Combinatorial algorithms Combinatorial designs Combinatorial matrix theory Combinatorial optimization Cryptography Enumerative combinatorics Finite geometry Structure graph theory Topological graph theory","date_start":"2022-05-27","date_end":"2022-05-29","important_dates":{"abstract":"","full":"2022-04-27","notification":"","final":""},"topics":["Physical Science & Math","Mathematics"],"location":{"virtual":"","full":["Xi'an","China"],"name":"","street":"","city":"Xi'an","state":"","ZIP":"","country":"China"},"organizers":["Academic Communications"],"societies":[],"indexes":[],"emails":["wsconf5@163.com"]}