{"name":"21st International Scientific GeoConference SGEM 2021","series":"","short":"","website":"www.sgem.org","content":"The International Scientific GeoConferences SGEM bring together Scientists, Researchers, Educators and Government Representatives from all over the world to present their latest research, to exchange ideas and to define the research priorities in the fields of Earth & Planetary Sciences. Our overall objective is to propose potential solutions of problems related to the global changes, to contribute to the integration of environmental consideration into the decision-making process - to ensure that present consumption will not compromise the ability of future generations to meet their own needs. The 21th International Scientific GeoConference SGEM 2021 will be held in the biggest and most modern Bulgarian sea-side resort and SPA Albena Complex, near Varna city, Bulgaria, in brand new 5 star, hi-tech Congress Centre MARITIM PARADISE BLUE. All accepted, after peer review papers, are published in the Conference Proceedings (ISSN 1314-2704) and yearly are submitted for evaluation and indexation by ISI Web of Science - Clarivate, ELSEVIER products - SCOPUS, Mendeley and COMPENDEX, CrossRef, SPRINGER Nature, EBSCO, ProQuest, RSCI (Russian eLibrary - РИНЦ), Google Scholar, CiteULike, British Library and many others. All the accepted papers receive a unique DOI number, needed for recognition in the International databases. The 21th International Multidisciplinary Scientific GeoConference SGEM 2021 is a conference and exhibition dedicated to solutions and innovations in 28 different scientific fields. The SGEM Scientific Committee has a strong commitment of providing opportunities for conference participants to exchange knowledge and ideas, communicate and learn from each other. The conference programme combines number of sessions and events that are designed specifically to promote interactions among the on-site members of the knowledge geo-community. These range from more formal Oral and Poster sessions, through parallel Invited Session presentations and Workshop discussions, to informal coffee breaks and optional social activities.","date_start":"2021-08-14","date_end":"2021-08-22","important_dates":{"abstract":"","full":"2021-07-05","notification":"","final":""},"topics":["Physical Science & Math","Geology","geology"],"location":{"virtual":"","full":["Albena","Bulgaria"],"name":"","street":"","city":"Albena","state":"","ZIP":"","country":"Bulgaria"},"organizers":["SWS Scholarly society"],"societies":[],"indexes":[],"emails":[]}