{"name":"Workshop: Urbanism on Screen","series":"","short":"","website":"https://urbanstudies.lcir.co.uk/workshop","content":"Cinema has had its focus set on the city ever since the former's inception. Twentieth century witnessed probably the most radical transformation of urban form, and it was film that came in as the prime medium of inscription, dissemination and reflection on urbanity. Still, a strictly historical concept of the city, viewed as an amassing of layered pasts, is a relatively new invention, introduced in the post-war years by memory studies and heritage preservation discourse. Nevertheless, even before the Venice Charter (1964) a number of film directors eagerly commented on the modern politics of amnesia. Their historical vantage point on urban metamorphoses will be the central theme of this workshop. We will inspect filmic cityscapes through the lenses of architectural and urban manifestos and critical writings of Aldo Rossi, Manfredo Tafuri, Anthony Vidler, Colin Rowe and Fred Koetter, Oswald Mathias Ungers, Rem Koolhaas, alongside other key figures in the 20th century's theories of built space. Their writings and daring proposals reframe the city as a historical collage, a montage of sites, an archipelago, let alone a touristic simulacrum composed out of brick and images. By means of a series of case studies of films such as Lisbon Story (1994, Wim Wenders), The Belly of an Architect (1987, Peter Greenaway), Run, Lola! Run! (1998, Tom Tykwer), Short Cuts (1993, Robert Altman), The Great Beauty (2013, Paolo Sorrentino), we will analyse cinematographic strategies employed when portraying cities, and reproducing not only metropolitan aesthetics but also the “post-modern” fragmentality, intensity, and mediatization of the urban landscape. The workshop is designed for students and researchers exploring subjects related to urban studies and architectural theory, who are interested in borderline areas of the discourse on spatiality, where the domain overlaps with art, cultural studies, and the fields of film and new media. All the registered participants who will attend the workshop will receive certificates. In order to book a place, please register on http://registration.lcir.co.uk by 10 December 2020\\. Registration fee is 45 GBP Contact email: workshops@lcir.co.uk","date_start":"2021-01-24","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Arts & Humanities","Other","Film & Cinema"],"location":{"virtual":"","full":["Online Event","United Kingdom"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research and Academic LAB"],"societies":[],"indexes":[],"emails":["workshops@lcir.co.uk"]}