{"name":"4th Annual Gender and Sexuality Studies Conference","series":"","short":"","website":"http://www.uco.edu/thecenter","content":"The Women's Research Center and BGLTQ+ Student Center at the University of Central Oklahoma invite proposals for presentations at the Fourth Annual International Gender and Sexuality Studies Conference. The IGSS conference will be held on October 3-5, 2019 at the Nigh University Center at the University of Central Oklahoma. This international interdisciplinary conference welcomes proposals for presentations in a variety of formats that address issues of gender and sexuality in the social sciences, humanities, fine arts, and STEM fields. We invite students, faculty, staff, scholars, and activists to propose papers, panels, roundtable discussions, and poster presentations. We also welcome proposals to present or perform creative work including creative writing, drama, music, and visual art. Instructions for Submission: Workshop, panel and round table discussion submission guidelines: 1\\. Initial submissions should include a 350-word abstract. 2\\. Include what format you would like to present your work: paper presentation, round table, poster, full panel. 3\\. You may submit your abstract in Word or PDF format. 4\\. If the Center has questions on the proposal, we will reach out to you via email. 5\\. Be sure to include your name, affiliation, phone number, and email address in your document. Creative art submission guidelines: 1\\. Creative art includes art displays, writing, drama, music and visual arts. If your work falls into one of the above categories, you are required to submit a 350-word description of your creative artwork. 2\\. If the Center has questions on the proposal, we will reach out to you via email. 3\\. You may submit your abstract in Word or PDF format. 4\\. Include your name, affiliation, phone number, and email address in your document. Abstracts should be submitted to thecenteratuco@gmail.com The deadline to submit your abstract for consideration is Friday, May 10, 2019, before 11:59PM. For more questions, please reach out to Dr. Lindsey Churchill, Director of the Women’s Research Center and the BGLTQ+ Student Center at lchurchill@uco.edu.","date_start":"2019-10-03","date_end":"2019-10-05","important_dates":{"abstract":"","full":"2019-05-10","notification":"","final":""},"topics":["Social Sciences","Gender/Sexuality","gender studies (and womens)"],"location":{"virtual":"","full":["Edmond","Oklahoma","United States"],"name":"","street":"","city":"Edmond","state":"Oklahoma","ZIP":"","country":"United States"},"organizers":["The Women's Research and BGLTQ+ Student Center"],"societies":[],"indexes":[],"emails":["thecenteratuco@gmail.com","lchurchill@uco.edu"]}