{"name":"Globalization and Gender Implications","series":"","short":"","website":"https://glocalismjournal.org/cfp-2019-3-globalization-and-gender-implications","content":"The long-term effects of contemporary globalization on gender identities and gender relations are becoming increasingly apparent. Their significance for the social sciences is clear and most of the recent research on gender transformations analyzes them as a linear consequence of the modernity revolution, without an effective evaluation of the contradictory impact of globalization on the gender factor. All the different representations of gender relations in economic processes, as in political decisions or in cultural and social assets, seem to underestimate the positive and negative implications of the global flows of news, values, goods, persons and technologies. The collapse of the nation-state and of its power structures has enabled new (inter)national actors that have not necessarily changed the previous gender model of recognition of rights and of access to strategic positions. The defense of the inherited system of dominance and the fear of a new gender balance have naturalized – and universalized – the female role in the private sphere, even recognizing the fluidity of any demarcation between public and private spheres. In the global dimension, the power actors are increasingly movements and groups and less individuals, damaging women when collective issues are not in favor of their rights. The growing independence that the post Fordist economy facilitates is not enough to achieve a shared agreement on weaker gender identities (women and LGBT+) issues, starting from their persistent risk of social exclusion. In this case, the assumption of profit as the main goal could favor the professional profiles of highly educated women (seen in female high-level workers in new brand professional profiles), but also emphasize their subordinated position as underemployed, unemployed or objects of transnational legal and illegal traffics. It is possible to argue that as a result of advanced globalization, the implications for gender relations are twofold and intertwined. Gender is still considered a crucial factor for enforcing those power structures that try to adapt themselves to the current cultural changes, in the Global North as in the Global South, in the economic and political structures (lack of female leadership, gender pay gap, work-life balance, exploitation, unemployment), in cultural and social representations (violence against women; restoration of traditional family structures, gender equality as a development sustainable goal). In the meantime, gender seems to misplace its meaning among the young (due to their socialization in an apparently more balanced society), because of those power structures that neutralize each attempt for a cultural recognition of social diversity. These are the emerging issues for social scientists, who could face them by searching for more adequate methodological tools","date_start":"2019-09-30","date_end":"","important_dates":{"abstract":"","full":"2019-09-30","notification":"","final":""},"topics":["Social Sciences","Gender/Sexuality","gender studies (and womens)"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["Glocalism. Journal of Culutre, Politics and Innovation"],"societies":[],"indexes":[],"emails":[]}