{"name":"8th International Conference on e-Democracy: Safeguarding Democracy and Human Rights in the Digital Age","series":"","short":"","website":"www.edemocracy2019.eu","content":"The ever-evolving digital age is becoming more intelligent and the future internet is shaping up. Technologies supporting the digital transformation, such as artificial intelligence, the internet of things, blockchain technologies, and robotics are developing in unprecedented rhythms. A new digital environment emerges, promising a lot, but also raising concerns about democracy itself and individual rights and freedoms. The relatively recent Cambridge Analytica scandal has profoundly influenced public opinion and -as written by many- has changed the world and the way citizens see their digital future. The effects of fake news and targeted political campaigns enabled by data misuse on democratic processes raise serious concerns. There are also fears of affecting the outcome of a democratic election itself. Moreover, the rapid development of technologies supporting the digital transformation, which is largely driven by significant economic benefits, raises concerns about the impact on privacy and, in general, on individual rights and freedoms. How can we safeguard our democracy against such threats? How can we create an intelligent digital world while ensuring individual rights and freedoms? Will our future digital world be privacy-friendly and secure to withstand attacks and malicious activities? Which ethical principles should govern the evolution of our digital future? Will this fast moving and intelligent digital world be trustworthy and embraced by the citizens? These are the questions and the focus of the 8th occasion of the International Conference on e-Democracy that will be held in Athens, the cradle of democracy, on 12-13 December 2019\\. The conference is organized by the Scientific Council for the Information Society, in co-operation with the Hellenic Data Protection Authority and a number of European and Greek Universities, Academia and Research. It is intended, as in previous occasions, to provide a forum for presenting and debating the latest developments in the field, from a technical, political, legal, and regulatory point of view. The conference will include keynote addresses, tutorials, panels, Ph.D. colloquia and sessions, workshops, special, regular, and poster sessions. All submitted papers to the conference will be peer reviewed acceptance will be based on quality, relevance, and originality. The topics of interest include, but are not limited to, the following: e-Democracy and e-Participation o e-Campaigning, e-Politics o Tools for supporting freedom of expression, opinion, assembly and association o e-Justice o e-Voting o Supporting children’s rights online o Information and Consultation Platforms o Collaborative working environments for e-Democracy o Social computing and e-Democracy o Citizen-sourcing and Policy Informatics o Citizen centered applications o Transparency in online applications o Protection against disinformation Security, Data Protection, Privacy, and Trust o Security, Privacy, and Trust in Online Social Networks o Applied Cryptography o Risk Analysis and Management o Software and System Security o Blockchain Technology and its applications o Cloud Computing Security and Privacy o Identity Management, Identity Theft, and Trust and Reputation Management o Artificial Intelligence for Security and Data Protection o Security and Privacy Audit, Risk and Governance o Security and Data Protection Education o Human aspects of security o Authentication technologies o Privacy by Design and Default Methodologies o Privacy Impact Assessment Methodologies o Privacy Enhancing Technologies o Measuring and Quantifying Privacy o Privacy Modelling and Analysis o Privacy-preserving Computing o Differential Privacy Social, legal and ethical issues o Transparency and Accountability in Data Protection o Ethics in Digital Societies o Surveillance Technologies and Legal Implications o Freedom of Information and Expression, and Privacy o Social factors of collaborative creativity o Anonymity vs accountability o Ethical principles of AI Systems o Ethics in Robotics e-Crime, e-Fraud and Digital Forensics o Cyber Crime Detection and Prevention o Internet Fraud, Cyber War o Computer Forensics and Anti-forensics Important Dates Full paper submission deadline: 18 August 2019 Notification of decision: 14 September 2019 Camera-ready deadline: 22 September 2019 Instructions for Authors Submitted papers must not substantially overlap with papers that have been published or that have been submitted to a journal or a conference with proceedings. The conference proceedings will be published in the Springer Communications in Computer and Information Science series, (https://www.springer.com/series/7899). Papers should be at most 15 pages long, including the bibliography and well-marked appendices, and should follow the LNCS style (https://www.springer.com/gp/computer-science/lncs/conference-proceedings-guidelines). Paper Submission Submissions are to be made to the submission web site at https://easychair.org/conferences/?conf=edemocracy2019\\. Submissions not meeting these guidelines risk rejection without consideration of their merits. Papers must be received by the deadline of 18th August 2019 (11:59 p.m. American Samoa time). Authors of accepted papers must guarantee that their papers will be presented at the conference. Furthermore, it is planned, as previously, to invite the authors of selected accepted papers in order to extend their work for further publication in the Emerald journal Information and Computer Security (http://www.emeraldinsight.com/journal/ics#) and to participate (after the necessary enhancements) to the evaluation process for inclusion in a special issue of the International Journal of Electronic Governance (http://www.inderscience.com/jhome.php?jcode=ijeg) The authors of accepted papers must guarantee that their papers will be presented at the conference.","date_start":"2019-12-12","date_end":"2019-12-13","important_dates":{"abstract":"","full":"2019-08-18","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science","Blockchain technology"],"location":{"virtual":"","full":["Athens","Greece"],"name":"","street":"","city":"Athens","state":"","ZIP":"","country":"Greece"},"organizers":["Scientific Council for the Information Society"],"societies":[],"indexes":[],"emails":[]}