{"name":"The 5th Int'l Pediatrics Conference","series":"","short":"IPC 2022","website":"https://www.janconf.org/conference/IPC2022","content":"The 5th Int'l Pediatrics Conference (IPC 2022) Website：http://www.janconf.org/conference/IPC2022/ Date：December 16-18, 2022 Venue：Sanya, China Online Registration Entrance：http://www.janconf.org/RegistrationSubmission/default.aspx?ConferenceID=1556 The 5th Int'l Pediatrics Conference (IPC 2022) will be held from December 16-18, 2022 in Sanya, China. This Conference will cover issues on Pediatrics. It dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods. Attendance Methods 1\\. Full Paper submission Submit full paper ( Regular Attendance + Paper Publication + Presentation ) You are invited to submit papers and participate in our academic exchange. One author will be invited to make an oral presentation and the paper will be published by peer-reviewed open access journal and submitted to CNKI and Google Scholar for indexing. 2.Abstract submission Submit abstract ( Regular Attendance + Abstract + Presentation ) You are welcome to submit abstract for oral presentation or poster presentation. 3.Regular Attendance ( No Submission Required ) You're also welcome to attend our conference (without submitting full paper or abstract) Publication and Presentation Publication: All the accepted papers will be published by a peer-reviewed open access journal that can ensure the widest dissemination of your published work Index: CNKI and Google Scholar Note: 1\\. If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract. 2\\. The simple Abstract submission should include the title, contents, keywords, authors names, affiliations and emails. The length is suggested to be controlled within 1 page and no more than 2 pages. 3\\. You will receive the review results within 3-5 working days after submission. If you do not get any notification within the time limit, please contact us as soon as possible. Contact Us Email: workshop1@126.com (workshop\\_editor@hotmail.com) Tel: +86 132 6470 2250 QQ: 1349406763 WeChat: 3025797047 Official Account: Academic Communications Call For Papers Topics: The conference is soliciting state-of-the-art research papers in the following areas of interest: General Pediatrics Pediatric Obesity Pediatric Oncology Pediatric Cardiology Pediatric Dermatology Pediatric Breast Feeding Pediatric Nephrology Pediatric Ophthalmology Syncope- treatment and management Congenital heart diseases and pulmonary stenosis Congenital or acquired immune deficiencies Vaccination and complications Nursing and care for pediatric Child Abuse and Neglect Pediatric Vaccines Other Related Topics","date_start":"2022-12-16","date_end":"2022-12-18","important_dates":{"abstract":"","full":"2022-12-08","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Sanya","China"],"name":"","street":"","city":"Sanya","state":"","ZIP":"","country":"China"},"organizers":["Academic Communications"],"societies":[],"indexes":[],"emails":["workshop1@126.com","_editor@hotmail.com"]}