{"name":"“From Stabat Mater to Mater Movens: Analysing Discourses on Motherhood” International Conference","series":"","short":"","website":"https://genderstudies.lcir.co.uk/discourses-on-motherhood-conference","content":"This conference aims at exploring motherhood and its diverse cultural representations, while interrogating the ways in which such representations impact on individual and collective experiences of motherhood. Thus, we attempt at examining motherhood both as a personal experience and as an institution, as well as observing the nuances involved in the interaction between both. The conference seeks to encourage dialogue around cultural concepts of motherhood by observing the cultural roles that are given to maternal figures, the perspectives from which this experience is approached, and how these engage in dialogue with other current discourses such as politics, law and medicine. By questioning traditional mother roles, challenging the myths and taboos associated with the reproductive body, and establishing dialogues with the personal and communal experience of motherhood, we hope to inspire more open and realistic discourses around a figure that is not only fundamental in our life experience but also constitutes one of the basic pillars that sustain our societies. We invite papers on (but by no means limited to) the following areas: Representations of motherhood in literature, cinema and TV Mother as a Myth: motherhood in art and philosophy Motherhood and law The mother’s body and the body politic: the political instrumentalisation of motherhood Motherhood and medicine: medicalising and pathologising women’s bodies Surrogate motherhood and alternative forms of parenting Motherhood and gender roles Mothers under patriarchy: motherhood and ideology The cons of motherhood: delaying, regretting or rejecting motherhood The conference is addressed to academics, researchers and professionals who are interested in the conference topic. Proposals up to 250 words accompanied by a brief biographical note should be sent to: motherhood@lcir.co.uk. Please download the paper proposal form on our website: https://genderstudies.lcir.co.uk/discourses-on-motherhood-conference. Selected papers will be published in a post-conference volume with ISBN.","date_start":"2022-07-09","date_end":"2022-07-10","important_dates":{"abstract":"","full":"2022-04-30","notification":"","final":""},"topics":["Social Sciences","Gender/Sexuality","gender studies (and womens)"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["motherhood@lcir.co.uk"]}