{"name":"Good Documentation Guideline (Chapter <1029> USP)","series":"","short":"","website":"https://www.complianceonline.com/good-documentation-guideline-chapter-1029-usp-webinar-training-705130-prdw?channel=Brownwalker","content":"This webinar will familiarize participants with USP Chapter <1029> on good documentation guidelines. This session will wrap up the general concept and will provide information as to what needs to be documented in certain records. Why Should You Attend: Good Documentation Practices (GDP) is a critical and essential part of a regulated environment (pharmaceutical and medical device manufacturing, R&D, laboratories and clinical trials). Compliance with GDP ensures an auditable account of work. It ensures integrity and control of documents and is a key requirement for a developed quality system. This training session will cover the US Pharmacopeia General Chapter <1029> and all aspects of GDP including practices for writing and correcting documentation. This webinar will familiarize participants with USP Chapter <1029> on good documentation guidelines. This session will wrap up the general concept and will provide information as to what needs to be documented in certain records. Areas Covered in the Webinar: US Pharmacopeia General Chapter <1029>: History of the chapter as to how and why it was created Purpose of development of this chapter Chapter outline: Principles of Good Documentation Data collection & recording Different types of GMP Documents: Laboratory records Equipment-related documentation Who Will Benefit: GDP's are meant for use in the production and control of Active pharmaceutical ingredients (APIs), Medical devices, Excipients, Pharmaceutical products, Labs, Dietary supplements and Food ingredients. The following titles will benefit: Regulatory Compliance Audit Quality R&D Scientists Documentation and Validation Clinical Research Lab Managers","date_start":"2022-02-15","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Mental-Health"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}