{"name":"CURRENT TRENDS ISSUES AND CHALLENGES IN DIVERSE SOCIETIES","series":"","short":"CTICDS 2022","website":"https://culturesconference97.webnode.com","content":"CURRENT TRENDS, ISSUES AND CHALLENGES IN DIVERSE SOCIETIES 2-DAYS VIRTUAL CONFERENCE, 6-7 MAY, 2022 Since its foundation in 2017, the Cultures Conference has acted as a learning platform for academic and educational institutions, research centres, institutes, organisations and industry, enabling presentation, discussion and education on key issues, trends and recent developments in the social sciences, humanities, arts, education, business and management fields. Scholars, researchers, practitioners, consultants, trainers, professionals and policy makers from across the world are invited to share their expertise, research results, innovative ideas, solutions and valuable experience. The conference is an opportunity for attendees to establish academic and business relations and find global partners for future collaboration. CONFERENCE TOPICS CTICDS 2022 encourages interdisciplinary and multidisciplinary research, and theoretical and empirical papers! Topics of interest include, but are not limited to, the following areas: IDENTITY AND CULTURE INTERCULTURALISM AND MULTICULTURALISM LANGUAGE AND EDUCATION GENDER AND SOCIETY NGOs AND HUMANITARIAN AID SOCIAL ENTERPRISE AND ENTREPRENEURSHIP ORGANISATIONAL DIVERSITY INTERCULTURAL BUSINESS INTERNATIONAL BUSINESS PUBLICATION OPPORTUNITY Extended papers are being invited for review and potential publication in an edited book/Scopus Indexed. More information is coming soon! PRESENTATION MODES ORAL PRESENTATION: Specific allocated time will be given to presenters and additional minutes will be added for Q&A (questions and answers), which will be moderated by the session chair. The required technical equipment will be provided for PowerPoint presentations. WORKSHOP: You are welcome to organise a workshop relevant to the theme of the conference if you prefer to give your audience a first-hand learning experience. PANEL DISCUSSION: Suggested topic \"Global impact of the Coronovarius COVID-19\".","date_start":"2022-05-06","date_end":"2022-05-07","important_dates":{"abstract":"","full":"2022-04-10","notification":"","final":""},"topics":["Social Sciences","Anthropology / Archaeology","entrepreneurship"],"location":{"virtual":"","full":["Online Event","Greece"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Greece"},"organizers":["Cultures Conference"],"societies":[],"indexes":[],"emails":[]}