{"name":"5th International Conference on Advanced Research in e-Learning","series":"","short":"","website":"https://www.icate.org/e-learning-conference","content":"Learn about the most recent scientific trends, connect better with peers, find new professional development and networking opportunities, explore one of the most beautiful cities in the world on a free guided tour, and find collaborators for your next research projects at ICATE e learning conference in Paris from 8th to 10th of April 2022! Furthermore, learning about various challenging topics within the fields of eLearning, online learning, distance learning, MOOCs, and open learning are at the core of the ICATE eLearning conference. Hurry up and sign up to join the best e-learning conferences. All accepted papers will be published with ISBN Number in a soft form & all full papers sent for conference proceedings will be accepted through a double-blind review process and will be published electronically in proceedings with a DOI number. All papers have publication opportunities in various indexed international journals: SCOPUS, DOAJ, EBSCO, GOOGLE SCHOLAR, COPERNICUS, and many more. The 5th International Conference on Advanced Research in e-Learning will return as an in-person event in Paris this April & also include the live-stream Virtual component for those who cannot join physically but wish to learn, connect, and network. Delegates can attend & present their papers either in person or online from wherever they are in the world. An Invitation Letter will be issued and sent after registration and payment of the registration fee. We look forward to welcoming you to the historical city of Paris at Centre International de Conférences Sorbonne Universités (CICSU)!","date_start":"2022-04-08","date_end":"2022-04-10","important_dates":{"abstract":"","full":"2022-03-25","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education, teaching"],"location":{"virtual":"","full":["Paris","France"],"name":"","street":"","city":"Paris","state":"","ZIP":"","country":"France"},"organizers":["Global knowledge sharing (GlobalKS)"],"societies":[],"indexes":[],"emails":[]}