{"name":"CGMP controlled Raw Materials","series":"","short":"","website":"https://www.complianceonline.com/qualification-of-cgmp-controlled-raw-materials-webinar-training-705148-prdw?channel=Brownwalker","content":"This webinar will help the attendee gain an understanding of the appropriate way to design the processing of all cGMP Controlled raw materials that are used for the manufacturing of drug product. The scope of this webinar applies to all cGMP controlled raw materials that are received, requiring testing, release and issuance of specifications. It also applies to the processing of changes and retiring of previously issued controlled raw materials specification within the product manufacturing process. cGMP Raw materials that are used for product manufacturing has to be released for use in the production process. Guidance will be given as to the steps that every drug product manufacturer should follow in order to process all incoming cGMP controlled raw materials which includes the release for use in the manufacturing of products. Why Should You Attend: cGMP raw materials are the most critical ingredient of any product manufacturing step hence they must be controlled as stipulated in 21 CFR 110.80 Processes and Controls as well as applicable FDA regulations. Some manufacturers of drug products have received FDA 483’s and lost several batches of product due to lack of a defined raw material processing that showed acceptability through qualification tests, traceability, consistency and control of the incoming raw materials. Raw material control is therefore a very critical part that ensures drug product quality, purity and potency. Drug product manufacturers must have a clear understanding in preventing loss of expensively manufactured drug product because of the use of an adulterated raw material through a defined procedure that clearly shows how raw materials are received, stored, labeled, quarantined, tested, qualified, tracked, used, and discarded at the end of expiry. This webinar will provide such guidance as to the process of ensuring that there all the steps are followed to avoid producing an adulterated product as defined by the 21 CFR 110.80 Processes and Controls. This webinar will provide a great resource to Pharmaceutical, Biotechnology and Medical Device Industries personnel that will like to have a clear understanding of the Designing the Receipt, Handling and Processing, Specification, Inventory Tracking, and Qualification of a cGMP Controlled Raw Materials. Areas Covered in the Webinar: Regulatory Requirements for all Incoming cGMP Controlled Raw Materials: What does the regulation say about raw materials that are received for cGMP use Receipt and Storage of cGMP Controlled Raw Materials Delineation of Raw Materials Critical Non-critical Acceptable Storage of cGMP Controlled Raw Materials Control of Conditions (Temperature and Humidity Control) Control of Location (Lock and Key) Quarantine, Segregation and Labeling Requirements Testing and Qualification Approval and Release for use Disposition and Release for Use Requirements Dispensing and Traceability (Tracking) Who Will Benefit: This topic applies to personnel/companies in the Pharmaceutical, Biotechnology and Medical Device Industries. The employees who will benefit most include: Quality Control Analysts and Management Senior Management Manufacturing Associates and Management Shipping, Receiving, Warehouse Personnel and Management Raw Material Receipt and Testing Personnel Quality Assurance Analyst and Management Quality Engineering Personnel and Management","date_start":"2021-11-16","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}