{"name":"The 3rd International Workshop on Cyberspace Security","series":"","short":"","website":"http://isci-conf.org/IWCSS2019","content":"\\======================= IWCSS 2019 ======================= The 3rd International Workshop on Cyberspace Security (IWCSS 2019) November 12-15, 2019, Guangzhou, China http://isci-conf.org/IWCSS2019/ In Conjunction with ======================= iSCI 2019 ======================= The 7th International Conference on Smart City and Informatization (iSCI 2019) November 12-15, 2019, Guangzhou, China http://isci-conf.org/iSCI2019/ ------------------------------------------------------------------------------------------------------------ Cyberspace Security With the advancement of \"Internet plus\" on all fronts, many traditional industries gradually step into a great era of digitization, cyberization, mobilization and intellectualization. However, the explosive growth of data and information in those processes brings serious challenges to cyberspace security. Meanwhile, the emergence of innovative network computing paradigms, such as cloud computing, IoT (Internet of Things), big data, mobile and wireless networks, lead to a lot of information security issues, which are neglected, unknown, or unable to handle for existing security solutions. Cyberspace has become the fifth national sovereign space besides the traditional four domains of land, sea, air, and aerospace. Cyberspace has become a new battlefield of security among nations. IWCSS 2019 topics include, but are not limited to the following: Cyberspace Trust Cyberspace Security Cyberspace Privacy Cyberspace Safety Cyberspace Anonymity Cyberspace Fault Tolerance Cyberspace Reliability Cyberspace Dependability Cyberspace Availability IMPORTANT DATES Paper Submission Deadline: June 15, 2019 Author Notification: August 15, 2019 Camera-Ready Paper Due: September 15, 2019 Conference Dates: November 12-15, 2019 PAPER SUBMISSION All papers need to be submitted electronically through the conference website (https://easychair.org/conferences/?conf=iwcss2019) with PDF format. Submitted papers must not substantially overlap with papers that have been published or that are simultaneously submitted to a journal or a conference with proceedings. Papers must be clearly presented in English, must not exceed 12 pages in Springer LNCS format (or up to 16 pages with the pages over length charge), including tables, figures, references and appendices. Papers will be selected based on their originality, significance, relevance, and clarity of presentation assessed by at least three reviewers. Submission of a paper should be regarded as a commitment that, should the paper be accepted, at least one of the authors will register and attend the conference to present the work. PAPER PUBLICATION All accepted papers will be published by Springer LNCS (EI Indexed). IWCSS 2019 reserves the right to exclude a paper from distribution after the conference (e.g., removal from the digital library and indexing services), if the paper is not presented at the conference. All accepted papers will be published by Springer LNCS (EI Indexed). One outstanding paper will be selected to receive the Best Paper Award. General Chairs J. Christopher Westland, University of Illinois (Chicago), USA Hai Jiang, Arkansas State University, USA Aniello Castiglione, University of Salerno, Italy Program Chairs Valentina Emilia Balas, \"Aurel Vlaicu\" University of Arad, Romania Fengwei Zhang, Wayne State University, USA Wenjun Jiang, Hunan University, China Local Organizing Committee Chair Guojun Wang, Guangzhou University, China Publicity Chairs Reza Meimandi Parizi, Kennesaw State University, USA George Grispos, University of Nebraska Omaha, USA Karim Alinani, Hunan University of Science and Technology, China Publication Chairs Tao Peng, Guangzhou University, China Fang Qi, Central South University, China Registration Chairs Xiaofei Xing, Guangzhou University, China Pin Liu, Central South University, China Conference Secretariat Wenyin Yang, Foshan University, China Webmasters Tianji Xu, Central South University, China Junyu Ma, Guangzhou University, China Steering Committee Guojun Wang, Guangzhou University, China (Chair) Kim-Kwang Raymond Choo, University of Texas at San Antonio, USA (Chair) Han-Chieh Chao, National Dong Hwa University, Taiwan Hsiao-Hwa Chen, National Cheng Kung University, Taiwan Robert Deng, Singapore Management University, Singapore Sy-Yen Kuo, National Taiwan University, Taiwan Xuejia Lai, Shanghai Jiao Tong University, China Zhaojun Li, Beihang University, China Rongxing Lu, University of New Brunswick, Canada Daniel Mosse, University of Pittsburgh, USA David Naccache, ENS Paris, France Li Weigang, University of Brasilia, Brazil Bebo White, SLAC Stanford University, USA Yang Xiang, Swinburne University of Technology, Australia Zheng Yan, Xidian University, China and Aalto University, Finland Shui Yu, University of Technology Sydney (UTS), Australia Deqing Zou, Huazhong University of Science and Technology, China SPECIAL ISSUES Distinguished papers, after further revisions, will be published in 11+ SCI & EI indexed special issues\\*. Special issues will be shared by co-located conferences (iSCI 2019 and DependSys 2019) and associated symposiums, workshops and special sessions (AEIT, IWCSS, Blockchain, INSERT-IoT, FogCom, etc): (1) IEEE Internet of Things Journal (SCI & EI Indexed, Impact Factor: 5.863) (Pending) http://ieee-iotj.org/ (2) IEEE Access (","date_start":"2019-11-12","date_end":"2019-11-15","important_dates":{"abstract":"","full":"2019-06-15","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Cybersecurity & digital forensics"],"location":{"virtual":"","full":["Guangzhou","China"],"name":"","street":"","city":"Guangzhou","state":"","ZIP":"","country":"China"},"organizers":["Guangzhou University"],"societies":[],"indexes":[],"emails":[]}