{"name":"2nd International Conference on Numerical Modelling in Engineering","series":"","short":"","website":"http://www.nmeconf.org/index.html","content":"The 2nd International Conference on Numerical Modelling in Engineering will be held from August 19 to 22 in Beijing, China, which is sponsored by Ghent University, Nanjing Tech University, Ton Duc Thang University and Duy Tan University. The conference is aimed at bringing together international scientists and engineers in academia and industry in fields related to advanced numerical techniques, such as FEM, BEM, IGA, etc., and their applications to a wide range of engineering disciplines. ★ Publication and Indexing All accepted and registered papers will be included in IOP Conference Series: Materials Science and Engineering,which will be indexed by EI Compendex, Scopus, etc. ★ Topics of interest for submission include, but are not limited to: Civil Engineering: Bridges and Dams Cyclic Loading Fluid Dynamics Structural Mechanics Electrical Engineering: Electromagnetic Analysis Thick Conductors Thin Conductors Ferromagnetic Materials Mechanical Engineering: Aerospace Applications Acoustic Analysis Biomechanical Applications Contact Problems and Wear Materials Science and Engineering Composite Materials Polymers Metal Alloys Fracture Mechanics Fatigue of Materials More topics can be found at http://www.nmeconf.org/Topics.html ★ Paper Submission 1\\. Submit original technical papers via Submission System 2\\. Submit original technical papers via email nme@nmeconf.org ★ Call for participants 1\\. Presenter:If you are interested in presenting your research on the conference, without publishing your paper in the proceeding, you only need to submit the abstract to us! 2\\. Listener:If you are interested in attending the conference to understand ongoing research achievements and share with them your ideas, you are welcome to send your name and affiliation to us. 3\\. Reviewer:Experts in the area of numerical modelling are welcome to join the conference as reviewer. If you are interested in reviewing the papers, please send your latest CV. ★ Conference Highlights 1\\. Invited Speakers will have a longer presentation time and we will post your information on the website so that other participants can learn more from you first. If you are interested, please do not hesitate to let us know; 2\\. Conference proceeding will be indexed by Scopus, Engineering Compendex (EI), Inspec and etc; 3\\. Best Oral Presenters will be awarded a free registration for the next conference; 4\\. Lunches and Dinners during August 19-22 are covered; 5\\. One day tourism will be provided. ★ Contact us Ms. Bernice Wu-Conference Secretary E-mail: nme@nmeconf.org Tel.&Wechat: +86-13545231968 LinkedIn: www.linkedin.com/in/cmanme-conference","date_start":"2019-08-19","date_end":"2019-08-22","important_dates":{"abstract":"","full":"2019-06-30","notification":"","final":""},"topics":["Engineering & Technology","Other","Electrical & Electronic Engineering"],"location":{"virtual":"","full":["Beijing","China"],"name":"","street":"","city":"Beijing","state":"","ZIP":"","country":"China"},"organizers":["Ghent University(Belgium), Nanjing Tech University (China), Duy Tan University (Vietnam), and Ton D"],"societies":[],"indexes":[],"emails":["nme@nmeconf.org"]}