{"name":"SPML 2019 2nd International Conference on Signal Processing and Machine Learning in Hangzhou, China","series":"","short":"","website":"http://www.spml.net","content":"Conference official website：http://www.spml.net Meeting time：November 27-29, 2019\\. Meeting place：Hangzhou, China/Hangzhou Dianzi University. Host unit：ACM Singapore Chapter. keynote speaker： Prof. Shigeru Katagiri from Doshisha University in Japan. Prof. Chin-Chen Chang from Feng Chia University in Taiwan. Prof. Li Jianjun from Hangzhou Dianzi University in China Prof. Yen-Wei Chen from Ritsumeikan University, Japan Published by： Accepted papers will be published in the Conference Proceedings by ACM (ISBN 978-1-4503-7221-3) which will be archived in the ACM Digital Library, and indexed by Ei Compendex and Scopus, and submitted to be reviewed by Thomson Reuters Conference Proceedings Citation Index (ISI Web of Science). Call for Papers： Adaptive Filtering & Signal Processing. Ad-Hoc and Sensor Networks. Analog and Mixed Signal Processing. Array Signal Processing. Audio and Electroacoustics. Audio/Speech Processing and Coding. Bioimaging and Signal Processing. Computer Vision & Virtual Reality. Cryptography and Network Security. Design and Implementation of Signal Processing Systems. Digital Signal Processing. DSP Implementations and Embedded Systems. Emerging Technologies. Hardware Implementation for Signal Processing. Higher Order Spectral Analysis. Important Dates Deadline (full text) : July 10, 2019\\. Deadline (abstract) : August 05, 2019\\. Registration Deadline: August 25, 2019\\. Conference Contact :Mr. Cheney Zhu mailbox: spml.contact@gmail.com Tel: +86-021-59561560","date_start":"2019-11-27","date_end":"2019-11-29","important_dates":{"abstract":"","full":"2019-07-10","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Machine learning"],"location":{"virtual":"","full":["Hangzhou","China"],"name":"","street":"","city":"Hangzhou","state":"","ZIP":"","country":"China"},"organizers":["ACM Singapore Chapter"],"societies":[],"indexes":[],"emails":["spml.contact@gmail.com"]}