{"name":"Developing Effective Employee Handbooks: 2021 Critical Issues and Best Practices","series":"","short":"","website":"https://bit.ly/3aSRAXt","content":"Employee handbooks are a critical tool in providing important information about your organization to employees. Employee handbooks typically describe what you expect of your employees and what your employees can (should) expect from you. Employee handbooks also provide critical information about your organization and your workplace, and how your employees are expected to fit in. Employee handbooks further formalize mutual expectations. In delineating these expectations employee handbooks create opportunities and risks. Handbooks provide your organization with the opportunity to enhance the value of its human capital, make your organization more competitive, and improve individual and organizational performance. Conversely, handbooks can impede the achievement of business objectives, increase employment-related liabilities, and reduce managerial prerogatives by making promises or commitments to certain procedural safeguards that your organization did not intend to make. As noted in a memorandum from a former General Counsel of the NLRB: “…incorrectly designed employee handbooks can violate the law and have a ‘chilling effect’ on employees’ activities.” Thus, while your employee handbook provides you with the opportunity to make your workforce more committed and supportive of your organizational goals, it can also, unfortunately, serve as the basis for employees’ legal action and can significantly reduce employees’ commitment to your organization’s success. Why Should You Attend The purposes and the scope of employee handbook process, policies and the practices are changing and expanding. From a siloed HR activity that creates insular documents concerned primarily with communicating the organizational work rules and benefits, employee handbook process, policies and practices have evolved into a critical component of an organization-wide management process that maximizes organizations’ achievement of business objectives, enhances the value of their human capital, and minimizes legal risk. Thus, to increase the effectiveness of their employment policies, organizations will have to: » Enhance their business, operational, and legal intelligence to ensure they have identified the changing external and internal factors that affect their policies » Increase internal stakeholder participation in the handbook development process to obtain greater employee commitment and operational alignment » Establish new metrics to assess handbook policy and practices performance and measure the achievement of organization goals » Implement internal controls that identify and alert management about employee handbook issues Objectives of the Presentation Your employee handbook plays an important role in communicating with and providing information to your employees. Increasingly, your employee handbook must ensure that it is aligned with strategic and business objectives, is properly drafted, and is effectively implemented. Thus, this webinar discusses how your handbook can: » Enhance your employment brand; » Play a key role in recruitment and retention; » Enhance employee relations, employee morale, and productivity; » Contribute to uniform and consistent application, interpretation, and enforcement of organizational policies and rules; » Protect your organization against claims of improper employee/supervisor conduct; and » Reduce your organization’s exposure to employment-related liabilities. Areas Covered in the Session A survey of employers revealed that organizations use employee handbooks to address key business, legal, and talent management issues. Unfortunately, they often limit the effectiveness of their handbook policies by using ineffective employee handbook practices. As the survey report noted, in many organizations there is a disconnect between the drafting and issuing of handbook policies and the practices that ensure those policies are effectively implemented. This disconnect can lead to missed business opportunities, lost strategic goals, increased legal action, and the loss of critical talent. In this webinar, we will look into; » Key employee handbook issues in 2021 » A review of the NLRB’s most recent memorandum on employee handbooks » How your organization can reduce the gap between policy issuance and effective implementation. » Review the basics of employee handbook development » Discuss the expanding purposes and scope of employee handbooks » Learn the dimensions of critical handbook policies » Understand the framework of employee handbook audits activities Who Will Benefit » HR professionals » Internal and external auditors » Business owners » Compliance managers » Risk managers » CEOs » CFOs » External auditors » Internal auditors To Register (or) for more details please click on this below link: https://bit.ly/3aSRAXt Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-02-05","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Human-Resources"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}