{"name":"Incoterms® 2020 Rules","series":"","short":"","website":"https://www.complianceonline.com/intercoms-2020-webinar-training-706265-prdw?channel=Brownwalker","content":"Attend this webinar to learn how to make correct use of Incoterms® to prevent delays and save additional costs. Learn how certain rules determine who is responsible for transportation, insurance, reporting the transaction to customs and much more. Why Should You Attend: Incoterms® are a set of rules which define the responsibilities and obligations of international sellers and buyers for the delivery of goods under sales contracts and are widely used in international commercial transactions. Incoterms® is short for International Commercial Terms. The rules are an agreement between seller and buyer relating to obligations concerning tasks, costs and risks involved in the delivery of goods. These trade terms provide a uniform set of rules to assist buyers and sellers in stating each party's obligations under an international contract. They streamline and remove some of the ambiguity that can occur in a contract especially when parties speak different languages. They provide a basis for dispute resolution. The chosen term defines where risk will transfer between the seller and buyer. This will have an impact on the cargo insurance obligations. Incorrect use of Incoterms® may cause delays and additional costs if not understood. Certain rules will determine who is responsible for transportation, insurance, reporting the transaction to customs and much more. Areas Covered in the Webinar: Definition of the 11 Incoterms Transfer of Risk from the Seller to the Buyer Responsibility for Insurance Costs Associated with Each Term Advantages and disadvantages of each term Who Will Benefit: Exporters Importers Sales and Marketing Managers Purchasing Managers Freight Forwarders Logistics Customs Brokers Carriers Credit Managers","date_start":"2022-05-05","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}