{"name":"Towards 2030: Sustainable Development Goal 3: Good Health and Wellbeing. A Sociological Perspective","series":"","short":"","website":"https://www.frontiersin.org/research-topics/30614","content":"In collaboration with the Open Access journal “Frontiers in Sociology: Medical Sociology” (www.frontiersin.org) we are bringing together a selected group of international experts to contribute to an article collection: \"Towards 2030: Sustainable Development Goal 3: Good Health and Wellbeing. A Sociological Perspective\" Submission Deadlines: 31 March 2022 - Abstract 15 June 2022 - Manuscript Visit the collection homepage for the full description of the project: https://www.frontiersin.org/research-topics/30614/ About this Research Topic: This Research Topic addresses third Sustainable Development Goal, which is to “ensure healthy lives and promote wellbeing for all at all ages.” Progress toward this goal is measured by a number of individual targets and indicators. As highlighted in the UN’s most recent SDG progress report, the COVID-19 pandemic has heavily impacted progress toward this goal. Prior to the pandemic there had been improvements in maternal & child health, immunization coverage, suicide rates, and reductions in the incidence of communicable diseases and mortality rates from non-communicable diseases. The pandemic threatens to reverse or stall much of this progress. As of June 2021, the global death toll from COVID-19 stood at 3.7 million, with manifold wider ramifications of the disease. Ninety per cent of countries are still reporting one or more disruptions to essential health services, and available data indicates that the pandemic has shortened life expectancy. The pandemic has also severely impacted mental health and increased waiting times for elective health services. At the same time, it has exacerbated inequalities at the national and international levels, including access to vaccines. In emerging from the pandemic and mitigating its effects, the UN has placed emphasis on expanding universal health coverage and multisectoral coordination for health emergency preparedness, as well as improving demographic and epidemiological data. This Research Topic will address the third Sustainable Development Goal from a sociological-specific perspective. It will focus on how social stratification, geographical location, and culture impact communities’ health, but also on groups-specific health problems, availability, understanding, and reception of medications and treatment, and the functioning of primary health care as a service, aiming to influence and inform policymakers on the development of equal public health policies. A specific focus will be dedicated to how disparities in gaining access to health care reproduce important social inequalities in wellbeing and quality of life. Due to the COVID-19 pandemic, unprecedented health, economic and social challenges are threatening lives and livelihoods, making the attainment of SDGs much more onerous. This call invites contributions in the form of studies, reviews, and opinion articles from the experts to provide sustainable solutions to achieve SDGs. This Research Topic welcomes papers that will provide both theoretical and empirical findings. Potential issues include, but are not limited to: - Transformations of social determinants of health, including lifestyles and environments. - Health inequalities and interventions towards their reduction. - Development of demographic and epidemiological data collecting and processing. - Advances in the fields of health emergency preparedness and access to universal health coverage. - Good health and wellbeing through access to clean and green agriculture. - Improving crop productivity on limited land in the era of climate change and COVID-19 pandemic. - Application of sustainable practices in agriculture and food sectors. - Public health and health sector innovations during the pandemic and for the post-pandemic period. - Tensions between national and international health policies in response to global health challenges. - Role of experts in making law and public policies related to the COVID-19 pandemic (e.g., response and recovery plans, programs, strategies, and funds). - Innovative, co-design, co-creation, and co-production schemes based on diversity of policy ideas in the environmental policy and health policy. - Disruptions and challenges for integrated public policies and programs on social, environmental, and health issues related to delivering social, health, and care services. - Opportunities, criticism, and ethical controversies related to digital social innovation, e-health, plant-based innovation, food innovation, AI, ICT, and 3D solutions, social and service robotics, smart environments, gerontechnology, and welfare technology. Keywords: SDG3, essential health services, mental health, universal health coverage, health inequalities, well-being Co-Editors: - Sangeeta Chattoo, University of York, United Kingdom - Chimaraoke Izugbara, International Center for Research on Women, United States - Andrzej Klimczuk, SGH Warsaw School of Economics, Poland - Magdalena Klimczuk-Kochańska, Faculty of Management, University of Warsaw, Poland - Piotr Toczyski, The Maria Grzegorzewska University, Poland - Ashwani Kumar, Dr. Harisingh Gour Central University, India - Rubal Kanozia, Central University of Punjab, India - Grzegorz Piotr Gawron, University of Silesia in Katowice, Poland - Ahmad Ozair, King George’s Medical University, India SUBMISSION: Papers should be submitted through this link, using the \"Submit your manuscript\" button: https://www.frontiersin.org/research-topics/30614/ and must follow paper templates available here: https://www.frontiersin.org/about/author-guidelines#Templates Publishing solutions: - Manuscripts will be peer reviewed, and if accepted for publication, are subject to publishing fees, which vary depending on the article type (https://www.frontiersin.org/about/publishing-fees). A discount or waiver can be applied for and all applications are considered (https://frontiers.qualtrics.com/jfe/form/SV\\_51IljifwFBXUzY1). - We collaborate with many leading universities making the Open Access publishing process even more accessible for authors. Click here (https://www.frontiersin.org/about/institutional-membership) to see whether your institution is collaborating with us.","date_start":"2022-06-15","date_end":"","important_dates":{"abstract":"","full":"2022-06-15","notification":"","final":""},"topics":["Social Sciences","Sociology","Health and Environment"],"location":{"virtual":"","full":["Online Event","Swaziland"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Swaziland"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}