{"name":"Illumination: Perspectives on the Way of Light","series":"","short":"","website":"https://illumination.lcir.co.uk","content":"The origin myths of multiple cultures describe a primordial order of life which emerges from the subterranean world into an upper world of light and growth. In recent eras, light has come to serve as a metaphor for learning and technological advancement. The term “enlightenment” continues to portray humankind as both the embodiment of spiritual growth and an historic era in which science and the humanities grew intertwined. Like moths, we are drawn to the light—everything from the sun to gilded manuscripts to the screens of our own computers. This conference examines the way light has and continues to reveal significant aspects of the human condition. Papers are invited on topics related, but not limited, to: Biographical or Personal Transformation as Reflected in Literature, Music, Visual Arts, Dance, or Theatre Light in Art Epiphany as Mental Process Light as Mythological Context in Literature and the Visual or Performing Arts Light and Technological Art Processes Such as Photography Objects of Light or Tools for Calendric Measurement Daily, Nightly, or Seasonal Rituals Stories of Historical, Cultural, or Personal Emergence, Rebirth, or Transformation Light as Religious Concept or Aspect of Sacredness Nations and People—Customs Surrounding Sun, Moon, Nightfall, or Daybreak The “Enlightenment” as Regional Historical Movement Effects of Education on Individuals or Underserved Peoples Humanistic Response to the Loss of the Nighttime Skies in 21st-Century Arts and Literature Elements of Light in Theatric or Dance Performance Ceremonial Fire Paper proposals up to 250 words and a brief biographical note should be sent by 30 September 2019 to: illumination@lcir.co.uk","date_start":"2020-03-14","date_end":"","important_dates":{"abstract":"","full":"2019-09-30","notification":"","final":""},"topics":["Arts & Humanities","Art History"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["illumination@lcir.co.uk"]}