{"name":"2022 Asia-Singapore Conference on Sport Science ‘LIVE’","series":"","short":"","website":"https://acss.ear.com.sg","content":"Who else wants an in-person conference? 2022 Asia-Singapore Conference on Sport Science ‘LIVE’ (ACSS2022) 6-7 December 2022 Holiday Inn Singapore Atrium, Singapore With plans to substantially ease travel restrictions, now is the best time to plan your trip to Singapore, the Monte Carlo of Asia! We’re pleased to announce that Asia-Singapore Conference on Sport Science (ACSS 2022), organized by East Asia Research and supported by Southern Cross University, Australia, will be a hybrid conference happening in Singapore from December 6-7, 2022! Learn from the masters of Sport Science at the premier conference for the sporting community. ACSS 2022, themed “A Multidisciplinary Approach to Enhance Sport Performance”, the two-day Conference will offer participants the opportunity to learn about the latest trends and best practices in the world of Sport Science. Leading academic scientists, researchers and research scholars will attend to exchange and share their experiences and research results on all aspects of Sport Science. We encourage research papers and training approaches based on integrating different disciplines applied in Sport Science to enhance sport performance to be submitted to the conference. Expect presentations on the most recent innovations, trends, and concerns, as well as practical challenges encountered and solutions adopted in the fields of Sport Science. Join us for ACSS 2022 at Holiday Inn Singapore Atrium, Singapore and walk away with powerful knowledge that will empower you to forge the path for the future of Sport Science. Limited seating may apply. ‘BUY TICKET’ now. Don’t wait – this rate won’t last long! Due to the persistence of COVID-19, the conference will be conducted in a ‘Hybrid Format’. Participants can make oral/poster presentations onsite or send us pre-recorded video presentations and register as a ‘Virtual Presenter’. They will indicate their preferred presentation medium when they register. The ‘Early Bird Registration Deadline’ is on October 11th 2022\\. Special theme for ACSS: ‘A Multidisciplinary Approach to Enhance Sport Performance’ We welcome all papers on the topic of Sport Science to be presented at ACSS 2022\\. ACSS Keynote Speakers: Assoc. Prof. Dr. Mike Climstein (FASMF, FACSM, FAAESS), Southern Cross University Australia Dr. Stephen Burns, Associate Professor, Physical Education and Sports Science, National Institute of Education, Nanyang Technological University Dr. Kawabata Masato, Asst. Professor, Physical Education and Sports Science, National Institute of Education, Nanyang Technological University Dr Ian Tim Heazlewood, Consultant Sports Science and Exercise Science expert, Sport Science Institute Abstract Submission Deadline: 12th July 2022 Enquiries: anthonytan@ear.com.sg Web address: https://acss.ear.com.sg Sponsored by: East Asia Research and Southern Cross University, Australia P.S. If you are representing an Association or an Institute of Higher Learning and would like to be a conference partner, please get in touch with us. Many benefits await you when joining us!","date_start":"2022-12-06","date_end":"2022-12-07","important_dates":{"abstract":"","full":"2022-07-12","notification":"","final":""},"topics":["Medicine & Health","Other","sport science"],"location":{"virtual":"","full":["Online Event","Singapore"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Singapore"},"organizers":["East Asia Research and Southern Cross University, Australia"],"societies":[],"indexes":[],"emails":["anthonytan@ear.com.sg"]}