{"name":"Secrets of Batch","series":"","short":"","website":"http://go.evvnt.com/479960-3?pid=4868","content":"Operating a commercially viable chemical process requires a good chemical synthesis to start with, but is also subject to the interplay of a myriad of important physical phenomena - heat transfer, mass transfer, fluid flow, etc. which are traditionally the realm of the chemical engineer. An understanding of these scale-up phenomena is crucial for the laboratory development of processes that will scale successfully. This course presents an overview of these issues and examines their impact on process operation in the pilot plant and beyond, including scale-up considerations for route selection, raw material charging, reaction steps, workup, crystallization, product isolation, drying, etc. Common bench techniques for each of these steps are contrasted to the safety and operability criteria for successful pilot plant operation. Numerous examples and case histories are presented, along with tips and techniques for operators and experimenters. Heavy emphasis is placed on process safety. An underlying goal of the course is improving communication and mutual understanding between development team members of different backgrounds; thus, the course is appropriate for synthetic chemists, process development chemists and process engineers with limited pilot plant experience who wish to learn more about the potential pitfalls of scale-up in process development. The course complements the more chemistry-focused Scientific Update course \"Chemical Development and Scale-Up in the Fine Chemical and Pharmaceutical Industries\". Tickets: https://go.evvnt.com/479960-0?pid=4868 Time: 09:00 to 17:00 Venue details: Tivoli Oriente Lisboa Hotel, 27 Avenida Dom Joao II, Lisboa, 1990-083, Portugal Price: Course fee: EUR 2099.00 Speaker: Francis X. McConville","date_start":"2020-04-21","date_end":"2020-04-23","important_dates":{"abstract":"","full":"2020-04-20","notification":"","final":""},"topics":["Medicine & Health","Public-Health","medicine & medical science"],"location":{"virtual":"","full":["Lisboa","Portugal"],"name":"","street":"","city":"Lisboa","state":"","ZIP":"","country":"Portugal"},"organizers":["Scientific Update Ltd"],"societies":[],"indexes":[],"emails":[]}