{"name":"Workshop on Interactive Environments and Emerging Technologies for eLearning (IEETeL)","series":"","short":"","website":"https://sites.google.com/view/ieetel2020","content":"eLearning is a dynamic research area reflecting on the current requirements of all participants in the educational process for innovative teaching and meaningful learning combining existing knowledge with future perspectives. The aim of IEETeL is to connect researchers, educators and technology experts giving them an opportunity to share and discuss new solutions, trends and realizations of eLearning environments and the adoption of emerging technologies in educational settings. These will draw the challenging problems in information gathering, processing and usage; development of web-based and mobile services; building intelligent and social-oriented applications in support of flexible, personalized, adaptable, in-demand learning. This forum invites research, technical papers, and report of work in progress, investigating eLearning environment development, information processing/management for education in local/small settings and in global/large scale ones, practices of implementation in education to facilitate high school and university students' learning, and to help then train to become self-organized life-long learners. The technological and pedagogical aspects of building a learning environment are also of interest for the workshop, such as the description of new systems built “from scratch” using open source software or cloud-based mashup applications, the extension of such environments, and the presentation of pedagogical strategies and solutions for utilizing such environments.","date_start":"2020-06-17","date_end":"2020-06-19","important_dates":{"abstract":"","full":"2020-01-31","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["L'Aquila","Italy"],"name":"","street":"","city":"L'Aquila","state":"","ZIP":"","country":"Italy"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}