{"name":"Cities’ Identity Through Architecture and Arts (CITAA) – 4th Edition","series":"","short":"","website":"http://bit.ly/citaaconf","content":"Recently, great attention has been raised to the transformation of our cities, which has been directed to the field of urban studies. The identity of cities has become a serious issue for many countries at present. That's why; the role of organizations and governments has become to maintain and fix architectural buildings in order to save their heritage. In this context, IEREK organizes this conference to discuss several topics regarding different vocabularies. For instance, the sacred architecture, heritage buildings, open spaces, landmarks, the street escapes, etc.; all of them have direct influences at the cities' form. The cities' form also receives the indirect impact from the citizens themselves, such as their culture that accordingly depends on the art, which could be seen and embodied through moral, painting, media, digital art, and sculpture. It then discusses the fundamental elements that have the full resilience and responsibility of the identity of the cities. This conference welcomes research papers that includes different case studies that present many solutions of activating the concept of the responsibility of architecture and arts on the development of our cities. It is an important initiative, which presents a new approach that depends on the available features of cities and how planners and decision-makers use these resources of the cities' features like the thread tip in solving the urban problems that our cities are facing. All accepted papers of the fourth Cities’ Identity Through Architecture and Arts (CITAA) after the peer-review process will be either published as chapters in the Book Series “Advances in Science, Technology and Innovation” (ASTI) by Springer or in The International Journal of Academic Research Community Publication (ARChive) online by IEREK Press. Conference Topics: 1\\. Identifying and Shaping Cities and formation 2\\. Heritage Arts: Sustainability, Identities and Public Regulations 3\\. Contemporary Arts: City Visual Arts and Visualization 4\\. Development of Cities’ vocabularies","date_start":"2020-12-09","date_end":"2020-12-11","important_dates":{"abstract":"","full":"2020-09-10","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental","Architecture & Civil Engineering"],"location":{"virtual":"","full":["Pisa","Italy"],"name":"","street":"","city":"Pisa","state":"","ZIP":"","country":"Italy"},"organizers":["IEREK"],"societies":[],"indexes":[],"emails":[]}