{"name":"7th Annual Conference on Engineering and Information Technology","series":"","short":"","website":"http://www.aceait.org","content":"Our planet is now in great danger. For the last one hundred years, the people of earth have wasted and misused the natural resources of earth. Problems like global warming, lack of natural resources for next generation, acid rain, climate change and the ozone layer are out of our control. In response to the environmental impacts caused by global warming and those problems caused by the over use of traditional energy, countries have accelerated the practical application of sustainable energy. Even in recent years when the world has continued to be shrouded in major conflicts such as Brexit and Iranian issues, the penetration rate of sustainable energy continues to increase, and it gradually changes the way people use energy. Annual Conference on Engineering and Information Technology (ACEAIT) will be the best platform to explore the world’s scholars’ research works and innovations in the respective areas. With members from around the world focused on learning about Sustainable Energy, this is the best opportunity to reach the largest assemblage of participants from various communities, conduct demonstrations, distribute information, meet with professionals and receive recognition at this 3-day event. Call for Paper Topics: Biological Engineering Chemical Engineering Civil Engineering Computer and Information Sciences Electrical and Electronic Engineering Environmental Science Fundamental and Applied Sciences Mechanical Engineering Material Science and Engineering","date_start":"2020-03-24","date_end":"2020-03-26","important_dates":{"abstract":"","full":"2019-12-05","notification":"","final":""},"topics":["Engineering & Technology","Renewable Energy/Nuclear","Information technology systems (IT)"],"location":{"virtual":"","full":["Osaka","Japan","Japan"],"name":"","street":"","city":"Osaka","state":"Japan","ZIP":"","country":"Japan"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}