{"name":"Value Pricing – Now Is The Time","series":"","short":"","website":"https://bit.ly/3alnrz7","content":"The accounting industry is one that has been the most focused on billable hours since it’s inception. People are obsessed with how many hours they are billing and staying on budget. This practice needs to go though – value is what should be charged for not time. This is a better practice for both the firm and the client. This means no surprise bills – its simply the cost of getting a task or project done. For the firm, it means you can try to become more efficient and truly showcase your worth. Remember, it can take different people different amounts of time to do things – outcomes should be worth the value, not the time it took to get there alone. Why Should You Attend Have you ever considered billing a different way? Using the value you add as the justification, not the time or hours you spent on a project? If you want to please your clients, and also give yourself, and your firm, the opportunity to grow in new ways, value pricing is the way to do it. Objectives of the Presentation » Understand why billable hours doesn’t work in the future » Learn the principles of value pricing » Understand the benefits of switching to a value pricing model » How to incorporate billable hours into the way you develop your value pricing » Learning about fencing and package pricing strategy Areas Covered in the Session » The Billable Hours mentality » Value pricing » Fencing » Package pricing » Value add/add ons Who Will Benefit » All in the accounting industry » CPAs » Public Accountants To Register (or) for more details please click on this below link: https://bit.ly/3alnrz7 Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-03-02","date_end":"","important_dates":{"abstract":"","full":"2021-03-02","notification":"","final":""},"topics":["Business","Accounting"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}