{"name":"International Conference on Urban Studies","series":"","short":"","website":"https://urbanstudies.lcir.co.uk","content":"Cities are born out of a specific necessity arising at a given moment in time and develop their own ethos based on a unique mentality and ideology, and a certain set of social values and cultural attitudes. Concrete, physical structures and systems, as well as abstract, conceptual notions work together in complex and complicated ways to articulate not only the symmetries and consistencies but also the paradoxes and contradictions of distinct urban and metropolitan areas. They are designed as leading centres of economics or politics, finance and commerce, governance and international administration, research and development, education and media, art and culture, entertainment and tourism. The scope and purpose of making a city are significantly important but the human factor is decisive since the city dwellers are the ones who insert their individual stories of identity into the communal biography of the municipal setting. The conference aims to explore the interdependence between the cities and their people, the mutual power they exercise upon each other, with cities absorbing individuals and humans conquering urban spaces. It will also focus on the various aspects that characterize the world’s capitals, conurbations and metropolitan regions, their strengths and achievements, challenges and opportunities, problems and solutions, as well as the realities of the 21st century that are placing increasing pressures upon both cities and their inhabitants: overpopulation, overconsumption, poverty, deforestation, pollution, climate change, etc. And last but not least the conference will investigate the heterogeneous nature and the romantic fascination exerted by urban areas. The main objective of the event is to bring together all those interested in examining the intersections between their professions and/or interests and some distinct aspects of metropolitan life, providing an integrated approach for the understanding of the mechanisms that lie behind the undisputed global centres. Topics include but are not limited to several core issues: arcology – principles and practices urban architecture and planning landscape urbanism radical planning the mind of the city supercities and the self past, present and future city limits and limitations travel and transport commuting and mobile consumerism economies of urban agglomeration ecological education recycling and waste management economic growth and social responsibility urban agriculture landscapes and cityscapes renewal and transformation models the ethics and morality of the city environmental health global warming gentrification and displacement home and homelessness landscape architecture overcrowding and overpopulation suburban colonization smart cities, intelligent communities progress, productivity and productivism place identity and human experience public spaces and social interaction urban patterns of behaviour addiction, crime and deviation neighbourhoods and sustainability terrorism and counterterrorism local history and cultural heritage historical, cultural and tourist landmarks multiculturalism and exclusiveness placemaking, race and ethnicity urban legends cities and cultural diversity writing the city media representations wisdom and humour Paper proposals should be sent by 5 December 2019 to: urbanstudies@lcir.co.uk. Please download Paper proposal form: https://urbanstudies.lcir.co.uk/ Registration fee – 100 GBP Conference venue TBC","date_start":"2020-05-09","date_end":"","important_dates":{"abstract":"","full":"2019-12-05","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental","interdisciplinary"],"location":{"virtual":"","full":["Cambridge","United Kingdom"],"name":"","street":"","city":"Cambridge","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["urbanstudies@lcir.co.uk"]}