{"name":"International Flight Crew Training Conference, London, 18-19 September 2019","series":"","short":"","website":"https://go.evvnt.com/430508-0?pid=4868","content":"The Annual International Flight Crew Training Conference is a premier event in the calendar. Last year’s Conference addressed the modernisation of flight crew training made possible by introducing Competency Based Training and Assessment (CBTA). This year the aim is to challenge the remaining vestiges of previous thinking and examine and discuss the opportunities to complete the transformation using practices and processes that make full use of today’s technology and understanding of human interactions. The Royal Aeronautical Society is privileged to have been asked to progress various aspects of flight crew training with the aim of improving safety. Safe operations require the maintenance of standards by adopting best practices. Training strategies and training systems need to exploit evolving technologies using all available tools from distance learning through to aircraft. Emerging regulatory requirements may place a fresh emphasis on aspects of training delivery, and performance-based training systems require changes to philosophies. Some 150 delegates are expected from around the world, and the Conference will conclude with an open forum giving every delegate an opportunity to table innovative proposals to progress relevant work. Regardless of your role, this Conference will provide a unique opportunity to engage with industry leaders, discuss the issues and influence the work required to resolve them. For anyone world-wide involved with flight crew training - aircraft manufacturers, sub-contractors and vendors; international, national and regional carriers; training integrators and training providers; regulatory authorities; researchers and designers; universities; and all other related fields - this opportunity should not to be missed. Time: 9:00 am - 5:00 pm Prices: Non-member / £625.00 + VAT: GBP 625.0, RAeS Corporate Partner / £525.00 + VAT: GBP 525.0, RAeS Member / £450.00 + VAT: GBP 450.0 Speakers: Stephen P. Creamer, Director, Air Navigation Bureau, International Civil Aviation Organization, United Nations, Capt Hugh Webbon FRAeS, Director, The LOSA Collaborative, Capt Miguel Marin, Chief, Operational Safety Section, Air Navigation Bureau, ICAO, Suzanne K Kearns FRAeS, Associate Professor Commercial Aviation Management, University of Western Ontario, Canada, Peter Mayes, Training and Quality Management, HALO Drones, UK, Sam Webb, LMQ Ltd, UK, Capt Stefan-Thilo Schmidt, Lufthansa, Germany, Dr Andy Taylor, Visiting Lecturer in Aviation, University of Bedfordshire, UK, FO George Webbon, A320 Fleet, British Airways, UK, Jacqui Suren FRAeS, Training Policy Manager, Airbus, France, Philip Tarry, Director, Halo Drones, UK, Capt Dave Newbery, Check and Training Captain, Cathay Pacific Airways, Capt Vasileios Kloudas, Chief Pilot, Olympic Air/Aegean Group Venue Details: No.4 Hamilton Place, 4 Hamilton Place, London, W1J 7BQ, United Kingdom","date_start":"2019-09-18","date_end":"2019-09-19","important_dates":{"abstract":"","full":"2019-09-17","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education, teaching"],"location":{"virtual":"","full":["London","Uk","United Kingdom"],"name":"","street":"","city":"London","state":"Uk","ZIP":"","country":"United Kingdom"},"organizers":["Royal Aeronautical Society"],"societies":[],"indexes":[],"emails":[]}