{"name":"10th Annual Pharma AntiCounterfeiting & Serialisation 2022","series":"","short":"","website":"https://www.virtueinsight.com/pharma/10th-Annual-Pharma-AntiCounterfeiting--Serialisation-2022","content":"10th Annual Pharma AntiCounterfeiting & Serialisation 2022 “Competences to Combat Counterfeits” 02nd & 03rd March 2022, Pestana Chelsea Bridge Hotel, London, UK 10th Annual Pharma AntiCounterfeiting & Serialisation 2022 overviews and integrates the business and technical problems that pharmaceutical companies should be aware of in order to fight the major global problem of counterfeit medicines. In addition to discussion of the problems, this conference addresses serialisation, track and trace analytical techniques scientists use to detect counterfeits and identifying solutions to the threat of counterfeit medical products. It gives us immense pleasure in welcoming you to “10th Annual Pharma Anti-Counterfeiting & Serialisation 2022 – “Competences to Combat Counterfeits” DELEGATE REGISTRATION: Email - kavitha@virtueinsight.co.in or TEL: +44-20 3509 3779 Please note that this is a PAID event and NOT A FREE event (no complimentary passes available). Any invite, email or tickets issued mentioning it as a free pass or free ticket to this event through any third party site will strictly not be accepted by the organizer. Super Early Discount - Valid till 14th December 2021 1 Delegate @ £699+20% VAT 3 Delegates @ £1,398+20% VAT Early Discount - Valid till 26th January 2022 1 Delegate @ £999+20% VAT 3 Delegates @ £1,998+20% VAT Standard Pricing - From 27th January 2022 1 Delegate @ £1,299+20% VAT 3 Delegates @ £2,598+20% VAT Conference Sponsor, Exhibition Stall & Paid Speaker Slot - Please email your interest and queries to kavitha@virtueinsight.co.in KEY SPEAKERS: • LUIS PEREZ, Assistant Special Agent in Charge, FDA • RORY CORCORAN, A/Assistant Director, Organized and Emerging Crime, Interpol • TIMOTHY HEMKER, Deputy Attache, Homeland Security Investigations (HSI) • JYRKI SYVAERI, Corporate Director Supply Chain Integrity, Boehringer Ingelheim • STEFAN ARTLICH, Director 'Track&Trace', Bayer • NEIL LAWRENCE, Global Serialisation Champion, GSK • ALEXANRU POPA, Associate Director, Blockchain for Pharma Supply Chain, MSD • SEBASTIEN MAUEL, Head of Serialization and Product Security, Ferring Pharmaceuticals • HEIKO TREFZGER, Product Manager, Business Analyst, Innovation Representative, Roche • CLAIRE CLARKE, Director Healthcare Engagement, GS1 • EIKE STRUTZ, Corporate Security Manager, Boehringer Ingelheim • HUGUES ISEL, Global Quality Issue Manager, Roche • GARY POND, Global Program Manager – Authentication, Colorcon • SULTAN DAJANI, Pharmacist Superintendent, Wainwrights Chemists • MONIKA DERECQUE-POIS, Director General, GIRP—European Healthcare Distribution Association • MIKE ISLES, Executive Director, European Alliance for Access to Safe Medicines • KASPER ERNEST, Secretary General, Affordable Medicines Europe • GRANT COURTNEY, Founder and CEO, Smarter and Safer Products • PATRIK MERCKELL, CEO, Disruptor and Founder, accent.world sa • GUSTAVO MORAIS, Partner - Member of Managing Committee, Dannemann Siemsen • JOSE H. WERNER, Partner, Dannemann Siemsen Plus more joining soon KEY THEMES: • How pharma is fighting counterfeit drugs especially during this post pandemic? • Market analysis – EU, US and RoW markets & Impact of BREXIT • Challenges and Opportunities - Waging war against counterfeit medicines • Discuss your serialization, track and trace, and brand protection programs with industry’s top best individuals • Track & Trace: Turning total compliance into a supply chain value plan • Fight the FAKE – Protect the public • IP - Cybercrime in the pharmaceutical industry: a booming business • Technology Impact - Current digital world - Counterfeiting Technologies • Fighting counterfeit at the world’s largest fraud market • Choose a Serialisation solution wisely to ensure timely and lasting compliance • Smart Packaging and Labeling - Warehouse & Logistics – Lessons to learn • Serialisation: The Next Frontier for Packaging Security and Traceability • How counterfeit medicines penetrate the legitimate supply chain • Discover the innovative role block-chain has to play in supply chain security • EU and USA: government policies & strategies - Comparing with RoW • Getting ready - regulations • Assess the current technology landscape and identify the right solution for your needs • How can companies and gov work closely and together and its importance • Network in our combined exhibition and catering area WHO SHOULD ATTEND: Pharmaceutical manufacturers and distributors, Healthcare professionals, Pharmacists, Serialisation, Track and Trace – Solution providers, Brand – protection, enforcement, security, integrity and management companies, Drug regulatory agencies, customs and police, Intergovernmental organizations (IGOs) involved in healthcare and IPR protection, Non-governmental organizations (NGOs) active in healthcare, Patients’ representatives, Healthcare research organizations, Pharmaceutical associations, Anti-counterfeiting organizations, Packaging, labeling and converting companies, Authentication technology suppliers, Anti-counterfeiting service suppliers – IP specialists, investigators, lawyers Get more from the event, with a broader scope bringing the whole communications value chain together. Enjoy and make the best out of our dedicated networking time, meet the leading international vendors showcasing the products of tomorrow in the co-located exhibition. Expand your knowledge of the latest business models and strategies in the high-level conference.","date_start":"2022-03-02","date_end":"2022-03-03","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal","Pharmacology & Pharmaceuticals"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Colorcon"],"societies":[],"indexes":[],"emails":["kavitha@virtueinsight.co.in"]}