{"name":"Variation; Universal Enemy of Business Performance","series":"","short":"","website":"https://bit.ly/2Q4mQKT","content":"General Carl von Clausewitz defined friction as \"…the force that makes the apparently easy so difficult,\" and \"countless minor incidents… combine to lower the general level of performance, so that one always falls short of the intended goal.\" Friction is why, in civilian occupations, organizational performance often falls short of plans, and for no obvious reason. Variation is a form of friction that, among other things, generates huge piles of inventory in plants with nominally adequate capacity and long lines of irate customers in service activities that also seem to have adequate capacity. The reason is similar to why traffic jams appear out of nowhere during rush hour. This webinar will show clearly how to identify this kind of variation so organizations can address it to improve bottom line performance and customer satisfaction. Why Should You Attend Quality professionals are most familiar with variation in product dimensions as a reason why parts might not meet specifications, but variation makes its presence known in other forms as well. Goldratt's and Cox's The Goal illustrates the effect of variation on operations management, where inventory can back up in factories with nominally adequate capacity. The reason is that favorable variation does not offset unfavorable variation, and time lost at a capacity constraining operation is lost forever. The same principle carries over into project management where unfavorable variation can even turn a nominally non-critical path into a critical one, and service activities in which lines of irate customers can back up at service desks with nominally adequate capacity. There are fortunately, however, simple ways to deal with much of this variation to improve performance. Objectives of the Presentation » Traditional role of variation in product quality » Gage capability (variation in measurements), the subject of measurement systems analysis » Role of variation in production control and service activities; why lines often back up when the service is below capacity. » Effect of variation in activity times on project management (and production planning) » Overall takeaway; variation impacts almost every business activity, but is often taken for granted. There are however things we can do about it. Areas Covered in the Session » Friction, which was originally a military concept, is equally applicable to business activities. It consists not of major and obvious disasters such as product recalls or widespread customer dissatisfaction, but rather of seemingly minor inefficiencies whose cumulative effect can be devastating. » Variation in product dimensions or other quality characteristics is the most familiar context, and it is why parts are sometimes out of specification even when the process is centered on the nominal measurement. Process capability and process performance indices are associated with this application. » Variation in measurements (gage reproducibility and repeatability) means that gages and instruments may return, on average, the correct measurement but \"on average\" is of little comfort if they sometimes reject conforming items and accept nonconforming ones. This is the context of measurement systems analysis (MSA). » Variation in processing and material transfer times is why inventory can accumulate even in a factory with nominally adequate capacity. Time lost at a capacity-constraining resource is lost forever, and favorable variation does not offset unfavorable variation. 1\\. Henry Ford identified this issue almost 100 years ago and his synchronized production system eliminated most if not all of the variation. 2\\. Goldratt's and Cox's drum-buffer-rope (DBR) production control system addresses the symptoms of the variation but does not actually eliminate it. 3\\. Single-unit flow, standard work, automation, and subdivision of labor, on the other hand, address and remove the variation itself, and are essentially prerequisites for successful kanban (pull production control) systems. » Variation in task completion times can cause projects to finish late, and even cause non-critical paths to become critical ones in extreme cases. This is again because favorable variation on one path does not offset unfavorable variation on another. » Variation is why traffic jams appear out of nowhere, especially during rush hour. Ford used staggered work shifts, with people starting and stopping at 30-minute intervals, to eliminate rush hour. (Staggered shifts are also now being used to reduce the number of people present at a factory as a countermeasure for Covid-19.) Who Will Benefit » All quality practitioners and operations managers To Register (or) for more details please click on this below link: https://bit.ly/2Q4mQKT Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-06-02","date_end":"","important_dates":{"abstract":"","full":"2021-06-02","notification":"","final":""},"topics":["Business","Management / Leadership"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}