{"name":"6th Annual IoT & AI Summit 2019","series":"","short":"","website":"https://www.virtueinsight.com/technology/6th-Annual-IoT--AI-Summit-2019","content":"6th Annual IoT & AI Summit 2019 “Unleashing the bold era of IoT & AI innovation” 3rd July 2019, Bangalore, India 6th Annual IoT & AI Summit 2019 will explore and review the various applications of Internet of Things (IoT), Artificial Intelligence (AI) combined. The purpose of the summit is to highlight the true potential of technology across multiple sectors and industries acting as a catalyst between policy makers, government, market movers, and thought leaders providing high level think tank leadership platform. SPONSORS: • ASSOCIATE SPONSOR: REVEALER KEY SPEAKERS: • TULIKA PANDEY, Scientist ‘F’ & Director, Ministry of Electronics & Information Technology Government of India • ABHINAV BISWAS, Alt. CISO at Electronics Corporation of India Limited (ECIL), Dept. of Atomic Energy, Govt. of India, National Cyber Defence Research Centre • SHEFALI BANSAL, Program Director & WW Practice & Client Success Leader for Watson IoT Manufacturing & Building Solutions, IBM Software Labs • RAVICHANDRAN MAHADEVAN, Vice President IoT - Moving Assets, SAP • LUX RAO, Director & Leader, Digital Solutions, Digital Transformation & Consulting, Dimension Data • KRITHIKA SURIANARAYANAN, Vice President, Standard Chartered Bank • VINOD BOGGARAPU, Country Leader - Smarter Cities, IBM Watson IOT • RAVI RAMASWAMY, Sr. Director & Head - Health Systems, Philips • VIKRAM SHARMA, Director, Intel • DINESH PILLAI, CEO & Managing Director, Acquisory (Former CEO, Mahindra Special Services Group) • ALEX JOJO JOSEPH, Program Director, IBM Software Labs • BIBEKANANDA ROY, Senior Information Security Consultant, Mercedes-Benz Research and Development • AKTA JAIN, Director, Enterprise Mobility Engineering, Dell • SUNIL DAVID, Regional Director - IOT (India and ASEAN region), AT&T • ALOK SHARMA, Head - IoT Practice, Manufacturing, Infosys • JOPHY VARGHESE, APAC Head – Strategic SIs & Alliances, Verizon • SIRISH BATCHU, VP - Digital Technology, Ather Energy • MONISHWARAN MAHESWARAN, Math Research, Harvard University (USA) Keynote Speaker, TEDx • BALAKUMARAN JAYAPAL, Principal Architect (Data Analytics and Artificial Intelligence), Panasonic India Innovation Centre • BIPIN PRADEEP KUMAR, Co-Founder, Gaia Smart Cities • HARSHA URLAM, Exp Data Scientist, Boeing • MUSTAMEER AHMED KHAN, Product Manager, SAP • SUHAS SHIVANNA, Distinguished Technologist and Strategist, Hewlett Packard Enterprise • SYAM MADANAPALLI, Global Lead - IoT Delivery, NTT Data KEY THEMES DISCUSSED: • Going forward into the new era of IoT analytics with AI • Investing on data to raise a data-driven result making culture for their consumer as well as organizations • Secret to a successful start-up • Evaluation of the current ecosystem • Future of IoT – Predictions for a Connected World • Building a secure and scalable structure for commercial IoT • Future of energy with AI and Blockchain • AI- powered solution for prosumers • AI for the enterprise: Challenges & Opportunities • Is your enterprise well prepared for the AI revolution • Leveraging digital transformation with AI & deep learning • Deep learning applications to online payment fraud detection • Driving value from enterprise AI and how it is of use to business • What AI is and isn’t for your organization and why your business should care? • Powering digital transformation through AI • How to enable and apply digital business with the help of enterprise AI? • Collaborating IoT, digital transformation & enterprise security • 2019 cybersecurity trends and investment opportunities • Be part of a major networking opportunity WHO SHOULD ATTEND:- Business managers, IT professionals and Channel managers should all be present at the 6th Annual IoT & AI Summit 2019\\. All job titles starting from the top management from the following categories: CISOs, Security Consultants, CTOs, Device Manufacturers, Sensors and Embedded Systems Companies, Systems Integrators, Enterprise Product management and development, Service Providers – Fixed, Wireless and Satellite, Developers, Content and Contact Managers, Technology, Product, Strategy, Storage , Business Analysts, Database/Data Center , Hosting , Training, System and Network Integrators, Data Center Managers, Telecoms and Tech, Compliance and Policy , Network Administrators CONFERENCE SPONSORSHIP: E-mail - kavitha@virtueinsight.co.in in Tel: +9144 24762472 Or M: +91 9940791115 Sponsor, Exhibition Stall (Booth) and a paid Speaker Slots are also available. We also have some sponsorship opportunities available for the event, which gives you an opportunity to sponsor/speak/exhibit, and create brand awareness. In addition, the networking opportunities in focused and relevant industry gathering provide the personal contact necessary for business development efforts. CONFERENCE DELEGATE REGISTRATION: E-mail - kavitha@virtueinsight.co.in Tel: +9144 24762472 OR M: +91 9940791115 • Early Bird Discount (Valid Till 16th May 2019) – (INR 7,000 + GST (18%) per delegate) • Standard (17th May 2019 Onwards) – (INR 10,000 + GST (18%) per delegate) • For Bulk Booking of More Than 5 Delegates – Please contact us for your interests at kavitha@virtueinsight.co.in Get more from the event, with a broader scope bringing the whole communications value chain together. Enjoy and make the best out of our dedicated networking time, meet the leading international vendors showcasing the products of tomorrow in the co-located exhibition. Expand your knowledge of the latest business models and strategies in the high-level conference","date_start":"2019-07-03","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Information-Technology","Biological Engineering & bioinformatics"],"location":{"virtual":"","full":["Bangalore","India"],"name":"","street":"","city":"Bangalore","state":"","ZIP":"","country":"India"},"organizers":[""],"societies":[],"indexes":[],"emails":["kavitha@virtueinsight.co.in"]}