{"name":"Productivity Research Network (PRN) Fourth Conference – Productivity, financial constraints and labour decisions of SMEs","series":"","short":"","website":"https://bschool.nus.edu.sg/strategy-policy/productivity-research-network","content":"\\*\\*\\*\\*\\*Please submit your paper to address: BIZLIUZ@NUS.EDU.SG \\*\\*\\*\\*\\*\\*\\* Productivity Research Network (PRN) Fourth Conference – Productivity, financial constraints and labour decisions of SMEs The University of Sydney, Australia (May 16-17, 2019) PRN is organising its fourth Conference on May 16-17, 2019 at the University of Sydney in Australia. The Conference – cosponsored by the University of Sydney, Macquarie University, and Business School - National University of Singapore (NUS) – is intended to allow regional researchers to learn about existing applied work focusing particularly on the Asia-Pacific region and generate research spill-overs and potential collaborations. The Conference is expected to provide an opportunity to also discuss how the Productivity Research Network (PRN) can provide an impetus for enhancing data collection within the region, aimed at allowing the development of solid research and policy analyses. Professor Ms. Lin TIAN, from INSEAD, will be holding a key-note address. CALL FOR PAPERS The organisation committee invites selected researchers to submit papers for presentation to the 16-17 May, 2019 Workshop in Sydney, Australia. The papers can be either theoretical or empirically based on firm level data, and address one or more of the following topics. Empirical works using the cross-country (Asia/Pacific) PRN firm-level based dataset will be given priority: 1\\. Cross-country comparable productivity measures and methodologies 2\\. Impact of firm’s financial conditions on productivity growth 3\\. The link between productivity and employment at firm level 4\\. Firms’ decisions about workers’ demands in terms of wages 5\\. The relationship between SMEs’ financial condition and decisions about employment and innovative activity 6\\. The ways firms’ financial resources impact upon employment process 7\\. Firms’ risk sharing associated with employment relations when facing risk of illiquidity 8\\. Labour market search and matching process The extended abstracts or papers should be submitted electronically in PDF to BIZLIUZ@NUS.EDU.SG (please indicate in the subject title “Fourth PRN Conference 16-17 May 2019”) by 30 March 2019\\. The Organization/Selection Committee is composed by: Sasan Bakhtiari (Australian Dept. of Industry, Innovation and Science) Gee Hee Hong (IMF) Lisa Magnani (Macquarie University) Filippo di Mauro (NUS) John Romalis (University of Sydney) Ben Charoenwong (NUS) Johan Sulaeman (NUS) Cris Badarinza (NUS) We look forward to see you soon in Sydney! Best Regards, The 4th PRN Conference Organization Committee To know more about PRN, please check our website here: https://bschool.nus.edu.sg/strategy-policy/productivity-research-network/","date_start":"2019-05-16","date_end":"2019-05-17","important_dates":{"abstract":"","full":"2019-03-30","notification":"","final":""},"topics":["Business","Economics"],"location":{"virtual":"","full":["Sydney","Australia"],"name":"","street":"","city":"Sydney","state":"","ZIP":"","country":"Australia"},"organizers":["National University of Singapore, The University of Sydney"],"societies":[],"indexes":[],"emails":["bizliuz@nus.edu.sg"]}