{"name":"Raw Material Requirements (Health Canada/USP/EP) in a cGMP Environment - Issues and Solutions","series":"","short":"","website":"https://www.complianceonline.com/raw-material-requirements-health-canada-usp-ep-in-a-cgmp-environment-issues-and-solutions-seminar-training-80218SEM-prdsm?channel=Brownwalker","content":"Raw material requirements in a cGMP environment are often overlooked as a Company develops new products. Depending upon the product being developed, e.g., tablets and capsules vs. biotechnology products to include recombinant microorganisms and gene therapy products, as few as fifteen to twenty or as many as sixty raw materials need to be sourced before the process can be moved from initiation through completion. This highly interactive two day seminar on raw material requirements in a cGMP environment will: Compare and Contrast FDA, Health Canada, ICH, USP and EP requirements Review latest updates to include FDA, Health Canada, ICH, USP and EP requirements Examine a variety of the issues surrounding raw materials to include what materials should be tested and to what extent during Phase 1, 2, 3 and commercial production. Cover testing requirements during each Phase (Phase appropriate), to include microbial and endotoxin, and what may be optional (regulatory risk) until the product moves to its next Phase. Determine what options exist - even within a Phase 2 or Phase 3 testing framework. Discuss compendial vs. non-compendial testing and how to respond when no method is available. Discuss how a 90 percent vs. a 90.0 percent minimum purity analysis can delay initiation of testing. Explore the number of lots required for testing before reduced testing might occur and why some companies don't accept this route. Review the use of individual samples vs. composite samples for testing. Learning Objectives: Upon completing this course on raw material requirements in a cGMP environment participants will: Understand how various types of raw materials may impact the user. Learn of the impact of raw materials to include any bacterial and endotoxin issues in the timely production of a product. Determine the single most used raw material in large molecule production and what it means to the user. Find the sources of analyses assistance for raw materials. Appreciate the requirements for Phase 1 through commercial manufacturing—why safety is required as part of Phase 1 Initiation of additional testing -- when? Examination of regulatory risk to include ICH Q7, Q9 and Q11\\. Why use compendial testing in lieu non-compendial testing. Testing requirements -- when is enough? Understand packaging and storage requirements and their impact on in-coming materials to include both raw materials and API. The impact of ASQ vs. square root of N+1 on sample size and attribute testing. Who Will Benefit: Those who will benefit from this ON-LINE seminar include: Quality professionals Regulatory professionals Compliance professionals Manufacturing engineers Quality engineers Quality auditors Quality Control Microbiology In-coming Materials","date_start":"2021-08-26","date_end":"2021-08-27","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}