{"name":"2021 International Conference on Economic Management and Internet Technology","series":"","short":"","website":"http://emit.iccsmt.net","content":"2021 International Conference on Economic Management and Internet Technology （EMIT2021）will be held on November 12-14, 2021 in Shanghai, China. As a leading role in the global megatrend of scientific innovation, China has been creating a more and more open environment for scientific innovation, increasing the depth and breadth of academic cooperation, and building a community of innovation that benefits all. These endeavors have made new contribution to globalization and creating a community of shared future. To adapt to this changing world and China’s fast development in this new era, the 2021 International Conference on Economic Management and Internet Technology is to be held in November 2021\\. Organized jointly by over ten universities and academic societies, this conference takes “bringing together global wisdom in scientific innovation to promote high-quality development” as the theme and focuses on cutting-edge research fields including information technology, artificial intelligence, biomedicine, big data, new energy and new materials. This conference aims to boost development of the Greater Bay Area, expand channels of international academic exchange in science and technology, build a sharing platform of academic resources, promote scientific innovation on the global scale, improve academic cooperation between China and the outside world. It also aims to encourage exchange of information on research frontiers in different fields, connect the most advanced academic resources in China and abroad, turn research results into industrial solutions, bring together talents, technologies and capital to boost development.","date_start":"2021-11-12","date_end":"2021-11-14","important_dates":{"abstract":"","full":"2021-11-12","notification":"","final":""},"topics":["Business","Economics"],"location":{"virtual":"","full":["shanghai","China"],"name":"","street":"","city":"shanghai","state":"","ZIP":"","country":"China"},"organizers":["AEIC"],"societies":[],"indexes":[],"emails":[]}