{"name":"Supplier and Contract Manufacturer Management for Medical Device Manufacturers","series":"","short":"","website":"https://www.complianceonline.com/supplier-and-contract-manufacturer-management-seminar-training-80627SEM-prdsm?channel=Brownwalker","content":"This 2-day virtual seminar can help you understand your responsibilities in terms of Purchasing Controls and Supplier Management enabling you to provide safe and effective products to your customers. Learn how to prevent quality and compliance problems by having a strong system for Purchasing Controls! This virtual seminar will help you to understand the regulations and how you can translate them into an efficient and effective process for purchasing/ supplier control. You’ll learn about the essential elements of purchasing control and how you can translate them into your procedures. We’ll discuss the process steps for purchasing control and how it relates to other parts of your QMS including receiving and acceptance activities. Why Should You Attend: Inadequate supplier/purchasing control can lead to a multitude of problems including rejections or delays at receiving inspection; non-conformances and scrap on your manufacturing lines; and quality problems that can manifest later in the field resulting in MDRs and recalls. Purchasing Controls have received significant scrutiny from the FDA in recent years due to an increase in adverse events and recalls. Purchasing Controls continue to be a leading source of 483 and Warning Letter citations. This course will examine real-life warning letters to deepen your understanding of important concepts. Areas Covered: Comparison of Quality System Regulation (21 CFR 820) to ISO13485:2016 Principles of Purchasing Controls and Supplier Management The differences between suppliers, contract manufacturers, contract sterilizers, contract designers, and others Regulatory Expectations How to “Establish and Maintain” a Quality System with Excellent Standard Operating Procedures Practical Approaches to an Efficient and Effective Quality Management System Lessons Learned from Case Studies and Warning Letters Understand QSR 820.50, 820.80, and ISO13485:2016 Understand GHTF guidance Who will Benefit: Quality System Specialists Internal Auditors, Managers, and Directors CAPA Specialists Compliance Managers or Directors Process Owners Quality Managers Supplier Managers Supplier Quality Engineers Supplier Auditors Product and Process Engineers","date_start":"2022-05-09","date_end":"2022-05-10","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}