{"name":"2021 Asia-Pacific Conference on Economics and Finance ‘LIVE’","series":"","short":"","website":"https://apef.ear.com.sg","content":"APEF 2021 is moving forward with a physical event in 2021! We’re pleased to announce that 2021 Asia-Pacific Conference on Economics & Finance (APEF 2021), organized by East Asia Research & supported by Universiti Malaysia Sarawak and Loughborough University, UK, will be live, in-person, in Singapore from December 16-17, 2021! Learn from the masters at the premier conference for the Economics and Finance community. 2021 Conference Theme: International Capital Flows and Foreign Investment There has quite rightly been a strong focus on liberalising international trade in the Asia-Pacific. Much less attention however has been paid to liberalising foreign investment in the region. Yet economic theory suggests foreign investment, through a range of microeconomic and macroeconomic channels, can deliver productivity and national income gains comparable with those stemming from international trade. Questions also arise about whether short term capital flows can be destabilising for economies via foreign exchange, bond and equity markets. This is a good opportunity to meet old friends again and meet new ones for future research collaborations. Limited seating may apply. ‘BUY TICKET’ now. Don’t wait – this rate won’t last long! Due to the persistence of COVID-19, the conference will be conducted in a ‘Hybrid Format’. Participants can make oral/poster presentations onsite or send us pre-recorded video presentations and register as a ‘Virtual Presenter’. They will indicate their preferred presentation medium when they register. The ‘Early Bird Registration Deadline’ is on October 15th 2021\\. What can you expect at APEF 2021? • Ample interaction opportunities for APEF delegates • Top Singapore hospitality for all attending delegates • An intellectually stimulating scientific program featuring more than 100 presentations by leading researchers, teachers, and practitioners • An opportunity for East-West science and practice collaborations at APEF Conference Papers Publishing: Authors are invited to submit their full papers after the conference for inclusion in the Book ‘Economics and Finance Readings- Selected Papers from Asia-Pacific Conference on Economics & Finance, 2021’, to be published by Springer (2019, 2017, 2016 edition). All accepted abstracts will be published in ‘Asia-Pacific Conference on Economics & Finance 2020 Programme & Abstract Book’, ISBN: 978-981-14-4813-3.","date_start":"2021-12-16","date_end":"2021-12-17","important_dates":{"abstract":"","full":"2021-12-16","notification":"","final":""},"topics":["Business","Economics","Economics & econometrics"],"location":{"virtual":"","full":["Singapore","Singapore"],"name":"","street":"","city":"Singapore","state":"","ZIP":"","country":"Singapore"},"organizers":["East Asia Research & Loughborough University & UNIMAS"],"societies":[],"indexes":[],"emails":[]}