{"name":"SELF-REALIZATION FROM THE PERSPECTIVE OF EDUCATION AND CREATIVITY. The relationship between personality and the ideal of life","series":"","short":"","website":" https://artpersonality.webs.com","content":"The conference will take place on Friday, 31 may, 9 a.m., 2019, AULA MAGNA – Romanian Academy, Iasi Branch, Avenue Carol I, no. 8\\. The event, at the Tenth edition, addresses the current and complex problem of individuation process, analyzed from multidisciplinary perspectives. OBJECTIVES: 1\\. The event addresses the complex process of self-realization from the psychological, educational and creative perspective. The ideal of life is integrated into the analysis of this process as an essential, defining element of personality. 2\\. We propose the analysis of this complex psycho-emotional process from the perspective of education as a means of modeling the personality, wanting to discover the abilities and talents, and from the perspective of creativity, which involves the development and actualization of these abilities. 3\\. The concept of self-realization (individuation) belongs to the psychologist and psychiatrist Carl Gustav Jung and refers to the development of personality so that his / her own ideals and aspirations are attained through a sustained and conscientiously oriented effort. A similar concept is the self-actualization described by psychologist Abraham Maslow as a corollary of the individual's development. The conference aims to a broadly presentation and gradual analysis of these concepts, being integrated among the demands of our modern society. 4\\. The topic of the conference reflects the concern for the role of education in the development of individual skills and talents, in cultivating the interest for individual development. The direct link between creativity and self-realization will be analyzed, highlighting the need for educational development of individual creativity. 5\\. We propose the presentation of some philosophical interpretations of self-realization, as the culmination of personal fulfillment, as a way of actualizing the special / unique personality traits, the individual talents. 6\\. The conditions that contemporary society offers to facilitate the self-realization process of the individual through economic and informational means will be analyzed. 7\\. From a psychological point of view, we want to analyze and accentuate the personality traits specific to those who record success: profound specialist knowledge, perseverance, boldness, empathy, renunciation, efficiency in work and the ability to capitalize on the results obtained. We invite to participate teachers and researchers, psychologists, psychotherapists, and students interested in this topic. The papers will be published in a collective volume with academic recognition. We offer nominal Diploma of participation. DEADLINES 25 April, 2019 - for sending title and abstract in English (up to 250 words and 3-5 keywords): 30 April – 20 April, 2019 - acceptance of papers. 10 May, 2019 - for sending full papers (8 to 10 pages, font Times New Roman - 12, format A4, fully justified, margins Normal. Bibliography: author, year, title, editor.) We ask participants to comply with the deadlines for submitting materials. All documents will be sent electronically to the following e-mail: acadconference@yahoo.ro or marinela.rusu@ices.acadiasi.ro The papers will meet the proposed theme and must not have been previously published. Each author can participate with a maximum of two papers.","date_start":"2019-05-31","date_end":"2019-06-01","important_dates":{"abstract":"","full":"2019-05-10","notification":"","final":""},"topics":["Social Sciences","Psychology","Education, teaching"],"location":{"virtual":"","full":["Iasi","Romania"],"name":"","street":"","city":"Iasi","state":"","ZIP":"","country":"Romania"},"organizers":[""],"societies":[],"indexes":[],"emails":["acadconference@yahoo.ro","marinela.rusu@ices.acadiasi.ro"]}