{"name":"Experiential Design – Rethinking relations between people, objects and environments","series":"","short":"","website":"https://architecturemps.com/florida","content":"This conference explores how user oriented design is essential for the design of products, spaces and computer interfaces that have benefits for health, well-being and learning. It is interested in perspectives from multiple fields, including: Interiors | Products | Education | Psychology | Health | Furniture | Wellbeing | Art | Architecture | Universal Design | Urbanism | Landscape | Occupational Therapy - Keynotes: Chris Downey. Architecture for the Blind | Angela Spangler. International WELL Building Institute - Outline: The World Institute of Psychology identifies multiple links between mood, behavior and learning, and the objects and spaces we interact with and occupy daily. The World Health Organization considers questions like the global increase in dementia as issues that can be tackled, in part, through design. The National Institute on Disability and Rehabilitation Research underlines how environments can actively exclude whole sections of society by design itself. The Effective Learning Environments initiative of the OECD aims to improve learning environments for the 21st century. At the same time, the Industrial Designers Society of America sees product design in the light of inclusivity for people of all abilities, geographies and cultures and the US Department of Arts and Culture argues art has a three-fold role to play in nurturing a culture of health: prevention, advocacy and treatment. The American Institute of Architects lists user experience and inclusivity as essential components of design education and thinking, while the Interior Design Educators Council highlights ‘human orientated design’ as essential to good practice in all fields, whether that be the design of schools, classrooms, health spaces, retail, offices or the home. In this now well intricate and integrated context, this conference offers a unique invitation to engage in cross disciplinary discourse around the role of people, objects and environments and how our individual practices and professions are, in reality, inseparable from each other.","date_start":"2020-01-16","date_end":"2020-01-17","important_dates":{"abstract":"","full":"2019-11-20","notification":"","final":""},"topics":["Engineering & Technology","Design","industrial engineering & design"],"location":{"virtual":"","full":["Tallahassee","Florida","United States"],"name":"","street":"","city":"Tallahassee","state":"Florida","ZIP":"","country":"United States"},"organizers":["Florida State University / AMPS"],"societies":[],"indexes":[],"emails":[]}