{"name":"5th Annual Pharma Regulatory Summit 2022 (Virtual Conference)","series":"","short":"","website":"https://www.virtueinsight.com/pharma/5th-Annual-Pharma-Regulatory-Summit-2022-Virtual-Conference","content":"5th Annual Pharma Regulatory Summit 2022 09th & 10th March 2022, Virtual Conference (Time Zone – IST) Join 5th Annual Pharma Regulatory Summit 2022 to discuss multi-regional cooperation, global harmonization and best practices related to India’s regulatory landscape. Sessions will highlight regulatory approaches and good practices to ensure certainty in India and strategic initiatives to improve collaboration and cooperation. DELEGATE REGISTRATION: E-mail - kavitha@virtueinsight.co.in or Call M: +91 9361957193 or +91 44 24762472 Please note that this is a PAID event and NOT A FREE event (no complimentary passes available). Any invite, email or tickets issued mentioning it as a free pass or free ticket to this event through any third party site will strictly not be accepted by the organizer. • Early Bird Discount Price (Valid Till 24th January 2022) – (INR 7,000 + GST (18%) per delegate) • Standard Price (Valid From 25th January 2022) - (INR 9,000 + GST (18%) per delegate) Conference Sponsor, Exhibition Stall & Paid Speaker Slot - Please email your interest and queries to kavitha@virtueinsight.co.in KEY SPEAKERS: • RAJENDRA SANGHAVI, Sr. Consulting Clinician & Chairman - Medical Committee, Indian Drug Manufacturers' Association (IDMA) • RASHMI HEGDE, Executive Vice President Medical Affairs, GSK • AMIT BHARGAVA, Vice- President and Head- Medical Services, Lupin • PRASANNA BANGALE, Vice President and Head, Global Regulatory Affairs, Alembic Pharmaceuticals • PRATIK SHAH, Vice President Medical Affairs, Bharat Serums and Vaccines • NAVANEETHA SELVAN, Associate Vice President - Global Regulatory Affairs, Wockhardt • SANJAY SHARMA, Vice President Technology Transfer, Lupin • MANISH MISTRY, Medical Director, Novartis • VAIBHAV CHOUDHARY, Joint Director, Medical and Clinical Affairs, Fresenius Kabi Oncology • RAJESH KHER, Director, Business Operations, Regulatory Medical Writing, Janssen • ANJU AGARWAL, Director Global Patient Safety, Advanz Pharma • KRANTHI KIRAN PEBBILI, Director and Cluster Head - Medical Affairs, Dr. Reddy’s Laboratories • SHIRAZ KANDAWALLA, Associate Director - Regulatory Affairs, Abbott • AMEY MANE, Director Medical Affairs, Dr. Reddy's Laboratories • PRAVEEN KUMAR L, Director - Regulatory Affairs, Cipla • YATEEN SHAH, Director - Regulatory Affairs & Quality, Johnson & Johnson • KAVITA LAMROR, Director, Real World Investigator, Digital Function, Sanofi • VIPUL JAIN, Associate Director - SCM Integrated Business Planning, Cipla • SHAHU INGOLE, General Manager, Head Medical Affairs, Wockhardt • MANGALA KOTNIS, Head Regional Medical Affairs, Abbott • VAIBHAV SALVI, Head – Medical Information, Asia, Sanofi • VICKRAM SRIVASTAVA, Head of Planning - Global Supply Chain, Sun Pharma • SADANAND KULKARNI, Head-Medical, Regulatory, Vigilance, Quality, Fresenius Kabi • VARSHA KHATRY, Head Medical and Scientific Affairs, Quality and Regulatory, Roche • GEETA SHANBHAG, Sr. General Manager – Pharmacovigilance & Medico-Regulatory Affairs, Ipca Laboratories • RAJENDRA JANI, Senior Subject Expert & Advisor, Clinical Research Consultant • SANJIV DONWALKAR, Head - Operational Excellence, Novartis • ASHWANI PANDITA, General Manager - Clinical Quality Management & Training, Glenmark • RAVI GAWARE, Head of Clinical Operations, Novo Nordisk • GANESH KADHE, Senior Leadership Team Member, Scientific & Medical Affairs, Abbott Nutrition • APARNA PRABHUNE, Asst General Manager Regulatory Affairs, Wockhardt • SUDIPTO BASU, Senior Manager - Demand Planning, Boehringer Ingelheim • INDRANIL PURKAIT, General Manager and Head Medical Affairs, Ipca Laboratories • MANJIRI WARANG, Medical Writing - Clinical Development, Sun Pharma Plus many more joining soon KEY THEMES DISCUSSED: • The new normal for clinical development regulatory practices - Staying ahead of regulatory changes • Lessons to learn from Covid pandemic - Potential benefits and risks of regulatory flexibility Striking the balance • Present regulatory system for growth and effective production of medicinal products • New regulations in Pharmacovigilance and the way forward • The role of technology within regulatory compliance • Prioritizing patient safety regulations • Discussing how to ensure operational performance in compliance with the aim of better regulation • New changes in Drug Supply Chain Security Act (DSCSA). • Recent developments in GCP. How to succeed with this? • Usage of mobile apps and medical devices in clinical trials – regulatory challenges • RWE implementation in clinical trials. What are the challenges, chances and curses? • Moving to electronic package-level traceability system – steps and barriers. • Regulatory issues and maintaining quality in medical writing. • Regulatory environment for medical devices in India as per 'New Medical Devices Rules'? • Relationship between regulatory and technology in medical devices? A better understanding. • What are the critical regulatory aspects for biotech companies? What should they look out for? • Biosimilars market regulation, what are the benefits and drawbacks? • Understanding the CGMPs under post pandemic. What changes will take place in priorities? • Effective plans to maintain manufacturing and packing drug product methods under CGMPs? • Ways to improve the combination of quality, safety and effectiveness in manufacturing. • Be part of a both (together and one) virtual networking opportunity WHO SHOULD ATTEND AND WHO YOU’LL MEET: This conference is specifically designed for Pharma, biotech, CRO’s, Government and Regulators, Hospitals/Trial Sites, Technology & Solution Providers and medical device professionals responsible for: • Regulatory Affairs • Regulatory Writing/Medical Writing/Publishing/Information/Submissions • Document and e-Records Management • Business Operations/Processing Labelling • Clinical Trials Management/Data • Clinical Data • Outsourcing/Clinical Outsourcing/Vendor Management • Product Development • Quality Assurance/Quality Control • Patient recruitment companies • Government- Department of health • Non-profit organizations/ Association, Consultants Get more from the event, with a broader scope bringing the whole communications value chain together. Enjoy and make the best out of our dedicated networking time, meet the leading international vendors showcasing the products of tomorrow in the co-located exhibition. Expand your knowledge of the latest business models and strategies in the high-level conference","date_start":"2022-03-09","date_end":"2022-03-10","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal","Pharmacology & Pharmaceuticals"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":[""],"societies":[],"indexes":[],"emails":["kavitha@virtueinsight.co.in"]}