{"name":"Unemployment Insurance: Managing Key Issues in the Response to the Implications of the Coronavirus","series":"","short":"","website":"https://bit.ly/2UlGSiK","content":"More than 38 million Americans have become unemployed…and the number is still rising. This represents a catastrophic employment disruption and is a significant loss of employment talent. In response, more than 1 in 5 American workers have filed for unemployment insurance benefits…with many more are likely to do so. For employers, this represents significant potential liability. While 2020 state UI tax rates have already been set and are lower than they have been in a number of years, the depression level unemployment caused by the coronavirus, will cause unemployment tax rates and liabilities to increase drastically in 2021 and 2022\\. In this environment, employers should take the necessary steps to identify and manage future UI tax liabilities.Understanding the key elements of your unemployment insurance experience can provide your organization with important information about its financial and human resource management decision making process Why Should You Attend Unfortunately, UI tax liabilities are only the most obvious risk created by employee separations and unemployment insurance claims. Unemployment insurance claims often expose organizations to other potential liabilities: from wage and hour violations for misclassifying independent contractors to providing plaintiffs with discovery opportunities in other employment litigation settings. Thus, effective management of your organization’s unemployment insurance experience can provide you with the opportunity to improve your talent management results, improve your hiring and onboarding processes, enhance your performance management and discipline procedures, and reduce your exposure to discrimination and wrongful discharge claims. Effective UI management allows your organization to use UI metrics to assess human capital risks, measure supervisor and manager performance, more accurately allocate resources, and have a positive impact on the bottom line. This webinar provides an update on federal and state UI issues, discusses the impact of the coronavirus, discusses 2020 and future state tax liabilities, assesses the risks and costs associated with UI taxes and benefits, and discusses effective UI tax management and cost control techniques. Areas Covered in the Session » Federal unemployment insurance issues » The CARES Act and its implications » State unemployment insurance issues » Key tax issues to be managed » Key UI benefit issues to be addressed » How UI issues affect your organization’s financial, managerial, and legal management Who Will Benefit » Human resources managers » Internal and external auditors » CEO and CFOs » Risk managers » Compliance managers » VPs, GMs, Directors, Division Heads, Senior Managers, and Coordinators To Register (or) for more details please click on this below link: https://bit.ly/2UlGSiK Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2020-12-09","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Human-Resources"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["AbideEdict"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}