{"name":"7th International Conference on Bioimaging - BIOIMAGING 2020","series":"","short":"","website":"http://www.bioimaging.biostec.org","content":"Bioimaging is a term that covers the complex chain of acquiring, processing and visualizing structural or functional images of living objects or systems, including extraction and processing of image-related information. Examples of image modalities used in bioimaging are many, including: X-ray, CT, MRI and fMRI, PET and HRRT PET, SPECT, MEG and so on. Medical imaging and microscope/fluorescence image processing are important parts of bioimaging referring to the techniques and processes used to create images of the human body, anatomical areas, tissues, and so on, down to the molecular level, for clinical purposes, seeking to reveal, diagnose, or examine diseases, or medical science, including the study of normal anatomy and physiology. Both classic image processing methods (e.g. denoising, segmentation, deconvolution and registration methods, feature recognition and classification) and modern machine, in particular deep, learning techniques represent an indispensable part of bioimaging, as well as related data analysis and statistical tools. \n The International Conference on Bioimaging encourages authors to submit papers to one of the main topics indicated below, describing original work, including methods, techniques, advanced prototypes, applications, systems, tools or survey papers, reporting research results and/or indicating future directions. Accepted papers will be presented at the conference by one of the authors and published in the proceedings. Acceptance will be based on quality, relevance and originality. There will be both oral and poster sessions. The proceedings will be indexed by several major international indexers. Special sessions are also welcome. Please contact the secretariat for further information on how to propose a special session. \n Conference Topics: \n Area 1: BIOIMAGING \n \\- Medical Imaging and Diagnosis \n \\- Single-Photon Emission Computed Tomography (SPECT) \n \\- Positron Emission Tomography (PET) \n \\- High Resolution Research Tomography (HRRT) \n \\- Magnetoencephalography (MEG) \n \\- Ultrasound and Optical Imaging \n \\- Optical Elastography \n \\- X-ray Microscopy \n \\- Biophotonics \n \\- Fluorescence Resonance Energy Transfer (FRET) \n \\- Conventional Microscopy \n \\- Image Processing Methods \n \\- Confocal Microscopy \n \\- Fluorescent Microscopy \n \\- Quantitative Bioimaging \n \\- Brain Function Analysis \n \\- Hemodynamics Imaging \n \\- Histology and Tissue Imaging \n \\- Image Fusion Methods \n \\- Feature Recognition and Extraction Methods \n \\- Biomechanical Imaging \n \\- Magnetic Resonance Imaging (MRI) \n \\- Functional Magnetic Resonance Imaging (Fmri) \n \\- Applications of Machine Learning \n \\- Deep Learning in Bioimaging \n \\- X-ray Imaging ","date_start":"2020-02-24","date_end":"2020-02-26","important_dates":{"abstract":"","full":"2019-10-04","notification":"","final":""},"topics":["Life Sciences","Biotechnology/ Bioinformatics"],"location":{"virtual":"","full":["Valletta","Malta"],"name":"","street":"","city":"Valletta","state":"","ZIP":"","country":"Malta"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":[]}