{"name":"An Advanced Course on Lean Documents, Lean Configuration and Document Control","series":"","short":"","website":"https://www.complianceonline.com/lean-documents-and-document-control-fda-requirements-webinar-training-701653-prdw?channel=Brownwalker","content":"In this training, learn the different types of lean documents and the usage of lean document principles; types of controlled documents; examples of lean and non-lean controlled documents. Pros and cons of lean vs. non-lean documents. Why Should You Attend: Controlled documents are the result of a business process, just as a manufacturing process generates a product. A document cannot move ahead if it is waiting for information or if its use is restricted by other documents, just as a product cannot move forward if it is waiting for component parts. Despite the fact that many life science businesses push for lean manufacturing, lean laboratories, and lean operations, they have cumbersome controlled documents and systems that add to operating costs and make it impossible to implement process innovations on a timely basis. This webinar covers critical topics for integrating lean principles while staying in control and adhering to regulations. It will teach you how to use lean manufacturing principles, the theory of constraints, the DHF, DMR, and DHR, as well as how to design a lean DHF, DMR, and DHR. Areas Covered in the Webinar: Definition of lean documents. Problems with traditional document approach. Applying lean manufacturing principles. Applying Theory of Constraints. Design History File. Device Master Record. Device History Record. Typical challenges and how to overcome them. Examples of various types of lean documents. Use of lean document principles; types of controlled documents; examples of lean and non-lean controlled documents. Pros and cons of lean vs. non-lean documents. How traditional document approach generates waste. Clues from Theory of Constraints and Lean Manufacturing. What a lean document approach would have. Creating a lean Design History File. Creating a lean Device Master Record. Creating a lean Device History Record. Preparing to configure an electronic document system. Who Will Benefit: This webinar will provide valuable insights to design engineers, manufacturing engineers, operations managers, quality system managers, and document control managers Project leaders implementing an electronic document system Functional managers QA managers Lean Project Managers","date_start":"2022-03-02","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}