{"name":"The 8th Int'l Conference on Thin Film Technology and Applications (TFTA_D 2021)","series":"","short":"","website":"http://www.janconf.org/conference/TFTA_D2021","content":"The 8th Int'l Conference on Thin Film Technology and Applications (TFTA\\_D 2021) Conference Date: December 24-26, 2021 Conference Venue: Sanya, China Website: https://www.janconf.org/conference/TFTA\\_D2021/ Online Registration System: https://www.janconf.org/RegistrationSubmission/default.aspx?ConferenceID=1425 Email: workshop1@126.com The 8th Int'l Conference on Thin Film Technology and Applications (TFTA\\_D 2021) will be held from December 24-26, 2021 in Sanya, China. This Conference will cover issues on Thin Film Technology and Applications. It dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal，please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: workshop1@126.com (Workshop\\_editorL@outlook.com) Tel: +86 132 6470 2250 QQ: 1349406763 WeChat: 3025797047 Twitter: conf\\_Committee Attendance Methods 1.Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Thin film materials Ferroelectric film Magnetic film Organic and polymer film Bioengineering film Semiconductor and Superconductor film Materials of Optical Coating Graphene Technology of thin film Deposition, epitaxy and coating Sol-gel and LB technology Device and integration Micro/Nano-fabrication Surface treatment and Interface control Characterization Applications of thin film Micro/Nano-electronics and MEMS Optoelectronics and Photonics Information Storage Display and Sensor Solar cell/LED EUV-Soft-X-ray multilayers Laser Resistant coatings","date_start":"2021-12-24","date_end":"2021-12-26","important_dates":{"abstract":"","full":"2021-11-24","notification":"","final":""},"topics":["Engineering & Technology","Material/Nanotechnology","Thin Film Technology"],"location":{"virtual":"","full":["Sanya","China"],"name":"","street":"","city":"Sanya","state":"","ZIP":"","country":"China"},"organizers":["Academic Communications"],"societies":[],"indexes":[],"emails":["workshop1@126.com","_editorl@outlook.com"]}