{"name":"Gender Studies Summer School","series":"","short":"","website":"https://genderstudies.lcir.co.uk/gender-studies-summer-school","content":"Study in London this summer! Spend an amazing week in London and learn about gender across different disciplines – literature and culture, philosophy and sociology, media and communication, history and political science, religious studies and education. Topics to be covered include: human rights and (in)equality, gender and migration, gender and violence, gender and creativity, gender and beauty, ecofeminism, anti-feminism and many more. Our team of international scholars will enhance your knowledge and facilitate dialogue and discussions. We are looking forward to applications from students, researchers and professionals with a particular interest related to gender studies. The course will allow you to deepen theoretical and methodological knowledge and critical thinking in gender studies. Participants will be encouraged to make a short presentation exploring a topic related to gender studies and participate in roundtable discussions. A Certificate of Completion will be provided by the end of the week. Registration fee for online participation is 290 GBP. If physical participation becomes possible by July 2021, those who are interested in this format will be able to pay an additional fee to join us in our London venues. In order to book a place, please fill in the Booking Form and send it to genderstudies@lcir.co.uk. After you receive a confirmation of booking, please register on https://registration.lcir.co.uk. Deepen your knowledge, enhance your skills and get inspired by lectures, workshops, discussions and tours. Experience London with us!","date_start":"2021-07-08","date_end":"2021-07-13","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Social Sciences","Gender/Sexuality","gender studies (and womens)"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research and Academic LAB"],"societies":[],"indexes":[],"emails":["genderstudies@lcir.co.uk"]}