{"name":"9th International Conference on Model-Driven Engineering and Software Development - MODELSWARD 2021","series":"","short":"","website":"http://www.modelsward.org","content":"9th International Conference on Model-Driven Engineering and Software Development MODELSWARD website: http://www.modelsward.org February 8 - 10, 2021 Vienna, Austria In Cooperation with: IEM Proceedings will be submitted for indexation by: SCOPUS, Google Scholar, DBLP, Semantic Scholar, Microsoft Academic, EI and Conference Proceedings Citation Index. IMPORTANT DATES: Regular Paper Submission: September 14, 2020 Authors Notification (regular papers): November 12, 2020 Final Regular Paper Submission and Registration: November 26, 2020 Position Paper Submission: October 29, 2020 Authors Notification (position papers): December 4, 2020 Final Regular Paper Submission and Registration: December 18, 2020 Scope: The purpose of the International Conference on Model-Driven Engineering and Software Development, MODELSWARD 2021, is to provide a platform for researchers, engineers, academics as well as industrial professionals from all over the world to present their research results and development activities in using models and model driven engineering techniques for Software Development. Model-Driven Development (MDD) is an approach to the development of IT systems in which models take a central role, not only for analysis of these systems but also for their construction. MDD has emerged from modelling initiatives, most prominently the Model-Driven Architecture (MDA) fostered by the Object Management Group (OMG). In the scope of MDA, a couple of technologies have been developed that became the cornerstones of MDD, like metamodelling and model transformations. MDD relies on languages for defining metamodels, like the Meta-Object Facility (MOF) and Ecore (developed in the scope of the Eclipse Modelling Framework), and transformation specification languages like QVT and ATL. MDD is already around for some years and is about to become commodity in software development due to its benefits (reduction on development costs, improvement of software quality, reduction of maintenance costs and the support for controlled evolution of IT systems). MDD has also been applied in many application areas, such as real-time and embedded systems, and telecommunication systems, and, more recently, to the development and integration of enterprise information systems. However, the MDD research community is wishing to explore the bounds of MDD, by investigating new applications areas and combinations with other emerging technologies, like, for example, pervasive context-aware systems, semantic web, semantic web services, service-oriented architecture, ontologies and cloud computing. This conference aims at fostering the further development and application of MDD techniques for software systems. Papers describing advanced prototypes, systems, tools and techniques and general survey papers indicating future directions are also encouraged. Papers reporting on original work in any of the areas listed below are welcome. Accepted papers, presented at the conference by one of the authors, will be published in the Proceedings of MODELSWARD. The submitted papers will be reviewed by at least three experts in this area, and acceptance will be based on quality, relevance and originality. The conference is open to full research and (short) work-in-progress papers. Sessions are planned for both oral and poster presentations. Conference Topics: Area 1: Methodologies, Processes and Platforms - Agile Model-Driven Development - Business Process Modeling - Frameworks for Model-Driven Development - Multi-level and Multi-view Modeling - Model Transformations and Generative Approaches - Artificial Intelligence (AI) for Modeling Support - Software Process Modeling, Enactment and Execution - Systems Engineering Area 2: Applications and Software Development - Component-Based Software Engineering - Data Mining Applications - Model-Driven Software Product Lines - Executable UML - Automated Code Generation - Model Execution and Simulation - Model Quality - Model-Based Testing and Validation - Model Management - Modeling for AI Applications - Model-Driven Development of Cyber Physical Systems Area 3: Modeling Languages, Tools and Architectures - Constraint Modeling and Languages - Domain-Specific Modeling - General-Purpose Modeling Languages and Standards - Metamodeling: Foundations and Tools - Model Transformation - Model-Driven Architecture - Reasoning about Models - Model-Driven Software and Services Infrastructures - Syntax and Semantics of Modeling Languages MODELSWARD CONFERENCE CHAIR: Edwin Seidewitz, Model Driven Solutions, United States MODELSWARD PROGRAM CO-CHAIRS: Slimane Hammoudi, ESEO, ERIS, France Luis Ferreira Pires, University of Twente, Netherlands PROGRAM COMMITTEE http://www.modelsward.org/ProgramCommittee.aspx MODELSWARD Secretariat Address: Avenida de S. Francisco Xavier, Lote 7 Cv. C Tel: +351 265 520 185 Fax: +351 265 520 186 Web: http://www.modelsward.org e-mail: modelsward.secretariat@insticc.org","date_start":"2021-02-08","date_end":"2021-02-10","important_dates":{"abstract":"","full":"2020-09-14","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Vienna","Austria"],"name":"","street":"","city":"Vienna","state":"","ZIP":"","country":"Austria"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["modelsward.secretariat@insticc.org"]}