{"name":"MEMORY, FORGETTING AND CREATING - 3rd International Interdisciplinary Conference","series":"","short":"","website":"https://memoryforgetting.ug.edu.pl/en/about_conference","content":"CFP: In our increasingly fast-paced societies, where information is abundant and i:s reception is superficial, human memory appears to be an endangered phenomenon. This is why we would like to take a closer look at the complex processes of memory. These include forgetting, neglecting, negation, and detachment, along with creating, recollecting, remembering, regaining memories, and reconstructing one’s relationship with the past. We are deeply interested in examples and consequences of altered memories: invention, fabrication, deception, indoctrination or propaganda. We invite reflection on mutual relations between memory and imagination, fantasising and manipulating, forgetting and creating. We would like all these problems to be contextualised as broadly as possible, with reference to historical, social, religious, cultural, psychological, artistic and other factors. Different forms of presentations are encouraged, including case studies, theoretical investigations, problem-oriented arguments, and comparative analyses. The conference is intended as an interdisciplinary event. Hence, we invite researchers representing various academic disciplines: anthropology, history, sociology, philosophy, psychology, psychoanalysis, neurophysiology, literary studies, theatre studies, film studies, memory studies, consciousness studies, dream studies, gender studies, postcolonial studies, animal studies, medical sciences, psychiatry, social policy, cognitive sciences and others. We will be happy to hear from both experienced scholars and young academics at the start of their careers, as well as doctoral and graduate students. We also invite all persons interested in participating in the conference as listeners, without giving a presentation. We hope that due to its interdisciplinary nature, the conference will bring many interesting observations on and discussions about the role of memory in the past and in the present-day world. Our repertoire of suggested topics includes but is not restricted to: 1\\. Lost Memory: - forgotten history - forgotten nations - forgotten heroes - forgotten legacy - forgotten times - forgotten revolutions - forgotten identity - forgotten authors - forgotten texts - forgotten languages 2\\. Memory Loss: - amnesia - Alzheimer’s disease - dementia - sclerosis - selective memory - repression - psychopathology of everyday life 3\\. Stolen Memory: - denationalisation - eradication - expulsion - disinheritance - exclusion - manipulation - propaganda - indoctrination - Holocaust (and other genocide) denial - “historical politics” - “cultural revolution” 4\\. Abandoned Memory: - non-action - negligence - indifference - insouciance - decline of attachment - emotional atrophy - disownment - betrayal 5\\. Memory as a Trap: - the terror of memory - trauma - post-memory - memory and mourning - nostalgia - fixation - the return of the repressed - “primal scenes” - compulsions - stereotypes 6\\. Memory Regained: - recollection - anamnesis - insight - epiphany - “time regained” 7\\. Dubious Memory: - déjà vu - confabulation - fabrication - rumour - apocryph - parallel histories 8\\. Memory and Imagination: - facts and phantasms - political phantasms - historiography and fantasising - the realness of memories - national mythologies - reconstructions and narrations - memory and representation - memory and fiction - non-fiction - autobiography - para-documentary film - imagination in mnemonics - collective memory and collective imagination 9\\. Memory and Art: - literature, art, film, theatre as memory “media” - socially engaged art: artists in defence of memory - Joseph Conrad and Heart of Darkness - Marcel Proust and In Search of Lost Time - Thomas Mann and The Magic Mountain - Gabriel Garcia Marquez and One Hundred Years of Solitude - Tadeusz Kantor and the “cliches of memory” 10\\. Memory and Science - mirror Neurons - diseases and syndromes of memory - “creating memory” in the lab - memory of matter (inorganic memory) - memory processing in technology Please submit abstracts (no longer than 300 words) of your proposed 20-minute presentations, together with a short biographical note, by 7 August 2019 to: inconferenceoffice@gmail.com The conference language is English.","date_start":"2019-09-19","date_end":"2019-09-20","important_dates":{"abstract":"","full":"2019-08-07","notification":"","final":""},"topics":["Social Sciences","Psychology","interdisciplinary"],"location":{"virtual":"","full":["Gdansk","Poland"],"name":"","street":"","city":"Gdansk","state":"","ZIP":"","country":"Poland"},"organizers":["InMind Support"],"societies":[],"indexes":[],"emails":["inconferenceoffice@gmail.com"]}