{"name":"Managing GMP Compliance and Phase Appropriate GMP Considerations for Virtual Companies","series":"","short":"","website":"https://www.complianceonline.com/fda-gmp-expectations-phase-i-first-in-man-clinical-trials-iso-9001-2015-qms-cmc-seminar-training-80366SEM-prdsm?channel=Brownwalker","content":"This program combines general considerations for Good Manufacturing Practice (GMP) compliance management with the principles of phase-appropriate GMP considerations, with an emphasis on needs of virtual companies. (“Virtual companies” are those who outsource GMP operations to Contract Manufacturing Organizations (CMOs) and Contract Analytical Laboratories.) Virtual companies typically do not conduct “hands on” manufacturing, but do perform tasks which are governed by GMP, for example, dispositioning final product, managing the supply chain, investigating complaints, and providing training to staff in GMP compliance concepts. Such companies often struggle to decide how to structure their quality management system, which procedures they need or do not need, and how to best manage vendor relationships. In addition, the application of GMP requirements to the manufacture of investigational products requires exercise of judgement over the life cycle from early phase (Phase 1) to peri-approval (late Phase 3). Understanding what is required by FDA and other regulatory agencies is important to assure timely approval, since GMP compliance issues can result in approval delays. In this two half-day workshop conference you will learn how GMP applies directly to virtual company operations, how to best structure a quality management system in a virtual company, and a method to decide which procedures are necessary at what points in time. You will also learn best practices for quality agreements and vendor management. In addition, you will learn the current guidance from FDA for application of GMP to the manufacture of Phase 1, 2 and 3 clinical trial materials. Though FDA requirements are the primary emphasis, some discussion of EMA (European) requirements and other venues will also be included. Learning Objectives: Upon completing this course participants should: Understand the fundamentals of GMP for the United States Understand how to determine what GMP-governed operations you are performing internally versus what you are outsourcing Understand a method to structure your quality management system and decide which procedures you need now versus which ones can wait Understand best practices for vendor management Learn how to apply GMP concepts to Phase 1, 2 and 3 investigational drugs Learn the differences between an FDA GMP inspection, a Pre-Approval Inspection and a Pre-License Inspection and where to obtain guidance for each Understand basic principles of FDA inspection authority, what to expect if FDA inspects your virtual firm, and how to manage the presence of FDA personnel on site Who will Benefit: This course is designed for persons responsible for GMP compliance management following a virtual model, both pre- and post-market. Though designed with small company needs in mind, the principles are also useful to those in larger companies who manage CMOs, particularly those manufacturing investigational drug API and finished products: Senior quality managers Quality professionals Regulatory professionals Compliance professionals Production supervisors Manufacturing engineers Production engineers Quality engineers Quality auditors","date_start":"2021-08-25","date_end":"2021-08-26","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}