{"name":"Data Integrity: FDA, WHO and EMA's Requirements","series":"","short":"","website":"https://www.complianceonline.com/data-integrity-fda-who-ema-cgmp-seminar-training-80397SEM-prdsm?channel=Brownwalker","content":"Data Integrity has become a non-compliance area often observed by the FDA and reported within Form FDA 483s and Warning Letters. While various governments have observed this on a world-wide basis, the FDA has been reporting its occurrence off-shore with a greater frequency than usually observed within the United States. A lack of Data Integrity hints of a Company being outside of compliance and questions the quality of the product being produced. Often the initial \"hint\" of an off-shore problem occurs within FDA \"circles\" when one first observes an \"Import Alert\". These Import Alerts don't offer much information other than the country, the Company and the product. However, this becomes a tell-tale signal that a Warning Letter will most likely be issuing within three to four months. Data Integrity issues may represent very simplistic issues that any auditor may readily observe to those that are so complex that only someone very skilled in the art of auditing can readily find them. During this two day seminar various examples of Data Integrity issues will be reviewed to include how and where to locate them during audits. In addition, breakout sessions will be held to learn from each other and other teams as they review the same data and compare their findings. Interestingly, conclusions developed by the various teams often differ from each other. Several documents have recently been published by the FDA, MHRA and WHO. The FDA Guidance for Industry, \"Data Integrity and Compliance with CGMP\" was published as a DRAFT guidance in April 2016\\. This Guidance was issued to clarify the role of Data Integrity in CGMP for drugs. In March 2015, the MHRA published a Guidance entitled \"MHRA GMP Data Integrity Definitions and Guidance for Industry\" which mirrored the 2016 FDA document. Other documents include ‘GXP’ Data Integrity Guidance and Definitions” in March 2018 and “Data Integrity and Compliance With Drug CGMP, Questions and Answers in December 2018”. Various source documents to include 21 CFR 210/211, FDA Guidances for Industry, Standard Industry Practices and other International sources will be used to support the conclusions developed by each team during this two day seminar. Learning Objectives: Upon completing this course participants should: Assure your understanding of the fundamental causes of Data Integrity issues Be able to identify these key elements Understand how cGMP regulations impact Data Integrity issues Understanding the various inspection approaches to monitor for Data Integrity Learn how to determine the regulatory requirements required to assure Data Integrity Understand the consequences of questionable data and how they may lead to seizures, import alerts, etc Who Will Benefit: Those that will benefit from this program include anyone involved in the incoming materials, manufacturing, laboratory and packaging process within a non-sterile/aseptic pharmaceutical environment. Quality professionals Regulatory professionals Compliance professionals Manufacturing engineers Quality engineers Quality auditors Quality Control Microbiology Document control specialists","date_start":"2021-10-28","date_end":"2021-10-29","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}