{"name":"When and How to Use Zero Acceptance Number Sampling","series":"","short":"","website":"https://bit.ly/3pb9XdF","content":"Traditional acceptance sampling plans (ANSI/ASQ Z1.4, formerly MIL-STD 105) have fixed sample sizes along with acceptance numbers that are often greater than zero. As an example, a plan may require the inspection of 80 parts with acceptance of the lot if 2 or fewer nonconforming items are found. If the producer is confident that its quality far exceeds the specified acceptable quality level (AQL), however, it can reduce the necessary inspection by using a zero acceptance sampling plan in which the lot fails if even one nonconforming item is found, but a far smaller sample size is necessary to provide the customer with the same level of protection against bad quality. Why Should You Attend Inspection is a necessary but non-value-adding activity whose purpose is to protect the customer from poor quality, in this case production lots with a high proportion (as defined by the specified acceptable quality level, AQL) of nonconforming items. Less inspection is therefore better as long as the inspection plan protects the customer from poor quality shipments. When the producer's quality far exceeds the AQL, i.e. the nonconforming fraction is much lower than the specified AQL, inspection can be reduced enormously with a zero acceptance number sampling plan. This webinar will show how to convert any ANSI/ASQ Z1.4 plan into a zero acceptance plan that offers comparable protection, as demonstrable to the customer with the operating characteristic (OC) curve for the two plans Objectives of the Presentation » Understand the specifications and characteristics of a traditional ANSI/ASQ Z1.4 sampling plan. » Understand the benefits of double and multiple sampling in terms of lower average sample number (ASN), and that c=0 plans have even lower ASNs (but higher producer's risks of rejecting lots at the AQL). » Know how to convert an ANSI/ASQ Z1.4 plan into a zero acceptance number sampling plan to minimize ASN. » Know how to demonstrate to the customer that the zero acceptance number plan provides protection better than the ANSI/ASQ Z1.4 plan. Areas Covered in the Session » Inspection is a necessary but non-value-adding activity. Less is therefore better, but the inspection plan must protect the customer from poor quality. » The traditional ANSI/ASQ Z1.4 plan is based on the acceptable quality level (AQL), lot size, and inspection level. It is defined by a sample size n and an acceptance number c. This means to inspect n items and reject the lot (e.g. for 100% sorting or rectification) if more than c nonconforming items are found. » An ANSI/ASQ Z1.4 plan can be converted into a zero acceptance plan as follows. 1\\. While ANSI/ASQ Z1.4 plans do not have formal rejectable quality levels (RQLs, the nonconforming fraction at which we want no more than a 10% chance of accepting the lot), pretend that the nonconforming fraction at which there is a 90% chance of rejection is the RQL. 2\\. Use the simple formula for discovery sampling to calculate the sample size for which, if the nonconforming fraction equals or exceeds this RQL, there is a 90% or more chance of finding at least one nonconforming item. 3\\. The operating characteristic (OC) curve, i.e. the chance of acceptance versus the nonconforming fraction, will show the customer that this plan is at least as likely to reject the lot until the nonconforming fraction actually exceeds the RQL. 4\\. Note however that the zero acceptance plan has a very substantial, and far greater than the nominal 5%, chance of rejecting lots at the AQL. This defeats the purpose of the plan (reduce inspection, as rejected lots must be checked 100%) and matters get even worse if ANSI/ASQ Z1.4 switching rules must be used. These plans should accordingly be used only when quality is much better than the specified AQL. » Alternatives when zero acceptance plans are not practical due to the reason cited above: 1\\. ANSI/ASQ Z1.4 double and multiple sampling plans reduce the amount of sampling somewhat. 2\\. Sequential sampling plans reduce it even more. 3\\. Narrow limit gauging can reduce sampling enormously but requires that (1) the quality characteristic follow the normal or bell curve distribution, (2) increases in nonconformances are due entirely to shifts in the process mean as opposed to increases in variation, and (3) the quality characteristic is measurable on a pass/fail basis by gages that can be set to a particular dimension (e.g. with gage blocks). Who Will Benefit » Quality managers » Engineers » Technicians » others with responsibility for acceptance sampling activities To Register (or) for more details please click on this below link: https://bit.ly/3pb9XdF Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-04-01","date_end":"","important_dates":{"abstract":"","full":"2021-04-01","notification":"","final":""},"topics":["Business","Management / Leadership"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}