{"name":"2020 Second International Conference on Materials Science and Manufacturing Technology","series":"","short":"","website":"http://icmsmt.com","content":"Materials science and manufacturing process is one of the significant symbols of modern day’s high-tech revolution. The technological developments in the materials science paves the road for advancements in materials science and manufacturing technology across the world. Materials are the key factor for the emerging industries of all kind. In order for new material to get the actual application, exquisite preparation and manufacturing must be processed. No doubt manufacturing is critical in every walk of life. With rapid development computer technology, communications technology and network technology, traditional manufacturing process has evolved to intelligent manufacturing which is more intelligent, more precision and more efficiency. The scope of the 2020 Second International Conference on Materials Science and Manufacturing Technology (ICMSMT 2020) is to provide a forum for researchers, scientists, academicians, scholars and practitioners around the world to present papers on recent developments in the broad fields of Materials Sciences and Manufacturing Technology. It also provides a premier interdisciplinary platform for researchers, practitioners and educators to present and discuss the most recent innovations, trends, and concerns as well as practical challenges encountered and solutions adopted in the fields of Materials Science, Engineering and Manufacturing. ICMSMT 2020 is jointly organised by Sri Shakthi Institute of Engineering & Technology, Coimbatore and Diligentec Solutions, Coimbatore, India. The conference will be held at the Hotel Aloft, Coimbatore, Tamil Nadu, India during 09 – 10, April 2020\\. Coimbatore is well connected by the road and rail with the Indian cities and air with the international destinations. The ICMSMT 2020 aims for a great gathering of both industrial and academic professional from across the world in the fields of materials science and manufacturing technology. It provides a major forum for the exchange of information among practicing professionals from all over the globe in the areas of greater importance such as Materials and Manufacturing.","date_start":"2020-04-09","date_end":"2020-04-10","important_dates":{"abstract":"","full":"2020-01-25","notification":"","final":""},"topics":["Engineering & Technology","Material/Nanotechnology","Materials science, engineering, nanotechnology"],"location":{"virtual":"","full":["Coimbatore","Tamil Nadu","India"],"name":"","street":"","city":"Coimbatore","state":"Tamil Nadu","ZIP":"","country":"India"},"organizers":["IOPScience"],"societies":[],"indexes":[],"emails":[]}