{"name":"Practical Updates in Primary Care Virtual Series","series":"","short":"","website":"https://go.evvnt.com/738634-0?pid=4868","content":"This is Where Inspiring Conversation Meets World-Class Education. This year, we're offering four opportunities to attend a meeting with like-minded professionals that works for you and your schedule. We're delivering this vital education conveniently online and on-demand to fit your busy lifestyle. Engage from your home with leading primary care clinicians, specialists, and other thought-leaders from across the country to gain practical updates and share best practices through live Q&A, panel discussions, one-on-one networking, and a virtual exhibit hall. Grab your preferred device - laptop, phone, or tablet - and settle in for three days of engaging, case-based sessions led by world-class educators motivated to help you improve patient outcomes. Choose the date that works best for you: May 12-15 July 15-17 September 23-25 November 11-13 Explore 3 days of accredited activities with 20+ sessions led by industry leaders covering topics such as: Mediterranean Diet for Heart Health Improving Dementia Care Early Identification of PsA in Office Exams Long-Haul COVID-19 in Primary Care Safety and Efficacy of Anti-Obesity Medications and more! Tickets https://go.evvnt.com/738634-2?pid=4868 Twitter https://go.evvnt.com/738634-3?pid=4868 Facebook https://go.evvnt.com/738634-4?pid=4868 Instagram https://go.evvnt.com/738634-5?pid=4868 LinkedIn https://go.evvnt.com/738634-6?pid=4868 Prices: Student/Fellow/Resident/Military USD 49.00 Industry USD 499.00 MD/DO USD 149.00 NP/PA/Allied/Pharmacist USD 99.00 Category: Conferences | Health Speakers: Timothy Harlan, MD, Angela Fitch, MD, Kathryn Evans Kreider, DNP, FNP-BC, BC-ADM, FAANP, Cindy Cooke, DNP, FNP-C, FAANP, Jeffrey P. Levine, MD, MPH, Barak Gaster, MD, Angela Golden, DNP, FNP-C, FAANP, Maureen Moriarty, DNP, APRN, FAHS, FAANP, Aric A. Prather, PhD, Amanda Cohn, MD, Alessio Fasano, MD, Joseph F. Merola, MD, MMSc Time: On Thursday May 13, 2021 at 8:00 am (ends Saturday May 15, 2021 at 6:00 pm)","date_start":"2021-05-13","date_end":"2021-05-15","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Public-Health","Healthcare"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["HMP Global"],"societies":[],"indexes":[],"emails":[]}