{"name":"Navigating through Maze of In-vitro Diagnostics","series":"","short":"","website":"https://www.complianceonline.com/in-vitro-diagnostics-ivd-regulatory-approvals-in-us-europe-canada-seminar-training-80148SEM-prdsm?channel=Brownwalker","content":"In-vitro Diagnostics (IVD) products provide critical information on patient’s health condition, based on which the healthcare provider develops and administers treatment plan. Although IVDs are medical devices, they are regulated under a separate set of regulations in U.S., Europe, and Canada. This 2 day interactive course on in-vitro diagnostics is structured to understand the different set of IVD regulations, how to navigate through this maze of IVD regulations, and to win regulatory approvals. This In-vitro Diagnostics (IVD ) course will make the attendees understand the IVD regulations and develop regulatory strategies that secure regulatory approvals. Learning Objectives: After completion of this two day interactive course on IVD, the attendee will be able to: Understand why IVD is regulated differently. An overview of IVD Regulations – U.S. FDA., Europe (MDD), Canada. Develop Regulatory Strategies and determine Regulatory Pathways. Inclusion and exclusion of data and information for different submission. Format and Content of premarket submissions. Product Label and Labeling for IVDs. Working and interacting with the reviewers and regulators. Tips and Suggestions to secure rapid regulatory approvals. Who will benefit: This interactive course is specifically developed for individuals, who are responsible for the design, development, manufacturing, marketing, and distribution of IVD products. This course is highly recommended for personnel involved in any of the following functions: Department Managers (middle management) Research & Development (R&D) Product Design & Development Validation Engineering Regulatory Affairs Quality Assurance Quality Control Manufacturing/Production","date_start":"2021-09-16","date_end":"2021-09-17","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}