{"name":"LEAP HR: Higher Education","series":"","short":"","website":"https://go.evvnt.com/610470-0?pid=4868","content":"Discover the Inspiration Behind How HR Change Makers Challenged Tradition, Transformed Their Strategic Impact And Future-Proofed Their Institutions LEAP HR: Higher Education is returning for its third year to unite the industry's most future-focused HR leaders and shine a light on the best examples of genuine and applicable HR transformations from universities And colleges across the US. This is you and your team's unique opportunity to take inspiration from how non-traditional HR leaders are future-proofing their institutions with forward-thinking new people strategies. Step inside the innovation that is making an active difference to HR impact across universities and colleges - and leave with the toolkit you need to deliver next-level value to your staff, faculty, and student populations. URL: Tickets: https://go.evvnt.com/610470-2?pid=4868 Prices: Full access (Conference + CHRO Strategy Day) - Early birds available : USD 2198.0, Conference only - Early birds available : USD 1799.0, CHRO strategy day : USD 499.0 Speakers: Casey Cook Chief Human Resources Officer The University of Chicago, Donna Bonaparte Chief Human Resources Officer Babson College, John Whelan Chief Human Resources Officer Indiana University, Renisha Gibbs Associate Vice President for Human Resources and F&A Chief of Staff Florida State University, Samer Samman Chief Human Resources Officer KAUST, Dr. Emily Weinacker Chief Human Resources Officer Yavapai College, Anthony Ray Chief Human Resources Officer Elgin Community College, Julie Auster Chief Human Resources Officer Yeshiva University, Mia Basic most recently Chief Human Resources Officer University of La Verne, Tim Rich Chief Human Resources Officer University of Northwestern - St. Paul, Julie Goonewardene Chief Talent And Innovation Officer and Senior Advisor to the Chancellor The University of Texas System, Amanda Bailey Vice President of Human Resources Brown University, Wayne Guthrie Vice President of Human Resources University of Delaware, Cheryl Gochis Vice President of Human Resources Baylor University, Warren Petty Vice President of Human Resources Stevens Institute of Technology, Wanda Heading-Grant Vice President of Human Resources And Diversity University of Vermont, David Blake Vice President of Administration California Western School of Law, Toni Whalen Assistant Vice President of Human Resources Jefferson Community And Technical College, Lori Erickson Assistant Vice President of Human Resources East Tennessee University, Gary Evans Assistant Vice President of Human Resources State University of New York College at Cortland, Tracey Donaldson Assistant Vice President of Human Resources Ocean County College, Adam Weikel Assistant Vice President of Human Resources Service University of Virginia, Susan Norton Vice President of Human Resources Augusta University, Sally Madden Associate Vice President of Human Resources Rosalind Franklin University, Dana Nagengast Assistant Vice President of Human Resources Harvey Mudd College Time: 9:00 am to 5:00 pm Venue Details: Omni Austin Hotel Downtown, 700 San Jacinto at East 8th Street, Austin, TX, 78701, United States","date_start":"2020-06-15","date_end":"2020-06-17","important_dates":{"abstract":"","full":"2020-06-14","notification":"","final":""},"topics":["Education / Legal / Other","Education","higher education"],"location":{"virtual":"","full":["Austin","Texas","United States"],"name":"","street":"","city":"Austin","state":"Texas","ZIP":"","country":"United States"},"organizers":["Hanson Wade"],"societies":[],"indexes":[],"emails":[]}