{"name":"Reiki Therapist Training: Level 1 at TriYoga in Soho, London","series":"","short":"","website":"https://go.evvnt.com/361478-2?pid=4868","content":"Reiki is a magical gift that anyone can learn. It has the power to heal on the physical, emotional, mental and spiritual level, therefore enabling deep spiritual transformation for the individual. Reiki Level 1 is the start of your Reiki journey. Within this course you will receive four attunements, which make you the channel for Reiki, and have the extra bonus of clearing out anything from your energetic system that is no longer needed. At the end of the day, you will be able to do a Reiki treatment on yourself. What can I expect? This course covers: - The five Reiki principles. - The history and lineage of Reiki. - Four attunements. - A 21-day self-clearing of your chakras. - How the physical, emotional and mental bodies all interlink. - Understand and learn how to check your chakras. - Guided meditations when appropriate. - Reiki hand positions. This course is fully accredited and you will receive a certificate upon completion. What will I gain from the workshop? - As Reiki is a healing energy, it will heal anything within your energetic and emotional body that needs to be healed and released. - Your chakras will be opened and connected for you to channel energy. - You will gain a deeper understanding of a world we have never been taught about. - You will understand and be able to feel energy being channelled through your crown chakra and out through the chakras in your palms. - You will feel totally blissed out, a complete inner peace, as the healing energy works on your own spiritual body. - You will be able to give yourself a Reiki treatment. Tickets: https://go.evvnt.com/361478-0?pid=4868 Prices: Early bird (until 1 March) : GBP 170.0 Full price (from 1 March): GBP 190.0 Category: Community | Religion and Spirituality | Meditation and Yoga Time: 10:00 am - 5:00 pm","date_start":"2019-03-23","date_end":"","important_dates":{"abstract":"","full":"2019-03-22","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education, teaching"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["triyoga"],"societies":[],"indexes":[],"emails":[]}