{"name":"Zero-Injury Workplace Culture vs. Safety Culture","series":"","short":"","website":"https://www.complianceonline.com/zero-injury-workplace-culture-versus-safety-culture-safety-maturity-curve-webinar-training-704986-prdw?channel=Brownwalker","content":"Creating a safety culture in the workplace takes time, patience, and is often a multi-year process. This training program will examine how organizations need to transition from the existing zero injury workplace culture to a more safety oriented culture. In the process, it will examine the pros and cons behind each process and also offer best practices to determine whether you are doing it right. Why Should You Attend: Within the occupational safety and health arena, there has been a moving trend to a zero-injury objective in many industries of the United States. Associated with this objective comes the development and promotion of a safety culture management system. A few reasons for this change is the focus upon targeted training and the minimization of unsafe behaviors. This webinar will focus on evolving a zero incident workplace culture within any organization; rather an existing or not. We will discuss the pro’s and con’s of a implementing a zero incident workplace culture and describe how to determine if you are doing it right. A zero injury workplace safety cultures consist of shared beliefs, practices, and attitudes that exist within an organization. Culture is the atmosphere created by those beliefs, attitudes, etc., which shape our behavior. An organizations safety culture is the result of a number of factors that include, but not limited to: Management and employee norms, assumptions and beliefs; Management and employee attitudes; Values, myths, stories; Policies and procedures; Supervisor priorities, responsibilities and accountability; Production and bottom line pressures vs. quality issues; Actions or lack of action to correct unsafe behaviors; Learning Objectives: Explain what it means to have a ‘zero incident workplace culture’ on site. Identify the 4 phases of the safety maturity curve process. Discuss employee and employee rights and responsibilities at each step of the safety maturity curve. Explain the benefits and challenges of sustaining a zero injury workplace safety culture in the workplace. Identify successful strategies of incorporating zero injury culture and to scorecards to determine if it is successful. Areas Covered in the Webinar: Definition of a zero injury workplace safety culture for your organization. Review the 4 phases associated with the Safety Maturity Curve Process toward zero injuries. Explain the benefits and challenges of establishing a zero injury workplace culture within your workplace. Identify execution strategy to determine if you are doing it right. Who Will Benefit: Plant Managers Plant Foremen Safety Committee Member Engineers Operations Managers Construction Foreman Occupational Safety Consultants HR Managers General Industry business owners Construction business owners Plant Supervisors Subcontractors","date_start":"2021-11-04","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Human-Resources"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}