{"name":"7th International Scientific Conference on ARTS and HUMANITIES (ISCAH) 2020","series":"","short":"","website":"http://www.sgemsocial.org ","content":"The 7th International Scientific Conference on ARTS and HUMANITIES (ISCAH) 2020 examines those subtle elements, which construct our inner world and its paradoxical dynamics and expressions, and its correlations with the social world. All the disciplines and creative activities within the field of Humanities & Arts are powerful means when applied to in-depth analysis of the individual, of a historical event or a particular idea. The focus of the papers ranges from the finely grained and empirical principles to wide-ranging multidisciplinary practices and perspectives on knowledge and method. The aim of the conference is to bring together leading academic scientists, artists and research scholars to exchange and share their experiences and inquiry results on all aspects of the specific fields. We aspire to provide a premier interdisciplinary platform for researchers, practitioners, and educators to present and discuss the most recent discoveries, ideas, and concerns as well as the practical challenges encountered and solutions adopted in each stand of Art & Humanities. The topics the conference covers are Law and Politics, Archaeology, History, Philosophy, Museology and Heritage Studies, Medieval and Renaissance Studies, Language and Linguistics, Architecture and Design, History of Arts, Performing and Visual Arts, Literature and Poetry. All papers presented during the conference will be peer-reviewed and published in a hard copy conference proceedings that are given to every participant at the conference venue. The scientific impact factor of the event is assured by the long-established and strong connections with most of the well-known indexing databases - Clarivate Analytics ISI Web of Science /former Thomson Reuters/, CrossRef, ProQuest, EBSCO, British Library, ELSEVIER products-Mendeley, Google Scholar, and many others. The Conferences include also accompanying events, such as performing arts (live dance performances, theater, and music, etc.) and very interesting cultural trips with historic value. We would like to invite you to share your experience and research in the field of Arts and Humanities with experts from all over the world.","date_start":"2020-08-27","date_end":"2020-08-31","important_dates":{"abstract":"","full":"2020-06-15","notification":"","final":""},"topics":["Arts & Humanities","Art History"],"location":{"virtual":"","full":["Albena","Bulgaria"],"name":"","street":"","city":"Albena","state":"","ZIP":"","country":"Bulgaria"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}