{"name":"New Perspectives in Science Education Virtual Conference","series":"","short":"","website":"https://conference.pixel-online.net/NPSE","content":"The Conference brings together teachers, researchers, practitioners and project managers from all over the world to share findings, expertise and experience about innovative science teaching and learning methodologies, through syhcnronous live presentations, asynchronous and poster presentations. We will deliver a full 2 days programme of inspiring sessions in the framework of a highly interactive virtual conference experience. We will provide enhanced digital contents that will give participants greater access to learning, sharing and networking. - All accepted papers at the virtual conference will be presented in synchronous or asynchronous modes. - Interactive Questions and Answers sessions will follow each paper presentation. - Virtual Poster Presentation Sessions will also be held. - Networking Opportunities will be organized. Important dates: 12 February 2021: Abstract submission extended deadline 19 February 2021: Notification of abstract evaluation 26 February 2021: Deadline for paper submission 18-19 March 2021: Conference days There will be three presentation modalities: synchronous, asynchronous and virtual poster presentation. All accepted papers will be included in the Conference Proceedings published by Filodiritto Editore with ISBN, ISSN, and DOI codes. The publication will be sent to be reviewed for inclusion in the Conference Proceedings Citation Index by Thomson Reuters (ISI-Clarivate). The publication will also be included in Academia and indexed in Google Scholar. Contact: science@pixel-online.net Official website: http://conference.pixel-online.net/NPSE/callforpapers.php YouTube video promo: https://youtu.be/RtI-lt0KS\\_Q","date_start":"2021-03-18","date_end":"2021-03-19","important_dates":{"abstract":"","full":"2021-02-12","notification":"","final":""},"topics":["Education / Legal / Other","Education","Life Sciences (nature)"],"location":{"virtual":"","full":["Online Event","Italy"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Italy"},"organizers":["Pixel"],"societies":[],"indexes":[],"emails":["science@pixel-online.net"]}