{"name":"Effective Quality Oversight of Pharmaceutical Contract Manufacturing Organizations (CMOs)","series":"","short":"","website":"https://www.complianceonline.com/pharmaceutical-contract-manufacturing-organizations-cmos-seminar-training-80389SEM-prdsm?channel=Brownwalker","content":"The globalization of the pharmaceutical supply chain has resulted in the increased use of Contract Manufacturing Organizations (CMOs). The use of CMOs provides many benefits; however, it also presents unique compliance risks, particularly since operations are not under your direct control. Compliance risks are highlighted by FDA Warning Letter trends, the majority of which are related to serious cGMP compliance and data integrity issues at foreign CMO sites. If you use CMOs, your firm is fully responsible for product quality, safety, efficacy, and cGMP compliance. Furthermore, FDA has clearly stated that firms using CMOs will be held accountable for CMO compliance to cGMPs, as well as for CMO adherence to Sponsor regulatory commitments. Issues identified at your CMO may result in FDA 483s and/or Warning Letters issued to your firm. Therefore, it is imperative that your organization have a robust CMO management system. At the end of the day, your ability to provide proper quality oversight of CMOs is the key to assuring product safety and safeguarding your firm’s compliance profile. This seminar will help all personnel responsible for CMO oversight understand how to ensure effective quality oversight of CMOs- from start to finish. In-depth focus will be placed on Selection and Qualification, CMO Audits, Quality Agreements, Oversight of CMO Operations, and Review of Key CMO Records. Considerations for different types of manufacturing will be highlighted, and techniques for managing difficult CMO situations will be addressed. Techniques for assuring robust CMO Oversight programs in light of COVID-19 restrictions will also be discussed. This is a practical how-to course, designed to provide participants with skills they can immediately apply to CMO oversight within their own organizations. Case studies will allow participants to practice skill sets in cooperation with the instructor. Learning Objectives: Upon completing this course, participants should be able to: Understand the CMO business model Understand the regulatory requirements for CMO quality oversight Understand how to structure your organization for effective CMO oversight Understand key points for selecting and qualifying CMOs Know how to prepare for and conduct CMO Audits Know how to develop a Quality Agreement and how to execute it Understand key points for reviewing CMO records Know how to resolve issues identified in CMO records Know how to manage CMOs on an ongoing basis Who will Benefit: This course is designed for people tasked with oversight of these CMO functions: Manufacturing operations Quality Control operations Quality Assurance operations The following personnel will benefit from the course: Pharmaceutical Development Quality Control Validation Regulatory Affairs Quality Assurance Project Management","date_start":"2021-02-16","date_end":"2021-02-17","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}