{"name":"2021 International Conference on Biomedical Materials and Science","series":"","short":"ICBMS 2021","website":"www.ic-bms.org","content":"2021 International Conference on Biomedical Materials and Science (IC-BMS 2021) will be held in Kyoto, Japan during August 26-28, 2021\\. It brings together leading academic scientists, researchers and research scholars to exchange and share their experiences and research results on all aspects of biomedical materials and science (IC-BMS 2021). Prof. Masaru Tanaka from Institute for Materials Chemistry and Engineering, Kyushu University, Japan，Prof. Shinichi TOKUNO from Voice Analysis and Measurement of Pathophysiology, Dept. of Bioengineering, Graduate School of Engineering, The University of Tokyo and Lecturer. Yuki Akagi from Department of Bioengineering, Graduate School of Engineering, The University of Tokyo, Japan will give keynote speaches. All the registered and presented papers will be published in the Journal of Biomimetics, Biomaterials and Biomedical Engineering (JBBBE), which will be Indexed in EI Compendex, Scopus, REAXYS, ESCI (Web of Science, Thomson Reuters), Inspec, and other databases for review and indexing. \\*Selected good quality or extended papers can be recommended for potential publication in Nanomaterials (ISSN 2079-4991) Impact factor: 4.324 Indexing: Scopus, SCIE (Web of Science), PubMed, PMC, CAPlus / SciFinder, Inspec, and many other databases. Special Issue \"Biomaterials and Applications Engineering (ICBAE-2021)\" Submission Deadline Before Aug 5, 2021 Notification of Acceptance On Aug 15, 2021 Registration Deadline Before Aug 20, 2021 Conference Dates On August 26-28, 2021 Paper submission: 1.Conference Submission System: https://cmt3.research.microsoft.com/ICBMS2021 2.Mail: ic-bms@isaeri.org Conference Secretary: Ms. Alice Li Tell: +852-30756685 Mail: ic-bms@isaeri.org Conference website: www.ic-bms.org","date_start":"2021-08-26","date_end":"2021-08-28","important_dates":{"abstract":"","full":"2021-08-05","notification":"","final":""},"topics":["Engineering & Technology","Material/Nanotechnology"],"location":{"virtual":"","full":["Online Event","Japan"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Japan"},"organizers":["Innovative Science and Engineering Research Institute (ISERI)"],"societies":[],"indexes":[],"emails":["ic-bms@isaeri.org"]}