{"name":"Society and Sea 2020: The Values of the Ocean and Coasts","series":"","short":"","website":"www.gre.ac.uk/society-and-the-sea","content":"The Greenwich Maritime Centre (GMC) in partnership with National Maritime and Royal Museums Greenwich is pleased to announce its third biennial conference titled Society and the Sea 2020: The Values of the Ocean and Coasts for Sustainable Development to run 9 - 11 September 2020\\. The ocean is in crisis and solutions to the many challenges require collaboration and contribution from science, industry, governments and communities. This conference will bring together a diverse international audience to explore the importance of the ocean and how to achieve ocean sustainability. As part of exploring the values of the ocean and coasts for sustainable development from multi-disciplinary and multi-sector perspectives the conference is looking for contributions around the following themes: Blue Economy Environment and Conservation Coastal Communities Health and Wellbeing Migration Fisheries Gender and Diversity Maritime Governance We encourage broad multi-disciplinary / multi-sector engagement with contributions from diverse stakeholders including industry, government, NGOS, communities and academia (including for instance the arts and humanities, natural sciences and social sciences) to help understand the multiple ways our rivers, oceans and coasts are important for sustainable development. The conference is supported by the Thames Estuary Partnership, Coastal Partnership Network and the Marine Social Science Network. For more information and a description of themes please visit: http://www.gre.ac.uk/society-and-the-sea We are inviting submissions for papers, sessions, posters and creative works on the above themes or related themes that you feel are connected and relevant, to be submitted using the form below by WEDNESDAY 15 JANUARY 2020\\. All proposals will be reviewed by the Conference Secretariat and those accepted will be published in the conference programme. Please follow this link to submit: https://greenwich.onlinesurveys.ac.uk/societyandsea2020 Contact Details Telephone: +44(0)20 8331 7688 Email: societyandthesea@greenwich.ac.uk","date_start":"2020-09-09","date_end":"2020-09-11","important_dates":{"abstract":"","full":"2020-09-09","notification":"","final":""},"topics":["Physical Science & Math","Ocean/Water"],"location":{"virtual":"","full":["London","Uk","United Kingdom"],"name":"","street":"","city":"London","state":"Uk","ZIP":"","country":"United Kingdom"},"organizers":["University of Greenwich"],"societies":[],"indexes":[],"emails":["societyandthesea@greenwich.ac.uk"]}