{"name":"IHPBA 2020 Virtual Congress | Friday 27 November to Sunday 29 November 2020","series":"","short":"","website":"https://go.evvnt.com/681236-2?pid=4868","content":"IHPBA together with its partners, ANZHPBA and A-PHPBA, have made the decision to host the 14th World Congress of the Hepato-Pancreato-Biliary Association (IHPBA) as a virtual-only congress for the year 2020\\. The IHPBA 2020 Virtual Congress will be hosted from Friday 27 to Sunday 29 November 2020\\. The congress will remain a full educational and scientific experience and will facilitate interactions among surgeons, physicians, researchers, scientists, clinicians, and other health professionals from around the world. The IHPBA 2020 Virtual Congress theme will be reflected through the scientific program in a series of interactive high-profile plenary presentations, special lecture presentations, and concurrent sessions. In addition to this, delegates will have access to a whole host of on-demand content covering all areas of HPB. We have received over 1800 abstracts for IHPBA 2020 and are delighted to advise that all accepted abstracts will be honoured for the IHPBA 2020 Virtual Congress. The Virtual Congress will offer new experiences in the HPB field and will open the borders to all surgeons, physicians, clinicians, and researchers from across the world. Delegates can also look forward to significantly reduced registration rates for the IHPBA 2020 Virtual Congress. Should you have any questions, contact us at ihpba2020.scientific@ihpba.org. We very much look forward to welcoming you to a virtual IHPBA 2020 in November 2020\\. URL: Tickets: https://go.evvnt.com/681236-0?pid=4868 Prices: Member (IHPBA combined member) | Early Bird Deadline 23 Oct 2020: USD 250.0, Member (IHPBA combined member) | Standard Rate after 24 Oct 2020: USD 350.0, Non-Member | Early Bird Deadline 23 Oct 2020: USD 350.0, Non-Member | Standard Rate after 24 Oct 2020: USD 450.0, Resident, Trainee, Fellow Member | Early Bird Deadline 23 Oct 2020: USD 95.0, Resident, Trainee, Fellow Member | Standard Rate after 24 Oct 2020: USD 150.0, New Member (Includes one year membership to IHPBA or A-PHPBA) | Early Bird Deadline 23 Oct 2020: USD 400.0, New Member (Includes one year membership to IHPBA or A-PHPBA) | Standard Rate after 24 Oct 2020: USD 500.0, Resident, Trainee, Fellow New Member (Includes one year membership to IHPBA or A-PHPBA) | Early Bird Deadline 23 Oct 2020: USD 170.0, Resident, Trainee, Fellow New Member (Includes one year membership to IHPBA or A-PHPBA) | Standard Rate after 24 Oct 2020: USD 225.0 Time: 09:00 - 17:00","date_start":"2020-11-27","date_end":"2020-11-29","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["IHPBA 2020 c/o MCI Australia"],"societies":[],"indexes":[],"emails":["ihpba2020.scientific@ihpba.org"]}