{"name":"Fifth Annual Gender and Sexuality Studies Conference","series":"","short":"","website":"https://sites.uco.edu/central/thecenter/conference-2020/index.asp","content":"IGSS Call for Abstracts The International Gender and Sexuality Studies Conference is presented by the Women’s Research Center and the BGLTQ+ Student Center at the University of Central Oklahoma with assistance from the UCO chapter of the National Organization for Women. In tandem, these organizations promote intellectual engagement with Women’s, Gender, and Sexuality issues. For 2020, our conference theme is “Inclusive, Intersectional, Interdisciplinary.” As we celebrate the centennial of US women’s suffrage and look forward into the 21st century, we want to focus on our overlaps as a community. How do diverse people inhabit the juncture of Women’s, Gender, and Sexuality studies? How can academics and activists work together to advance deep thinking and real-world change? How do our different backgrounds – in terms of lived experiences, scholarly fields, and political goals – help to cross-pollinate our understanding of WGSS? What productive tensions exist between these fields and experiences? How can we resolve conflict inclusively and work toward shared solutions? This year’s conference will gather together voices from across the complex ecosystem of gender and sexuality studies, creating a crossroads for conversation. While all submissions are welcome, the selection committee encourages presentations that fit in line with this year’s theme. This intersectional conference welcomes proposals that address issues of gender and sexuality across various disciplines, including, but not limited to, the social sciences, humanities, fine arts, activism, and STEM fields. We invite students, faculty, staff, scholars, and activists to propose papers, panels, roundtable discussions, and poster presentations. We also welcome proposals to present or perform creative work, including creative writing, drama, music, and visual art. ---Instructions for Submissions--- All presentations must be emailed to thecenteratuco@gmail.com. Be prepared to provide the following in the form: 1\\. In the subject line, please enter the category of the presentation (History, Social Sciences, STEM and Arts, Activism, Literature and Languages, or Other) 2\\. The format of presentation (e.g. panel, paper presentation, visual art) 3\\. A 250-word abstract 4\\. Your name, affiliation, and contact information If the selection committee has any questions about your submission, they will contact you directly through the information provided. All presentation submissions are due at 11:59 PM. For full research panels, the deadline is March 31; for all individual submissions, the deadline is May 1\\. For more questions, please reach out to Dr. Lindsey Churchill, Director of the Women’s Research Center and the BGLTQ+ Student Center at lchurchill@uco.edu. All presentation submissions must be sent to thecenteratuco@gmail.com.","date_start":"2020-10-02","date_end":"2020-10-03","important_dates":{"abstract":"","full":"2020-05-01","notification":"","final":""},"topics":["Social Sciences","Gender/Sexuality","gender studies (and womens)"],"location":{"virtual":"","full":["Edmond","Oklahoma","United States"],"name":"","street":"","city":"Edmond","state":"Oklahoma","ZIP":"","country":"United States"},"organizers":["The Women's Research and BGLTQ+ Student Center"],"societies":[],"indexes":[],"emails":["thecenteratuco@gmail.com","lchurchill@uco.edu"]}