{"name":"Special Issue on Enabling Cognitive Smart Cities: Security and Privacy in IoT applications","series":"","short":"","website":"https://www.journals.elsevier.com/computer-communications/call-for-papers/security-and-privacy-in-iot-applications","content":"A smart city is a label given to a city that incorporates Information and Communication technologies (ICT) to enhance the quality and performance of urban services such as energy, transportation and utilities in order to reduce resource consumption, wastage and overall costs. The main objective of a smart city is to enhance the quality of living for its citizens through smart technologies like the Internet, telecommunications network, broadcast network, wireless broadband network and other sensors networks where high-performance computing, computing intelligence, cloud computing as well as IoT is at its core. With the explosive growth of smart city, IoT and high-performance computing based services receive increasing attention. It creates many scientific and engineering challenges that call for ingenious research efforts for the development of efficient, scalable, and reliable communication and network technologies. In particular, internet of things (IoT) with cloud computing plays an vital role to connect everything and to the Internet through specific protocols for information exchange and communications, achieving intelligent recognition, location, tracking, monitoring and management. IoT with cloud-based smart cities can provide various kinds of services for both the citizens and the administrators. For example, smart homes, smart parking lots, weather systems, vehicular traffic, environmental pollution, surveillance systems, smart energy, and smart grids. One of the biggest concerns, while using any of the IoT based applications is the safety and privacy of individual users. Any breach in the security leads to confidential data loss, which further leads to financial loss. Any such security breach leads to compromise of an individual’s privacy. As many devices are connected, the security risk gets increase a lot in IoT based smart city applications. Future cities are to be not only an intelligent and green living environment but also providing human-centric public services at a lower cost. The IoT, artificial intelligence, cloud computing, computational intelligence, and high-performance computing are four pillars for smart cities enablement and define the transition from smart to cognitive. Cognitive smart city refers to the convergence of emerging IoT and smart city technologies, their generated big data, and artificial intelligence techniques to predictive, proactive real-time adaptations over suggestion management. Smart city implementation may include implementation of - Smart energy grid, Intelligent buildings, smart water management, connected healthcare and patient monitoring, environment/climate monitoring, connected cars, and smart transportation, intruder detection using home Wi-Fi router, vehicular network for traffic control, and video surveillance with intelligent recognition, location tracking, monitoring and management. A consistent citizen enagagement, uniquitous data collection, and sophisticated analytics can lead to the shift to produce the best kind of cognitive city. The motivation of the special issue is to invite research scholars, academic researchers and industry professionals to submit their research ideas and implementations related to artificial intelligence and deep learning for the security and privacy in computer, IoT and communication networks.","date_start":"2019-12-30","date_end":"","important_dates":{"abstract":"","full":"2019-12-30","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Biological Engineering & bioinformatics"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":[""],"societies":[],"indexes":[],"emails":[]}