{"name":"17th International Conference on Informatics in Control, Automation and Robotics - ICINCO 2020","series":"","short":"","website":"http://www.icinco.org/ ","content":"The purpose of the 17th International Conference on Informatics in Control, Automation and Robotics (ICINCO) is to bring together researchers, engineers and practitioners interested in the application of informatics to Control, Automation and Robotics. Four simultaneous tracks will be held, covering Intelligent Control Systems, Optimization, Robotics, Automation, Signal Processing, Sensors, Systems Modelling and Control, and Industrial Informatics. \n Informatics applications are pervasive in many areas of Control, Automation and Robotics; This conference intends to emphasize this connection, therefore, authors should highlight the benefits of Information Technology (IT) in these areas. Ideas on how to solve problems using IT, both in R&D and industrial applications, are welcome. Papers describing advanced prototypes, systems, tools and techniques and general survey papers indicating future directions are also encouraged. Papers describing original work are invited in any of the areas listed below. Accepted papers, presented at the conference by one of the authors, will be published in the Proceedings of ICINCO, with an ISBN. Acceptance will be based on quality, relevance and originality. Both full research reports and work-in-progress reports are welcome. There will be both oral and poster sessions. \n Special sessions, dedicated to case-studies and commercial presentations, as well as tutorials dedicated to technical/scientific topics are also envisaged: companies interested in presenting their products/methodologies or researchers interested in holding a tutorial, workshop or special session are invited to contact the conference secretariat or visit the conference website. ","date_start":"2020-07-07","date_end":"2020-07-09","important_dates":{"abstract":"","full":"2020-04-29","notification":"","final":""},"topics":["Business","Information-Technology"],"location":{"virtual":"","full":["Lieusaint","France"],"name":"","street":"","city":"Lieusaint","state":"","ZIP":"","country":"France"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":[]}