{"name":"Managing complex boundary and dual relationship issues in behavioral health: Ethical and risk management challenges","series":"","short":"","website":"https://bit.ly/3qkUMPX","content":"During the course of their careers, behavioral health professionals inevitably face complex ethics challenges related to boundaries and dual relationships. This webinar will explore complicated boundary issues in behavioral health and highlight practical risk-management strategies designed to protect clients and prevent litigation and ethics complaints. Why Should You Attend Behavioral health professionals must be skilled in their ability to manage complex boundary and dual relationship issues. How do I manage professional boundaries and dual relationships in online communications? Under what circumstances is it appropriate to disclose personal information to a client? Is it ever ethical to accept clients’ invitations or gifts? Is it ever appropriate to perform favors for vulnerable clients or hire a former client? If you find these and other complex boundary issues in behavioral health challenging, this is the webinar for you. Come hear ethics expert Dr. Frederic Reamer share his insights about effective ways to protect clients and prevent litigation and licensing board complaints. Objectives of the Presentation » Identify challenging boundary and dual relationship issues in behavioral health » Apply practical ethical decision-making frameworks and protocols » Identify ethical issues that pose malpractice and liability risks » Design strategies to protect clients, practitioners, and employers Areas Covered in the Session » Complex boundary and dual relationship issues in behavioral health: Case examples » The nature of boundary and dual relationships in behavioral health: A Typology » Managing boundaries and dual relationships: A framework » Risk management strategies: Protecting clients, practitioners, and employers Who Will Benefit » Clinical Social Workers » Psychologists » Psychiatrists » Mental Health Counselors » Marriage and Family Therapists » Substance use Disorder Practitioners To Register (or) for more details please click on this below link: https://bit.ly/3qkUMPX Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-02-17","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Mental-Health","Risk Management"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}