{"name":"International Symposium on Social Sciences and Human Rights","series":"","short":"","website":"http://www.isepst.org","content":"We want to thank everyone who attended our International Symposium on Social Sciences during the past 7 years. The 8th ISS20 will take place on the 20th – 22nd of May, 2020 in Taipei, Taiwan. Our special session this time is Human Rights and prospective authors are invited to submit original research abstracts or full papers which were not and have not been submitted / published / under consideration in other conferences and journals. Human rights are the basic rights and freedoms that belong to every person in the world, from birth until death. The basic idea of human rights is that each one of us, no matter who we are or where we are born, is entitled to the same basic rights and freedoms. But it’s easier said than done. We still encounter news such as racism, the basic needs not being met all over the world, refugees being discriminated and women being disparaged. Topics are listed but not restricted to : HUMAN RIGHTS SESSION ●Business & Human Rights ●Children’s Rights ●International Human Rights Law ●Human Rights Development ●Human Rights Education and Training ●Conflicts and Cross Border Migrations ●Death Penalty ●Gender, Sexuality and Human Rights ●Human Rights in the Digital Age ●Voting Rights for Felons SOCIAL SCIENCES SESSIONS We encourage a cross-disciplinary exchange ideas and share knowledge through a variety of teaching methods and perspectives. Topics should be related but NOT limited to the following below: ●Business & Management ●Culture & History ●Philosophy & Psychology ●Economics & Finance ●Linguistics and Literature ●Education ●Law & Politics ●Sociology Kind Reminder : Please select “Human Rights Session” if you would like to talk about topics which are related to human rights ; If not related, please select other “Social Sciences Sessions”.","date_start":"2020-05-20","date_end":"2020-05-22","important_dates":{"abstract":"","full":"2020-01-15","notification":"","final":""},"topics":["Social Sciences","Gender/Sexuality","Law and legal studies"],"location":{"virtual":"","full":["Taipei","Taiwan","Province Of China"],"name":"","street":"","city":"Taipei","state":"Taiwan","ZIP":"","country":"Province Of China"},"organizers":["ARA"],"societies":[],"indexes":[],"emails":[]}