{"name":"The 4th International Conference on Childhood and Adolescence","series":"","short":"","website":"https://icca.eventqualia.net/en/2020/home/about-venue","content":"The 4th International Conference on Childhood and Adolescence and 7th anual meeting of the Social Paediatric Subcommittee (SPS-SPP) of the Portuguese Society of Paediatrics took place between 23-25 January 2020, at Ramada Lisbon Hotel, Lisbon. The International Conference on Childhood and Adolescence promotes open dialogue about childhood and adolescence issues with the help of multidisciplinary perspectives and experiences. Anchored on a participative approach, in which the audience may take part in the debate, ICCA cultivates a meeting between knowledge and know-how in an array of areas, from Pshycology to Medicine, going through Law, Arts, Sports, Social Service, Nursing, Nutrition, among others, giving the opportunity to reseachers, professionals, students, teachers, parents and everyone who is interested in these issues. Building on three successful editions, with over five hundred participants per edition, ICCA has been gaining notice beyond borders, gathering participants from all 5 continents who share their expiriences and knowledge in an intense and diversified three day program. We’re sure that everything is set so that 2020’s edition goes as well as before with new discussions, new speakers and the same will to provide an unique and unforgettable experience. The conference is organized by eventQualia together with the Social Paediatric Subcommittee (SPS-SPP) of the Portuguese Society of Paediatrics and Portuguese Society for the Study of Abused and Neglected Children (SPECAN).","date_start":"2020-01-23","date_end":"2020-01-25","important_dates":{"abstract":"","full":"2019-12-10","notification":"","final":""},"topics":["Education / Legal / Other","Education","psychology"],"location":{"virtual":"","full":["Lisbon","Portugal"],"name":"","street":"","city":"Lisbon","state":"","ZIP":"","country":"Portugal"},"organizers":["Social Paediatric Subcommittee (SPS-SPP) of the Portuguese Society of Paediatrics and Portuguese Soc"],"societies":[],"indexes":[],"emails":[]}