{"name":"Lead Auditor EN ISO 13485:2016 and EU MDR 2017/745 - Regulation","series":"","short":"","website":"https://www.complianceonline.com/en-iso-13485-2016-eu-mdr-2017-745-seminar-training-80654SEM-prdsm?channel=Brownwalker","content":"The new medical device regulation EU MDR 745/2017 in the European Union has a lot of new requirements. This new upcoming regulation is also stronger connected to the EN ISO 13485:2016\\. The understanding of this changes and how to implement last minute changes until May 2021 is essential to keep your certificates. The first key for the understanding and the implementation of the changes is the knowledge about the interfaces between the EN ISO 13485:2016 and the EU MDR 2017/745\\. The second key is to understand, which parts of the EU MDR 2017/745 are not covered by the EN ISO 13485:2016\\. These not covered paragraphs and requirements must be additional implemented into the quality management system until May 2020\\. The time is short and immediately action is required. Learning Objectives : Introduction, who must apply the new EU MDR 2017/745 requirements? Overview about the changes of the EU MDR 2017/745 regarding quality management What are the interfaces between the EN ISO 13485:2016 and the EU MDR 2017? Which new requirements of the EU MDR 2017/745 are not covered by the EN ISO 13485:2016? Smart and fast ways to implement the changes in your quality management system Fast track internal audit to approve the changes Areas Covered : The new scope of the EU MDR 2017/745 The obligations and roles of the EU MDR 2017/745 How work the regulation and the EN ISO 13485:2016 together? New and updated processes required by the EU MDR 2017/745 How to implement the required changes until May 2021? Who will Benefit: CEO’s, product manager, quality/ regulatory / medical affairs manager, quality representatives of medical device manufacturer, importer, distributors dealers","date_start":"2020-12-15","date_end":"2020-12-16","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}