{"name":"20th International Multidisciplinary Scientific GeoConference SGEM 2020","series":"","short":"","website":"https://www.sgem.org","content":"All accepted, after peer-review papers, are published in the Conference Proceedings (ISSN 1314-2704) and yearly are submitted for evaluating and indexing by ISI Web of Science - Clarivate, ELSEVIER products - SCOPUS, Mendeley and COMPENDEX, CrossRef, SPRINGER Nature, EBSCO, ProQuest, RSCI, Google Scholar, CiteULike, British Library and many others. All the accepted papers receive a unique DOI number, needed for recognition in the international databases. SCOPUS indexed Proceedings Scimago Journal Rank: • H index 13 • SJR 0.21 • SNIP 0.457 The 20th International Multidisciplinary Scientific GeoConference SGEM 2020 will be held in the biggest and most modern Bulgarian sea-side resort and SPA Albena Complex, near Varna city, Bulgaria, in brand new 5 star, hi-teched Congress Centre PARADISE BLUE. KEY FEATURES: • Stronger peer review criteria • Double-blinded peer review • Stronger authors criteria • Stronger articles criteria • Multidisciplinarity • Top keynote speakers • High-level presentations • Interesting workshops • Summer school for students The SGEM Scientific Committee has a strong commitment to providing opportunities for conference participants to exchange knowledge and ideas, communicate and learn from each other. The conference program combines a number of sessions and events that are designed specifically to promote interactions among the on-site members of the knowledge geo-community. These range from more formal Oral and Poster sessions, through parallel, Invited Session presentations, and Workshop discussions, to informal coffee breaks and optional social activities. PARTICIPATION FORMS • LECTURER • PHD STUDENTS • DELEGATE • PUBLISHED • ACC. PERSON","date_start":"2020-08-16","date_end":"2020-08-25","important_dates":{"abstract":"","full":"2020-06-30","notification":"","final":""},"topics":["Physical Science & Math","Geology","mining"],"location":{"virtual":"","full":["Albena","Bulgaria"],"name":"","street":"","city":"Albena","state":"","ZIP":"","country":"Bulgaria"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}