{"name":"Short Course on Financial Modelling of Projects and Economic Evaluation","series":"","short":"","website":"https://www.wessex.ac.uk/courses/short-course-on-financial-modelling-2019","content":"Very often, a technically excellent project dies prior to being implemented. The reason for this is usually that the engineer who had proposed the project was not capable of explaining its financial benefits. How does a project (be it a manufacturing line, a power plant, the security protection of a shipping centre or whatever) come to life? Firstly, the technical side has to be developed - which is the engineer’s task. Once this is achieved, the project is ready to be implemented. The key decision makers in this final stage are almost always economists. If the engineer fails to explain why the project is economically advantageous it will not be approved. Hence, a project developer also has to be able to demonstrate the financial feasibility of the engineering work, i.e. presenting key indicators like ROI, specific costs, IRR etc. as well as a financial risk evaluation. The participants of this course will learn how to perform these calculations. The lecturer will use a step-by-step approach, not only covering the right methods and calculations but also overcoming one of biggest problems an engineer has - how, and from where, do I get the data required for carrying out the economic analysis? There are numerous hands-on exercises of real projects with a focus on energy, environment protection, safety and security. The course will also enable the participant to work out banking papers for the funding.","date_start":"2019-09-17","date_end":"2019-09-19","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Managerial Economics","Architecture & Civil Engineering"],"location":{"virtual":"","full":["Ashurst","United Kingdom"],"name":"","street":"","city":"Ashurst","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Wessex Institute"],"societies":[],"indexes":[],"emails":[]}