{"name":"How to write SOP's that Avoid Human Error","series":"","short":"","website":"https://www.complianceonline.com/how-to-write-sop-that-avoid-human-error-webinar-training-704418-prdw?channel=Brownwalker","content":"This training program will address the common human errors and deviations related to the use of procedures. It will also offer best practices for writing SOP’s to reduce the likelihood of human errors. Why Should You Attend: Human error is known to be the primary cause of quality and production losses in many industries. Although it is unlikely that human error will ever be eliminated, many human performance problems can be prevented. Human errors start at the design stage. Procedures play a vital role in human reliability. Nevertheless, it is essential to understand human behavior and the psychology of error as well as understand exactly where the instructions weaknesses are so that procedures can be human engineered, improved and fixed. Procedures account for more than 40% of human error events in manufacturing. The majority of regulatory citations are also related to procedures. Procedures are essential for both execution and audits. These should be written for users without missing relevant information for regulators. Usually, procedures have weaknesses that harm productivity, quality, and regulatory standing. We will discuss from content development to formats designed for human error reduction due to procedures. Areas Covered in the Webinar: SOP writing writing outline Content development The rationale for procedure use Regulatory compliance background Universal purpose of procedures The Human Perspective Human Error as a root cause The thinking and reading process Common mistakes and causes How to create and maintain a procedure Goals of a procedure Good Procedure Writing practices (Terminology, Formats, layouts, mixed cases, steps content, familiar words, references, branching, conditional steps, the use of “Precautions”, “Warnings” and “Cautions,” Procedure styles Use of electronic information networks for procedure access. Frequently Asked Questions: If you have an associated checklist, would you recommend one long checklist for an activity or breaking it down into multiple shorter checklists? Is it recommended to avoid use of words such as 'should' and to say 'must' instead Also, do you recommend use of flow diagrams, photos etc.? When to include as separate work instruction (how much detail to include)? Who Will Benefit: QA/QC directors and managers Process improvement/excellence professionals Training leaders and managers Plant engineering Compliance officers Regulatory professionals Executive management Manufacturing operations directors Human factors professionals","date_start":"2021-10-05","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}