{"name":"3rd Annual Pharma Packaging, Labelling, Serialization, Track & Trace 2021 (Virtual Conference)","series":"","short":"","website":"https://www.virtueinsight.com/pharma/3rd-Annual-Pharma-Packaging-Labelling-Serialization-Track--Trace-2021-Virtual-Conference","content":"3rd Annual Pharma Packaging, Labelling, Serialization, Track & Trace 2021 “Securing your Supply Chain and Quality Management” 15th July 2021, Virtual Conference (Time Zone - IST) Virtue Insight is delighted to announce its 3rd Annual Pharma Packaging, Labelling, Serialization, Track & Trace 2021 to be held on 15th July 2021(Virtual Conference). Get in touch with decision makers not only from the Pharma and Healthcare but also from the Chemical and Food Industry at Packaging and Labelling Conference. Benefit from our deep expert knowledge on Track & Trace and Serialization Solutions and optimize your supply chain with help of our future-proof solutions, partners, and the profound insights of our speakers. Discover how Pharma Packaging Labelling, Serialization and Track & Trace improves consumer safety and supply chain transparency, find out what benefits Pharma Packaging delivers beyond legal compliance, and learn how its help grow your business. DELEGATE REGISTRATION: E-mail - kavitha@virtueinsight.co.in or Call M: +91 9361957193 Please note that this is a PAID event and NOT A FREE event (no complimentary passes available). Any invite, email or tickets issued mentioning it as a free pass or free ticket to this event through any third party site will strictly not be accepted by the organizer. • Early Bird Price (Valid Till 11th June 2021) – (INR 6,000 + GST (18%) per delegate) • Standard Price (Valid From 12th June 2021) – (INR 8,000 + GST (18%) per delegate) • For more than 5 delegates please let us know your interests. Conference Sponsor, Exhibition Stall & Paid Speaker Slot - Please email your interest and queries to kavitha@virtueinsight.co.in KEY SPEAKERS: • MARCEL DE GRUTTER, PM Serialization & Liaison Regulatory & Government Affairs, Abbott (Netherlands) • HEIKO TREFZGER, Product Manager, Business Analyst, Innovation Representative, Roche (Germany) • S.R. SALUNKHE, Former Assistant Commissioner, FDA Maharashtra • CHAKRAVARTHI AVPS, Global Ambassador, Hon Advisor and Director on Board - Pharmaceutical Export Promotion Council, Govt of India, World Packaging Organisation • PRASAD S. DESHPANDE, Senior Vice President& Global Head – Supply Chain Management, Biocon • SUDHIR MOHAN BANSAL, Vice President & India Head of Supply Chain Management, Pfizer • KRISHNA SAI T, Associate Vice President, Biocon • MAHESH MURTHY, Sr. Director of Operations Medical Device, Biocon • VAIBHAV KULKARNI, Director - Regulatory Affairs, Abbott Nutrition • VIPUL JAIN, Associate Director, Cipla • GAURAV BHATIA, Associate Director - Supply Chain, Cipla • PRABIR DAS, Head of Packaging Technical Services, OSD (India), Mylan Laboratories • KAUSTUBH KULKARNI, Senior Manager - Packaging Development, Wockhardt • SHIVAJICHAKRABORTY, Asst. General Manager, Fresenius Kabi • AJAY BAPAT, Independent Pharma Packaging Consultant • VICKRAM SRIVASTAVA, Head of Planning - Supply Chain Management, Ipca Laboratories • SOUMYANATH MISHRA, Head-Packaging Development, Mankind Research Centre • ANAHITA KARANDE, Head - Packaging Development & Procurement, Alembic Pharmaceuticals • MARIAPPAN N, Chief Manager and Global Labeling, Piramal • KINJAL PARIKH, Sr Research Assistant Formulation & Development, Baxter • BHARAT BHUSHAN RATHI, Head Logistics, Mankind Research Centre • RAMESHWAR VERMA, Senior Officer of Track and Trace and Serialization, Intas Pharmaceuticals • KAZI MASUD HASAN, Team Lead - Packaging Development, Dr. Reddy's Laboratories KEY THEMES DISCUSSED: • Smart packaging and e-labelling advancements • Knowing what smart packaging is and how it relates to the labeling process is important. • Addressing some of the most challenging problems in pharmaceutical labeling and package design • How major pharma companies have managed the challenging task of manufacturing labels, records, and packaging. • Smart packaging for pharma industries – How can we make packaging truly intelligent? • Does the future of pharmaceutical packaging seem to be bright? Why smart packaging will affect the pharmaceutical industry’s future. • Addressing the future of life sciences labeling with technology and transparency • Addressing the major changes in the way we manufacture goods, as well as the digitization of manufacturing • Implementation and aggregation of serialization technology and tools • Focusing on the introduction of serialization and discussing some of the problems, solutions, and takeaways • Track & Trace - Serialization is the new normal? Discussing operations in a serialized world • Addressing serialization’s side effects, including the loss of productivity in packaging and warehouse operations. • Packaging and labeling developments in the global regulatory environment • Focusing on global regulatory patterns, standards, and guidelines, as well as their potential consequences for packaging and labeling • Meeting your needs while complying with regulatory requirements • How the pharma industry is keeping up with changing labelling regulations and compliance? • Be part of a major networking opportunity WHO SHOULD ATTEND AND WHO YOU’LL MEET: CEO's, CTO's, CIO's, Presidents, Vice Presidents, Directors Heads & Managers of: Pharmaceutical manufacturers and distributors, Healthcare professionals, Pharmacists, Serialisation, Track and Trace – Solution providers, Brand – protection, enforcement, security, integrity and management companies, Drug regulatory agencies, customs and police, Intergovernmental organizations (IGOs) involved in healthcare and IPR protection, Non-governmental organizations (NGOs) active in healthcare, Patients’ representatives, Healthcare research organizations, Pharmaceutical associations, Anti-counterfeiting organizations, Packaging, labelling and converting companies, Authentication technology suppliers, Anti-counterfeiting service suppliers – IP specialists, investigators, lawyers. CERTIFICATION: E-Certificate of attendance would be provided to attendees on request, upon completion of conference Get more from the event, with a broader scope bringing the whole communications value chain together. Enjoy and make the best out of our dedicated networking time, meet the leading international vendors showcasing the products of tomorrow in the co-located exhibition. Expand your knowledge of the latest business models and strategies in the high-level conference.","date_start":"2021-07-15","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal","Pharmacology & Pharmaceuticals"],"location":{"virtual":"","full":["Online Event","India"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"India"},"organizers":[""],"societies":[],"indexes":[],"emails":["kavitha@virtueinsight.co.in"]}