{"name":"Memory Poetics of Architectural Form(ation)","series":"","short":"","website":"https://memory.lcir.co.uk/memory-poetics-of-architectural-formation","content":"The concepts of (and studies of) memory itself underwent a radical transformation in the 20th century. Static models of archive- and museum-like structures were replaced with a dynamic process of narrativized reconstruction that is susceptible to context, narrator's fallibility, or the 'censorship' on the part of narrator's defense mechanism. This is hardly surprising, given the fact that architectural works are generally thought of as solid and immutable. Outside of normative protocols of creating architecture, however, architects and urban planners never ceased to engage with the evolving branches of memory studies or even neuropsychology – Maurice Halbwachs's concept of collective recollection, Gaston Bachelard's phenomenological account of urban space, or Pierre Nora's places of memory, to name but a few. Instead of an idealized model, we will reflect on alternate perspectives on memory employed in architectural designs. The course is aimed at bringing together conceptual frameworks from architecture, urban studies, and studies on memory, while inspecting examples of projects that problematize the working of our psychic apparatus, i.e. traumatic (collective) events, forced erasure in tabula rasa politics, and the notion of memory voids (amnesia) in relation to city space. We will look into how these cultural and psychological concepts are being embodied in (material) forms by means of design and architectural ideation. Focusing in each of the three meetings on the consecutive themes of lacuna, trace, and sensation, we will bridge the gap between deconstructivist works of Daniel Libeskind and Bernard Tschumi, which channel unconscious anxieties through built theories, unearth the repressed histories of war-torn cities in Lebbeus Woods's Underground Berlin (among his subsequent projects), and immerse in Michael Webb's design for a Proustian Temple Island – a device-landscape for incessant recollection. Let other destinations remain a surprise. For more information, please contact us on academiclab@lcir.co.uk. Registration fee: 150 GBP Register on https://registration-aclab.lcir.co.uk","date_start":"2021-08-14","date_end":"2021-09-05","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","memory studies"],"location":{"virtual":"","full":["Online Event","United Kingdom"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research and Academic LAB"],"societies":[],"indexes":[],"emails":["academiclab@lcir.co.uk"]}