{"name":"Process Mapping for Risk-Based P&PC Using Lean Six Sigma and HACCP","series":"","short":"","website":"https://www.complianceonline.com/process-mapping-for-risk-based-p-pc-using-lean-six-sigma-and-haccp-webinar-training-700817-prdw?channel=brownwalker","content":"There is an on-going major shift in the emphasis of U.S. FDA CGMP compliance emphasis. The 2011 Pharma Process Validation Guidance Document emphasizes “P&PC” to ensure “homogeneity within batch” and “consistency between batches”, basic Dr. Deming, et al. Such changes in regulatory focus should have a major impact on individual compliance objectives, efforts and measurements of success. Using P&PC, lean, six sigma / SPC, together with process mapping / flow charting and HACCP, will yield major business benefits as well: Reduced waste / scrap, early warning of process shifts before non-conforming product is manufactured, increase efficiencies, minimal need for re-validations of equipment and/or process, and opportunities for improvement in quality, through-put. A case of regulatory / business “win-win”. P&PC systems, metrics, and information / analysis, combined lean principles, and six sigma / SPC tools, and the FDA’s QSIT for medical devices and pharmaceutical requirements, together provide an effective, proactive and aggressive / robust methodology to maintain a production process in a “state of statistical control”, and in CGMP compliance for any regulated industry. Software, data integrity, and cybersecurity issues are considered. Such a system greatly reduces the need for equipment / process re-verification / -qualification / -validation.","date_start":"2020-09-30","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Other","Risk Management"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}