{"name":"The Semantic Web Enabled Blockchain Technologies Workshop","series":"","short":"","website":"http://www.isncc-conf.org/workshops/swebt","content":"Scope The aim of this workshop is to provide a meeting point for both practitioners and researchers to discuss and resolve the theoretical and empirical issues reported in Semantic Web (SW) technology by employing the blockchain technology and vice versa. This workshop will provide an opportunity to present the empirical evidence regarding implications of blockchain technology to address the certain SW issues such as knowledge discovery, trust and identity management, annotations and data integration and so on Background The ultimate goal of the SW is to allow computers to do more useful work and to build systems capable of supporting trusted network interactions. Rearchers form different fields are employing SW technologies in contexts ranging from industry to government and science. These application areas include, knowledge graphs, semantic annotations healthcare, data mining and so on. We witnessed the emergence of Blockchain in the last years as a way of distributing assets and trust. This technology has been successfully employed by the research community to reshape domains including finance economy, healthcare and other domain applications development areas by targeting certain SW issues such as RDF tripples, knowledge graps and data mining. This modern distributed ledger paradigm brings with it the possibility to create an endless number of decentralized applications that allow Berners-Lee's concept to be refounded in a new ecosystem without central servers and central control. Unlike RDF triples, in Blockhin transactions, each statement or piece of information is backed up and validated by the protocol. We can trust certain statements or triples using Blockchain (smart contacts), and we can link information and map data from different chains and/or contracts using SW. This integration and complementary nature of both these technologies are what we call Semantic Blockchain (SB). A semantic layer in the blockchain that offers special protocol improvements. There are certain SW tasks where blockchain could be successfully employed and vice versa to obtain effective findings and can aid the research community to develop robust systems. In this regard, the research community of different application domains needs to get theoretical or empirical evidence regarding the implications of SB technology. This workshop will be a vital platform for academic and industrial researchers of the corresponding domains. Suggested Topics We invite proposals from colleagues in academia, government, and for-profit and not-for-profit organizations. We encourage students, researchers, test developers and teachers to present papers on projects related to SW practices via Blockchain Technology. Topics of interest include, but are not limited to: • Semantic data mining and knowledge discovery on the blockchain. • Semantic information management & knowledge integration. • Semantics in blockchain and distributed ledger technologies. • Semantic smart contracts. • Semantic queries and analytics on blockchains. • Blockchain-enabled SW and AI scenarios and applications. • Semantic models for forensics, defenses, and countermeasures on blockchain platforms. • Blockchain trust verification models, distributed trust semantics, and integrity proofs for distributed trust graphs. • Anonymity and privacy issues among blockchain. • Trust and identity management in SW using blockchain. • Annotations and data integration in the blockchain using SW research. Prospective authors are invited to submit an original Full or Short paper in IEEE PDF format via the EDAS online submission system: https://isncc-2020-swebtworkshop.edas.info/ Important Dates February 10, 2020 Submission Deadline March 29, 2020 Notification of Acceptance/rejection April 12, 2020 Early Bird Registration May 03, 2020 Regular registration and Camera-ready copies of accepted papers","date_start":"2020-06-16","date_end":"","important_dates":{"abstract":"","full":"2020-02-10","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Blockchain technology"],"location":{"virtual":"","full":["Islamabad","Pakistan"],"name":"","street":"","city":"Islamabad","state":"","ZIP":"","country":"Pakistan"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}