{"name":"IAS 12 Taxes-IFRS Essentials","series":"","short":"","website":"https://bit.ly/3oCfv1b","content":"We all know that domestic and foreign taxes are based on taxable profits. But how exactly do you account for the current and future tax consequences of transactions and other events in IFRS? When can you defer taxes and when do you have to record a tax expense? What about taxes on revaluation of assets? How do you account for taxes on share-based payments (options)? Can you offset tax assets and tax liabilities? This webinar will answer these and many other questions about IFRS and Taxes. Why Should You Attend This session will help you meet the double objectives of complying both with Tax filing requirements and IFRS compliance. Objectives of the Presentation » Apply the treatment of future recovery (settlement) of the carrying amount of assets (liabilities) » Allocate correctly tax liability » Know how and when to offset of tax assets and tax liabilities » Understand taxable and deductible temporary differences and unused tax losses and credits » Understand the rules for re-valuating deferred tax assets Areas Covered in the Session » Foreign and domestic taxes » Recognition of tax liability » Measurement, revaluation, and discounting of deferred tax assets and liabilities » Investments in subsidiaries, branches and associates and interests in joint ventures » Items recognized within and outside profit or loss » Tax effect (including deferred tax) of a business combination » Deferred tax liability » Current and deferred tax on share-based payment transactions » Financial Statement Presentation and Disclosures Who Will Benefit » CEO/CFO » Board members » External auditors » Compliance professionals » Operational professionals » Finance professionals » Internal auditors To Register (or) for more details please click on this below link: https://bit.ly/3oCfv1b Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-02-04","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Finance"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}