{"name":"11th International Scientific Conference of the Faculty of Management of the Cracow University of Economics Knowledge - Economy – Society CFM 2019","series":"","short":"","website":"www.cfm.uek.krakow.pl","content":"Main topics of the conference • Theoretical and application problems of management • Enterprise management on the global market • Information, knowledge and intellectual capital management • Managing information in an enterprise • Information systems in management of organizations • Innovativeness and entrepreneurship • Commercialization of scientific researches • Methods and quantitative tools in management • Financial management • Accounting in organization management • Marketing aspects of enterprise management • Management in tourism and leisure sector Events within the Conference: 1\\. Quadrilateral Scientific Seminar This year's conference will be united with the debates of the 17th Polish-Italian-Ukrainian-Serbian Scientific Seminar on „Contemporary trends and transformations of economies and enterprises. Economic, Social and Legal Aspects”, taking place within strategic alliance and quadrilateral agreements of Cracow University of Economics with University of Messina, Kyiv National University of Trade and Economics and University of Kragujevac. . 2\\. Student and doctoral session Within the framework of the conference sessions, traditional panel sessions intended for students and doctoral students of Polish and foreign universities will take place. It is an annual forum of the exchange of knowledge, thoughts and views of the community of students and doctoral students from all over the world. The fruit of these sessions is also a separate publication, collecting the output of the student session participants in the form of a monograph, whereas doctoral students’ papers are published in the main, reviewed conference monograph. An element of the student and doctoral session will also be a poster session, giving young scientists the opportunity to present the results of research and to conduct discussions with the use of science posters.","date_start":"2019-05-29","date_end":"2019-05-30","important_dates":{"abstract":"","full":"2019-03-31","notification":"","final":""},"topics":["Business","Management / Leadership"],"location":{"virtual":"","full":["Cracow","Poland"],"name":"","street":"","city":"Cracow","state":"","ZIP":"","country":"Poland"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}