{"name":"Introduction to Film and Psychoanalysis","series":"","short":"","website":"https://film.lcir.co.uk/online-workshop","content":"Introduction to Film and Psychoanalysis 27 July 2021 – Online Workshop 1pm-4pm (London Time) organised by London Centre for Interdisciplinary Research and Academic LAB Film and Psychoanalysis emerged in the same year, when the Lumière brothers patented the cinematograph in France in 1895, just as the Viennese neurologist Sigmund Freud published the very first psychoanalytic text Studies on Hysteria with his colleague Josef Breuer. For 125 years these two disciplines have grown alongside each other, influencing and challenging one another. In this workshop a special focus will be placed on the film medium's unique capacity to communicate unconscious motives often considered taboo by society. Ultimately, it will be argued that psychoanalysis applied to cinema empowers spectators to express subjective associations they consider to be meaningful. The following films will be discussed (advance viewing is optional): The Discreet Charm of the Bourgeoisie (Luis Buñuel,1972) Eyes Wide Shut (Stanley Kubrick, 1999) The Dark Knight (Christopher Nolan, 2008) Stories We Tell (Sarah Polley, 2012) The Wrestler (Darren Aronofsky, 2008) Merry Christmas Mr Lawrence (Nagisa Ōshima, 1983) The workshop is designed and led by Mary Wild, the creator of the PROJECTIONS lecture series at Freud Museum London, applying psychoanalysis to film interpretation. Her interests include cinematic representations of mental illness, doppelgängers and the unconscious in the genres of horror, science fiction and documentary. Mary also co-hosts the PROJECTIONS Podcast available on iTunes and Spotify. In order to book a place, please register on http://registration.lcir.co.uk by 1 June 2021\\. All registered participants who will attend the workshop will receive certificates. Registration fee is 45 GBP Contact email address: workshops@lcir.co.uk","date_start":"2021-07-27","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Arts & Humanities","Visual Arts","Film & Cinema"],"location":{"virtual":"","full":["Online Event","United Kingdom"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["workshops@lcir.co.uk"]}