{"name":"2021 International Conference on Market、Blockchain and Prediction Model（MBPM 2021）","series":"","short":"","website":"http://mbpm.icemme.org/?lang=en","content":"1.Important Information 2021 International Conference on Market、Blockchain and Prediction Model（MBPM 2021） CONFERENCE INFORMATION: Website：www.icemme.org Conference Date：November 26-28, 2021 Venue: Shanya, China Submission Deadline: July 20, 2021 Indexing: EI, Scopus The 2021 International Conference on Market, Blockchain and Prediction Model (MBPM2021) will be held in Sanya from November 26 to 28, 2021\\. The purpose of the conference is to provide an international platform for experts, scholars, engineers and technicians, and technical R&D personnel engaged in related fields such as \"blockchain\", \"market\" and \"prediction model\", to share scientific research results, broaden research ideas, collide with new ideas, and strengthen academic research, and to explore the key challenges and research directions faced by the development of this field, and promote the industrialization cooperation of academic achievements. Experts, scholars, business people and other relevant personnel from universities and research institutions at home and abroad are invited to attend the conference. 2.CALL FOR PAPER 1).Market ◆Market Economy Analysis and Marketing Straegy ◆Empirical Strategy Research ◆Enterprise Development and Countermeasure Strategy ◆The Influence of Consumers' choice on Market ◆Development ◆Investment and Risk Management ◆Research on Enterprise Development Strategy under Market Economy ◆Mode Optimization and Comparative Study ◆Research on Legal Issues ◆Technological Innovation under The New Situation 2). Blockchain: ◆Blockchain Security Technology ◆Consensus Algorithm and Optimal Balance ◆Bitcoin and Digital Currency ◆Stock Right Registration and Securities Trading ◆Government Affairs and Finance of Blockchain ◆Blockchain Type and Infrastructure ◆Smart Contract ◆Scalability and Cross-chain Technology ◆Research and Application Direction of Energy Blockchain 3). Forecasting Model and Market Economy Development ◆Forecasting Method and Combined Forecasting Model ◆Research on Factors Affecting Market Economy ◆Establish a Model to Predict The Future Development of The Market ◆Least Squares Support Vector Machine ◆Mathematical Model and Regression Analysis ◆Principal Component Analysis ◆Other Topics Related to Markets、Blockchain Field and Forecasting Models 3.Publication Submit to Conference Proceedings (EI) 1).All papers, both invited and contributed, will be reviewed by two or three experts from the committees. After a careful reviewing process, all accepted papers of MBPM 2021 will be submitted to EI Compendex, Scopus for indexing. Submit to Online Journal 2). If you would like your manscript to be indexed by CNKI & Google Scholar, there is an international Journal for you. Journal of Contemporary Educational Research (JCER) is an international, peer-reviewed and open access journal which promotes the evaluative, integrative, theoretical and methodological research on contemporary education; shape a novel, broader view of issues in contemporary education; enhance the caliber of humanities research through active use of best domestic and foreign practices; and integrate the achievements of various sciences and knowledge areas with unconventional approaches. All relevant papers are carefully considered, vetted by a distinguished team of international experts, and rapidly published. Original articles, short communications, case studies and comprehensive review articles can be submitted online via the journal submission and peer review site. Proceedings of Business and Economic Studies (PBES) is an international, peer-reviewed and open access journal which focuses on theoretical and applied studies of corporate and financial behavior. Aiming to promote the research in fields of business economics and management, it covers mainly but not limits to the following areas: accounting and financial management, economics, human resource management and organizational behavior, information management, international business, strategy and innovation, management science and operations management, marketing and retailing. Scientific and Social Research(SSR) publishes papers devoted to quantitative social science research and methodology. The journal features articles that illustrate the use of quantitative methods to empirically test social science theory. The journal emphasizes research concerned with issues or methods that cut across traditional disciplinary lines. Special attention is given to methods that have been used by only one particular social science discipline, but that may have application to a broader range of areas with an ultimate goal of testing social science theory. Submit to SCI journal 3). Selected 10 papers will be recommended for publication in SCI journal. Resources Policy（ISSN: 0301-4207, IF=3.986） Singapore Economic Review (ISSN: 0217-5908, IF=0.807) Climate Change Economics (ISSN: 2010-0078, IF=1.271) Economic Change and Restructuring (ISSN: 1573-9414, IF=1.5) Economic Research(ISSN: 1331-677X, IF=2.229) Sustainability (ISSN: 2071-1050, IF=2.576) \\*All submissions must not be less than 10 pages in length，and papers should be submitted to SCI Submission System. Note: All submitted articles should report original, previously unpublished research results, experimental or theoretical. Articles submitted to the conference should meet these criteria and must not be under consideration for publication elsewhere. We firmly believe that ethical conduct is the most essential virtual of any academic. Hence any act of plagiarism is a totally unacceptable academic misconduct and cannot be tolerated. 4.Submission Methods 1).The submitted papers must not be under consideration elsewhere. 2).Please send the full paper(word+pdf) to SUBMISSION SYSTEM 3).Please submit the full paper, if presentation and publication are both needed. 4).Please submit the abstract only, if you just want to make presentations. 5).Templates Downlow ：Templates 6).Should you have any questions, or you need any materials in English, please contact us at icemme@163.com Note: 1)Both Abstract and Full Paper are welcomed. The author can make an oral presentation after the Abstract is accepted and the payment is finished. 2)All submitted articles should report original, previously unpublished research results, experimental or theoretical. Articles submitted to the conference should meet these criteria and must not be under consideration for publication elsewhere. We firmly believe that ethical conduct is the most essential virtual of any academic. Hence any act of plagiarism is a totally unacceptable academic misconduct and cannot be tolerated. 5.CONTACT US Conference Secretary: Doris Wang E-mail: icemme@163.com Tel: +86-13502444340(Wechat) QQ: 2141235574 The Secretary office of MBPM 2021 is responsible for the daily organizing work. All paper will be reviewed by Program Committee Member and invited experts. If you have any question or inquiries, please feel free to contact us.","date_start":"2021-11-26","date_end":"2021-11-28","important_dates":{"abstract":"","full":"2021-11-24","notification":"","final":""},"topics":["Business","Economics","Finance"],"location":{"virtual":"","full":["Sanya","China"],"name":"","street":"","city":"Sanya","state":"","ZIP":"","country":"China"},"organizers":["艾思学术"],"societies":[],"indexes":[],"emails":["icemme@163.com"]}