{"name":"How to Deal with Difficult People - Techniques to Reduce Conflict and Stress","series":"","short":"","website":"https://bit.ly/3oIDxYG","content":"\"The difficult people we encounter can be our greatest teachers.\" -- Eileen Anglin Difficult people are found in every walk of life. They come in many forms. Given that we can't avoid or eliminate them from our world, the next best solution is to learn how to deal with difficult people effectively. Learning how to recognize what they are doing, and why that’s creating so much difficulty for you, and those around you, is the first step. From that recognition, you can create a plan for how to shift the impact they have on you and the environment. There are a host of specific tools, techniques, tactics and strategies that will work when you want to shift the relationship and outcome. Learning to use the right tool, technique, etc. in the right situation is key to creating positive change. Why Should You Attend Let’s be honest here … you probably have people in your life ... that, if they would just go away!… your life would be easier? Interacting with them is exhausting and frustrating - even thinking about interacting with them is discouraging and causes you to despair the situation will never get any better. We all have those people in our lives. The reality is, having them out of your life is not practical - they may be your boss, staff, colleague, customer, vendor, friend, or family member. You've probably thought to yourself - \"what can I do?\" You avoid them … you spend inordinate amounts of time, cognitive and emotional energy, trying to figure out work-arounds and effective strategies, but none of it is working. You want to just throw up your hands and say - \"That's it, I’m done\". Again, not practical. Here's some good news. There are practical solutions. This webinar is filled with tips, techniques, strategies and tools that will make your dealings with difficult people much easier. You will no longer have to say to yourself \"I just don't know what to do\", because you will have a toolbox full of responses that will be game changers. You'll know where to direct your energy, instead of feeling frustrated and at a loss about what do to, you will feel empowered with very clear and effective responses. You'll learn how to deal with difficult people at work, how to diagnose exactly what the person is doing and why it is so frustrating for you. You'll begin to see patterns that you hadn't seen before. Specific language to use in specific situations. What skills you can learn to get on equal footing. Create a plan with specific targeted timing that will get you the result you want. You will also learn the techniques of managing conflict in the workplace. Attend this webinar and take the first step in relieving the frustration and exasperation … and making your life a whole lot easier. Objectives of the Presentation In this webinar you will learn how to identify why you experience some people as difficult and learn specific tips, techniques, strategies and tools for interacting with them effectively to both get the job done and have less stress in your life. Areas Covered in the Session Participants will learn: » Where specifically to focus your energy to create a positive change in the relationship » A very targeted set of skills to use with difficult people » Advanced strategies for managing conflict in the workplace to make even the most seemingly intractable situation productive » What to watch for in body language and the counter-intuitive response that will completely shift the situation » Diagnosing their preferred style of communication and how to adapt yours to change the way they connect with you » How to manage difficult employees by creating a practical, effective outcome focused plan » Why some of the words and phrases you have been using have not been working … and what words and phrases to use instead » Strategies for managing stress in the workplace This webinar is for you if: » You interact with people » You’re frustrated and exhausted by some of the people you have to deal with regularly » You spend way too much time thinking about how to deal with one or more people in your world » You have a team or organizational leadership role » You want specific practical tips, tools, techniques, tactics and strategies to effectively deal with the most difficult people in your life Who Will Benefit » HR Professionals » CEO » COO » People Managers » Leaders » Directors » Managers » Supervisors » Business Owners » Business Consultants » Department Managers » Senior Leaders » Staff at all Levels To Register (or) for more details please click on this below link: https://bit.ly/3oIDxYG Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2020-12-14","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Human-Resources"],"location":{"virtual":"","full":["United States"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":["AbideEdict"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}