{"name":"The “CROSS-INTER-MULTI-TRANS-“ disciplinarit(ies) of English Studies","series":"","short":"","website":"http://www.assenglish.org/cimt","content":"CALL FOR PAPERS The “CROSS-INTER-MULTI-TRANS-“ disciplinarit(ies) of English Studies 5th ASSE conference on British and American Studies 6-8 June 2019, Vlora, Albania Deadline for submissions: 31 March 2019 In today’s world when the exchange of information, the means of communication, the advance of technology, the organization of our daily routine have become so multifaceted, the study of various phenomena surrounding us also calls for a complexity of ways to their solutions or answers. Researchers and scholars quite often resort to mixture of approaches and methods for the understanding of the problems around us and for providing answers to them or attempting to solve them. Quite often these solutions come from the integration and interaction of various disciplines that could address these research questions. Thus one and the same problem can be looked into from a single disciplinary perspective or, instead, from multidisciplinary, cross-disciplinary, interdisciplinary or transdisciplinary perspectives. Attempts are often made to distinguish one from the other but one cannot deny the rising tendency to study things or research problems from a comprehensive integrated perspective that goes across disciplines. In this regard, English Studies, as a distinct discipline that integrates in itself several others are not immune to research methodologies that combine such perspectives. In this conference, we invite scholars to challenge their perceptions of English Studies by engaging themselves in a reflection about the nature of English Studies themselves with the purpose to discover the “CROSS-INTER-MULTI-TRANS-“ disciplinarit(ies) of English Studies. Some of the proposed topics for this conference include: • Integrating linguistics, literature, translation and cultural studies • English Studies approached from today’s research perspectives • Crosscultural, intercultural, transcultural, multicultural, pluricultural, what else? • Language disciplines and their interdisciplinary/multidisciplinary nature • Intercultural communication as interdisciplinary/multidisciplinary • Literary theory as interdisciplinary/multidisciplinary • The influence of technology in the multidimensional nature of language, literary and cultural studies today • Current trends in semiotics • The multimodality of language studies today • Language in culture, culture in language • Language teaching and learning as the integration of various approaches, methods and technologies • Interdisiplinary collaboration in ELT • Multidisciplinary approaches to ESP • Intersemiosis: From translation to transduction • Cultural Studies and Applied Linguistics • Translation, Linguistics and Culture • The influence of technology in the study of literature, culture and language • Representations of culture in social media Papers are welcomed from but are not limited to: • British and Commonwealth Literature • American Literature • Literary Theory • Literary Criticism • Cultural Studies • Intercultural Communication • Communication Studies • Media Studies • Discourse Analysis • Pragmatics • Linguistics • Semiotics • Translation Studies • Applied Linguistics • ESP The conference language is English. Please send your abstracts (about 250 words) for papers (20 min) as an MS word attachment to the following email address by 31 March 2019: asse2019@assenglish.org For more information, please check the conference website, http://www.assenglish.org/cimt/ . A selection of papers will be published in the journal in esse: English Studies in Albania, Vol. 11, No. 1 and in esse: English Studies in Albania, Vol. 11, No. 2\\. (http://www.assenglish.org/publications/).","date_start":"2019-06-06","date_end":"2019-06-08","important_dates":{"abstract":"","full":"2019-03-31","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","Humanities"],"location":{"virtual":"","full":["Vlora","Albania"],"name":"","street":"","city":"Vlora","state":"","ZIP":"","country":"Albania"},"organizers":["Albanian Society for the Study of English"],"societies":[],"indexes":[],"emails":["asse2019@assenglish.org"]}