{"name":"Current Trends Issues and Challenges in Diverse Societies","series":"","short":"CTICDS 2021","website":"https://culturesconference97.webnode.com","content":"CURRENT TRENDS, ISSUES AND CHALLENGES IN DIVERSE SOCIETIES Since its foundation in 2017, the Cultures Conference has acted as a learning platform for academic and educational institutions, research centres, institutes, organisations and industry, enabling presentation, discussion and education on key issues, trends and recent developments in the social sciences, humanities, arts, education, business and management fields. Scholars, researchers, practitioners, consultants, trainers, professionals and policy makers from across the world are invited to share their expertise, research results, new ideas, solutions and valuable experience. The conference is an opportunity for attendees to establish academic and business relations and find global partners for future collaboration. CONFERENCE TOPICS CTICDS 2021 encourages interdisciplinary and multidisciplinary research, and theoretical and empirical papers! Topics of interest include, but are not limited to, the following areas: IDENTITY AND CULTURE Cultural Identity and Diaspora, Identity and Nationalism, Cultural Imperialism, Ethnicity, Race and Conflict, Identity and Belonging, Cultural Integration and Immigration, Migration and Identity, Marginalisation and Minorities, Xenophobia and Ethnocentrism, Culture Shock and Adaptation, Cultural Heritage and Identity, Arts and Cultural Management, Religion and Culture, Religion and Identity, Religion and Morality, Religion and Spirituality, Religions and Beliefs Systems, Cultural Relativism, Ethnography and Culture, Oral History and Ethnography, Folklore and Modernity. INTERCULTURALISM AND MULTICULTURALISM Interculturalism vs. Multiculturalism, Intercultural Communication and Diplomacy, Cultural Stereotyping and Intercultural Communication, Developing Intercultural Sensitivity, Intercultural Awareness and Intercultural Empathy, Intercultural Communication and Cultural Stereotypes, Intercultural Relations, Integration and Intercultural Dialogue in Europe, European Backlash against Multiculturalism, Intercultural Language Teaching, Politics of Multiculturalism. LANGUAGE AND EDUCATION Language, Power and Ideology, Education for Global Citizenship, Bilingual Education, Minority and Heritage Languages, English as a Lingua Franca, Foreign Language Education, Language and Intercultural Communication, Intercultural Competence through Language Education, Multilingualism and Multilingual Education, Adult Education, Digital Education, Education for Innovation, International Educational Exchange Programs, Enterprise Education, Education and Gender Equality, Inclusive Education Systems, Ethical Issues in Education, Cultural Education. GENDER AND SOCIETY Gender Identity and Roles, Gender and Marginalised Groups, Gender Relations and Conflict, Education for Gender Equality, Gender and Sexuality, Women and Leadership, Women and Politics, Women in Entrepreneurship, Career and Motherhood, Hegemonic Masculinity, Gender Differences in Communication, Women and Technology, Gender Inequality in Employment, Patriarchy, Sexism and Gender Differences, Gender Norms and Stereotypes, Feminist Art, Transnational Feminism, Feminism and Mass Media, Feminism and Popular Culture. NGOs AND HUMANITARIAN AID Human Rights and International Humanitarian Law, Humanitarian Diplomacy, Refugee Crises and Human Rights, Humanitarian Organisations and Humanitarian Work, Humanitarian Innovation Programmes, Humanitarian Leadership, Humanitarian and Disaster Relief, Humanitarian Relief Chains, Future of Humanitarian Action, NGOs and Development, NGOs and Education, NGOs and Civil Society, NGOs and Issues of Accountability, NGOs and Peacebuilding, NGOs as Conflict Managers. ORGANISATIONAL DIVERSITY Diversity Management Practices, Workplace Diversity and Inclusion, Equality and Diversity Policies, Cultural Diversity and Implications, Models for Diversity Training, Policy Making on Diversity in/out of Europe, Country Perspectives on Diversity and Equality, Age Diversity, Gender Diversity and Leadership, Inclusive Leadership, Corporate Diversity Programmes, Diversity Climate Perceptions, Diversity and CSR, Politics of Diversity, Religion, Equal Opportunities and Fairness. ORGANISATIONAL BEHAVIOUR Misbehaviour in Organisations, Formal and Informal Networks in the Workplace, Successful Ageing at Work, Emotion in Organisations, Job Stress and Burnout, Emotional Intelligence and Resilience, Organisational Politics and Power, Creative and Innovative Management, Transnational Innovation, Organisational Climate and Job Motivation, Organisational Development Strategies, Rewarding and Recognising Employees, Globalisation and Corporate Culture, Managing Organisational Change, Work/Life Balance. INTERCULTURAL BUSINESS National vs. Corporate Culture, Cross-cultural Management, Cross-cultural Business Relationships, Intercultural Dimensions of Business, Intercultural Service Encounters, Intercultural Business Communication, Intercultural Business Networks, Cultural Differences in Business Ethics, Cultural Styles of Conflict Management, Negotiation Styles in Intercultural Business Communication, Global Leadership Skills, Culture-sensitive Strategies, Cross-cultural Training for Business Expatriates, Cultural Adaptation and Business Relationships, Intercultural Competence for Global Leaders. INTERNATIONAL BUSINESS Global Management Competencies, Management in Developing Countries, Competitiveness of Nations and Firms, Emerging Markets, Language Issues in Multinational Management, English for International Business, Competing in the Global Marketplace, Modern Global Economy, International Expansion, Coordination in Global Teams, The Global Manager's Work, Mergers and Acquisitions, National Business Systems, HRM Best Practice, International HRM, Global vs. Local CSR Strategies, Doing Business in Europe/Middle East/Asia/Africa. PRESENTATION MODES ORAL PRESENTATION: Specific allocated time will be given to presenters and additional minutes will be added for Q&A (questions and answers), which will be moderated by the session chair. The required technical equipment will be provided for PowerPoint presentations. POSTER PRESENTATION: Each poster must include text in a large enough font to be read easily on an A1 poster (594 x 841 mm). Material should be displayed in logical sequence (introduction, development, conclusion). We strongly recommend avoiding glossy or heavy material when printing your poster. WORKSHOP: You are welcome to organise a workshop relevant to the theme of the conference if you prefer to give your audience a first-hand learning experience. PANEL DISCUSSION: Suggested topic \"Global impact of the Coronovarius COVID-19\". An event organised by Cultures Conference in collaboration with AZM University (Lebanon), Dimitrie Cantemir Christian University (Romania), SIETAR Italia (Italy) and Filomathia Greek Language Centre (Greece) Contact Person and Programme Chair: Dr Eirini Daskalaki Email: culturesconfechania@gmail.com","date_start":"2021-09-03","date_end":"2021-09-04","important_dates":{"abstract":"","full":"2021-07-23","notification":"","final":""},"topics":["Social Sciences","Anthropology / Archaeology","cultural studies"],"location":{"virtual":"","full":["Chania","Crete","Greece"],"name":"","street":"","city":"Chania","state":"Crete","ZIP":"","country":"Greece"},"organizers":["Cultures Conference, Under the Auspices of the Cultural Centre of Chania and the Region of Crete-Reg"],"societies":[],"indexes":[],"emails":["culturesconfechania@gmail.com"]}