{"name":"Oral History Workshop","series":"","short":"","website":"http://www.lcir.co.uk/oral-history-workshop","content":"Oral History Workshop 25 October 2020 – Online The workshop is designed for students, young scholars independent researchers and history, culture and tradition enthusiasts who would like to improve their academic skills, introduce oral history in their work, engage with oral tradition and also record and preserve unwritten stories. The workshop will overview methods and techniques an oral historian can use, including how to organise a project, prepare and manage interviews, read critically, evaluate sources and manage a project. We will analyze all the stages of a successful project and step by step we will focus on key elements. Interviewing techniques, essential equipment and necessary software, work preservation and dissemination are only some of the aspects we will work on. . Topics will include: Discovering and Understanding Oral History Establishing Contacts and Choosing a Topic Preparing and Organizing a Project Documentation and Legal aspects Interviewer and Interviewee: Setting the Outline Questions and Ethical Aspects Voice and Video Recording Note Taking and Interview Basics Digital Humanities Tools Software and Equipment Transcription, Indexing and Citing Oral History Preserving and Protecting Material Dissemination your Project- Blogging and Sharing Oral History in Scholarly Projects- Dos and Don’ts Oral History in Education & its Role in Memory Preservation All the participants who will attend the workshop will receive certificates. The workshop is designed and led by Dr. Konstantinos D. Karatzas. In order to book a place, please fill in the booking form and send it to workshops@lcir.co.uk by 20 September 2020\\. After you receive a confirmation of booking, please register on https://registration.lcir.co.uk. Registration fee – 45 GBP","date_start":"2020-10-25","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Arts & Humanities","History","interdisciplinary"],"location":{"virtual":"","full":["Online Event","United Kingdom"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research and Academic LAB"],"societies":[],"indexes":[],"emails":["workshops@lcir.co.uk"]}