{"name":"Verification and Validation - Product, Equipment/Process, Software and QMS","series":"","short":"","website":"https://www.complianceonline.com/verification-and-validation-product-equipment-software-and-qms-seminar-training-80058SEM-prdsm?channel=Brownwalker","content":"Develop / review a company's Master Validation Plan for major cGMP deficiencies. Address the U.S. FDA's newer and tougher regulatory stance. One major failing is lack of sufficient or targeted risk-based V&V planning: Start with a Master Validation Plan; Evaluate its elements against ISO 14971 and ICH Q9 for hazard analysis and product risk management; The Individual V&V Plan; V&V Project Management; “Risk-based” per ISO 14971, ICH Q9, and/or GAMP/JETT; Two key input analysis tools; Change control and “drawing a line in the sand”; Develop meaningful V&V Files and Protocols for: Products; Process; Production Equipment; Monitoring and Test Equipment; Learning Objectives: Understand Verification and Validation, differences and how they work together Develop a “Working Definition” of V&V, Qualification, and related terms Discuss recent regulatory expectations How to document a “risk-based” rationale, and use it in a resource-constrained environment Determine key “milestones” and “tasks” in a project; device sample provided Locate and document key subject “inputs” Compile “generic” Master and Individual Validation Plans Lean the key element of a Product V&V File / Protocol How to develop Process and/or Production / Test Equipment V&V Files / Protocols Basic Test Case / Script construction Sample sizes and their justification Who will Benefit: This seminar will provide valuable assistance to all regulated companies that need to review and modify their Master Validation Planning and Plan(s). While this information is focused on Medical Devices, its principles apply to personnel / companies in the Pharmaceutical, Diagnostic, and Biologics fields. The employees who will benefit include: Senior and middle management and staff Regulatory Affairs QA/QC IT/IS R&D Production Management Manufacturing Engineers Process Engineers Software Engineers Project Managers Hardware and software vendors, sales and marketing","date_start":"2022-01-18","date_end":"2022-01-19","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}