{"name":"The 2nd Int'l Symposium on Water Resources Management and Pollution Control","series":"","short":"WRMPC 2019","website":"http://www.novevents.org/conference/WRMPC2019","content":"The 2nd Int'l Symposium on Water Resources Management and Pollution Control (WRMPC 2019) Conference Date: November 22-24, 2019 Conference Venue: Guilin, China Website: http://www.novevents.org/conference/WRMPC2019/ Online Registration System: http://www.novevents.org/RegistrationSubmission/default.aspx?ConferenceID=1154 Email: rolin\\_zhang@163.com If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal，please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: rolin\\_zhang@163.com Tel: +86 15172330844 QQ: 3025797047 WeChat: 3025797047 Conference Topics Topics: The conference is soliciting state-of-the-art research papers in the following areas of interest: Water Management and Planning Water rights and Accessibility Water Markets Economics and Policies Sedimental Soil Erosion Irrigation Water resources in Arid Regions Ground Water Urban Water Management Hydraulic Engineering Water Quality and Pollutant Control Water Quality and Health River Basin Management Flood Risk Management Hydroinformatics GIS and Remote Sensing Trans-boundary Water Management Water, Food and Energy Socio-economic Aspects Water Resources Strategies Innovative Technologies Water and the Community Integrated Water Analysis Wetlands as Water Sources Storm Water Management Other Related Topics","date_start":"2019-11-22","date_end":"2019-11-24","important_dates":{"abstract":"","full":"2019-10-22","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental"],"location":{"virtual":"","full":["Guilin","China"],"name":"","street":"","city":"Guilin","state":"","ZIP":"","country":"China"},"organizers":[""],"societies":[],"indexes":[],"emails":["_zhang@163.com"]}