{"name":"\"Cultural Divides: Bridging Gaps and Making Connections\"","series":"","short":"","website":"https://www.utep.edu/liberalarts/hera","content":"Humanities Education and Research Association HERA Call for Papers 4-6 March 2021 \"Cultural Divides: Bridging Gaps and Making Connections\" 1st Virtual Conference The Humanities encompasses a vast story comprised of many stories. From the classics through the present day, from ancient times to the contemporary, the humanities as a discipline speaks through time, as a voice for many cultures, addressing many peoples. HERA invites research, papers, panels, and presentations embracing inclusivity in all aspects of the human conditions––including, but not limited to, race, class, gender, sexuality, age, veteran status, ability, power, ecology, sustainability. We encourage a wide and extensive representation of disciplines and interdisciplinary projects. Every field in the humanities, liberal & creative arts, and social sciences is appropriate. Our goal is to foster the sharing and expressing of the humanities as an urgently important human enterprise––helping to clarify the crucial immediacy of the humanities and why they should be encouraged, supported, and sustained. Submissions are encouraged from educators at all levels as well as all those with an interest in the arts and humanities. Proposals for papers, panels, or workshops (150-200 words) must be submitted through the conference submission portal on HERA’s website. heraconference.org HERA's Undergraduate Humanities Prize A prize of $500 will be awarded to the best undergraduate conference paper that addresses race, ethnicity, gender, or sexuality. Creative presentations, readings, and exhibitions are also welcomed. Undergraduate students applying for the prize, must indicate this on their submission abstract. HERA Undergraduate Research Prize A prize of $1,000 will be awarded to the best undergraduate conference paper (or divided among a panel of papers), sponsored by an attending professor (with a $500 prize awarded to the professor). See HERA’s website for more details. Creative presentations, readings, and exhibitions are also welcomed. Undergraduate students may apply for only one of the two undergraduate prizes. Questions may be directed to the conference organizer, Marcia Green (mgreen@sfsu.edu) Presentation time for individual papers is limited to 15-20 minutes. Deadline for submission: no later than January 25, 2021.","date_start":"2021-03-04","date_end":"2021-03-06","important_dates":{"abstract":"","full":"2021-03-04","notification":"","final":""},"topics":["Arts & Humanities","History","Humanities"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["Humanities Education and Research Association"],"societies":[],"indexes":[],"emails":["mgreen@sfsu.edu"]}