{"name":"2022 3rd International Conference on Materials Science and Engineering (IC-MSE 2022)","series":"","short":"","website":"www.ic-mse.org ","content":"2022 3rd International Conference on Materials Science and Engineering (IC-MSE 2022) will be held in Suzhou University of Science and Technology, Suzhou, China during Apeil 13-15, 2022\\. It brings together leading academic scientists, researchers and research scholars to exchange and share their experiences and research results on all aspects of materials science and engineering (IC-MSE 2022). Prof. Changming Li from School of Materials Science and Engineering of Suzhou University of Science and Technology, China will be our conference chair, Prof. Chunxian Guo from School of Materials Science and Engineering, Suzhou University of Science and Technology, China and Prof. Masaru Tanaka from Institute of Materials Chemistry and Engineering, Kyushu University, Japan will give keynote speeches. All the accepted and registered papers will be published in Materials Science Forum (ISSN web 1662-9752), which will be indexed by Ei Compendex, Scopus, Chemical Abstracts Service (CAS), REAXYS, Chimica, etc. \\*The high quality papers with great extension will be recommended to publish in Materials, 5-Year Impact Factor: 3.920 (2020). Submission Deadline Before Jan 15, 2022 Notification of Acceptance On Feb 1, 2022 Registration Deadline Before Feb 10, 2022 Conference Dates On April 13-15, 2022 Paper submission: 1.Conference Submission System: https://cmt3.research.microsoft.com/ICMSE2022 2.Mail: ic-mse@isaeri.org Conference Secretary: Ms. Alice Li Tell: +852-30756685 Mail: ic-mse@isaeri.org Conference website: www.ic-mse.org","date_start":"2022-04-13","date_end":"2022-04-15","important_dates":{"abstract":"","full":"2022-01-15","notification":"","final":""},"topics":["Engineering & Technology","Material/Nanotechnology"],"location":{"virtual":"","full":["Online Event","China"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"China"},"organizers":["Suzhou University of Science and Technology"],"societies":[],"indexes":[],"emails":["ic-mse@isaeri.org"]}