{"name":"The Veterinary Drug Approval Process and FDA Regulatory Oversight","series":"","short":"","website":"https://www.complianceonline.com/the-veterinary-drug-approval-process-and-fda-regulatory-oversight-seminar-training-80155SEM-prdsm?channel=Brownwalker","content":"The U.S. Food and Drug Administration’s Center for Veterinary Medicine (CVM) is responsible for the approval of veterinary drug products intended for family pets, food-producing animals, and other animal species. This seminar will cover the process for obtaining federal government approval for marketing new animal drug products that are under the jurisdiction of the FDA, and also briefly covers animal products that are regulated by other federal agencies. For example, animal vaccines, animal disease diagnostic devices and some animal biologics are regulated by the U.S. Department of Agriculture, and some flea and tick control products are regulated by the Environmental Protection Agency. This three-day interactive seminar will provide attendees with an understanding of FDA’s veterinary drug approval process. The group size is small, generally between 8 and 20 people, with plenty of opportunities to ask questions and discuss issues or challenges that the attendees have experienced. Learning Objectives: Key goals of the seminar will include learning: How the U.S. Food and Drug Administration (FDA) regulates animal drug products. How FDA’s Center for Veterinary Medicine is organized. The process by which veterinary drug products are reviewed and approved. How to open an Investigational New Animal Drug (INAD) File. The FDA’s various user fees, what fee waivers are available, and how to request a fee waiver. The various technical sections included in a New Animal Drug Application (NADA). What information is needed to substantiate product characterization, target animal safety and effectiveness. An overview of FDA’s rules governing chemistry, manufacturing and controls (CMC). The various components of an animal field study to support product approval. How animal feed, veterinary devices, OTC drug products and nutritional supplements are regulated in the U.S. Who will Benefit: This course is designed primarily for people tasked with developing new animal drugs for an animal health company or a human pharmaceutical company. This includes individuals responsible for overseeing regulatory affairs, developing veterinary drug products, or evaluating new technologies or applications. Among others, this includes: Personnel new to the Animal Health Industry CRO professionals Entrepreneurs looking to add value to their products Regulatory professionals Compliance professionals U.S. Agents of Foreign Corporations Legal Professionals Financial Advisors and Institutional Investors","date_start":"2021-06-09","date_end":"2021-06-11","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}