{"name":"Advanced Coaching Techniques for Supervisors and Managers","series":"","short":"","website":"https://bit.ly/3e10h3h","content":"The program shows you how to vary your coaching style to match the needs and abilities of each person with whom you work so you raise the odds of their success as an employee and your success as a coach. Why Should You Attend After hiring the right people, coaching people to improve their performance can be a daunting responsibility for many managers and supervisors. » Do you ever wonder why some people you are coaching seem to soak up your advice and thrive on it while others simply don’t get it? » Do some of your folks seem to resist when you give directions? » Are there times when you wish people would use their heads and not coming running to you every time they run into a problem? » Do you lose sleep worrying if your subordinates are managing as you would like them to? » Would the people who work for you say you are a micro-manager? » Are you sure about that? » Do you ever wonder “when to hold’em and when to fold’em when it comes to keeping a non-performing or difficult employee? Objectives of the Presentation This webinar goes beyond the standard formula of Explaining-Showing-Observing-Giving Feedback model that is used in most coaching programs. You will learn advanced coaching techniques for managers and how to tailor your coaching efforts to match the readiness and capability of the person being coached, thus ensuring that you both get the best result. Areas Covered in the Session » Five coaching modes and how to use them. » Effective coaching skills for managers and how to determine what each coachee needs from you to succeed. » When and how to vary your approach. » What variable to consider when coaching in different situations. » How to determine when to give orders and when to ask for input. » The right questions to ask to maximize the coachee’s outcomes. » How to respond to a decline in the coachee’s performance. Who Will Benefit » Team leaders » Managers » Directors » Leaders – anyone who manages or coaches others. To Register (or) for more details please click on this below link: https://bit.ly/3e10h3h Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-03-22","date_end":"","important_dates":{"abstract":"","full":"2021-03-22","notification":"","final":""},"topics":["Business","Human-Resources"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}