{"name":"Mental Health, Leadership, And Managing Through Times Of Challenge and Crisis","series":"","short":"","website":"https://bit.ly/3qVQT4B","content":"A leader’s role is to lead. However, research show us that many leaders have not been fully trained in understanding the impact of mental health on their team, especially not through times of crisis and unprecedented uncertainty. Leaders who understand that they are in a unique position to assist their team in recognizing and dealing with the various causes and symptoms of stress faced in the workplace, will have teams that can weather this uncertainty and stay mentally healthy. Why Should You Attend The Coronavirus pandemic has sent many teams and businesses for a loop. You are probably seeing your employees experiencing a higher degree of uncertainty, worry and stress about their health and safety and that of their loved ones, and how the next couple of months will play out in their work and personal lives. As leaders, we need to look for creative ways to do business and we need to protect the physical and psychological health of ourselves and our employees during this crisis. Your job now, as a leader, is to ensure that your team is feeling safe, supported, and engaged. Successful leaders know that small shifts can have a major impact on mental health. Discover the seven key areas, that will help you to choose the most effective strategies to help you and your team move forward during this crisis, minimize their negative stress symptoms and reactions, and stay mentally healthy. Discover how to effectively respond to challenges, cope through change, and give and garner more support, so that you and your team can build resiliency, accelerate performance, and thrive through this continuing uncertainty. Objectives of the Presentation » Avoid the pitfalls to managing a team during and after crisis using the 7 keys. » Recognize the mental health indicators and symptoms that are signaling that your team is not coping with the uncertainty and business disruption. » Discover the 3 C's that leaders are vital to effective leadership. » Detect, assess, and minimize the causes and symptoms of stress that those in your team may be facing. » Understand the different types of resiliency strategies that can protect your team’s mental health, and enable them to relax more and feel better. » Utilize various resiliency strategies based on the S-O-S Principle to increase and restore energy, improve productivity, and support your team in achieving their objectives. Areas Covered in the Session » Leaders who address mental health issues will have teams that thrive through challenge and those who fail to address those mental health needs will struggle to be productive, service their customers, and be competitive. » There is a mental health continuum that we all move along, and it is dynamic as we experience stress, challenge, and crisis. » Leaders who understand and address mental health challenges, will have teams that thrive through this uncertainty and those organizations that ignore those needs will struggle to be productive, service their customers, and be competitive. » Resilient people are able to sustain successful performance and positive well-being in the face of adverse conditions » Resiliency is created and sustained through adaptability, a sense of purpose and vision, insight and problem-solving, and garnering support. » In the workplace, leaders can not only model resilient behaviour and attitudes, which is critical, but they can also employ strategies to meet the mental health needs of their employees to encourage engagement, productivity, and resilience. Who Will Benefit » Human Resources Professionals » Health and Safety Reps » Union Reps » Supervisors, Manager, Directors (Team Leads) » Executive Directors Not-For-Profit To Register (or) for more details please click on this below link: https://bit.ly/3qVQT4B Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-03-18","date_end":"","important_dates":{"abstract":"","full":"2021-03-18","notification":"","final":""},"topics":["Business","Management / Leadership"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}