{"name":"Access Point Case Management: Managing the Two-Midnight Rule via Your Routes of Entry","series":"","short":"","website":"https://www.complianceonline.com/access-point-case-management-two-mid-night-rule-webinar-training-706045-prdw?channel=Brownwalker","content":"This case management webinar will explore how an initial assessment and clinical review can better ensure that patient is placed in the correct setting right from the get-go which is a very unique role played by ED and admitting office, transfer center case managers and social workers. The 2 midnight rule and the part that case management plays in managing it will also be reviewed. It will give idea about reducing the use of Condition Code 44 or self-denials when patients get admitted to the incorrect level. Why Should You Attend: Access point case managers reside in emergency departments, admitting offices and transfer centers. Among their roles is to ensure that patients are placed in the right level of care upon admission. With the advent of the 2 midnight rule, this role has never been more important. In addition, they are vital in assisting in readmission reduction, discharge planning and patient flow. In this webinar we will explore the unique roles of the ED and admitting office and transfer center case managers and social workers and how an initial assessment and clinical review can better ensure that patient are placed in the correct setting right from the get-go. We will review the 2 midnight rule and the part that case management plays in managing it. This can better ensure a reduction in use of Condition Code 44 or self-denials when patients get admitted to the incorrect level. ED staff also assists in reducing unnecessary admission and readmissions. Learn how to prioritize which patients need case management at your routes of entry and how these positions can assist in-patient case managers as well. We will complete this webinar with a discussion of how to measure the impact of these roles on the department and the hospital. Review the concept of access point case management Discuss the role of the RN case manager in the ED Describe the role of the Social Worker in the ED Understand the 2 Midnight Rule Understand the relationship between the 2 Midnight Rule and case management Discuss how to prioritize access point patients Identify the role of through-put at access points Review the positive outcome achieved by access point case management Areas Covered in the Webinar: Introduction to access point case management Levels of care Role of the RN case manager Role of the social worker Definition of 2 Midnight Rule Role of case management in managing 2 Midnight Rule Prioritizing patients in the emergency department Discharge planning in the emergency department Patient through-put Evaluating emergency department case management outcomes Who Will Benefit: Directors of Case Management Directors of Social Work RN Case Managers Social Workers Directors of Quality Management Emergency Department leaders Vice Presidents of Nursing Directors of Finance Vice Presidents of Operations Hospitalists","date_start":"2021-10-28","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Medical-Speciality"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}