{"name":"2022 International Conference on Advances in Biological Science and Technology","series":"","short":"","website":"https://icabst.apanse.com","content":"Based on the successfully held of ICABST2021 -- 2022 International Conference on Advances in Biological Science and Technology will be held during January 29-31, 2022 as an online video conference. ICABST2022 is organized by Asia-Pacific Association of Natural Science and Engineering (APANSE), co-organized by Hanoi National University of Education, Mahidol University, and supported by American Chemistry Society, IOP Science and other academic institutions & medias partners. As an annual gathering, it provides an extensive platform for scientists, researchers and scholars to present their research results and newest findings in all fields of Biological Science and Technology, especially in Biotechnology and Bioengineering, Biomedical Engineering, Clinical Medicine, Biopharmaceuticals and Pharmacology, Animal and Plant Sciences and other related topics, discuss the practical challenges encountered recommend better solutions for biotechnology and biomedicine. ICABST2022 will include keynote speeches, invited speeches, oral presentations and poster presentations. The conference certification will be issued to all attendees including listeners. Besides, the ICABST workshop \"International Workshop on Pharmaceutical and Clinical Research, WPCR2022\" will be held simultaneously with ICABSTS2022\\. For more details about WPCR2022, please click https://icabst.apanse.com/wpcr Important Dates Conference Dates: January 29-31, 2022 Abstract Deadline: December 31, 2021 Registration Deadline: January 15, 2022","date_start":"2022-01-29","date_end":"2022-01-31","important_dates":{"abstract":"","full":"2021-12-31","notification":"","final":""},"topics":["Life Sciences","Biotechnology/ Bioinformatics","Biotechnology"],"location":{"virtual":"","full":["Singapore"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":["Asia-Pacific Asso. of Natural Science & Engineering"],"societies":[],"indexes":[],"emails":[]}