{"name":"3rd International Conference on Recent Trends in Multi-Disciplinary Research","series":"","short":"ICRTMDR 20","website":"https://icrtmdr.com","content":"3rd International Conference on Recent Trends in Multi-Disciplinary Research (ICRTMDR-20) Venue : Maldives Conference Date: 26th & 27th Dec 2020 IFERP with high responsibility and expectation organizes virtual conference 3rd International Conference on Recent Trends in Multidisciplinary Research (ICRTMDR-20) which is scheduled to take place on the 26th and 27th December 2020 at Maldives. Important Dates: Early Bird Registration 25 Oct 2020 Abstract Submission 05 Nov 2020 Full Paper Submission 15 Dec 2020 Registration Deadline 05 Dec 2020 Objectives We experience the role of Science, Technology, Engineering and Management studies is vital, it supports our daily routine. From Agriculture to Astronomy study and exploration we feel and relish the existence of Multidisciplinary research. ICRTMDR 2020 main emphasis is to bring together all the stakeholders involved and others related disciplines. ICRTMDR 2020 conference will be a unique confluence of networking, recreation, education, and practice themed to bring global wellbeing. ICRTMDR 2020 aimed to help business and technology experts cut through the excitement and learn how research ideas successfully deployed to build competitive advantage, drive new business opportunities, reduce costs and accelerate innovation efforts. ICRTMDR 2020 encourages all researchers (young and experienced) to make their research findings known to the world by submitting relevant research papers, irrespective of what specific field in Engineering and Technology, they specialize in. The authors of the best research papers will be awarded suitably. Call for Multidisciplinary papers Engineering & Technology Business management Studies influencing the recent technologies Other important areas- Science, Education and Social Science Benefit • Opportunity to Interact With Outstanding International Speakers. • Involve and Participate in Thought-provoking Case discussions. • Join Special Interest Groups • Chance to access innovative and profound research Ideas • Showcase your latest research discoveries to a global mass audience. • Associate with Best & experienced industry experts. • Build and develop a cohesive network and exchange ideas. • Will be a catalyst and provoke towards further professional studies. • Best occasion to mingle and cultivate research with compatible peers. • Share your wisdom to enhance the growth globally. • Gain gratitude & earn a reputation. • Articles presented at ICRTMDR will be available for citation at reputed scientific repositories like Science Direct, Research pedia and Academic library. • All the accepted papers will be published during the conference proceedings. • All accepted papers will be provided with Digital Object Identifier (DOI) numbers with which authors can find their research papers uploaded at the doidirectory.com. • All the accepted papers can be published in relevant International Scopus/Web of Science indexed Journals based on author's preference. Contact Information Program Manager +91 9884078406 info@icrtmdr.com https://icrtmdr.com/","date_start":"2020-12-26","date_end":"2020-12-27","important_dates":{"abstract":"","full":"2020-12-05","notification":"","final":""},"topics":["Engineering & Technology","Electrical/ Electronic","Engineering Science & Technology"],"location":{"virtual":"","full":["Maldives"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":["IFERP"],"societies":[],"indexes":[],"emails":["info@icrtmdr.com"]}