{"name":"The Path to Effective Mentoring Programs","series":"","short":"","website":"https://bit.ly/3mUu6V3","content":"This webinar explores modern or effective mentoring and the shift from the traditional style of mentoring. The traditional style of mentoring was about the senior person mentoring the junior person. The mentoring process was very much one way. Fast forward to today and we see successful mentoring programs becoming more about a two way trusted relationship where both the mentor and mentee learn and grow together on a personal and professional basis. This webinar will explore effective mentoring strategies and how to be a good mentor in the workplace. We look at some of the best practices that have evolved as a result of this change in mentoring philosophy. This webinar will explore effective communication and building effective relationships in the workplace as the foundational pieces of mentoring. We will also explore the barriers to effective communication and a trusted relationship and how we might address those barriers. Why Should You Attend With the growth of effective mentoring initiatives on a global basis people and organizations have raised the expectation bar on the business value of mentoring. Mentoring programs typically fail because of four reasons: » Lack of corporate support » lack of structure » lack of training » a culture that will not support mentoring. Organizations are unsure of the path that they wish to take as failure is not considered an option. In some cases there is a lack of understanding of what is effective mentoring and what the value for embarking on a journey of this sort would be. For some, mentoring is an off shoot of coaching and with that comes the confusion of whether or not a mentoring initiative would be of any value and what the ROI would be for doing so. Some of the research has shown that 79% to as high as 90% of mentoring program fail and it is this stat that causes the most concern for senior executives who must make the decision of whether to implement or not. It is not all bad however and this webinar dispels some of the myths about failed attempts at implementing mentoring. This webinar will clearly demonstrate the high return on investment that can be realized through the sharing of “The Gift of Mentoring”. In a study done in 2017 » 63% of participants saw an increase in productivity » 54% saw an increase in engagement with the company they were employed by » 45% of the organizations believed that their mentor program helped them retain valued employees. This is most definitely a must attend webinar – “can you afford not to?” Objectives of the Presentation » This webinar will provide an overview of effective mentoring and why it is important. » This webinar will look at what can cause failure in the implementation of a mentoring program » This webinar will look at the steps to a successful implementation and ROI. Areas Covered in the Session » What is effective mentoring » What is traditional style of mentoring » Transferable skill 1\\. Family 2\\. Community 3\\. Organization » Paradigm shift in mentoring » Two Primary skills 1\\. Trusted Relationship building 2\\. Effective Communication » Building Trust 1\\. Sharing something personal 2\\. Story telling » Communicating effectively 1\\. Active Listening 2\\. Trigger Words 3\\. Deflections 4\\. Crucial Conversations 5\\. Conversational Pauses 6\\. How messages are received » Why mentor programs fail » Some things to consider when implementing a mentor program 1\\. Corporate Support 2\\. Structure 3\\. Training 4\\. Culture that supports mentoring » Communication » Celebrating success Who Will Benefit » This webinar is of value to all levels of an organization and to all organizations and associations. This webinar is designed to provide value to all who attend. To Register (or) for more details please click on this below link: https://bit.ly/3mUu6V3 Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-02-16","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Management / Leadership"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["AbideEdict"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}