{"name":"Film Studies Workshop: The Double in Cinema","series":"","short":"","website":"https://film.lcir.co.uk/workshop","content":"The Double in Cinema Workshop 9 February 2020 London Centre for Interdisciplinary Research How do we specify the parameters of our identity? How do we differentiate ourselves from others? Is it functional to emotionally invest in social masks, compartmentalising various dimensions of ourselves? Is the ‘double’ a useful symbol for communicating division in the self and emotional conflict? Identity formation is a psychological process by which a person assimilates an aspect of someone else and is transformed, wholly or partially, by the model that the other provides. It is by means of a series of identifications that the conscious personality is formed. Whilst a simple concept on the surface, identity is one of the most perplexing areas of clinical and theoretical research in psychoanalysis. The cinematic field engages with the notion of the identity in ways that are instinctual, playful, and meaningful. In this session we will explore doppelgängers as a cinematic representation of identity, with reference to psychoanalytic concepts including Sigmund Freud's 'Uncanny', Jacques Lacan’s ‘Mirror Stage’, Carl Jung's ‘Persona’ and Otto Rank's 'Double'. The following films will be discussed (advanced viewing is optional; brief bespoke video montages will be screened): The Double Life of Veronique (1991) Krzysztof Kieslowski Triangle (2009) Christopher Smith American Psycho (2000) Mary Harron Black Swan (2010) Darren Aronofsky Confessions of a Superhero (2007) Matthew Ogens Zelig (1983) Woody Allen Blade Runner 2049 (2017) Denis Villeneuve S1m0ne (2002) Andrew Niccol The workshop will start at 9am and finish at 1pm. In order to book a place, please register on http://registration.lcir.co.uk Registration fee is 65 GBP. Organisers can be contacted on film@lcir.co.uk. Venue: Birkbeck, University of London, Malet Street, Bloomsbury, London WC1E 7HX","date_start":"2020-02-09","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Arts & Humanities","Visual Arts","Film & Cinema"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["film@lcir.co.uk"]}