{"name":"FAAM-EUROBAT Digital 2020","series":"","short":"","website":"https://go.evvnt.com/666279-2?pid=4868","content":"The joint FAAM-EUROBAT Digital 2020 meeting will take place between 16-17 October 2020 as a fully digital meeting. This year, EAACI has decided to - for the first time ever - combine both the Food Allergy and Anaphylaxis Meeting (FAAM) and the European Consortium on Application of Flow Cytometry in Allergy with Focus on the Basophil Activation Test (EUROBAT), in order to deliver a brand new meeting combining state-of-the-art scientific content with a format that allows us to reach new audiences. The aim of the FAAM-EUROBAT Digital 2020 meeting is to gather leading researches in the areas of: - Molecular and cellular mechanisms of food allergy and anaphylaxis - Practicalities of diagnosis and patient management - Exciting new developments for prevention and treatment - Applications of BAT in food and insect allergy - Drug hypersensitivity and urticaria Delegates will have the chance to dive into the latest findings and future developments as internationally acclaimed speakers will be invited to share their knowledge to international delegates through an intense and rich scientific programme. We invite you to participate in what promises to be a one-of-a-kind experience that will hopefully facilitate the translation of emerging research findings into clinical practice and favour scientific collaborations. For Sponsorship and Exhibition opportunities, please visit our website: https://www.eaaci.org/focused-meetings/faam-eurobat-digital-2020/sponsorship-and-exhibition URLs: Tickets: https://go.evvnt.com/666279-0?pid=4868 LinkedIn: https://go.evvnt.com/666279-3?pid=4868 Prices: General Delegate: EUR 175.0, EAACI Member: EUR 90.0, EAACI Junior Member: EUR 50.0, Nurses, Students, Laboratory technicians, Dieticians: EUR 50.0 Time: 07:00 - 18:00","date_start":"2020-10-16","date_end":"2020-10-17","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education, teaching"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["European Academy of Allergy and Clinical Immunology (EAACI)"],"societies":[],"indexes":[],"emails":[]}