{"name":"Gender Studies Winter School","series":"","short":"","website":"https://genderstudies.lcir.co.uk/gender-studies-winter-school","content":"Study in London this winter! Spend an amazing week in London and learn about gender across different disciplines – literature and culture, philosophy and sociology, media and communication, history and political science, religious studies and education. Topics to be covered include: human rights and (in)equality, gender and migration, gender and violence, gender and creativity, gender and beauty, ecofeminism, anti-feminism and many more. Our team of international scholars will enhance your knowledge and facilitate dialogue and discussions. We are looking forward to applications from students, researchers and professionals with a particular interest related to gender studies. The course will allow you to deepen theoretical and methodological knowledge and critical thinking in gender studies. Participants will be encouraged to make a short presentation exploring a topic related to gender studies and participate in roundtable discussions. A Certificate of Completion will be provided by the end of the week. The fee for participants is 450 GBP, which includes learning materials, coffee breaks, lunches and a number of social events. The fee does not include travel and accommodation costs. In order to book a place, please fill in the Booking Form and send it to genderstudies@lcir.co.uk by 31 October 2019\\. After you receive a confirmation of booking, please register on http://registration.lcir.co.uk.","date_start":"2020-02-24","date_end":"2020-02-29","important_dates":{"abstract":"","full":"2019-10-31","notification":"","final":""},"topics":["Social Sciences","Gender/Sexuality"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["genderstudies@lcir.co.uk"]}