{"name":"Gender Research Workshop: “Radical Thinkers”","series":"","short":"","website":"https://genderstudies.lcir.co.uk/gender-research-workshop","content":"Gender Research Workshop: “Radical Thinkers” 8 November 2020 – Online (Time TBC) organised by London Centre for Interdisciplinary Research and Academic LAB This session will discuss and examine the work of four highly influential 20th century feminist thinkers: Simone de Beauvoir, Audre Lorde, Olive Morris and Jacqueline Rose. We will cover different kinds of texts, such as literary criticism, essays, poetry and archival material, in order to explore the wide variety and application of feminist thinking. We will engage in close reading, as well as discussing the most important ideas of these thinkers. We will also think about the relationships between feminism and politics, and consider the interrelation between theory and practice. The workshop is designed for students, young scholars and independent researchers with a particular interest related to gender studies. The workshop will allow them to deepen theoretical and methodological knowledge and critical thinking in gender studies. All the registered participants who will attend the workshop will receive certificates. The workshop is designed and led by Dr Katherine Da Cunha Lewin. In order to book a place, please fill in the Booking Form and send it to workshops@lcir.co.uk by 30 September 2020\\. After you receive a confirmation of booking, please register on http://registration.lcir.co.uk. Registration fee is 45 GBP","date_start":"2020-11-08","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Social Sciences","Gender/Sexuality","gender studies (and womens)"],"location":{"virtual":"","full":["Online Event","United Kingdom"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research and Academic LAB"],"societies":[],"indexes":[],"emails":["workshops@lcir.co.uk"]}