{"name":"Towards 2030: Sustainable Development Goal 9: Industry, Innovation and Infrastructure. A Sociological Perspective","series":"","short":"","website":"https://www.frontiersin.org/research-topics/30656","content":"In collaboration with the Open Access journals of Frontiers (www.frontiersin.org) we are bringing together a selected group of international experts to contribute to an article collection: \"Towards 2030: Sustainable Development Goal 9: Industry, Innovation and Infrastructure. A Sociological Perspective\" Submission Deadlines: 30 March 2022 - Abstract 15 June 2022 - Manuscript Visit the collection homepage for the full description of the project: https://www.frontiersin.org/research-topics/30656/ Participating Journals - manuscripts can be submitted to this Research Topic via the following journals: - Frontiers in Sociology: Urban Ecology (2020 CiteScore 1.2) - Frontiers in Ecology and Evolution: Urban Ecology (2020 Impact Factor 4.171; 2020 CiteScore 3.6) About this Research Topic: This Research Topic addresses the ninth Sustainable Development Goal, which is to “Build resilient infrastructure, promote inclusive and sustainable industrialization and foster innovation.” Progress toward this goal is measured by a number of individual targets and indicators. As highlighted in the UN’s most recent SDG progress report, the manufacturing sector, which had already seen the slowest year-on-year growth rate since 2012, was hit especially hard by the COVID-19 pandemic. This led to a global drop in manufacturing production of 8.4 per cent in 2020\\. Alongside job losses and declining income for workers, the pandemic has significantly disrupted global supply chains and severely affected small-scale industries. Less technology-intensive industries have also taken longer to recover than medium and high-technology industries, such as the pharmaceutical, computer, electronics and automotive sectors. The UN nonetheless notes that the crisis offers the opportunity to foster industrialization and improve the global distribution of groundbreaking technologies. In emerging from the pandemic, it highlights key areas of focus, including continuing to expand mobile broadband networks, increasing R&D investment, and improving rural road connectivity. This Research Topic will address the ninth Sustainable Development Goal from a sociological-specific perspective. Given the global setbacks to the industrial and transport sectors resulting from the coronavirus pandemic, this year’s edition of the Research Topic will focus particularly on the challenges and complexities of industrial development in the wake of the COVID-19 crisis. This Research Topic welcomes papers that will provide both theoretical and empirical findings. Potential issues include, but are not limited to: - Social and cultural aspects of technology transfer and global diffusion of groundbreaking technologies. - Supply chains and the global economy: threats and opportunities for specific sectors. - Redesign of the transport systems, including travel, trade, logistics, and freight distribution. - Multi-level, cross-sectoral, and multi-sectoral cooperation of various stakeholders, including public, private, non-governmental organizations (NGOs), and non-formal entities. - Regional and local bottom-up responses, their scalability, feedbacks from environmental change, degrowth, and community resilience. - The advances in the access to digital infrastructures as well as information and communications technologies (ICTs). - The new ideas and approaches relevant for the fields of technological policy, industrial policy, and innovative policy. - National and international industrial policies and innovation policies in response to global health challenges. - Planning, management, governance, and evaluation of governmental interventions including, for example, economic policy, agricultural and food policy, industrial policy, technology policy, and innovative policy. - Industrialization, resilient infrastructure, innovation, and research and development investments in the law and public policies related to the COVID-19 pandemic. Keywords: SDG9, Resilient infastructures, Innovation, Industrial policies, Digital infrastructures Co-Editors: - Andrzej Klimczuk, SGH Warsaw School of Economics, Poland - Grzegorz Piotr Gawron, University of Silesia in Katowice, Poland - Magdalena Klimczuk-Kochańska, University of Warsaw, Poland - Piotr Toczyski, The Maria Grzegorzewska University, Warsaw, Poland SUBMISSION: Papers should be submitted through this link, using the \"Submit your manuscript\" button: https://www.frontiersin.org/research-topics/30656/ and must follow paper templates available here: https://www.frontiersin.org/about/author-guidelines#Templates Publishing solutions: - Manuscripts will be peer reviewed, and if accepted for publication, are subject to publishing fees, which vary depending on the article type (https://www.frontiersin.org/about/publishing-fees). A discount or waiver can be applied for and all applications are considered (https://frontiers.qualtrics.com/jfe/form/SV\\_51IljifwFBXUzY1). - We collaborate with many leading universities making the Open Access publishing process even more accessible for authors. Click here (https://www.frontiersin.org/about/institutional-membership) to see whether your institution is collaborating with us.","date_start":"2022-06-15","date_end":"","important_dates":{"abstract":"","full":"2022-06-15","notification":"","final":""},"topics":["Social Sciences","Sociology","industrial engineering & design"],"location":{"virtual":"","full":["Online Event","Switzerland"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Switzerland"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}