{"name":"11th International Conference on Fuzzy Computation Theory and Applications - FCTA 2019","series":"","short":"","website":"http://www.fcta.ijcci.org","content":"Fuzzy computation is a field that encompasses the theory and application of fuzzy sets and fuzzy logic to the solution of information processing, systems analysis and synthesis problems. Bolstered by information technology developments, the extraordinary growth of fuzzy computation in recent years has led to major applications in fields ranging from medical diagnosis and automated learning to image understanding, decision and systems control. This conference intends to be a major forum for scientists, engineers and practitioners interested in the study, analysis, design, modeling and implementation of fuzzy systems, both theoretically and in a broad range of application fields. \n Conference Topics: \n Area 1: FCTA - International Conference on Fuzzy Computation Theory and Applications \n \\- Foundations of Fuzzy Sets, Fuzzy Logic, Fuzzy Measures and Fuzzy Integrals \n \\- Fuzzy Methods in Data Analysis, Clustering, Classification and Pattern Recognition \n \\- Fuzzy Information Processing, Data Bases, Information Retrieval, Big Data, Cloud Computing \n \\- Fuzzy Methods in Knowledge Discovery, Machine Learning, Approximate Reasoning, Information Fusion \n \\- Fuzzy Decision Analysis, Multi-Criteria Decision Making and Decision Support \n \\- Fuzzy Control, Robotics, Sensors, Fuzzy Hardware, System Design and Architectures, Quantum Computing \n \\- Fuzzy Web Engineering, Information Retrieval, Text Mining and Social Network Analysis \n \\- Adaptive, Hierarchical, Hybrid, and Type 2 Fuzzy Systems \n \\- Industrial, Financial, Medical, and Other Applications Using Fuzzy Methods ","date_start":"2019-09-17","date_end":"2019-09-19","important_dates":{"abstract":"","full":"2019-07-12","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Vienna","Austria"],"name":"","street":"","city":"Vienna","state":"","ZIP":"","country":"Austria"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":[]}