{"name":"2022 International Conference on Technologies in STEM ‘LIVE’","series":"","short":"","website":"https://sldt.ear.com.sg","content":"Who else wants an in-person conference? 2022 International Conference on Technologies in STEM ‘LIVE’ (ICTSTEM2022) 13-14 December 2022 Holiday Inn Singapore Atrium, Singapore With plans to substantially ease travel restrictions, now is the best time to plan your trip to Singapore, the Monte Carlo of Asia! We’re pleased to announce that the 2022 International Conference on Technologies in STEM (ICTSTEM 2022), organized by East Asia Research and supported by Australia’s Curtin University, will be a hybrid conference happening in Singapore from December 13-14, 2022! Learn from the masters of STEM education at the premier conference for the global Educator community. The conference aims to further the application of technology education within STEM and specific learning areas. Within Technology education, students use design and/or computational thinking and technologies to generate and produce designed solutions both digital and physical for authentic problems. As such it applies to many areas of STEM. We invite practitioners and researchers to network and share their experiences. Teachers, and heads of learning areas as well as teacher educators, researchers and HDR researchers from K to higher education are all encouraged to attend. A broad range of technology education topics, including significant developments as well as innovative uses of technology that promote learning, performance, and instruction, will be presented at ICTSTEM 2022\\. Join us for ICTSTEM 2022 at Holiday Inn Singapore Atrium, Singapore and walk away with powerful knowledge that will empower you to forge the path for the future of STEM education. Limited seating may apply. ‘BUY TICKET’ now. Don’t wait – this rate won’t last long! Due to the persistence of COVID-19, the conference will be conducted in a ‘Hybrid Format’. Participants can make oral/poster presentations onsite or send us pre-recorded video presentations and register as a ‘Virtual Presenter’. They will indicate their preferred presentation medium when they register. The ‘Early Bird Registration Deadline’ is on October 13th 2022\\. Keynote Speakers: Dr. Jeremy Pagram, Former Technologies Coordinator School of Education Edith Cowan University Dr. P John Williams, Professor of Education and the Director of Graduate Research, School of Education, Curtin University Abstract Submission Deadline: 14th July 2022 Enquiries: anthonytan@ear.com.sg Web address: https://sldt.ear.com.sg Sponsored by: East Asia Research and Curtin University P.S. If you are representing an Association or an Institute of Higher Learning and would like to be a conference partner, please get in touch with us. Many benefits await you when joining us!","date_start":"2022-12-13","date_end":"2022-12-14","important_dates":{"abstract":"","full":"2022-07-14","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education and Technology"],"location":{"virtual":"","full":["Online Event","Singapore"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Singapore"},"organizers":["East Asia Research and Curtin University"],"societies":[],"indexes":[],"emails":["anthonytan@ear.com.sg"]}