{"name":"Compliance with Environmental, Social, and Governance (ESG) Requirements","series":"","short":"","website":"https://www.complianceonline.com/environmental-social-governance-requirements-compliance-seminar-training-80663SEM-prdsm?channel=Brownwalker","content":"Environmental, Social, and Governance (ESG) has gained increasing attention over the past few years. Today many institutional investors only invest in those companies that provide ESG performance reporting. ESG criteria provide a set of standards for a company’s operations that today’s socially conscious investors use to screen potential investments. Environmental criteria look at how a company performs as a steward of nature in protecting the planet. Social criteria examine how the company manages relationships with employees, suppliers, customers, and the communities where it operates. Governance deals with a company’s leadership, the pay of its executives, audits, internal controls, and shareholder rights. ESG criteria are an increasingly popular way for investors to evaluate companies in which they might want to invest. Using ESG criteria can also help investors avoid companies that could pose a greater financial risk due to below par environmental or other practices. ESG has considerations relevant to analysts and investors, consumers and employees, and has become a major topic of discussion at Board meetings. Learning Objectives This course has a two-fold objective; To present an introduction/overview of the ESG framework and how it supports a company’s overall risk management strategy and structure. To provide you with the knowledge needed to respond to ESG inquiries and leverage this information to conduct more effective due diligence, and/or make better investment decisions. To achieve this, this course will; Explain what ESG is, and its relevance in making financial decisions. Describe key environmental, social, and governance issues. Explain how stakeholders influence corporate ESG performance. Methodology: This 1-day training program consists of 12 highly detailed sessions covering all aspects of ESG. The presentation material is supported interactive sessions and exercises scheduled at regular intervals. Who will Benefit: Board Members CXO Level Management Risk Officers & Managers. Internal Auditors. Compliance Officers","date_start":"2021-12-09","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}