{"name":"7th Annual IoT, AI & Blockchain Summit 2020","series":"","short":"","website":"https://www.virtueinsight.com/technology/7th-Annual-IoT-AI--Blockchain-Summit-2020","content":"7th Annual IoT, AI & Blockchain Summit 2020 “Unleashing the bold era of IoT, AI & Blockchain innovation” 2nd July 2020, Sterling Mac (Matthan Hotel), Bangalore, India This summit will explore the impact of the Internet of Things (IoT), AI & Blockchain on industries, such as manufacturing, transport, supply chain, insurance, logistics, government, energy and automotive. Not merely that, we have exciting surprise activities which will help you to interact more with your peers. This will be surely an exciting event wherein you could get chance to meet big industry gems. Let’s gather to shape the industry with your magnificent ideas. CONFERENCE DELEGATE REGISTRATION: Please note that this is a PAID event and NOT A FREE event (no complimentary passes available). Any invite, email or tickets issued mentioning it as a free pass or free ticket to this event through any third party site will strictly not be accepted by the organizer and entry won’t be granted at the event. Please contact kavitha on Email – kavitha@virtueinsight.co.in or +91 44 24762472 • Early Bird Discount (Valid till 8th May 2020 ) – 1 Delegate – (INR 8,000 + GST (18%) per delegate) • Standard Price ( Valid from 9th May 2020) – 1 Delegate – (INR 12,000 + GST (18%) per delegate) • For Bulk Booking of More Than 5 Delegates discounts available CONFERENECE PARTNERS: • COCO • REVEALER We have more opportunities available for the event, which gives you an opportunity like paid Panel or Solo speaking/exhibiting/Booth or stall and create brand awareness. In addition, the networking opportunities is focused and relevant industry gathering will provide the personal contact necessary for business development efforts. So kindly let me know if you would be interested in any and then I can share more details. KEY SPEAKERS: • TULIKA PANDEY, Scientist 'F' & Director, Ministry of Electronics & Information Technology, Government of India • RAJAN MATHEWS , Director General, Cellular Operators Association of India • SUBRATA RAKSHIT, Associate Director (Technology), Centre for Artificial Intelligence and Robotics • NIRANJAN SRINIVASAN , Vice President & Delivery Head – IVS, Infosys • RAVINDRA SHET , Director - IoT & Convergence Technologies, Samsung Electronics • RAVICHANDRAN MAHADEVAN, Vice President IoT - Moving Assets, SAP • ANIRUDDHA DESWANDIKAR , Director & Principal Architect - Strategic AI Initiatives, Microsoft • RAGHURAM LANKA , Assistant Vice President – AI, Reliance Jio • KRISHNA MARKANDE, Associate Vice President, Principal Technology Architect, Infosys • SHEIK BILAL PEER MOHAMMED, Director – Public Services, Utilities & Telco Development, SAP • LUX RAO, Director & Head – Solutions, NTT India • BIPIN PRADEEP KUMAR, Co-Founder, Gaia Smart Cities • PAVAN KUMAR , Director, Product Management – IoT, SAP • JOPHY VARGHESE, APAC Head – Strategic SIs & Alliances, Verizon • MINERVA PANDA , Research Associate, Niramai • SOORAJ KUMAR RAJ , IIoT Solutions Product Management - Track & Trace, Supply Chain Management, Blockchain, Asset Performance Management, HCL • M.MUNI PRABAHARAN , Process Engineering Consultant • MILIND D KULABKAR, Company Secretary and Legal Counsel, Professional Non Executive Resident, Independent Director • MADHU KARTHA, Senior IT Manager, Dell Plus many more KEY THEMES DISCUSSED: • Connected Industry: How the IIoT evolves with the advent of new technology, trends, developments and some industry forecasts. • Developing and implementing cognitive computing within industries • Machine learning for industry - What is the role of AI and Data Analytics in it • The future of industrial machine learning • Understanding the implementation of IoT innovations • How do companies ensure that the IoT's potential is realized? • Innovation and application of AI technologies • What is the potential of using AI for AR and VR? • AI's future impact on cybercrime • Changing our way of protecting our most important assets • Transforming healthcare with AI & Big Data • How does AI change the delivery of health care systems? • Global technology of blockchain – Providing innovative solutions to real-world problems • How higher levels of assurances can be instilled into decentralized applications • Future possibilities for blockchain technology – Where will we be in 2025? • How blockchain could create entrepreneurial value in the good manufacturing and fast consumer sectors • Cyber security – Exploring the converging technology • Evolving cyber intelligence landscapes • Be part of a major networking opportunity WHO SHOULD ATTEND AND WHO YOU’LL MEET: CEOs, Presidents, VPs, Heads, CISOs, CTOs, Security Consultants, Managers, IT Professionals and all job titles starting from the top management from the following categories: Device Manufacturers, Sensors and Embedded Systems Companies, Systems Integrators, Enterprise Product management and development, Service Providers – Fixed, Wireless and Satellite, Developers, Content and Contact Managers, Technology, Product, Strategy, Storage, Business Analysts, Database/Data Center, Hosting, Training, System and Network Integrators, Data Center Managers, Telecoms and Tech, Compliance and Policy, Network Administrators Get more from the event, with a broader scope bringing the whole communications value chain together. Enjoy and make the best out of our dedicated networking time, meet the leading international vendors showcasing the products of tomorrow in the co-located exhibition. Expand your knowledge of the latest business models and strategies in the high-level conference.","date_start":"2020-07-02","date_end":"","important_dates":{"abstract":"","full":"2020-07-02","notification":"","final":""},"topics":["Business","Information-Technology","IOT Internet of Things (IoT)"],"location":{"virtual":"","full":["Bangalore","India"],"name":"","street":"","city":"Bangalore","state":"","ZIP":"","country":"India"},"organizers":["COCO, REVEALER"],"societies":[],"indexes":[],"emails":["kavitha@virtueinsight.co.in"]}