{"name":"2nd Global Summit on Condensed Matter Physics","series":"","short":"CONMAT2022","website":"https://www.thescientistt.com/condensed-matter-physics/2022/ ","content":"Dear Colleagues, It is a great pleasure to announce that The Scientistt will host the 2nd Global Summit on Condensed Matter Physics (CONMAT2022) will be held in Dubai, UAE during October 17-19, 2022\\. CONMAT2022 aims to bring together the renowned researchers, scientists and scholars to exchange ideas, to present sophisticated research works and to discuss hot topics in the field and share their experiences on all aspects of Condensed Matter Physics. The CONMAT2022 will be a 3 days event that means to gather the key players of the Condensed Matter Physics community and related sectors. This event is launched with the aims to become an established event, attracting global participants, intent on sharing, exchanging and exploring new avenues of Condensed Matter Physics. A wide-ranging scientific program consisting of plenary lectures, keynote lectures, Invited lectures, parallel sessions, as well as poster sessions for young scientists covering all topics in Condensed Matter Physics will be scheduled. This conference provides a wonderful opportunity for you to enhance your knowledge about the newest interdisciplinary approaches in Condensed Matter Physics. Moreover, the conference offers a valuable platform to create new contacts in the field of Condensed Matter Physics, by providing valuable networking time for you to meet great personnel in the field. We look forward to seeing you at CONMAT2022 in Dubai, UAE.","date_start":"2022-10-17","date_end":"2022-10-19","important_dates":{"abstract":"","full":"2022-08-17","notification":"","final":""},"topics":["Physical Science & Math","Physics","Semiconductor Physics"],"location":{"virtual":"","full":["Dubai","United Arab Emirates"],"name":"","street":"","city":"Dubai","state":"","ZIP":"","country":"United Arab Emirates"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}