{"name":"The 6th Int'l Conference on Environmental Chemistry and Ecotoxicology","series":"","short":"CECE 2022","website":"https://scet-meeting.org/conference/CECE2022","content":"The 6th Int'l Conference on Environmental Chemistry and Ecotoxicology (CECE 2022) Conference Date: April 22-24, 2022 Conference Venue: Suzhou, China Website: https://scet-meeting.org/conference/CECE2022/ Online Registration: https://www.scetmeeting.org/RegistrationSubmission/default.aspx?ConferenceID=1446 Email Registration: paper\\_service@163.com The 6th Int'l Conference on Environmental Chemistry and Ecotoxicology (CECE 2022) will be held during April 22-24, 2022 in Suzhou, China. This Conference will cover issues on Environmental Chemistry，Ecotoxicology, and other related topics. It dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods in related fields. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal, please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: paper\\_service@163.com Tel: +86 18627814037 QQ: 1349406763 WeChat: 3025797047 Official Account: Academic Communications Twitter: conf\\_Committee Attendance Methods 1\\. Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Chemistry and Control Technology of Air Pollution Chemistry and Control Technology of Water Pollution Soil Pollution and Remediation, Solid Waste Disposal Environmental Biology Ecotoxicology and Health Effect Nano Environmental Effect Theoretical Environmental Chemistry and Environmental Models Sample Pretreatment Technology Methods and Standards of Environmental Analysis Environmental Mercury Contamination Pollution Control Chemistry and Green Chemistry Environmental Chemistry of Isotopes Environmental Education Environmental Management and Policy Chemical Transfer Release and Environmental Exposure Physical, Environmental and Health Hazards of Chemical Substances Ecological and Health Risk Assessment of Chemicals Chemical Environmental Management Technology Environmental Management of Toxic Pollutants Environmental Exposure and Biological Absorption of Chemical Pollutants High-throughput Screening Methods for Chemicals Methods of Ecological Toxicity and Toxicology Testing of Chemicals Ecotoxicology and Ecological Risks of Chemicals Molecular Toxicology of Chemicals Environmental Risk Assessment and Environmental Quality Benchmarks for Chemical Pollutants Other Related Topics","date_start":"2022-04-22","date_end":"2022-04-24","important_dates":{"abstract":"","full":"2022-04-22","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental"],"location":{"virtual":"","full":["China"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":[""],"societies":[],"indexes":[],"emails":["_service@163.com"]}