{"name":"Reciprocal Healing: Nature, Health and Wild Vitality","series":"","short":"","website":"https://naturalhistoryinstitute.org/reciprocal-healing","content":"The health of humans and nature are inextricably linked. As we heal ourselves, we heal the earth – and vice versa. Our goal is to illuminate the healing ground that lies at the confluence of natural history, medicine, and psychology. From this common ground we intend to grow the practices and associations that will foster the health of all life. Join us and help activate a coalition of engaged people to inspire and empower connections between disciplines. Interactions between naturalists and ecologists, psychologists, physicians, educators, artists, writers, and advocates will light a path that connects humans and nature through healing both the human and more-than-human world. This national confluence is dedicated to nurturing a sense of hope grounded in tangible, actionable outcomes. Participants will benefit from inspiration, innovation, cross-pollination, and depth in both plenary and breakout sessions. The Place We will gather in the presence of the red rock of Sedona, Arizona, at the Sedona Mago Retreat Center (www.sedonamagoretreat.org) on the western margin of the Mogollon Highlands, one of the most biologically diverse ecoregions in North America—at the juncture of a continental-scale biogeographic crossroads. Format The gathering will be structured as a confluence between three primary tributaries— medicine, psychology, and natural history—with a rhythm of alternating plenary presentations from inspiring speakers and illuminating panels, smaller field workshops, and open space for emergent ideas. Throughout the 4 days and 3 nights of the gathering, we’ll integrate intellect, spirit, and experience while intertwining contemplation and wild nature. We intend to emerge with the strategies and skills to take this work into the wider world. The academic journal Ecopsychology has committed to engagement with this conference, with the intention of publishing a special section deriving from the gathering. Plenary Speakers Davona Blackhorse, M.A. Michael Finkelstein, M.D. Thomas L. Fleischner, Ph.D. Robert Greenway, Ph.D. Peter Kahn, Jr., Ph.D. Robin Wall Kimmerer, Ph.D. Kathleen Dean Moore, Ph.D. Gary Paul Nabhan, Ph.D. Anna O’Malley, M.D. Laura Sewall, Ph.D., M.S.E.L. Brian Stafford, M.D., M.P.H. Sara Warber, M.D. Registration Full registration is $945 and available until October 1st, or until all spaces are filled. The registration fee covers your confluence attendance, accommodations at the retreat center for three nights, and all meals and snacks. Convening Organization The Natural History Institute 126 N. Marina St. Prescott, Arizona 86301 naturalhistoryinstitute.org (928)863-3232 Allied Organizations Center for Humans and Nature (Illinois) Ecopsychology Journal Natura Institute for Ecology and Medicine (California) North Cascades Institute (Washington) Stanford University, Earth Systems Program (California) Sponsor Biophilia Foundation","date_start":"2019-11-05","date_end":"2019-11-08","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Medical-Speciality","medicine & medical science"],"location":{"virtual":"","full":["Sedona","United States"],"name":"","street":"","city":"Sedona","state":"","ZIP":"","country":"United States"},"organizers":["The Natural History Institute"],"societies":[],"indexes":[],"emails":[]}