{"name":"14th South-Eastern European Economic Research Workshop,","series":"","short":"","website":"https://www.bankofalbania.org/Press/Press_Releases/Call_for_papers_14th_South-Eastern_European_Economic_Research_Workshop_10-11_December_2020.html","content":"Invitation and Call for Papers 14th South-Eastern European Economic Research Workshop Organized by the Bank of Albania Bank of Albania has the pleasure to announce its 14th SEE Economic Research Workshop, this year to be organized virtually via Webex, on 10 and 11 December 2020\\. Fourteen years into serving as a cooperation bridge, the workshop is intended to provide a forum for discussing the latest economic and finance research, to foster exchanges of views between central bankers, academic community, market practitioners’, researchers and policymakers in the region and beyond. The workshop aims to develop long-term collaborative relationships and encourage interaction among participants in their fields of interests. In line with our tradition, the workshop is open to multidisciplinary research and welcomes theoretical and empirical contributions on central bank relevant topics. Following the difficulties set upon us by the COVID-19 pandemics, this year’s workshop will have a special focus on presenting the latest research findings related to COVID-19, challenges and uncertainties for central banks. Suggested topics We welcome theoretical and empirical contributions on following topics of interest1: · Economics of pandemics: Challenges and uncertainties for central banks; · Digital revolution, financial innovation and central banks digital currencies: risks and opportunities; · Central bank policies, capital flows and exchange rates; · Monetary and macro-prudential policies as useful tools for price and financial stability; · Applied microeconomics in policy models and analysis of labor, monetary and financial markets; · Environmental concerns as drivers of inflation & macro-financial developments. The scope of the workshop is not limited to the topics listed above, and submissions on other related topics are also welcome. Submissions Authors interested in presenting their research, are welcome to submit extended abstracts (300–500 words including the title, keywords, JEL classification, authors’ names and affiliation) or, preferably, full drafts of papers and a short bio, to BoAresearchworkshop@bankofalbania.org. The submission deadline is 30 October 2020\\. In your submission, please tell us whether you would like also to act as a discussant of another paper presented in the workshop. Submitted papers will be reviewed by a Selection Committee, which will notify the authors of accepted papers by 16 November 2020\\. Final papers and the PowerPoint Presentations should be sent no later than November 30, 2020 to BoAresearchworkshop@bankofalbania.org. Registration Fee Please note that there is no fee for registration/participation. The Bank of Albania will cover the costs of participation in the online Webex system. With kind regards, On behalf of the Bank of Albania, Dr. Altin TANKU ------------------------------------------------- Director of the Research Department Bank of Albania","date_start":"2020-12-10","date_end":"2020-12-11","important_dates":{"abstract":"","full":"2020-10-30","notification":"","final":""},"topics":["Business","Economics"],"location":{"virtual":"","full":["Online Event","Albania"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Albania"},"organizers":["Bank of Albania"],"societies":[],"indexes":[],"emails":["boaresearchworkshop@bankofalbania.org"]}