{"name":"THE INTERNATIONAL WORKSHOP ON APPLIED MODELING AND SIMULATION","series":"","short":"WAMS 2019","website":"http://www.msc-les.org/conf/wams2019/index.html","content":"The 12th WAMS concentrates on Applications of Simulation and Computer Technologies. Indeed the new 12th edition in 2019 will result another great opportunity for the International Simulation Community to meet together in the beautiful framework of Singapore, the City of Future, one of most popular destinations in Far East. In facts, WAMS is a workshop very effective in networking and very useful to set up new proposals and projects. Worldwide specialists have the opportunity to participate and to interact within this important International Forum on Applied M&S. The audience will include both users, vendors and scientists operating in applying advanced techniques to the main application areas and sectors including Industry, Business, Logistics Environment, Services & Defense. WAMS started as a series of international workshops organized in Latin America, AMS2004 (Rio de Janeiro) and AMS2006 (Buzios); these events were focusing on Application and Theory of Modeling & Simulation. In the following years, WAMS was organized in both side of Atlantic Ocean (i.e.Rio de Janeiro, Italian Riviera), while in 2011, WAMS was co-located with the International Marine Defense Show in St.Petersburg Russia organized in Joint Cooperation with SPIIRAS Russian Academy of Science. In 2012, WAMS was held in Rome in connections with the NATO CAX Forum. The WAMS 2013 was back in Latin America and it attracted scientists, technicians and experts from world leading Universities, Institutions, Agencies and Companies; indeed WAMS 2013 edition was held in Buenos Aires, Argentina and was attended by all Latin America Countries as well as by scientists from Europe, North America, Asia and Australia. In 2014, WAMS moved in the wonderful framework of the Bosphorous (Istanbul, Turkey) in co-location with the NATO CAX Forum. Therefore WAMS returned in Italy in 2015 (Bergeggi), 2016 (Cagliari), 2017 (Florence) and 2018 (Prague). ---------------------------------------------------------------------------- Poster Session and Student Colloquium If you are a PhD student or a researcher younger than 30, you are invited to submit a poster proposal to the Poster Session and Student Colloquium. A best poster award will be awarded at the end of the conference to the best presentation. ----------------------------------------------------------------------------- Save the dates (EXTENDED) - Extended abstract or draft paper – June 30th 2019 - Acceptance Notification – July 30th 2019 - Camera Ready Papers – August 30th 2019 ----------------------------------------------------------------------------- International Journals’ Special Issues The authors of the best papers submitted and presented at the conference will be invited to extend their work to International Journals’ Special Issues at the end of the conference. ------------------------------------------------------------------------------ Conference Topics - Artificial Intelligence - Artificial Neural Networks - Automation - Business Process Re-engineering - Business Intelligence - Cloud Computing - Company Intelligent Management - Crowdsourcing - Customer Satisfaction - Data Farming - Data Fusion - Crowdsourcing - Data Warehousing - Decision Support Systems - Effective Design - Electronic Data Interchange - Engineering & Design - Fuzzy Logic - Genetic Algorithms - Human Behavior Modeling - Knowledge Based Systems - Mobile Solutions - Modeling & Simulation Methodologies, Techniques and Applications - Logistics Networks - Network Management - Organizational Modelling - Process Simulation - Process Consulting - Production Simulation - Social Sciences - Strategic Consulting - Total Quality Management - Resources Planning - Safety in Work Environment - Scheduling - Security & Intelligence - Serious Games ---------------------------------------------------------------------------- Current List of tracks - Digital Fruition of Cultural Heritage & Architecture - Serious Games - Simulation Techniques and Methodologies - Simulation for Applications - Simulation for Emergency & Crisis Management - Simulation Tools for Human Reliability Analysis Studies - Serious Games for Strategy - Strategic Engineering & Simulation - CBRN & Crisis Simulation - Immersive Solution for Product Design - Innovative Solutions supporting Interoperability Standards - Mixed Reality & Mobile Training enabling new Educational Solution ---------------------------------------------------------------------------- WAMS 2019 Organization Committee General Chair: Prof. Agostino Bruzzone Program co-Chairs: Prof. Francesco Longo, Prof. Adriano Solis Organization co-Chairs: Marina Massei, Luca Bucchianica, Cecilia Zanni-Merk ---------------------------------------------------------------------------- For further information please contact Francesco Longo (f.longo@unical.it) or wams@msc-les.org. http://www.msc-les.org/conf/wams2019/index.html","date_start":"2019-11-11","date_end":"2019-11-13","important_dates":{"abstract":"","full":"2019-06-30","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Virtual Reality"],"location":{"virtual":"","full":["singapore","Singapore"],"name":"","street":"","city":"singapore","state":"","ZIP":"","country":"Singapore"},"organizers":["Cal-tek S.r.l."],"societies":[],"indexes":[],"emails":["f.longo@unical.it","wams@msc-les.org"]}