{"name":"Managing an Effective AML Compliance Program","series":"","short":"","website":"https://www.complianceonline.com/anti-money-laundering-aml-compliance-program-seminar-training-80114SEM-prdsm?channel=Brownwalker","content":"Are the financial transactions within your organization subject to money laundering risk? Do you have a robust internal controls program that focuses on mitigating the greatest AML/Fraud risks? Are your employees aware of the red flags within all financial transaction business processes and know what to do if they find unusual or suspicious activity? Are your company and management up to date on its compliance requirements and the potential impact of non-compliance? Whether you need to get back-to-basics or you are a seasoned AML professional, join us as we explore the many facets of managing an effective AML compliance program: Regulatory frameworks surrounding anti-money laundering Objectives of an effective AML compliance program Risk assessing your institution Developing robust internal controls Training for appropriate personnel Expectations and duties of the appointed compliance officer Effective audit program to ensure adequacy of your AML compliance program Learning Objectives: Key goals of this course are: To provide an understanding of money laundering and how it can impact an institution To review the importance of “tone at the top” and how to implement a compliance-friendly environment To learn about the critical internal controls and how these controls can protect your institution The course will focus on the 4 pillars of an AML compliance program: Policies, procedures and internal controls Designation of a compliance officer Training for appropriate personnel Independent audit To understand the importance of the risk assessment To focus on the senior management/board of directors oversight of the Program To discuss customer due diligence and know your customer expectations To discuss knowing your high risk customers To review implementation steps for enhanced customer due diligence Who Will Benefit: BSA/AML Officers, Compliance Officers, AML Analysts, Operations Managers, Remittance Analysts, Consultants, Internal Auditors, Accounting and Finance Directors, Internal Auditors, Legal Departments, Compliance Officers, and Risk Managers at Banks, Broker-Dealers, Residential Mortgage Lenders & Originators, Precious Gems Traders, Money Services Businesses and other nonbank financial institutions. Risk Management Legal Regulatory Compliance Audit","date_start":"2021-08-23","date_end":"2021-08-24","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Engineering & Technology","Chemical"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}