{"name":"Academic Writing Workshop -Getting Published Workshop – what do academic journals look for?","series":"","short":"","website":"https://academic-writing.lcir.co.uk/saturday13","content":"The workshop is designed for students, young scholars and independent researchers who would like to improve their academic writing skills in order to succeed in studies and in career. It is organised to provide maximum hands-on practice for participants. Each session will include explanations, examples, exercises, and texts to help the participants develop techniques for working productively at different stages of the scholarly writing process. The workshop will start at 10:30 and finish at 16:30, it will be divided into three sessions with breaks for tea, coffee and snacks. All the participants who will attend the workshop will receive certificates. Facilitator: Shailen Popat is a DPhil Researcher at the Oxford University Department of Education, a Senior Hulme Scholar at Brasenose College, and a Board Member of Management in Education Journal published by SAGE. Shailen is a Board member for SAGE journal, Management in Education, and one of his roles is to ensure quality in the articles that are published by reviewing articles that reviewers cannot agree on whether to recommend to publish. In this session, he will take you through what good book reviews, reports, and articles look like. Bring a draft article and work through some improvements within the group. In order to book a place, please register on https://registration.lcir.co.uk. Registration fee – 75 GBP Venue: Radcliffe Square (Lecture Room 7), University of Oxford, Brasenose College, Oxford OX1 4AJ For more information, please contact us on workshops@lcir.co.uk.","date_start":"2020-06-13","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Arts & Humanities","Other"],"location":{"virtual":"","full":["Oxford","United Kingdom"],"name":"","street":"","city":"Oxford","state":"","ZIP":"","country":"United Kingdom"},"organizers":["LCIR"],"societies":[],"indexes":[],"emails":["workshops@lcir.co.uk"]}