{"name":"Excel: Building a Reporting Tool with Pivot Tables and Charts","series":"","short":"","website":"https://www.complianceonline.com/building-reports-with-excel-pivot-tables-charts-filter-data-with-slicers-timelines-webinar-training-705245-prdw?channel=Brownwalker","content":"Learning how to create Pivot Tables is one of the must have skills for anyone who needs to use Excel to quickly build reports and summaries. This webinar will provide you with a solid foundation that you can use to build your own Pivot tables and reports. Why Should You Attend: From global enterprises to early-stage startups and small businesses, people everywhere use Pivot Tables to see and understand their data. Learning how to create Pivot Tables is one of the must have skills for anyone who needs to use Excel to quickly build reports and summaries. This training will enable anyone who is familiar with the basics of pivot tables to take their skills and knowledge to the next level. Learning Objective: Use Pivot Tables to turn raw data into meaningful and insightful reports Use Pivot Tables to create different types of summary reports Use formulas in a Pivot Table Use Slicers to create interactive Pivot Table reports Areas Covered in the Webinar: Producing a Difference report (month-on-month or year-on-year) Producing Running Totals and Top 10 reports Use Pivot Tables to produce a \"unique count\" report Use Pivot Tables to produce time-based reports (quarterly, monthly etc) Create additional columns in a Pivot Tables using formulas Combine row items in a Pivot Tables using formulas GETPIVOTDATA – What is it? When to use it and when to avoid it Using Slicers to Slice, Dice and Filter your data Who Will Benefit: If you are familiar with the basics of pivot tables (creating a basic pivot table, changing the appearance and layout, sorting, creating a pivot chart) and you wish to take your knowledge to the next level, this training is for you. The training will be delivered using the latest version of Excel for Windows although much of the functionality is available in earlier versions of the application.","date_start":"2022-03-21","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}