{"name":"International Conference and Workshop: \"Body and the Unconscious\"","series":"","short":"","website":"https://memory.lcir.co.uk/memory-embodiment-and-corporeality","content":"Does the body remember what the mind tries to forget? The psychoanalytic tradition grew out of Sigmund Freud's interest in hysteria, and the body's capacity to record painful events in the guise of psychosomatic symptoms. The painful narrative that becomes 'unspeakable' gains potency as it roams around the body, possessing various parts of us. Instead of a wandering womb (originally believed to be the cause of hysteria), it is the banished signifier that wanders, seeking expression. In the workshop with Mary Wild (the creator of the PROJECTIONS lecture series at Freud Museum London), we will examine the connection between memory and the body as represented in cinema. The proposition is that precisely that which we try to eliminate from consciousness becomes stored as physiological symptoms. The body comes to functions as a warped communicative device, fashioning trauma into future symptoms, urging us to remember. Even as language breaks down, our symptoms do all the talking for us. The following films will be discussed (advanced viewing is optional; brief scenes will be shown): Upgrade (2018, dir. Leigh Whannell), Black Swan (2010, dir. Darren Aronofsky), Videodrome (1983, David Cronenberg), and Mysterious Skin (2004, Gregg Araki). The conference sessions will be scheduled on Saturday, 12 December 2020 and we invite proposals for paper and poster presentations addressing the conference theme. The proposals should be sent to memory@lcir.co.uk by 10 November 2020\\. Please download Paper Proposal Form. The workshop is scheduled on Sunday, 13 December 2020\\. Provisional Timing: 12:00-15:00 London Time. Registration fee (speakers): 90 GBP Registration fee (attendees): 45 GBP Registration is open on https://registration.lcir.co.uk","date_start":"2020-12-12","date_end":"2020-12-13","important_dates":{"abstract":"","full":"2020-11-10","notification":"","final":""},"topics":["Arts & Humanities","Visual Arts","interdisciplinary"],"location":{"virtual":"","full":["Online Event","United Kingdom"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["memory@lcir.co.uk"]}