{"name":"How to Create a Drama Free Workplace","series":"","short":"","website":"https://bit.ly/2X3Zwgm","content":"Do you feel Frustrated? Overwhelmed? – with the constant Drama in your workplace. Discouraged that you can’t avoid it and don’t know how to make it stop? Drama takes many forms: » incessant gossip – it's divisive and unproductive AND you wonder what they’re saying behind your back » personality conflicts that create constant tension and bickering » people who are aggressive » people who are passive » people who are passive-aggressive (these are maybe the hardest to deal with) » meetings that are supposed to be collaborative are dominated by a few individuals » people feeling stressed and overworked » You end up feeling Irritated, Confused and sometimes even Helpless to do anything about it. Why Should You Attend The drama-free workplace webinar will give you the understanding, skills, tips, techniques, and tools to deal with the drama, conflict, stress, gossip, and aggression while maintaining your sense of calm and peacefulness. Think about it: » How much more work you’ll get done? » How much calmer you will be, and with more energy, you’ll have at the end of the day? » How much more you’ll enjoy your job and going to work? Areas Covered in the Session » A 5-step process to eliminate unproductive drama from your world » Strategies to redirect drama » Specific skills to address aggression, passivity and passive-aggressive words or actions » A model to recognize the 3 roles people play to create drama and how to deal with each of those roles » How to recognize even the subtlest forms of drama and how to nip them before they escalate » How to elegantly decline invitations to participate in drama Who Will Benefit » Leaders who want to create a Drama Free Workplace – enjoy more productivity, creativity, collaboration from your team » Anyone who has ever felt exhausted and overwhelmed by being immersed in a drama-filled environment and wants a more peaceful, calm, collegial and productive workplace » Anyone who feels attacked, put-down, or diminished by a co-worker » Anyone faced with personality conflicts that leave you feeling frustrated and discouraged To Register (or) for more details please click on this below link: https://bit.ly/2X3Zwgm Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-02-05","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Human-Resources"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}