{"name":"4th Annual Pharma AI, IoT & Blockchain 2021 (Virtual Conference)","series":"","short":"","website":"https://www.virtueinsight.com/pharma/4th-Annual-Pharma-AI-IoT--Blockchain-2021-Virtual-Conference","content":"4th Annual Pharma AI, IoT & Blockchain 2021 Integrating AI, IoT, Blockchain & Big Data in Pharma & Healthcare 11th March 2021, Virtual Conference (TimeZone – BST) This conference will provide insight into the current state of play in the EU & US and stimulate debate, in a multi-stakeholder setting, on the vital role of techonologyy impact in the sustainability of pharma and healthcare systems. Beyond a comprehensive outlook of key European market access policies, our speakers will outline the key recent developments in technology impact in pharma and healthcare in the EU and other international jurisdictions. DELEGATE REGISTRATION: Email: kavitha@virtueinsight.co.in or Call: +44-20 3509 3779 Please note that this is a PAID event and NOT A FREE event (no complimentary passes available). Any invite, email or tickets issued mentioning it as a free pass or free ticket to this event through any third party site will strictly not be accepted by the organizer. Early Bird Pricing 1 Delegate @ £300 + VAT (Valid Till 5th February 2021) 3 Delegates @ £800 + VAT (Valid Till 5th February 2021) Standard Pricing 1 Delegate @ £450 + VAT (Valid From 6th February 2021) 3 Delegates @ £1100 + VAT (Valid From 6th February 2021) Conference Sponsor, Exhibition Stall (Booth) & Paid Speaker Slot - Please email your interest and queries to kavitha@virtueinsight.co.in KEY SPEAKERS: • STEVEN ABRAHAMSON, Sr. Director, Region Information Security Officer, GE Healthcare (USA) • IGNACIO QUILES LARA, VP Commercial & BUH | Spain OncoHematology, GSK • DISA LEE CHOUN, Director Head of GCSO Innovation, UCB • VLADIMIR ANISIMOV, Principal Data Scientist | Data Sciences | Center for Design & Analysis, Amgen • EVI MATHIOU, Legal, Compliance & Quality Manager BA Europe East & South, Novo Nordisk • ANDREW BRYANT, Principal Engineer / Principal Fellow, Novartis • MYLES FURNACE, Global Digital Health Lead Partnerships Strategy, Transformation and Digital, Ipsen • KEVIN HUA, Senior Manager A.I./Machine Learning Development, Bayer LifeScience iHub • JON LEE-DAVEY, Global IoT Healthcare , Lead, Vodafone • EVGENY TILEZHINSKY, Global Expansion Business Partner, Office of Business Intergity & Ethics, Vertex Pharmaceuticals • STEFANIA ALVINO, Digital & MultiChannel Manager, Daiichi Sankyo • GABOR PURMAN, Scientific Solutions Director, NexGen Healthcare Communications • BILL ARONSON, COO, Artificial Intelligence Research Group • MARK DUMAN, Director, MD Healthcare • RAMINDERPAL SINGH, CEO, Anduril • INGO BAUMANN, Partner, Thescon KEY THEMES DISCUSSED IN THIS CONFERENCE: • Market overview and analysis - Shaping the future of AI in Pharma • ML in Pharma and Medicine - A potential future in which synchronicity of data, analysis, and innovation are an everyday reality • Applications of Machine Learning in Pharma and Medicine • AI - Challenges and opportunities – Moving forward with a successful strategy • Impact of Digital Transformation in healthcare & pharma industry • Big data to big impact: AI-driven patient health optimisation • Big data to big impact: Big data transforming the pharma industry • Why Big Pharma Is Betting on Blockchain • How AI technology can accelerate, cheapen and De-Risk R&D • How IoT is transforming the Pharmaceutical Industry? • IoT in Pharmaceutical manufacturing and supply chains • Big Data Analytics – A Revolution in Drug Discovery and Pharma R&D • Differences that Internet of Things (IoT) Can Make to Healthcare • How IoT is poised to transform the world of pharma • Developing regulatory framework in advanced and developing markets – for Today Tomorrow • Moving beyond 5 years – What will the technology landscape look like? • Be part of a major virtual networking opportunity WHO SHOULD ATTEND: CIOs, CEOs, CDOs, Vice Presidents, Presidents, Heads, Directors, Team Leaders, Evangelists and Senior Scientists from the following areas: Pharmaceuticals, Biotech, Artificial Intelligence, Data Science, Machine Learning, IoT, Cloud, Advanced Analytics, Innovation, Big Data, Deep Learning, Bioinformatics , Regulatory Compliance, New Product Development, Process Science, Portfolio Management, Research & Development, Business Development, Business Operations, Scientific Affairs, Commercial Affairs, Marketing By attending this conference, you will gain a comprehensive outlook on the key issues surrounding latest technologies that are being analysed towards the pharma and healthcare. Expand your knowledge of the latest business models and strategies in the high-level conference.","date_start":"2021-03-11","date_end":"","important_dates":{"abstract":"","full":"2021-03-11","notification":"","final":""},"topics":["Business","Information-Technology","Artificial intelligence"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":[""],"societies":[],"indexes":[],"emails":["kavitha@virtueinsight.co.in"]}