{"name":"Memory Studies Summer School","series":"","short":"","website":"https://memory.lcir.co.uk/memory-studies-summer-school","content":"Memory Studies Summer School 10-15 August 2021 – London/Online organised by London Centre for Interdisciplinary Research This summer school will cover topics in memory studies, historiographical reflection on narrative, oral history methods, anthropological studies on myth, memory, rituality and cinematic approach to the processes of memory telling, memory and trauma. Structured over a week, the school courses will explore to the following topics: Memory Studies: past and present time, social concerns of memory, understanding the past, the shapes of memory; Historical time and human experience; Memory and Historiography in the social context; The rituals of memory and commemoration: the work of memory, the plurality of memories; Memory telling, rituality and experience; Memory practice and subjectivity; Memory and trauma We are looking forward to applications from students, researchers and professionals with a particular interest related to memory, psychoanalysis or (cultural) storytelling. The summer school will allow you to deepen critical thinking and theoretical and methodological knowledge in the interdisciplinary field of Memory Studies. The school activities will include lectures, workshops, virtual tours, conference sessions and discussions. Participants will be encouraged to make a short presentation exploring a topic related to the summer school’s content and attend at least two lectures and workshops. A Certificate of Completion will be provided by the end of the course. Registration fee for online participation is 290 GBP. If physical participation becomes possible by August 2021, those who are interested in this format will be able to pay an additional fee to join us in our London venues. In order to book a place, please register on http://registration.lcir.co.uk by 10 June 2021\\. Contact email address: memory@lcir.co.uk","date_start":"2021-08-10","date_end":"2021-08-15","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Arts & Humanities","History","Oral History"],"location":{"virtual":"","full":["Online Event","United Kingdom"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["memory@lcir.co.uk"]}