{"name":"The First 90 Days – A Step-by-Step Guide for New Supervisors","series":"","short":"","website":"https://bit.ly/2ZXrpbb","content":"If you have taken on a new position and are concerned about what you don’t know – you’re in good company. Research show supervisors, managers and leaders moving into a new role only get a minuscule amount of the training needed to be successful in the role. On the job learning is expected – but you don’t know what you don’t know. This is the place to start. This webinar provides a structured approach to strategies and steps needed to build a solid foundation in the first 3 months that will set the stage for your future success. If you have been in the role for more than 3 months – don’t worry, many of the strategies and ideas will be successful after 90 days and can be applied even if you’re an old hand. Why Should You Attend » Are worried about how to deal with all the different personalities » Want to ensure you get the team \"on board\" and engaged early on » Will have staff who are older or more experienced in their roles » Are inheriting a team that has dysfunctional moments » Want to excel, but aren’t sure where to start Areas Covered in the Session » A step-by-step process for the first 90 days in their new role » To identify what has to be dealt with now and what can wait until later » How your leadership style will impact the team » How to adapt your leadership style to have the most positive impact » How to create collaboration and engagement on your team Who Will Benefit » HR Professionals » People Managers » Leaders » Directors » Managers » Supervisors » Business Owners » Business Consultants » Department Managers » Senior Leaders To Register (or) for more details please click on this below link: https://bit.ly/2ZXrpbb Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-03-18","date_end":"","important_dates":{"abstract":"","full":"2021-03-18","notification":"","final":""},"topics":["Business","Management / Leadership"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}