{"name":"The 4th International Conference of Public Health and Preventive Medicine","series":"","short":"PHPM 2021","website":"http://www.janconf.org/conference/PHPM2021","content":"The 4th International Conference of Public Health and Preventive Medicine (PHPM 2021) Conference Date: January 8-10, 2021 Conference Venue: Sanya, China Website: http://www.janconf.org/conference/PHPM2021/ Online Registration System: http://www.janconf.org/RegistrationSubmission/default.aspx?ConferenceID=1312 Email: workshop1@126.com The 4th International Conference of Public Health and Preventive Medicine (PHPM 2021) will be held from January 8-10, 2021 in Sanya, China. This Conference will cover issues on Public Health and Preventive Medicine. It dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal, please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: workshop1@126.com Tel: +86 132 6470 2250 QQ: 1349406763 WeChat: 3025797047 Twitter: conf\\_Committee Attendance Methods 1.Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Occupational disease Tropical Medicine Endemic diseases Alternative Medicine Cancer Prevention & Treatment Cardiology Child & Adolescent Health Chronic Care Communicable Disease Dermatology Emergency Medicine HIV/AIDS and other STDs Immunizations Infectious Disease Men's Health Nursing Obesity Prevention Oral Health Injury Prevention & Control International Health Lifestyle Medicine Military Medicine Public Health Laboratories Public Health Promotion and Education Food Drug and Device Safety Health Care Policy Weight Management Social Medicine Health Inspection Food Hygiene Environment Health Maternal and Child Health Labor Hygiene Radiation Hygiene Sanitary Engineering Health Economics Health Statistics Eugenics Health Promotion and Health Education Health Management Health Supervision Health Policy Science Health Information Management Other Related Topics","date_start":"2021-01-08","date_end":"2021-01-10","important_dates":{"abstract":"","full":"2020-12-08","notification":"","final":""},"topics":["Medicine & Health","Public-Health","Public Health"],"location":{"virtual":"","full":["Sanya","China"],"name":"","street":"","city":"Sanya","state":"","ZIP":"","country":"China"},"organizers":["Academic Communications"],"societies":[],"indexes":[],"emails":["workshop1@126.com"]}