{"name":"2nd Global Conference on Women’s Studies","series":"","short":"","website":"https://www.womensconf.org","content":"The 2nd Global Conference on Women’s Studies, June 10\\_12, 2021 in Berlin, Germany, encourages all to present their recent research work. This conference is considered a prestigious event organized with a motivation to provide an excellent international platform for academics, researchers, managers, industrial participants, and students to share their research findings with global experts. All full paper submissions will be peer-reviewed and evaluated based on originality, technical and/or research depth, accuracy, and relevance with the theme of the conference. Activist Art Challenging Male Dominance Climate crisis and Environmental activism Consciousness-raising Cyber Feminisms—Blogs, Zines, and Reproductive Rights Disabled women Economic developments and the legal system Equity and equality Family history Family policies Feminism and decolonial praxis Feminism and Nationalism Feminist pedagogy and writing Feminist theory Gender and communication Gender and Intersectionality Gender and Migration Gender and Sexual Diversity Gender Equality and Educational Systems Gender equality policies Gendered and Sexual Diversities Gendering the Covid-19 Pandemic Globalization Humanities relating to women and to gender Implementation of gender equality Implementing law Inheritance rights Intersectionality Law and accountability Laws and Policies Legal remedies Materialism Men as allies in the struggle Motherhood and Work-Life Balance Nation-building Popular and Folk cultures Resocialization of Men Social justice Socialization of boys Standpoint theory Toxic Masculinity Trafficking and Prostitution Transgender Rights and Sexual Diversity Transnational feminist theory Women and Islamic Sharia Women and Religion Women Empowerment and Social Change Women in Politics and Public Administration Women, Climate Change and Inequality Women, Media and Technology Women’s history Women’s Human rights Women’s human rights Women’s Spirituality and Religion Women’s Success Stories Women’s vulnerabilities CONFERENCE THEMES AND TOPICS Submitted abstracts will be evaluated by the Scientific Committee. If an abstract is accepted, the author agrees to send full-text paper, including results, tables, figures, and references. All submissions should report original and previously unpublished research results no matter the type of research paper you are presenting. Full-text papers (.docx and .doc) will be accepted by Electronic Submission Form. Manuscripts should meet the format set by the Conference committee and are subject to review. Please submit your papers via ONLINE SUBMISSION FORM. – For more information about the conference, you are welcome to contact the organizing committee directly via info\\[at\\]womensconf.org. Important Deadlines are: Paper Submission: 21 May 2021 Early Registration Deadline: 09 April 2021 Late Registration Deadline: 31 May 2021 Conference Dates: 10 – 12 June 2021 We encourage you to invite colleagues to participate in the conference and submit original research for the conference Call for Papers.","date_start":"2021-06-10","date_end":"2021-06-12","important_dates":{"abstract":"","full":"2021-05-21","notification":"","final":""},"topics":["Social Sciences","Gender/Sexuality","gender studies (and womens)"],"location":{"virtual":"","full":["Berlin","Germany"],"name":"","street":"","city":"Berlin","state":"","ZIP":"","country":"Germany"},"organizers":["Acavent"],"societies":[],"indexes":[],"emails":[]}