{"name":"UK SMART CITIES MISSION TO MALAYSIA","series":"","short":"","website":"https://www.events.great.gov.uk/ereg/newreg.php?eventid=200233939","content":"The United Kingdom is recognised as one of the global leaders in smart cities development, with its renowned technological expertise and advanced solutions. UK smart cities strengths lie across a board spectrum, from design, engineering, and consulting to internationally recognised standards and highly innovative technologies in key fields such as infrastructure, transport, communications, security, energy and healthcare. As a result of these, the UK companies are regularly solicited by international partners at the highest level to counsel, advise on and implement smart city developments and innovations. On 22 June 2021, the former Minister of Housing and Local Government Malaysia (KPKT), YB Datuk Zuraida Kamaruddin and the British High Commissioner, H.E Charles Hay launched the Smart City Handbook: Malaysia. The handbook outlines the smart city landscape across Malaysia and highlights best practices across the UK that could potentially be adopted in Malaysia. As a follow through, the Department of International Trade Kuala Lumpur will be hosting a 3-day Virtual UK Smart Cities Mission to Malaysia from 22nd to 24th February 2022, to increase awareness and share UK Smart Cities expertise and experiences by showcasing successful implementations of smart cities solutions in various cities across the UK and to position the UK as a partner of choice for smart cities development, creating mutually beneficial trade opportunities, complimenting the work of the Global Future Cities Programme.","date_start":"2022-02-22","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Economics","international trade (business)"],"location":{"virtual":"","full":["Online Event","Malaysia"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Malaysia"},"organizers":["British High Commission"],"societies":[],"indexes":[],"emails":[]}