{"name":"International Conference: \"Narratives of Displacement\"","series":"","short":"","website":"https://narrativesofdisplacement.lcir.co.uk","content":"\"Narratives of Displacement\" International Conference - 6 November 2020 - Palma, Spain - organised by London Centre for Interdisciplinary Research, The British and Comparative Cultural Studies Research Group (BRICCS), Unversity of the Balearic Islands, Spain; in collaboration with Research Project RTI2018-097186-B-I00 and RED2018-102678-T (MCI/AEI/ERDF, EU) | The conference seeks to explore the narratives of displacement and to demonstrate the validity of a cross-disciplinary approach which brings together the historical, cultural, social and literary expertise in the handling of text. The conference will particularly focus on time and space representations and on treatment of the theme of cultural ambivalence and identity conflict. The subject of displacement will be regarded as both a migration, voluntary or forced, and a sense of being socially or culturally “out of place”. Papers are invited on topics related, but not limited, to: migrations and deportations (expatriation, expulsion, exile, etc.), journeys, pilgrimages, missions; mobility and place, rootlessness and taking root, foreignness and indigeneity, (re)settlement and (non)residence, nomadism and place attachment, hotels, guesthouses, shelters; multiculturalism, interculturalism, transculturalism, strangerhood and neo-cosmopolitanism, | Submissions may be proposed in various formats, including: Individually submitted papers (organised into panels by the committee); Panels (3-4 individual papers); Posters. The conference aims to bring together scholars from different fields. We invite proposals from various disciplines including history, philosophy, sociology, anthropology, culture studies, media studies, political science, law, architecture, tourism, religious studies, literature, linguistics, psychology, etc. Academic Committee: Dr OlenaLytovka (LCIR, UK) Dr Anna Hamling (University of New Brunswick, Canada) Dr Gianluca Sardi (University of Teramo, Italy) Prof Isabel Carrera-Suárez (University of Oviedo) Prof Mireia Aragay (University of Barcelona, Spain) Dr Laura M. Lojo-Rodríguez (University of Santiago de Compostela, Spain) Prof M. Dolores Herrero-Granado (University of Zaragoza, Spain) Dr Rodrigo Andrés (University of Barcelona, Spain) Prof Jane Mattisson Ekstam (Østfold University College, Norway) Dr Eduardo de Gregorio Godeo (University of Castilla-La Mancha, Spain) Dr Mihai Iacob (University of Bucharest, Romania) Dr Dragos A. Ivana (University of Bucharest, Romania) Dr Natalia Magnes (Saint Petersburg State University, Russia) Dr ArmelaPanajoti (University of Vlora “Ismail Qemali”, Albania) Dr Roberta Piazza (University of Sussex, UK) Dr Slávka Tomaščíková (PavolJozefŠafárik University, Slovakia) Dr Bledar Toska (University of Vlora “Ismail Qemali”, Albania) Dr Elke Weissmann (Edge Hill University, UK) Organising Committee: Mr Elmer de Vos (LCIR, UK) Ms Rosa Moreno-Redondo (University of the Balearic Islands, Spain) Dr José Igor Prieto-Arranz (University of the Balearic Islands, Spain) Dr Patricia Bastida-Rodríguez (University of the Balearic Islands, Spain) Dr Rubén Jarazo-Álvarez (University of the Balearic Islands, Spain) Dr Aida Rosende-Pérez (University of the Balearic Islands, Spain) Dr Katarzyna B. Paszkiewicz (University of the Balearic Islands, Spain) Ms Margalida Pizarro-Sirera (University of the Balearic Islands, Spain) Proposals up to 250 words should be sent by 10 June 2020 to: displacement@lcir.co.uk. Download Paper proposal form. Standard registration fee – 120 GBP Student registration fee – 90 GBP Conference venue: Unversity of the Balearic Islands, Spain","date_start":"2020-11-06","date_end":"","important_dates":{"abstract":"","full":"2020-06-10","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature"],"location":{"virtual":"","full":["Palma","Spain"],"name":"","street":"","city":"Palma","state":"","ZIP":"","country":"Spain"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["displacement@lcir.co.uk"]}