{"name":"The International Congress on Psychiatry","series":"","short":"CP 2020","website":"https://www.confjune.org/conference/CP2020","content":"The International Congress on Psychiatry (CP 2020) Website：https://www.confjune.org/conference/CP2020/ Date：November 6-8, 2020 Venue：Fortune Hotel Xiamen, Xiamen, China Online Registration Entrance：https://www.confjune.org/RegistrationSubmission/default.aspx?ConferenceID=1250 Due to COVID-19 epidemic situation all over the world, most countries still maintain a strict policy of no-gathering, no-entering and leaving the country, and 14-days quarantine. We have to postpone the conference till November 6-8, 2020 in Xiamen, China. The International Congress on Psychiatry (CP 2020) which was planned to be held from May 29-31, 2020 in Xiamen, China has been postponed till November 6-8, 2020\\. CP 2020 will cover issues on Mental Health and Well-being, Research, Education and Case Studies on Mental Health, Neuroscience Nursing and Neurosurgery, Stress, Anxiety and Depression, Self-harm and Suicide Prevention . It dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods. Attendance Methods 1\\. Submit full paper ( Regular Attendance + Paper Publication + Presentation ) You are welcome to submit full paper through Online Registration System. All the accepted papers will be published by a peer-reviewed open access journal and submitted to CNKI and Google Scholar for indexing. 2.Submit abstract ( Regular Attendance + Abstract + Presentation ) You are welcome to submit abstract for oral presentation or poster presentation. 3.Regular Attendance ( No Submission Required ) You're also welcome to attend our conference (without submitting full paper or abstract) Contact Us Email: confws6@163.com Tel: +86 151 7247 9625 QQ:1349406763 Wechat: 3025797047","date_start":"2020-11-06","date_end":"2020-11-08","important_dates":{"abstract":"","full":"2020-10-25","notification":"","final":""},"topics":["Medicine & Health","Mental-Health","psychiatry"],"location":{"virtual":"","full":["Xiamen","China"],"name":"","street":"","city":"Xiamen","state":"","ZIP":"","country":"China"},"organizers":[""],"societies":[],"indexes":[],"emails":["confws6@163.com"]}