{"name":"2020 ANPOR-APCA Annual Conference","series":"","short":"","website":"https://www.anpor.net/anpor2020","content":"In the past year, we have witnessed trends of global transformation across industries due to the COVID-19 pandemic. The worldwide increase in human knowledge despite limited physical mobility, unhindered and expansive communication channels have been facilitating the transfer of knowledge across continents. Communication is one of the underlining frameworks of such global transformation that also reinforces public opinion on global issues. The Asian Network for Public Opinion Research (ANPOR) has been an important venue for scholars, practitioners, journalists, and students from various countries to participate and contribute to the betterment of Asian societies through the lens of public opinion, journalism, and communication research since 2012\\. Since the founding of the Asia-Pacific Communication Alliance (APCA) in 2018, this organization of national and regional organizations, which includes ANPOR as one of its members, has facilitated communication among communication scholars on both sides of the Pacific Ocean. Members of the global community are in the process of transformation to survive the COVID-19 pandemic. ANPOR and APCA are also riding this challenging wave to survive. As academic communities, ANPOR and APCA offer the venue for scholars to meet and expand their relationship regularly. Throughout the past seven years, the ANPOR annual conference has successfully crafted friendships and collaborations among scholars and institutions, not only in Asia but also in other regions. To keep the spirit of ANPOR and APCA in this time of limited physical mobility, we will cherish our tradition in the virtual world of the 2020 Joint ANPOR Annual Conference/APCA Annual Conference. The previous ANPOR conferences in Seoul, Niigata, Bangkok, Battambang/Siem Reap, Shanghai, Bandung, and Chiangmai have all been a great success, drawing participants from more than 20 countries. Ideas, research, and cooperation have been the fruit of our gatherings. We have indeed come a long way since our establishment and have steadily grown. The network’s journal – the Asian Journal for Public Opinion Research (AJPOR) – has now been indexed in the Korean Citation Index database, and Scopus and will continue to be listed in other world ranking databases. To commemorate the 8th year of ANPOR and the 3rd year of APCA, you are cordially invited to submit abstracts and papers to present at the online conference. The theme of our conference this year is “Measuring, Understanding, and Communicating Public Opinion in Unprecedented Times”. Thus the 2020 ANPOR-APCA Annual Conference hopes to engage academics from across the regions within the central theme of public opinion and multicultural communication. Topics Discussion topics and questions included but not limited to: • Public Opinion Theory and Methods o Conducting Surveys in Times of Social Distancing o Evolution of the Survey during COVID-19 • Politics and Public Opinion Research • Social, Economic and Ecological Issues • Global Transformation • Media, Journalism and Marketing Communication • Science, Environment and Risks Communication • Challenges and Solutions in Cross Cultural and Intercultural Communication • Security Landscape and Political-Administrative Development • Health Communication o Daily Life Satisfaction o Aging Society o Health Literacy o Communicating in Health Care o COVID-19 in Traditional and New Media • Big Data, Sentiment Analysis, and Machine Learning • Data Visualization, New Technologies, and Online Surveys In addition, AJPOR, will host some sessions including a session on demystifying the process of publishing in an international journal.","date_start":"2020-12-02","date_end":"","important_dates":{"abstract":"","full":"2020-11-13","notification":"","final":""},"topics":["Social Sciences","Sociology","Journalism"],"location":{"virtual":"","full":["Online Event","Thailand"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Thailand"},"organizers":["Asian Network for Public Opinion Research"],"societies":[],"indexes":[],"emails":[]}