{"name":"Retention Strategies for Keeping Top Performers","series":"","short":"","website":"https://bit.ly/2JfeyMp","content":"In this HR compliance webinar attendees will learn why Millennial and other employees stay or leave and learn practical techniques you can use to retain the best employees. Why Should You Attend The Millennial generation is a force to be reckoned with. They are talented, innovative, entrepreneurial, and creative. They are also highly mobile and prone to job hopping. Retaining top talent is a key business imperative and old strategies are no longer effective. More than 60% of Millennials leave their company in less than three years and their turnover is greater than any other generation. In addition there are now more Millennials than Baby Boomers in the workforce. 60% are open to a different job and 36% will look for a new job in the next year. No question they have their own style, attitudes, and beliefs. Unfortunately most companies don’t have a focused retention strategy to retain these important employees. The good news is that Millennial prefer to stay with the same company and they will if given the right environment and opportunities. There are strategies and tactics that can improve retention rates. Objectives of the Presentation » Why Millennial employees stay or leave » How to measure turnover » The relationship of compensation to employee satisfaction and motivation » The relationship of leadership to retention and turnover » How to create a workplace \"community\" » Why recruitment and interviewing are important in managing turnover » The importance of \"Stay interviews\" » 135 ideas for reducing turnover » 10 steps toward great retention » Ideas for more effective onboarding » Importance of realistic job previews » 7 steps to giving effective recognition » Linking benefits to retention » The 5 components of the retention model » Keys for millennial retention Areas Covered in the Session » Cite factors that contribute to Millennial employee turnover » Identify strategies for retaining employees » Understand the link between leadership, employee satisfaction, and turnover » Measure employee turnover » Cite three factors that contribute to employee motivation » Understand the priorities of the Millennial generation Who Will Benefit » Individuals responsible for employee retention » Human resources » Employee development » Leadership and management To Register (or) for more details please click on this below link: https://bit.ly/2JfeyMp Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2020-12-10","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Human-Resources"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["AbideEdict"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}