{"name":"CfP: IEEE CAMAD, Special Session on Emerging Paradigms for Intelligent and Massive IoT, Pisa, 14-16 September 2020","series":"","short":"","website":" http://camad2020.ieee-camad.org","content":"IEEE International Workshop on Computer Aided Modeling and Design of Communication Links and Networks (CAMAD) http://camad2020.ieee-camad.org/ \\*\\*\\*\\*\\* Special Session on \"Emerging Paradigms for Intelligent and Massive IoT\" \\*\\*\\*\\*\\* Paper submission deadline: May 20, 2020 CALL FOR PAPERS This Special Session aims to draw together researchers and practitioners engaged in the development, experimentation and management of solutions for IoT over large scales. The session looks for contribution addressing both the theoretical aspects and practical experiences of IoT that apply to large scale scenarios, possibly including crowds, and that may also involve security, big data or artificial intelligence technologies. For more details, please visit the main web site of the Conference. Topics of Interest In this Special Session, we welcome submissions of papers presenting original works. Submissions must not overlap with works that have been published or that are simultaneously considered for publication elsewhere. Specifically, we encourage researchers and industry experts to submit original contributions in the following major areas (indicative list, other related topics will also be considered): - Human-enabled sensing - Human into the loop Edge Architectures - Novel Paradigms for Mobile Edge/Fog Computing - Machine Learning and Knowledge-based IoT - Intelligent Services for citizen in urban/rural environments - Crowd Opportunistic and Participatory Sensing - Green and Sustainable Architectures - Smart Environments/Cities/Landscapes: Vision and Reality - Safety, security, privacy and trust in IoT-enabled Architectures and Services - Pervasive and mobile computing technologies for Intelligent Smart Environments/Cities/Landscapes - Disruptive use of UAV in Smart Environments/Cities/Landscapes - Real-world experiences in Smart Environments/Cities/Landscapes Important Dates Paper submission deadline: May 20, 2020 Paper acceptance notification: July 05, 2020 Camera-ready paper: July 31, 2020 Conference date: September 14-16, 2020 Paper Submissions Guidelines Prospective authors are invited to submit a full paper of not more than six (6) IEEE style pages including results, figures and references. Papers should be submitted via EDAS. Papers submitted to the conference, must describe unpublished work that has not been submitted for publication elsewhere. All submitted papers will be reviewed by at least three TPC members, while submission implies that at least one of the authors will register and present the paper at the conference. Electronic submission will be carried out through the EDAS web site at the following link: https://edas.info/newPaper.php?c=27371&track=101984 All accepted papers will be included in the conference proceedings and IEEE digital library (http://ieeexplore.ieee.org/). Special Session Organizers - Michele Girolami, National Research Council (ISTI-CNR), Italy - Soledad Escolar, University of Castilla-La Mancha, Spain - Stefano Chessa, University of Pisa, Italy","date_start":"2020-09-14","date_end":"2020-09-16","important_dates":{"abstract":"","full":"2020-09-14","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Pisa","Italy"],"name":"","street":"","city":"Pisa","state":"","ZIP":"","country":"Italy"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}