{"name":"Dubai 2020: Rapid Cities – Responsive Architectures","series":"","short":"","website":"https://architecturemps.com/dubai-2020","content":"The backdrop to this conference is EXPO 2020 Dubai. Using the themes of the EXPO as the starting point for an examination of contemporary design and construction, this conference welcomes participants from various disciplines: Urban Design | Architecture | Construction | Sustainability | Engineering | Housing | Public Health | Sociology | Transport | Business | Technology | History and Culture. PUBLISHERS: Routledge | UCL Press | Cambridge Scholars Publishing FORMATS: In-person, pre-recorded presentations, skype, written papers Themes: Urbanism: Global Cities | Urban design in the Gulf | Temporary urbanism | Regional Planning. Design: Emerging ‘Styles’ | High Rise-low density | Spectacle architecture. Speed: Just-in-time construction | Prefabrication | Fast-track procurement. Technology: Computational design | 3D printed buildings | BIM | Virtual Reality. Social: Communities and Activism| Affordable Housing | Right to the City. Sustainability: Resilience | Net-zero energy design | Climate-responsive architecture. Culture: Heritage | Tourism | Branding | Real Estate and Development. Infrastructure: Integrated Transport | The Intelligent City | The Walkable city…. and more. Full Call: In 1975 the World EXPO opened in Okinawa, Japan. Its centerpiece was ‘Aquapolis’, a floating city designed by the leading ‘metabolist’ architect Kiyonori Kikutake. By the time it closed one year later, Reyner Banham had published Megastructure: Urban Futures of the Recent Past. Paul Virilio had also coined the term dromology to explain the impact of speed and technology on contemporary culture. For all, speed and technology were not only central to architectural and urban design, but also the mediated culture of spectacle around them. The debates they instigated were not one dimensional however. Virilio’s interest in technology was matched by concerns for social justice. Banham’s focus on megastructures was nuanced by ideas on responsive environments. Kikutake’s interest in ‘spectacle’ was tied to an interest in ecology as manifest in the 1975 EXPO itself. The event that this conference aligns with, EXPO 2020, addresses the dichotomies found in the work of these theorists. For many, the phenomenon of the EXPO is the epitome of contemporary fast-paced design and development. Commercially driven, built at break neck speed, led by star architects and premised on instant urban planning. EXPO 2020 has all these traits. However, it also presents itself as responsive to social and environmental concerns. It is powered by solar arrays, recycles wastewater and monitors its carbon footprint. It touts its long term plan for housing and mixed-use development post EXPO. It is themed around opportunity, mobility and sustainability. As with the city of Dubai itself – the poster-child of rapid development in the Gulf – EXPO 2020 is the perfect backdrop to this conference. Rapid Cities – Responsive Architectures seeks to examine the dialectic, tensions, problems and possibilities of architecture and urbanism as technologically imbued, fast-paced commercial exercises. Can the design and construction of the built environment be fully profit-driven, remain responsive to climate and cultural heritage? Is spectacle architecture consistent with vernacular design, accessible transport and best practice construction? How do rapidly planned cities ensure social integration, urban health and produce affordable housing? Is it the role of the design and construction industries to respond to these issues at all? Should we embrace speed and technology as motors of design, construction and development as ends in themselves? If we do, what are the advantages and likely results? What does the history of these issues tell us about future trends? Abstracts: 30th June 2020 (Round One) / 01 October 2020: (Round Two)","date_start":"2020-11-22","date_end":"2020-11-24","important_dates":{"abstract":"","full":"2020-06-30","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental","Architecture & Civil Engineering"],"location":{"virtual":"","full":["Dubai","UAE","United Arab Emirates","United Arab Emirates"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":["American University in Dubai"],"societies":[],"indexes":[],"emails":[]}