{"name":"Security and sovereignty in the 21st century","series":"","short":"","website":"http://culturalrelations.org/portfolio/sesco2019","content":"⁞ Conference topics Current affairs of security and defence policy and various sovereignty-related issues. The roles of state and non-state actors in cooperation and conflict; concerns of territorial, political and economic integrity of states and regions; safety and well being of people. Current issues of security threats, neighbourhood policies, violence and terrorism. Special focus of the conference in 2019: Current disputes in Eastern Europe and assistance of the EU Institutions. Recent actions in the Council of Europe Parliamentary Assembly. Cyberattacks and disinformation (information warfare) in Eastern Europe. Regional and European integration in the post-Soviet area. ⁞ Aims This interdisciplinary meeting welcomes presentations of research on security studies, international relations, political science, law, history, economics and cross-border cooperation topics. The conference is supported by the Institute for Cultural Relations Policy (ICRP) and Kodolányi János University (KJU). Its aim is to serve as a meeting point to facilitate the public exposure of the perspectives and interests of different communities, governments, international organisations, NGOs, businesses, scholars, thinkers and common citizens. ⁞ Programme summary The conference consist of keynote lectures by diplomats and leading experts in the field of security policy and international relations; presentations of guest speakers and Q&A sessions. The submitted and confirmed papers will be published online. The main language of the conference is English. ⁞ Conference themes (Possible directions may include, but are not restricted to, the following) Global challenges and regional security; national security and defence policies, military strategies; security organisations; conflict transformation and conflict resolution; cyber security; economic issues; energy security; cross-border crime, counter-terrorism; immigration; self-determination; territorial sovereignty; financial sovereignty; separatism, ethnic minority issues; diaspora policies and interstate relations. ⁞ Conference location Kodolányi University, Budapest Frangepán utca 50-56, 1139 Hungary See below the map and directions ⁞ Benefits of attending • Opportunity to present individual and group researches within an international forum and collaborate with experts from around the world; • Conference papers and abstracts are peer-reviewed by members of ICRP international Advisory Board; • Published papers in electronic format (proceedings available online); • Get in touch with different views and new approaches; • A chance to promote own research work by presenting it to relevant people and organisations (decision-makers, diplomats and experts); • To get more knowledge about recent developments and new challenges in security policy. ⁞ Registration and payment information How to register for participation (listeners)? The registration is a two-step procedure and it includes the submission of the online registration form and payment of the listener registration fee (10 EUR\\*). Deadline of submission & payment: 10 November 2019 How to apply for paper presentation (speakers)? The application is a two-step procedure and it includes the submission of the online application form and payment of the speaker registration fee (100 EUR\\*). Deadline of submission: 8 November, 2019\\. Authors will be notified of acceptance or rejection within 5 working days after submission. The registration fee shall be paid by bank transfer prior to the event OR at the same time as first day registration. Early bird application fee is 50 EUR\\* for presenters if application is submitted before 20 September 2019! Registration fee for in absentia presentation is 80 EUR\\* (plus international money transfer fee). \\* NOTE that bank transfer fees must be covered by participants. In order to reduce money transfer costs, speakers are entitled to make payment in cash during the registration (original speaker registration fee 100 EUR). Speaker registration fees for the full conference includes a copy of conference materials (including booklet of abstracts and conference proceedings that contains all approved papers), and covers the cost of refreshments, and all conference activities, including the walking tours on the last day. These items are not separately priced. Papers are invited on the topics outlined and others falling within the scope of the meeting. The conference fee does not include public transport, international travel and travel related expenses (visa & insurance fee expenses) and accommodation fees. ⁞ Important dates & times Early bird registration: 20 September 2019 Deadline for application for in absentia presentation: 8 November 2019 Deadline for application of speakers: 8 November 2019 Deadline for registration of listeners: 10 November 2019 The conference: held on 15 November 2019 Arriving & Registration of Participants: 15 November 2019, 10:00-10:30 Conference sessions: 15 November 2019; walking tour: 16 November 2019 Deadline for submitting final paper: 31 January 2020 Final schedule of lectures and presentations will be disseminated to participants later. ⁞ Cancellation rules Speaker applications: After submission of speaker application in any case of the participation cancellation until 10 October 2019 the charge 35 EUR (plus bank transfer costs will be extra charge) will be deducted from the participation fee for the administrative charges. In case of participation cancellation after 10 October 2019 the charge will be 100 EUR (bank transfer costs will be extra charge). Listener registration: After submission of online registration in any case of the participation cancellation until 10 October 2019 the charge of bank transfer costs will be deducted from the participation fee for the administrative charges. In case of participation cancellation after 10 October 2019 no refund is possible. Submitted abstracts will be evaluated by an international reviewing committee. Authors will be notified of conditional acceptance or rejection in 5 working days after submission Event organised by the Institute for Cultural Relations Policy in cooperation with Kodolányi University Budapest The event targets a broad spectrum of undergraduate, PhD student, candidate, lecturer and researcher participants, recognising the multidisciplinarity of research in security studies and other related disciplines ⁞ Notes • Deadlines for publishing: the abstracts sent upon registration will be included in the Booklet of Abstracts published for the conference. The full paper will be published online on the event’s webpage (if paper received by final deadline 31 January 2020). • Visa: Due to the international epidemic of attempted visa, entry permit, conference registration, and credit card fraud, the conference and its sponsors reserve the right to question any speaker application request and only honour it on receipt of valid proof of active research, studies or relevant experience in the field of the conference. In case of any issue, the decision will be up to the registration staff and conference organizing committee. Please visit the following website to get information about your visa easily: http://konzuliszolgalat.kormany.hu/how-to-apply-for-visa • Co-authors and groups: Please note that in case of group registration and papers with co-authors all registration fees are per person. • Accomodation: The ICRP is ready to suggest first class, mid-range and low budget hotels in Budapest. • Public transport: The ICRP is happy to purchase Budapest transportation ticket upon request. A Budapest 24-hour travel card costs 6 euros and Budapest 72-hour travel card costs 15 euros. If you would like us to buy any of these travel cards for you please transfer the additional sum (6 or 15 euros) with the participation cost. Please transfer the accommodation and transportation cost together with the participation cost. • In absentia presentations are possible under some conditions. In case of presenting in absentia the abstract of your paper will be included in the Abstracts Booklet. Your full paper will be published online on the event’s webpage (if paper received by 31 January 2020). The attendance certificate can be given only to those who attend the conference, however we can email you a certificate (upon request) showing that your paper was presented “in absentia.” • Language: The conference language is English. No translation services will be available. ⁞ Abstracts and oral presentation • Papers are invited on the topics outlined and others falling within the scope of the meeting. Abstracts of no more than 3,000 characters. Abstracts should clearly state the purpose, results and conclusions of the work to be described in the final paper. • Paper of no more than 40,000 characters. Abstracts should be uploaded through the online application form (or sent by e-mail at the following e-mail address:conference@culturalrelations.org) • 15 minutes for presentation. Q/A session: 10 minutes maximum. • Use Microsoft PowerPoint or Prezi for your presentation. • Author guidelines: Language: British English; Font type and size: Times New Roman – size 12; editable file (.doc, .rtf, .odt); recommended length: 20,000 – 40,000 characters; Harvard Citation System (see: http://libweb.anglia.ac.uk/referencing/harvard.htm). Figures, illustrations, tables are allowed. ⁞ Links and downloads Find the Event on Facebook: https://www.facebook.com/events/913964622313964 Conference Brochure: http://culturalrelations.org/Files/Conferences/2019SESCO/SESCO2019\\_conference\\_information.pdf Conference website: http://culturalrelations.org/portfolio/sesco2019 ⁞ Bank transfer information Registration fees shall be paid by bank transfer or on the spot in case of speakers. Please use the corresponding information below (please enter your name (or name of institution) as the payment reference): The ICRP Bank Account: Payee: Kulturalis Kapcsolatokert Alapitvany Address: Gyongyosi u. 45., 1131 Budapest, Hungary Bank: OTP Bank Address: H-1051, Budapest, Nador utca 16\\. For international transfers International Bank Account Number (IBAN): HU92 1171 1010 2000 2963 0000 0000 Bank Identifier Code (BIC/SWIFT): OTPVHUHB For transfers within Hungary Account Number: OTP Bank 11711010-20002963-00000000","date_start":"2019-11-15","date_end":"2019-11-16","important_dates":{"abstract":"","full":"2019-11-08","notification":"","final":""},"topics":["Social Sciences","Political-Science"],"location":{"virtual":"","full":["Budapest","Hungary"],"name":"","street":"","city":"Budapest","state":"","ZIP":"","country":"Hungary"},"organizers":[""],"societies":[],"indexes":[],"emails":["conference@culturalrelations.org"]}