{"name":"19th International Multidisciplinary Scientific GeoConference SGEM 2019","series":"","short":"","website":"http://www.sgemviennagreen.org","content":"Period: 9 – 12 December, 2019 Venue: Palais Niederösterreich, Vienna, Austria Address: 1010 Wien, Österreich Abstract deadline: 01 October 2019 Full Paper Deadline: 10 November, 2019 Registration & payment Deadline: 01 November 2019 The SGEM Vienna Green 2019 Conference is organized as an extended Scientific Sessions of the International Scientific GeoConference SGEM. The conference will take place from 9 to 12 December, 2019, at one of the most interesting palace buildings in Vienna - Palais Niederösterreich. During these four days of SGEM Vienna GREEN 2019 this famous Palace will be an epicenter of global interacting between best scientists from more than 25 countries. Their innovative scientific works are devoted to important topics such as: Oil and Gas Exploration, Hydrology and Water Resources, Forest Ecosystems, Nuclear Technologies, Recycling, Air Pollution and Climate Change, Micro and Nano Technologies, Advances in Biotechnology, Green Buildings Technologies and Materials, Green Design and Sustainable Architecture, Modern Energy and Power Sources, Animals and Society. All submitted papers will be peer-reviewed, evaluated and, if accepted, will be published in a Conference proceedings /hard copy version/ with ISSN, ISBN and DOI numbers. Every accepted paper have DOI number and will be also submitted for evaluation and indexation in the biggest scientific databases - ISI WoS Clarivate, SCOPUS, ELSEVIER products - Mendeley, EBSCO, ProQuest, Mendeley, Russian eLibrary (RINTZ), British Library etc. The Conferences include also accompanying events, such as workshops and very interesting cultural activities with historic value.","date_start":"2019-12-09","date_end":"2019-12-12","important_dates":{"abstract":"","full":"2019-10-01","notification":"","final":""},"topics":["Life Sciences","Other","petroleum & petrochemicals (oil & gas)"],"location":{"virtual":"","full":["Vienna","Austria"],"name":"","street":"","city":"Vienna","state":"","ZIP":"","country":"Austria"},"organizers":["SWS Society"],"societies":[],"indexes":[],"emails":[]}