{"name":"PV (Pharmacovigilance) Audit Strategy Planning - A Practical Approach to Design and Implementation","series":"","short":"","website":"https://www.complianceonline.com/pharmacovigilance-pv-audit-gvp-sdea-sop-seminar-training-80304SEM-prdsm?channel=Brownwalker","content":"The European Medicines Agency's (EMA) Guideline on good pharmacovigilance practices (GVP), Module IV requires that risk-based audits of the quality system be performed at regular intervals to assure that it complies with the established quality requirements and to determine its effectiveness. It includes audit of the pharmacovigilance system which is covered by the quality system. The GVP Modules are applicable to EU-based companies and any company marketing medicinal products on a global basis. The legally required risk based audit strategy shall cover all PV processes and tasks undertaken by or delegated to other departments, MAH affiliates, and third parties such as distributors, external service providers, partners (the PV Universe). The PV Audit Strategy Plan is used to prepare the PV audit program, i.e. annual PV Audit Schedule. In this two day workshop conference we will review the EMA and FDA requirements regarding Risk Based Audits of the PV system and Quality System. The course will focus on the design of the PV audit strategy, identification of the PV processes and entities subject to PV audit (define the PV audit universe), development of risk assessment methodology, development of procedures/tools to monitor PV processes and activities, and implementation of the PV audit strategy plan. Additionally, we will review methods of quality oversight and management of third parties performing PV activities. Learning Objectives: Upon completing of this course, participants should be able to: Understand the legal requirements and health authority expectations for a risk based audit program and current interpretation. Plan, develop and implement the PV Audit Strategy Plan, which includes the following processes: Develop a high-level PV audit strategy Identify the PV activities and processes subject to PV audit Develop risk assessment criteria Identify the PV audit universe – entities subject to PV audit Categorize the entities subject to PV audit Perform risk assessments Prioritize entities for audit according to relative risk Prepare a 3-5 year PV audit plan Identify procedures/tools to monitor PV quality of third parties Who will Benefit: This course is designed for people with some PV experience and tasked with developing, maintaining, updating and/or reviewing the PV quality system audit strategy plan, risk assessment and/or the annual PV audit schedules. It is also beneficial for staff responsible for the quality oversight of third parties conducting PV activities. The following personnel will benefit from the course: PV Quality Assurance Staff PV Compliance professionals Quality auditors Pharmacovigilance Auditors Relevant Pharmacovigilance Staff PV Service Provider Relationship Managers MAH Affiliates responsible for Pharmacovigilance","date_start":"2021-05-10","date_end":"2021-05-11","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}