{"name":"The Ketamine Conference","series":"","short":"","website":"http://go.evvnt.com/664026-2?pid=4868","content":"Bexson Biomedical, The Conscious Fund and Microdose present The Ketamine Conference on the 21st/22nd August 2020\\. A molecular masterclass. About this Event THE KETAMINE CONFERENCE MOLECULAR MASTERCLASSES BY MICRODOSE Deep dives into key psychedelic compounds. 21st and 22nd August 2020 Ketamine is creating new pathways to pain management and better mental health. We present a complete exploration of ketamine at the intersection of clinical care, research and investment, featuring the world's top researchers, clinicians, companies, advocates and experts. Discover the potential of ketamine and NMDA receptor antagonists in the treatment of key mental and physical conditions through keynote presentations, expert panels, interactive discussions and collaboration. This two-day conference brings together experts in the field to discuss the very latest science, health care innovation and business opportunities in this rapidly growing field. Sponsors Bexson Biomedical - developing therapies for chronic and acute pain management. The Conscious Fund - investing in early-stage ventures in plant-based medicine. Microdose - psychedelic insights, events, podcasts, news and market intelligence. Speakers Jeffrey Becker, MD Martha B. Koo, MD Steve Mandel, MD Veronika Gold, MFT Wes Ryan, MD Anthony El Chibani David Feifel Gregg Peterson Sandhya Prashad Stephen Parker Steve Best Our Mission Connect leaders in ketamine science, delivery, and training with clinicians, business leaders and capital. Translate the science behind ketamine and NMDA Receptor based interventions. Illustrate the dynamic and nuanced nature of this medication in medical treatment. Provide perspective on the realities of working in this rapidly evolving space. Identify pitfalls, medical concerns, delivery gaps and medical/legal issues in the field. Review markets, investment cases and value propositions for ketamine-based therapies. Showcase the leading enterprises within the ketamine sector worldwide. CONFERENCE TIMES and FORMAT Panels and keynotes will run for 45 minutes, with a 15 minute Q and A session afterwards. The conference will begin at 17:00 (GMT) / 12:00(EST) / 09:00 (PST) each day. You will be sent login and platform details with your ticket. The whole conference will be recorded and will be available to all ticket holders to enable attendees to make the most of the experience. Speakers will be confirmed and added to each track. We are expecting more than 40 leading lights from across the ketamine ecosystem to present. Tickets: https://go.evvnt.com/664026-0?pid=4868 Time: 09:00 to 16:00 Prices: Standard Ticket: USD 80.00, Investor VIP Ticket: USD 270.00 Speakers: Jeffrey Becker, MD, Martha B. Koo, MD, Steve Mandel, MD, Veronika Gold, MFT, Wes Ryan, MD, Anthony El Chibani, David Feifel, Gregg Peterson, Sandhya Prashad, Stephen Parker, Steve Best Venue details: Online","date_start":"2020-08-21","date_end":"2020-08-22","important_dates":{"abstract":"","full":"2020-08-21","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["San Francisco","United States"],"name":"","street":"","city":"San Francisco","state":"","ZIP":"","country":"United States"},"organizers":["Microdose Psychedelic Insights"],"societies":[],"indexes":[],"emails":[]}