{"name":"The Street and the City IV - Moments","series":"","short":"","website":"https://thestreetandthecitylx4.wordpress.com","content":"Cities come alive and build themselves from moments. Moments we breathe in the present, moments that shape both collective and individual memories. All these memories drift from a solitary pace in a crowd, to a dialogue between us and the other united by the urb. As in Dickens’s words (1859) “a multitude of people and yet a solitude.” This conference aims at approaching topics from the past, both nearby or further away; topics from the present, globally, locally or glocally relevant and topics from the future – real or imaginary. Munford (1961) states that “the origins of the city are obscure, a large part of its past buried or effaced beyond recovery, and its further prospects are difficult to weigh.” We propose the analysis of moments of political and social unrest, which affect the everyday city life emptying the streets and making the ordinary socializing scenarios something of the past, as well as projects that look for answers and mitigation actions that can soothe such scenarios. A reflection is intended on the phenomena that approach the city and challenge the creation of new connection methods between its residents and the ones that arrive there – either for leisure, work, war or natural catastrophes. The city life, in its renewing dynamics, invites us to the redefining of space, mobilizing the emerging creativity and the memory of past moments capable of reshaping identity continuities. We welcome papers, pre-organised panels, and roundtables (20 minutes per speaker) in English or Portuguese responding to the above. Suggested (merely indicative) topics include: 1\\. Architectural Moments in the Streets and the Cities 2\\. Moments in Film Studies in the Streets and the Cities 3\\. Literary Moments in the Streets and the Cities 4\\. Political Moments in the Streets and the Cities 5\\. Diaspora Moments in the Streets and the Cities 6\\. Technological Moments in the Streets and the Cities 7\\. Touristic Moments in the Streets and the Cities 8\\. Visual Moments in the Streets and the Cities 9\\. Sonorous Moments in the Streets and the Cities 10\\. Moments of the Streets and the Cities at risk. As indicated by the number in its title, this conference is the fourth in a series of academic events based at CEAUL/ULICES Submissions should be sent by email to: thestreetandthecity@gmail.com by April 30th. Please include SC4 in the subject line of your email and organise your proposal into two separate files: • a file containing the full title and a 250-300 word description of your individual paper; Round tables of up to four speakers plus a chairperson. Please include a brief description of the panel (150 words) and a 300-word abstract.; Panels of three speakers plus a chairperson. Please include a brief description of the panel (150 words) and a 300-word abstract. • a file containing the author’s data: name, affiliation, contact address, paper title and author’s bio-note (100 words). Please name these two documents as follows: Surname\\_Name\\_Abstract\\_SC4 Surname\\_Name\\_AuthorInfo\\_SC4 All delegates are responsible for their own travel arrangements and accommodation. More information available at https://thestreetandthecitylx4.wordpress.com/","date_start":"2022-09-07","date_end":"2022-09-09","important_dates":{"abstract":"","full":"2022-04-30","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","Education, teaching"],"location":{"virtual":"","full":["Lisbon","Portugal"],"name":"","street":"","city":"Lisbon","state":"","ZIP":"","country":"Portugal"},"organizers":["University of Lisbon Centre for English Studies"],"societies":[],"indexes":[],"emails":["thestreetandthecity@gmail.com"]}