{"name":"RISC2019, INTERNATIONAL CONFERENCE FOR SCHOOL AT ROME ITALY","series":"","short":"","website":"https://go.evvnt.com/385382-4?pid=4868","content":"RISC consider academic excellence as our strategic pillar embraced by the principles of European education system to deliver quality education. All our speakers act as mentors who will support the students and teachers to identify values of education and maps out their educational journey through knowledge and values which helps for a successful lives and living generations.It is meant for the students, teachers, principal, managers, property owners. The website is www.romeisc.com. Rome International School Conference 2019 is organizing an International Exhibition for Schools along with the RISC 2019.The exhibition focuses on bringing learning opportunity of science to students attending the conference from different countries. RISC Science Exhibition will emerge as a unique platform for students to celebrate the achievements in the field of science and technology for the development of the mankind. Students/Schools participating and Non Participating in the RISC 2019 can participate through direct registration.Schools need to register through a common portal of RISC 2019 Science Exhibition.Registration is based on the following categories.Winning Schools will receive trophy along with the prize money and students will receive individual certificates along with the prize money. All the Participants will receive a participation certificate of the science exhibition. \\* € 2500 for Non Participating Schools in RISC 2019 \\* € 1000 Euro for Participating Schools in RISC 2019 \\* 6 students should be included in a Group from a school. \\* Minimum participation of 10 schools is mandatory Participating schools will receive an automatic response mail upon submission of abstract at the time of registration. However, if you submit your abstract through email (abstract@romeisc.com), school will receive an email from the abstracts team.Abstracts are expected to be in the line with the identified themes. Registration Dates Starts : 10 March 2019 Closes : 10 May 2019 URLs: Tickets: https://go.evvnt.com/385382-0?pid=4868 Price: STUDENTS, TEACHERS,MANAGER/PROPERTY OWNERS: EUR 400.0 Speakers: Eduardo Jauregui Eduardo Jauregui is a psychologist with a doctoral thesis on the topic of laughter and humor. He teaches positive psychology, among other courses, at Saint Louis University (Madrid Campus), and participates regularly in masters degrees of the Universidad de Alcalá de Henares and the Universidad Jaume I. A few years ago Eduardo co-founded Serious Fun (Humor Positivo in Spanish), a training consultancy specialized in the applications of humor, fun and play in the workplace, working with clients such as IKEA, General Motors and Oracle. He also collaborates with the innovation and enterpreneurship schools Hyper Island and Teamlabs., Anne Wingenter profile img EDUCATION Ph.D. History, Loyola University Chicago, IL Major Field of Study: Modern European History M.A. History, |Indiana University, Bloomington, IN Minor: West European Politics B.S. International Studies, Spring Hill College, Mobile, AL TEACHING AND RESEARCH INTERESTS Teaching interests include: Modern and Contemporary Europe, War and Society, Western Civilization, History of Travel. Areas of research specialization include: Comparative Fascist Movements, WWI and WWII, Modern and Contemporary Italy, Women’s and Gender History, Cold War Politics and Policy., Jorge Lopez Doctor in Sport and Exercise Science from the University of Castilla-La Mancha in 2018, Jorge is working as a researcher for IGOID Research Group (Spain) since 2012 and for Coventry University (UK) since 2016\\. Over the past five years, he has participated in more than 15 national and international R&D, written more than 10 research papers and contributed to more than 20 international congresses about sport, exercise and health. In teenagers, his main contribution to science is focussed on the influence of sports surfaces in youth health and the use of different training drills to increase the performance of teenagers while playing football., Pedro Diaz Ridao profile img Pedro Díaz Ridao is a leadership and management author with a rich background in helping organizations in a wide range of industries (from sports teams to banking corporations) maximize their talent and reach high performance. He has trained hundreds of CEOs, managers and entrepreneurs from +50 countries and in six continents to become better leaders, always incorporating innovative training methodologies. Pedro participates as a public speaker in numerous discussions on how to better manage and lead teams and he writes about management, education, leadership and entrepreneurship in his bilingual blog SPARK, which has +200,000 readers in +100 countries: (http://www.pedrodiazridao.com/).In 2010, Pedro received the Youth Social Entrepreneurs Award for his work fighting homelessness in Spain through the practice of sport. He has also founded several initiatives to help athletes in their transition into a new career after sports., Alison Borthwick profile img Experienced trainer with a demonstrated history of working in the education industry. Skilled in Curriculum Development, Teacher Training, Staff Development, Educational Leadership, and Leadership Development. Strong education professional with a Doctor of Philosophy (Ph.D.) focused in Mathematics Education. Alison is currently the strategic mathematics adviser for a group of schools in the UK and a part time freelance mathematics consultant. She has worked extensively in many schools and countries with teachers (of all phases), teacher educators and researchers. She is the current chair of the Primary ATM and MA group and a member of the Primary Contact Group for the Advisory Committee on Mathematics Education (Royal Society).she is also a member of the KS2 Expert Panel with the Standards and Teaching Agency, the Early Childhood Mathematics Group, the British Society for Research into the Learning of Mathematics and a Governor of a local Infant school. , Anthony Smith profile img Anthony is a rare combination of a manager, engaging communicator and athlete, who boasts a wealth of experience as a senior manager in two multi-national companies, as a motivational speaker and a long career in track and field and American football. Anthony is presently a business and personal coach for entrepreneurs and executives across different industrial and commercial sectors. In addition, given that well-rounded professional soccer and coaches are great communicators and managers, he also serves as a mental and personal coach for soccer coaches in the top Italian football divisions, To round out his skill set and professional activities, Anthony is a highly sought-after speaker for management and sales teams, providing them a source of practical motivation and inspiration., Kam Chohan An enthusiastic, effective and successful professional, experience of managing training and professional development . A proven track record of leading both internal and external learning and development for a range of organisations, managing measurable improvements for staff, customers and external stakeholders. A member of the Senior Leadership Team at ECIS, serving as Chief Operating Officer, Kam has lectured in maths and business studies, and she has led on teaching through innovation. She worked with the UK Governments Behaviour Insights Team to apply the ‘Nudge Theory’ to improve student outcomes. Kam also joined the government team at an ACER conference to share the theory and findings. She is committed to empowerment through education. In addition to her teaching qualifications, Kam has recently completed a further bachelor’s degree in Leadership and Professional Development. Kam has 20 years of business experience. Time: 8:00 am to 5:00 pm Venue Details: Barcelo Aran Mantegna, Via Andrea Mantegna, 130, Roma, 00147, Italy","date_start":"2019-05-27","date_end":"2019-05-28","important_dates":{"abstract":"","full":"2019-05-26","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education, teaching"],"location":{"virtual":"","full":["Roma","Italy"],"name":"","street":"","city":"Roma","state":"","ZIP":"","country":"Italy"},"organizers":["ASSOCIATION OF INTERNATIONAL SCHOOLS IN EUROPE"],"societies":[],"indexes":[],"emails":["abstract@romeisc.com"]}