{"name":"How IFRS Will Change SOX Controls","series":"","short":"","website":"https://bit.ly/2YV20hP","content":"When International Financial Reporting Standards (IFRS) come into effect, public company executives will be personally responsible for their company’s financial statements on a consolidated basis and for the effectiveness of their internal controls. Public companies will have to overhaul their Sarbanes-Oxley controls to ensure that all the new processes are effectively controlled. Accountants will have to have company executives and auditors approve these new controls. Why Should You Attend This session will help you make sure your company remains compliant with SOX. You will become acquainted with the latest information regarding IFRS and will include examples of designing and implementing controls for IFRS processes. Objectives of the Presentation If you are an accounting professional you need to become familiar with exactly what these new standards consist of, and what these changes mean for companies. Areas Covered in the Session » Brief IFRS overview » Applying the four key principles of IFRS » How disclosure requirements will change » The new rules for assigning values to assets » How recording revenue will change » How IFRS will affect SOX compliance Who Will Benefit » CEO/CFO » Board members » External auditors » Compliance professionals » Operational professionals » Finance professionals » Internal auditors » Accountants » Accounting and Reporting, Finance and Treasury Managers » Company Executives » Anyone involved in the IFRS or SOX compliance process To Register (or) for more details please click on this below link: https://bit.ly/2YV20hP Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-02-26","date_end":"","important_dates":{"abstract":"","full":"2021-02-26","notification":"","final":""},"topics":["Business","Finance"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}