{"name":"Being Prepared for an Active Shooter Incident at Workplace","series":"","short":"","website":"https://www.complianceonline.com/preparing-for-a-workplace-active-shooter-incident-general-duty-clause-of-osh-act-webinar-training-704652-prdw?channel=Brownwalker","content":"This training program will take attendees through the actions to take when confronted with an active shooter and in assisting responding law enforcement officials. It will help recognize potential workplace violence indicators and describe actions to take to prevent and explore the General Duty Clause of the OSH Act. Why Should You Attend: This webinar will analyze why there is an increase of aggression in the workplace incidents in the United States and how to prepare your workforce for such an emergency response situation. An active shooter is an individual actively Learning Objectives: Describe the actions to take when confronted with an active shooter and in assisting responding law enforcement officials Recognize potential workplace violence indicators Describe actions to take to prevent and prepare for potential active shooter incidents Describe how to manage the consequences of an active shooter incident Areas Covered in the Webinar: General Duty Clause of the OSH Act Profile of an active shooter How to effectively and safely respond to an active shooter or other workplace violence situation Training for an active shooter situation and creating an emergency action plan Tools and tips for recognizing signs of an aggressive worker who has the potential of workplace violence Who Will Benefit: Attorneys Plant Managers Plant Foremen Safety Committee Members Engineers Operations Managers Construction Foreman Occupational Safety Consultants","date_start":"2022-06-10","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}