{"name":"LEAP HR: Higher Education","series":"","short":"","website":"https://go.evvnt.com/365809-2?pid=4868","content":"Explore the Real Stories of How Non-traditional Leaders Are Iterating and Innovating to Transform HR Value, Navigate Change and Drive Competitive Advantage. LEAP HR: Higher Education will explore what the future of HR in higher education will look like and enable you to walk away with the practical strategies you need to totally revolutionize your HR impact, and truly move your institution forward. LEAP's unique format combines presentations delivered by true disrupters coupled with the chance to engage in meaningful discussions in interactive round table sessions. This means that you'll have the opportunity to take part in a truly collaborative discussion around how HR can challenge the status quo in higher education. This is a high-energy, high-impact, fully-immersive experience. It's the place for ambitious, non-traditional people leaders to engage in a disruptive dialogue around how to deal with the implications of working in a rapidly evolving, but change-resistant, consensus-driven industry. 30+ world-class speakers - including Mary George Opperman, CHRO at Cornell, Casey Cooke, AVP HR at The University of Chicago, Felicia Washington, Vice Chancellor - Workforce, Strategy, Equity and Engagement at The University of North Carolina - Chapel Hill, and many more - will ensure everyone who takes part leaves with actionable outputs which will make this among the most valuable few days they spend all year. Take a look at the full event guide and be aware that you can save up to 50% from onsite registration prices if you sign up with our Early Bird packages. URLs: Tickets: https://go.evvnt.com/365809-0?pid=4868 Brochure: https://go.evvnt.com/365809-3?pid=4868 Time: 09:00 to 17:00 Venue details: Hilton Austin, 500 East 4th Street, Austin, 78701, United States Prices: Conference + 2 Deep Dives: USD 1697.0, Conference + 1 Deep Dives: USD 1498.0, Conference Only: USD 1399.0, Deep Dive Only: USD 399.0 Speakers: Mary George Opperman - Cornell University, Michelle Piekutowski - Carnegie Mellon University, Felicia Washington - The University of North Carolina at Chapel Hill, Casey Cook - The University of Chicago, John Poma - The College of William and Marry, Ruth Spencer - Vassar College, David Turner - Eastern Michigan University, Janis McEldowney - The University of Southern California, Donna Bonaparte - Babson College, Kimberly Gholston - Drexel University, Whitney Bandemer - Manchester University, Sharon Butler - Michigan State University, Richard Huntley - The University of Dallas, Cheryl Gochis - Baylor University, Jennifer Boyd - Barry University, Dr Brian Dickens - Ithaca College, Carolyn Brownawell - University of Colorado, Jane Moyer - Northeastern University, Colleen Dutton - University of Texas, Patricia Feldman - Arizona State University, Jaffus Hardrick - Florida Memorial University, Beverly Pruitt - University of Miami, Ann Bresingham - Robert Morris University, Bob Buer - Washington University in St. Louis, Linda Croll-Howell - Cornell University , Michael Latsko - The University of Virginia, Guy Bell - Concorde Colleges, Trey Wright - Kaye/Bassman International, K. Anja Wynne, Ph.D. - University of Colorado","date_start":"2019-05-29","date_end":"2019-05-30","important_dates":{"abstract":"","full":"2019-05-28","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Austin","United States"],"name":"","street":"","city":"Austin","state":"","ZIP":"","country":"United States"},"organizers":["Hanson Wade"],"societies":[],"indexes":[],"emails":[]}