{"name":"International Conference on Childhood Studies","series":"","short":"","website":"https://childrens-studies.lcir.co.uk","content":"Childhood is a crucial stage in the formation of personality, value orientations, self-image and ideas about the world. However, the subject of childhood has become the target of research relatively recently. A wide range of problems and an interdisciplinary approach to this phenomenon have extended the boundaries of the academic and professional research interests. Nowadays, the study of children and childhood is an integral part of the humanities and social sciences. We invite psychologists, educators, sociologists, anthropologists, cultural and literary scholars, historians, art experts, lawyers, linguists and specialists in other fields to participate in the conference. Papers are invited on topics related, but not limited, to: Childhood Psychology Anthropology of Children and Childhood Sociology of Children and Childhood Children and Childhood in Art and Culture Children and Childhood in the System of Law Ethics and Methodology of Child-Centered Studies Contemporary Children’s Culture Children’s Literature. Literature about Children and Childhood Children and Human Rights Historical Research about Children and Childhood Early Childhood Education Children and Media. Children’s Media. Media about Children and Childhood Children's Play Children in the System of Formal and Non-Formal Education Children and Parenthood Paper proposals up to 250 words and a brief biographical note should be sent to: childrens-studies@lcir.co.uk. Please download the aper proposal form on our website: https://childrens-studies.lcir.co.uk.","date_start":"2022-03-05","date_end":"2022-03-06","important_dates":{"abstract":"","full":"2022-01-15","notification":"","final":""},"topics":["Social Sciences","Sociology","Humanities"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["childrens-studies@lcir.co.uk"]}