{"name":"Design, Development and Scale-Up of Safe Chemical Processes and Operations","series":"","short":"","website":"https://go.evvnt.com/577197-4?pid=4868","content":"A 5 day virtual course with DEKRA Process Safety Developing safe processes is of paramount importance to any chemical company. Exothermic chemical reactions in batch and semi- batch processes can result in serious injury to people and plant if they get out of control. Results of thermal runaways include violent loss of containment, possibly explosion and the release of flammable or toxic materials to the environment. Employers are bound by Health & Safety legislation to ensure the safety of their employees and those outside their employment who might be affected by their activities. Chemical manufacturers must therefore be aware of all potential dangers in their processes and take steps to eliminate them. The best approach is to design safety into the process from the start. Often, the first sign of loss of control over a reaction is a reduction in yield or in the quality of the product. Thus safety, quality and profitability are all interlinked. The third day of the course focuses on plant protection and safety systems designed to prevent or protect against runaway reaction scenarios. This includes extensive discussion and workshops on process control strategies and emergency relief system design for two-phase relief using DIERS methodology. The course makes extensive use of case studies to help embed principles and key learning points such that attendees leave with tools they can immediately deploy. This seminar is designed to enhance the awareness of chemists and engineers regarding hazard issues. Utilising the expertise of the chemists and chemical engineers at DEKRA and Scientific Update, it will consider hazard control of new chemical processes throughout their development cycle: from early development through to full-scale production. Hazards can often be eliminated by appropriate choice of reagent or synthetic route at the R&D stage. Where this is not possible, techniques exist to quantify the hazards so that robust engineering solutions can he applied in production. URLs: Tickets: https://go.evvnt.com/577197-0?pid=4868 Brochure: https://go.evvnt.com/577197-3?pid=4868 Price: General Admission: GBP 499.0 Speakers: Dr Stephen Rowe, Dr Keith Middle, Dr Will Watson Time: 9:00 am to 5:00 pm","date_start":"2020-06-01","date_end":"2020-06-05","important_dates":{"abstract":"","full":"2020-05-31","notification":"","final":""},"topics":["Medicine & Health","Medical-Speciality","Education, teaching"],"location":{"virtual":"","full":["Online","United Kingdom"],"name":"","street":"","city":"Online","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Scientific Update Ltd"],"societies":[],"indexes":[],"emails":[]}