{"name":"Visualizing Excel Data with SmartArt and Charts","series":"","short":"","website":"https://bit.ly/366ZzMB","content":"Use a SmartArt graphic if you want to do any of the following: » Create an organization chart or Excel sparkline charts » Show hierarchy, such as a decision tree » Illustrate steps or stages in a process or workflow » Show the flow of a process, procedure, or other event » List information Use a chart if you want to do any of the following: » Create a bar chart or column chart » Create a line or XY scatter (data point) chart » Create a stock chart, used to graph various stock prices » Create a surface, donut, bubble, or radar chart » Create a combination chart, such as a bar and line chart Why Should You Attend They say that ‘a picture is worth a thousand words’. Using SmartArt and Charts to visually display complex Excel data helps in communicating the data’s message much more effectively to your target audience. SmartArt graphics and Charts can be created not just in Excel, but also in PowerPoint, Word and Outlook. This makes learning these tools extremely useful. In addition, you’ll get tips and tricks along the way to help you save time and make your job of data visualization with advanced Excel easier and more efficient. Objectives of the Presentation A Smart Art graphic is a visual representation of information and ideas, and a Chart is a visual illustration of numeric values or data. Basically, SmartArt graphics are designed for text, and charts are designed for numbers. In this advanced Excel training you will learn how to create a SmartArt graphic and charts. Areas Covered in the Session Creating SmartArt Diagrams » Inserting diagrams » Modifying illustrations » Formatting shapes and SmartArt » Convert bulleted text into SmartArt Creating Charts » Types of charts » Creating a chart » Parts of a chart » Changing the chart type » Switching data » Changing the chart style » Moving a chart to a chart sheet » Creating a combination chart Who Will Benefit » Administrative assistants » Managers » Directors » Sales associates » Students » Teachers » Marketing personnel » Medical personnel » Legal professionals Anyone using MS Office in a business or educational setting to create reports and presentations To Register (or) for more details please click on this below link: https://bit.ly/366ZzMB Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2020-12-17","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Accounting"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["AbideEdict"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}