{"name":"Lucerne Master Class 2021 with Marion Fourcade","series":"","short":"","website":"www.unilu.ch/LMC2021","content":"Lucerne Master Classes offer doctoral students from Switzerland and from abroad an intensive exchange with internationally renowned researchers. Selected doctoral students will receive the opportunity to present their work to the other participants and to discuss it with the guest expert. The Scholar Marion Fourcade is a Professor of Sociology and Director of Social Science Matrix at UC Berkeley. She grew up and studied in France, received her Ph.D. from Harvard University (2000), and taught at New York University and Princeton University before joining the Berkeley sociology department in 2003\\. Fourcade is also an Associate Fellow of the Max Planck-Sciences Po Center on Coping with Instability in Market Societies. A comparative sociologist by training and taste, she is interested in variations in economic and political knowledge and practice across nations. Her first book, Economists and Societies (2009), explored the distinctive character of the discipline and profession of economics in three countries. With Kieran Healy, she is working on a second book –titled The Ordinal Society– that investigates new forms of social stratification and morality in the digital economy. The Topic The deployment of algorithms –computer code paired with massive datasets– has reshaped the basic rules of social life: how people communicate, exchange and associate; how they relate to each other, themselves and the world around them, down to the most ordinary and intimate aspects; how institutions, both public and private, think about and pursue their social mission and economic purpose; and how they sort and slot populations and individuals accordingly. This Lucerne Master Class will analyze the political economy of digital capitalism, paying attention to continuities and ruptures with antecedent forms of capital accumulation. It will revisit classical questions of social scientific theory –including the search for economic profit, the production of social formations and inequalities, and the nature of politics and government– in light of specific implementations of digital technologies across a range of domains and geographical settings.","date_start":"2021-04-26","date_end":"2021-04-30","important_dates":{"abstract":"","full":"2020-12-01","notification":"","final":""},"topics":["Social Sciences","Sociology","Sociology, Social Sciences"],"location":{"virtual":"","full":["Lucerne","Switzerland"],"name":"","street":"","city":"Lucerne","state":"","ZIP":"","country":"Switzerland"},"organizers":["Graduate School of Humanities and Social Sciences of the University of Lucerne"],"societies":[],"indexes":[],"emails":[]}