{"name":"International Scientific Conference - Theory to Practice as a Cognitive, Educational and Social Challenge","series":"","short":"","website":"https://t2p-conference.org","content":"International Business College Mitrovica (IBC-M), together with 11 partners under the ERASMUS+ Capacity Building Program, supported by the European Union, cordially invite you to submit a paper to the upcoming 2020 second Scientific International Conference on Theory to Practice as a Cognitive, Educational and Social Challenge. The aim of this conference is to bring together the scholars from different academic fields to find out whether the scientific and social reasons can lead to interdisciplinary approaches. Is cooperation between different academic areas achievable? What could pedagogues and engineers, bio-scientists and philosophers, agronomists, economists and mechanical engineers, natural scientists and writers -and so on- have in common? On behalf of the Organizing Committee, you are kindly invited to attend this event, which will be held on June 15th – 16th, 2020 in the IBC-M campus in Mitrovica, Kosovo. The official language of the conference will be English. We would appreciate if on June 15th, 2020 you can present your paper on your current research and projects , on one of the following topics: 1\\. Educational theory and practice 2\\. Science and research 3\\. Social practice and development 4\\. Human resource management 5\\. Information and Strategy In addition, you are invited to submit abstract for presentation in two workshops, which will be held on June 16th, 2020: 1\\. Theoretical approaches to interdisciplinarity, 2\\. Social practice and development. Authors are asked to submit the title and abstract of up to 250 words by the deadline of March 31th, 2020\\. The abstract can be submitted through the conference website: https://t2p-conference.org/ or directly to the conference e-mail: conference@t2p-conference.org. Authors will be informed by April 15th, 2020 if their submitted abstract has been accepted. Full papers limited to 10 pages should be submitted by May 31st, 2020\\. All papers will be published in the proceedings book. The best papers selected by the organizers after peer review will also be recommended for the potential publication in conference supported scientific journals.","date_start":"2020-06-15","date_end":"2020-06-16","important_dates":{"abstract":"","full":"2020-03-31","notification":"","final":""},"topics":["Education / Legal / Other","Education","Information technology systems (IT)"],"location":{"virtual":"","full":["Mitrovica","Kosovo"],"name":"","street":"","city":"Mitrovica","state":"","ZIP":"","country":"Kosovo"},"organizers":["European Union"],"societies":[],"indexes":[],"emails":["conference@t2p-conference.org"]}