{"name":"Strategic Accounts Receivable Management","series":"","short":"","website":"https://bit.ly/3FEEbym","content":"Historically, AR Management has been a backroom function focused on minimizing bad debt expense and browbeating customers into paying on time. Incremental revenue from existing and new customers, market segments, and geographies is often constrained by over-cautious bad debt risk avoidance and old-line thinking. I call this Transactional AR Management. However, your AR Management approach can be Strategic vs Transactional, designed to: a. Drive revenue and margin growth b. Provide an excellent customer experience c. Operate at ultra-efficiency d. Manage bad debt risk and cash flow properly In today’s competitive markets, can any customer-facing department in your firm afford NOT to be Strategic with a laser focus on: a. the customer and b. driving revenue and margin? Why Should You Attend Strategic AR Management is today’s AR Management with its focus on the customer experience and driving revenue. Other benefits such as lower operating cost, shorter cycle times, and improved cash flow are also realized. This is accomplished by the following actions/programs: » Define, agree and articulate a Corporate AR Strategy that is harmonized with the firm’s Go-To-Market Strategy » Review risk vs revenue models especially with new markets & customers » Establish better control over net pricing (vs unauthorized discounts) » Increase productivity by 50 – 70% and improve response times via leading technologies such as robotic automation, machine learning, artificial intelligence, and e-commerce (digital vs paper, high use of portals 24/7). » Ensure Order Processing’s customer facing elements are a major beneficiary of increased automation. » Ensure foundation Order to Cash transactional processes are Best Practice. Objectives of the Presentation » The benefits your firm is missing by settling for Transactional vs Strategic management of AR. » The principles of implementing Strategic Management of AR Areas Covered in the Session » Definition of Strategic AR Management » Providing Exceptional Customer Experience » Driving Revenue Growth » Increasing Margins » Achieving Ultra-efficiency » Increasing Cash Flow Who Will Benefit » CFO’s » Controller » Treasurers » Customer Financial Services Managers » Credit Managers To Register (or) for more details please click on this below link: [https://bit.ly/3FEEbym Email: support@concordeducations.com Tel: +1-989-341-8773](https://bit.ly/3FEEbym)","date_start":"2022-01-12","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Finance","Banking finance fintech and regulations financial"],"location":{"virtual":"","full":["New Castle","United States"],"name":"","street":"","city":"New Castle","state":"","ZIP":"","country":"United States"},"organizers":["ConcordEducations"],"societies":[],"indexes":[],"emails":["support@concordeducations.com"]}