{"name":"Effective Technical Writing in the Life Sciences","series":"","short":"","website":"https://www.complianceonline.com/technical-writing-life-sciences-seminar-training-80647SEM-prdsm?channel=brownwalker","content":"This virtual seminar will begin with a general discussion of technical writing and its role within the life sciences. Technical writers produce a variety of technical documents that are required to manage and direct regulated operations and to meet regulatory requirements. We will spend some time in this webinar discussing those document types, their importance, and the consequences of the messages are unclear or misunderstood. After setting the stage for this content, we delve into the writing process beginning with the audience and how the audience must be analyzed to determine the level of writing that must be employed to complete the document. Gathering the information to be included in the technical document requires collaboration between the writer and the various subject matter experts that possess the knowledge to be harvested. How that information is gathered can be an effective efficient process or an ineffective time-consuming endeavor all dependent upon the techniques employed to execute the activity. We will address the most effective techniques for extracting information from SMEs as well as those techniques that work best when observing procedures and activities to be documented. We will end this webinar with the mechanics of technical writing ranging from planning and organizing the content through grammar, spelling and punctuation ending with writing simplification.","date_start":"2020-09-10","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Life Sciences","Other","Life Sciences (nature)"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}