{"name":"Medical Device Single Audit Program [MDSAP] Implementation & Participating Country","series":"","short":"","website":"https://www.complianceonline.com/medical-device-single-audit-program-mdsap-implementation-regulatory-processes-us-canada-brazil-australia-japan-seminar-training-80493SEM-prdsm?channel=Brownwalker","content":"Global Medical Device Regulations continue to evolve, as devices become more diverse and sophisticated. Understanding the regulations and requirements in your targeted markets will expedite speed-to-market of innovative products and assist patients needing access to life-saving products and technologies. Government Regulatory Authorities, needing to become more efficient with their time, are looking for ways to better use their internal resources without compromising safety in products, which become marketable. One such example is the Medical Device Single Audit Program \\[MDSAP\\], where Authorized Organizations would be allowed to carry out a single GMP audit on medical device manufacturing facilities and have it stand to support registrations across the current participating member countries: U.S. Canada, Brazil, Australia and Japan. Health Canada has now made the MDSAP process mandatory for all licensed products in Canada. Why Should You Attend: This 6 hrs. webinar is focused on understanding the Medical Device Single Audit Program, the scope of the program, how to apply, the Authorized Organizations, the rating system developed and what you can expect when signing onto the program. The webinar will discuss how such audits are organized, what to expect during a MDSAP audit, how does this differ from a typical certified body audit, along with document movement and timeline expectations in receiving the facility’s certificate. Highlights of the key Regulatory Requirements for Medical Devices will also be covered for the participating MDSAP Countries of: U.S., Canada, Brazil, Australia and Japan. Learning Objectives: The Medical Device Single Audit Program (MDSAP) Device Classification Licensing Pathways Medical Device GMP Inspections Device Labeling License Holder Responsibilities Timelines and Fees Country Specific Cultural Considerations and Challenges Adverse Event Reporting Who Will Benefit: This 6 Hrs. webinar will provide invaluable assistance to all personnel in the Medical Device industry, who have a stake in expanding their business into a MDSAP participating country and for those interested in more information about MDSAP and how it may apply to them. This webinar will be particularly useful for those involved in research and development, document creation for regulatory submission, data handling and for those conducting/monitoring/coordinating clinical investigation, performing risk management and post-market vigilance/surveillance. This seminar is a must for those who are looking to apply for a medical device registration and product license in a MDSAP country. Regulatory Affairs Quality assurance, quality control, and quality systems Product development personnel Contract research organizations Business management Site managers Senior and executive management Contractors and subcontractors Distributors Consultants","date_start":"2021-05-26","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}