{"name":"International Journal of peer-to-peer networks (IJP2P)","series":"","short":"","website":"http://airccse.org/ijp2p/index.html","content":"International Journal of peer-to-peer networks (IJP2P) ISSN: 2229 - 3930 \\[Online\\]; 2229 - 5240 \\[Print\\] https://airccse.org/ijp2p/index.html Scope & Topics The International Journal of peer-to-peer networking is a quarterly open access peer-reviewed journal that publishes articles that contribute new results in all areas of P2P Networks. The journal provides a platform to disseminate new ideas and new research, advance theories, and propagate best practices in the area of P2P networking. This will include works that relate to peer-to-peer systems, peer-to-peer applications, grid systems, large-scale distributed systems, and overlay networks. The journal offers a forum in which academics, consultants, and practitioners in a variety of fields can exchange ideas to further research and improve practices in all areas of P2P. Authors are solicited to contribute to the journal by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in the areas of P2P networks. Topics considered include but are not limited to: • Cooperation and collaboration in P2P systems • Delay-tolerant P2P systems • Higher-level query support in P2P systems • Mobile P2P • Overlay architectures and topologies • Overlay monitoring and management • P2P and wireless convergence • P2P applications and services • P2P economics • P2P grids • P2P information retrieval • P2P overlay interaction with underlying infrastructure • P2P systems over mobile networks • P2P technology and sensors • P2P workload characterization and simulation • Performance and robustness of P2P systems • Protocols and Algorithms for Mobile and Wireless Peer-to-peer Networks • Security in P2P systems • Self-organization in P2P systems • Semantic overlay networks and semantic query routing in P2P systems • Social networks • Trust, Reputation and Fairness in P2P Systems • ad hoc and sensor networks Paper Submission Authors are invited to submit papers for this journal through Email: check web page or through Submission System. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this Journal. Important Dates • Submission Deadline : October 09, 2021 • Notification : November 09, 2021 • Final Manuscript Due : November 17,2021 • Publication Date : Determined by the Editor-in-Chief Contact Us Here's where you can reach us : ijp2p@yahoo.com or ijp2p@aircconline.com Submission URL : http://coneco2009.com/submissions/imagination/home.html","date_start":"2021-12-30","date_end":"2021-12-31","important_dates":{"abstract":"","full":"2021-10-09","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Communication Networks"],"location":{"virtual":"","full":["Australia"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":["IJP2P"],"societies":[],"indexes":[],"emails":["ijp2p@yahoo.com","ijp2p@aircconline.com"]}