{"name":"ESOC The Voice of Stroke 2022, 4 - 6 May 2022, Palais des congres de Lyon.","series":"","short":"","website":"https://go.evvnt.com/1021218-2?pid=4868","content":"ESOC conferences are notable for the excellent scientific program that includes presentations of major clinical trials, state-of-the-art presentations by renowned clinicians and researchers, and updates on the latest guidelines. The upcoming ESOC 2022 will continue that tradition, with a range of different educational and scientific sessions that will address all your learning needs as a professional in the stroke field. You will come together to learn about the latest trial results, new technologies, hear innovative ideas, and begin to understand how our future is being shaped by them. Join us for 3 fabulous days of insight and inspiration with your friends and colleagues. Attending in person will provide you with the opportunity to meet and discuss with the leading practitioners in the world from the field of stroke. You can expect to find debates on patient selection for thrombectomy in the 1st few hours after stroke and the need for advanced imaging, and on stroke prevention and how best to use information from MRI. Additionally, amongst the Teaching Courses, there will be discussions on optimal approaches to the use of intravenous thrombolysis, in delivery of secondary stroke prevention, and on the management of intracerebral hemorrhage. You will find excellent sessions on the design of clinical trials and the inclusion of the use of AI. These are just a few of the topics that will be covered and discussed in person. URLs: Tickets: https://go.evvnt.com/1021218-0?pid=4868 Twitter: https://go.evvnt.com/1021218-3?pid=4868 Facebook: https://go.evvnt.com/1021218-4?pid=4868 Prices: Early Bird Non Member : EUR 650.00, ESO Member Early Bird: EUR 520.00, Trainee (Students/Fellows/Nurses), AHPs and Junior Researchers, Early Bird: EUR 230.00, ESO Member from Low and Lower-Middle Economy Countries Early Bird: EUR 210.00, Non-Member from Low and Lower-Middle Economy Countries Early Bird: EUR 310.00, Trainee (Students/Fellows/Nurses), AHPs and Junior Researchers from Low and Lower-Middle Economy Countrie: EUR 100.00, Stroke Support Organization (SSO) Early Bird: EUR 50.00, Teaching Course / Session Early Bird: EUR 25.00 Date and Time: 4th May 2022 at 8:30 am to 6th May 2022 at 7:00 pm Venue details: Lyon Convention Center, 50 Quai Charles de Gaulle, Lyon, Auvergne-Rhône-Alpes, 69006, France","date_start":"2022-05-04","date_end":"2022-05-06","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Lyon","France"],"name":"","street":"","city":"Lyon","state":"","ZIP":"","country":"France"},"organizers":["Congrex"],"societies":[],"indexes":[],"emails":[]}