{"name":"The BAD (Behaviour & Design) Conference","series":"","short":"","website":"www.thebadconference.com","content":"Thursday 20th June, 2019\\. 08:00 – 18:00\\. The Greenwood Theatre, 55 Weston Street, London, SE1 3RA. The Behaviour & Design (BAD) Conference is the only event of its kind dedicated to the study of User Psychology in UX/UI. Join us for a full day of psychology-focused design talks. A one-track, one-day conference; BAD is dedicated entirely to understanding the cognitive drivers which make humans tick. With a strong emphasis on behavioural science, we’re set to bring 450 UX specialists to the quirky Greenwood Theatre in London. We shall discuss how, when designing experiences, investing in understanding the psychology of your user is paramount. We will have a roster of PhD-holding speakers, ranging from global brands to some of the most prestigious university lecturers and pioneers of psychology-driven design. We will be showcasing the behavioural designs and methodologies implemented to develop the type of products that we use every day from the likes of Google, Facebook & Youtube. This conference is tailored for those working as Researches and Designers within user experience teams. No matter the size, if you are interested in understanding how to implement psychology into your user research and design, we want to see you along. It’s as simple as that! Confirmed lineup so far includes: Dr. Ricardo Prada (UX Director, Google) Dr. David Travis (User Experience Strategist) Prof. Karen Cham (Professor, University of Brighton) Dr. Robert Youmans (UX Manager, Youtube) Lisa Ortega (Founder, Keep it Usable) Dr. Nick Fine (Lead User Researcher, Greater London Authority) Dr. Stephanie McNee (Research Lead, Facebook) And more to come! Check out www.thebadconference.com to find out more","date_start":"2019-06-20","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Social Sciences","Psychology"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Tech Circus"],"societies":[],"indexes":[],"emails":[]}