{"name":"11th International Conference on Knowledge Discovery and Information Retrieval KDIR 2019","series":"","short":"","website":"http://www.kdir.ic3k.org","content":"Knowledge Discovery is an interdisciplinary area focusing upon methodologies for identifying valid, novel, potentially useful and meaningful patterns from data, often based on underlying large data sets. A major aspect of Knowledge Discovery is data mining, i.e. applying data analysis and discovery algorithms that produce a particular enumeration of patterns (or models) over the data. Knowledge Discovery also includes the evaluation of patterns and identification of which add to knowledge. This has proven to be a promising approach for enhancing the intelligence of software systems and services. The ongoing rapid growth of online data due to the Internet and the widespread use of large databases have created an important need for knowledge discovery methodologies. The challenge of extracting knowledge from data draws upon research in a large number of disciplines including statistics, databases, pattern recognition, machine learning, data visualization, optimization, and high-performance computing, to deliver advanced business intelligence and web discovery solutions. Information retrieval (IR) is concerned with gathering relevant information from unstructured and semantically fuzzy data in texts and other media, searching for information within documents and for metadata about documents, as well as searching relational databases and the Web. Automation of information retrieval enables the reduction of what has been called \"information overload\". Information retrieval can be combined with knowledge discovery to create software tools that empower users of decision support systems to better understand and use the knowledge underlying large data sets. The primary focus of KDIR is to provide a major forum for the scientific and technical advancement of knowledge discovery and information retrieval \n Conference Topics: \n Area 1: KDIR - International Conference on Knowledge Discovery and Information Retrieval \n \\- BioInformatics & Pattern Discovery \n \\- Foundations of Knowledge Discovery in Databases \n \\- Information Extraction \n \\- Interactive and Online Data Mining \n \\- Machine Learning \n \\- Mining Multimedia Data \n \\- Mining Text and Semi-Structured Data \n \\- Pre-Processing and Post-Processing for Data Mining \n \\- Process Mining \n \\- Software Development \n \\- Structured Data Analysis and Statistical Methods \n \\- Business Intelligence Applications \n \\- User Profiling and Recommender Systems \n \\- Visual Data Mining and Data Visualization \n \\- Web Mining \n \\- Clustering and Classification Methods \n \\- Collaborative Filtering \n \\- Concept Mining \n \\- Context Discovery \n \\- Data Analytics \n \\- Data Mining in Electronic Commerce \n \\- Data Reduction and Quality Assessment ","date_start":"2019-09-17","date_end":"2019-09-19","important_dates":{"abstract":"","full":"2019-07-12","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Vienna","Austria"],"name":"","street":"","city":"Vienna","state":"","ZIP":"","country":"Austria"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":[]}