{"name":"Validation, Verification and Transfer of Analytical Methods (Understanding and implementing guidelines from FDA/EMA, USP and ICH)","series":"","short":"","website":"https://www.complianceonline.com/lab-analytical-compendial-method-ich-q2-glp-part11-annex11-qbd-seminar-training-80291SEM-prdsm?channel=Brownwalker","content":"Analytical methods used for GxP purposes should be validated to ensure the reliability, consistency and accuracy of analytical data. Compendial methods should be verified to demonstrate the suitability of laboratories to successfully run the method and when methods are transferred between laboratories successful transfer should be demonstrated through testing or a transfer waiver, if justified. If a laboratory uses an alternative method instead of a compendial method, equivalence or superiority of the alternative method should be demonstrated. Recent guidance on method validation and transfer has been produced by FDA and EMA, and USP has guidance chapters on method validation, verification and transfer, equivalence testing and statistical evaluation. Articles in US Pharmacopeial Forum have introduced the concepts of measurement uncertainty and lifecycle management for analytical procedures. Lifecycle management has also been the subject of recent FDA and ICH publications. This 2-day seminar will help attendees to understand regulatory requirements for method validation, verification and transfer. It will also suggest ways to de-risk the method validation process through prior evaluation of method performance and the use of effective protocols. Learning Objectives: Understand the regulatory requirements for validation of analytical methods Learn how to plan, execute and document development and validation of in-house methods Be able to explain the different requirements for validation, verification and transfer of analytical procedures Understand the principles of validation of in-house methods, verification of compendial methods and method transfer Know how to demonstrate equivalence to compendial methods Understand the important qualities of stability-indicating methods Be able to select test parameters, test conditions and acceptance criteria for different analytical measurements Know how to plan, justify and document revalidation after method changes Understand important indicators of the suitability of a method for routine QC use Understand approaches for the statistical evaluation of validation test results Understanding what questions will be asked during audits and inspections and how to answer them Who will Benefit: Quality assurance personnel Quality control and method development analysts Validation specialists Laboratory managers and supervisors Regulatory affairs personnel Consultants","date_start":"2021-03-25","date_end":"2021-03-26","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}