{"name":"New Perspectives in Science Education International Conference - 9th edition","series":"","short":"","website":"http://conference.pixel-online.net/NPSE","content":"The 9th edition of the New Perspectives in Science Education Conference will take place in Florence, Italy, on 19 - 20 March 2020\\. The objective of the Conference is to promote transnational cooperation and share good practice in the field of innovation for science education. The New Perspectives in Science Education Conference is also an excellent opportunity for the presentation of previous and current projects in the science field. The Call for Papers is addressed to teachers, researchers and experts in the field of science education as well as to coordinators of science and training projects. Experts in the field of science teaching and learning are therefore invited to submit an abstract of a paper to be presented during the conference. Important dates: • 13 January 2020: Last Extended Deadline for submitting abstracts • 17 January 2020: Notification of abstracts’ acceptance / rejection • 20 January 2020: Deadline for papers’ submission • 19-20 March 2020: Conference days There will be three presentation modalities: oral, poster and virtual presentations. All accepted papers will be included in the Conference Proceedings published by Filodiritto Editore with ISBN, ISSN, DOI and ISPN codes. This publication will be sent to be reviewed for inclusion in Conference Proceedings Citation Index by Thomson Reuters (ISI-Clarivate). The publication will also be included in Academia.edu and indexed in Google Scholar. For further information, please contact us at the following address: science@pixel-online.net or visit the New Perspectives in Science Education conference website: http://conference.pixel-online.net/NPSE","date_start":"2020-03-19","date_end":"2020-03-20","important_dates":{"abstract":"","full":"2020-01-13","notification":"","final":""},"topics":["Education / Legal / Other","Education","educational technology"],"location":{"virtual":"","full":["Firenze","Italy"],"name":"","street":"","city":"Firenze","state":"","ZIP":"","country":"Italy"},"organizers":["Pixel"],"societies":[],"indexes":[],"emails":["science@pixel-online.net"]}