{"name":"10th International Conference on Cloud Computing and Services Science - CLOSER 2020","series":"","short":"","website":"http://closer.scitevents.org","content":"The 10th International Conference on Cloud Computing and Services Science, CLOSER 2020, focuses on the highly important area of Cloud Computing, inspired by some latest advances that concern the infrastructure, operations, and available services through the global network. Further, the conference considers as essential the link to Services Science, acknowledging the service-orientation in most current IT-driven collaborations. The conference is nevertheless not about the union of these two (already broad) fields, but about Cloud Computing where we are also interested in how Services Science can provide theory, methods and techniques to design, analyze, manage, market and study various aspects of Cloud Computing. Emerging Enterprise Technologies are profoundly changing the way we think of IT - from economics and efficiency to process and usage models. Many organizations look to the \"externalized\" IT systems and services as a potential cost-savings advantage by moving internally hosted IT services to external providers. Other organizations view the \"external\" IT as potential disaster recovery systems or as on-demand capacity to boost business continuity and customer service levels. We need to take a closer look, discerning what emerging enterprise technologies are and how they can catalyze creativity and produce a competitive advantage. There is hence a new wave of interest in 'Externalization of IT' - anything as a service (including Software as a Service, Infrastructure as a Service, Platform as a Service), On Demand delivery, outsourcing, edge cloud and so on. This emerging facilitation and way of utilizing services through IT is what we are referring to as Cloud Computing. Conference Topics: Area 1: Services Science - Business Process Management and Web Services - Service Innovation - Service Lifecycle Management - Service-Oriented Architecture - Service Society - Service Management - Service Platforms - Business Services Realized by IT Services - Enterprise Architectures and Services - Industrial Applications of Services Science - Information and Service Economy - Internet of Services - Model-Driven Web Service Engineering - Semantic and Service Web - Microservices: Atomation Deployment and Management, Resource Allocation Elasticity, Service State and Resilience Area 2: Data as a Service - On-Line Transaction Processing (OLTP) Services - NOSQL Services: Store, Visualization, Processing - Time Series Services: Databases, Dashboards Area 3: Cloud Operations - Cloud Management Platforms - Cloud Reliability and Resilience - Cloud Automation - Hybrid Clouds and Their Integration Area 4: Edge Cloud and Fog Computing - Edge Cloud Orchestration - Cluster Management - Edge Cloud Network Management - Edge Cloud Data Management - IoT-Cloud Integration Area 5: Service Modelling and Analytics - Cloud Cost Analysis - Service Discovery - Service Modeling and Specification - Service Monitoring and Control - Services Security and Reliability - Service Ecosystems - Service Simulation - Service Performance Analytics - Analytics and Services Area 6: Mobile Cloud Computing - Mobile and Energy-Efficient Use of Clouds - Mobile and Wearable Computing Systems and Services - Mobile Cloud Architectures and Models - Mobile Cloud Networking - Mobile Commerce, Handheld Commerce and emarkets on Cloud Area 7: Cloud Computing Fundamentals - Cloud Application Portability - Privacy, Security and Trust - Federated Cloud - Web Services - Consistency and Consensus - Cloud Computing Architecture - Cloud Delivery Models - Cloud Deployment Models: Public/Private/Hybrid Cloud - Cloud Interoperability - Cloud Risk, Challenges and Governance - Cloud Standards - QoS for Applications on Clouds - Resource Management Area 8: Cloud Computing Platforms and Applications - Access Control - Development Methods for Cloud Applications - XaaS - Cloud Services - Mobile Cloud Computing Models, Infrastructures and Approaches - Cloud Data Centers, Storage and Networking Technologies - Mobile-Aware Cloud Data Management and Data Retrieval - High Performance Computing Cloud Applications ; Use Cases , Experiences with HPC Clouds - Hybrid Cloud Integration - Cloud Brokering - Cloud Workflow Management Systems - Cloud Solution Design Patterns - Native Cloud Applications - Cloud for Enterprise Business Transformation - Cloud Application Architectures - Cloud Application Scalability and Availability - Cloud Applications Performance and Monitoring - Cloud Economics - Cloud Middleware Frameworks - Engineering Mobile Clouds and Mobile-Based Systems - Social and Green Cloud Computing Area 9: Cloud Computing Enabling Technology - API Management - Security, Privacy and Compliance Management - Virtualization Technologies - Application Containers - Microservices and Lambda Functions - Multi-Cloud Solutions Enablement - Cloud Quality and Performance - Cloud Optimization and Automation - Cloud Resource Virtualization and Composition - Cloud Management and Operations - High Performance Cloud Computing - Cloud Migration - Monitoring of Services, Quality of Service, Service Level Agreements - Function-as-a-Service and Serverless Computing","date_start":"2020-05-07","date_end":"2020-05-09","important_dates":{"abstract":"","full":"2020-05-07","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Prague","Czech Republic"],"name":"","street":"","city":"Prague","state":"","ZIP":"","country":"Czech Republic"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":[]}