{"name":"Towards 2030: Sustainable Development Goal 1: No Poverty. A Sociological Perspective","series":"","short":"","website":"https://www.frontiersin.org/research-topics/30648","content":"In collaboration with the Open Access journals of Frontiers (www.frontiersin.org) we are bringing together a selected group of international experts to contribute to an article collection: \"Towards 2030: Sustainable Development Goal 1: No Poverty. A Sociological Perspective\" Submission Deadlines: 31 March 2022 - Abstract 15 June 2022 - Manuscript Visit the collection homepage for the full description of the project: https://www.frontiersin.org/research-topics/30648/ Participating Journals - manuscripts can be submitted to this Research Topic via the following journals: - Frontiers in Sociology: Migration and Society (2020 CiteScore 1.2) - Frontiers in Human Dynamics: Migration and Society About this Research Topic: This Research Topic addresses the first Sustainable Development Goal, which is to “end poverty in all its forms everywhere.” Progress toward this goal is measured by a number of individual targets and indicators. As highlighted in the UN’s most recent SDG progress report, the slowdown in poverty reduction since 2015 has been greatly exacerbated by the coronavirus pandemic. In 2020, for example, around 120 million people were pushed back into extreme poverty, representing the first increase in extreme poverty in over 20 years. Along with workers in the informal economy, the pandemic has also disproportionately impacted young and female workers. At present, the goal of eradicating poverty by 2030 is not on course to be met, with around 600 million people expected to be living in extreme poverty in 2030\\. Against the backdrop of the growing climate crisis, significant efforts are therefore needed to bring the 2030 target within reach. This Research Topic will address the first Sustainable Development Goal from a sociology-specific perspective. It will enquire about the framing and elaboration of the goal, its adaptation to particular geographical contexts, stakeholder involvement in it, and influence and impact of social mobility and social stratification studies on it. Given the setbacks to poverty reduction across the world resulting from the coronavirus pandemic, this year’s edition of the Research Topic will focus particularly on the challenges and complexities of poverty reduction in the wake of the COVID-19 crisis. This Research Topic welcomes papers that will provide both theoretical and empirical findings. Potential issues include, but are not limited to: - New approaches to definitions and measurement of poverty in the context of COVID-19 pandemic. - Lived experience of poverty, inequality, and unfairness. - Measurement as well as social and political implications of the informal economy. - Interventions in marginalized communities and peripheral areas. - Qualitative or quantitative studies focusing on poverty. - Case studies and good practices in battling poverty. - The development of programs and initiatives related to the social economy and solidarity economy. - Examples of social disparities and inequalities unveiled by the COVID-19 pandemic. - Local, regional, national, and international policies on poverty reduction. - Planning, management, governance, and evaluation of social policies. - Poverty reduction in the COVID-19 pandemic-related interventions, for example, response and recovery plans, programs, strategies, and funds. - Comparative social policy studies, including differences across nations, a variety of policy ideas and policy instruments, and policy transfer and learning. - Multi-level, cross-sectoral, and multi-sectoral cooperation of various stakeholders, including public, private, non-governmental organizations (NGOs), and non-formal entities. - Evaluation of poverty reduction schemes and strategies. Keywords: SDG1, COVID-19, poverty, unfairness, informal economy, solidarity economy Co-Editors: - Andrzej Klimczuk, SGH Warsaw School of Economics, Poland - Grzegorz Piotr Gawron, University of Silesia in Katowice, Poland - Piotr Toczyski, The Maria Grzegorzewska University, Poland SUBMISSION: Papers should be submitted through this link, using the \"Submit your manuscript\" button: https://www.frontiersin.org/research-topics/30648/ and must follow paper templates available here: https://www.frontiersin.org/about/author-guidelines#Templates Publishing solutions: - Manuscripts will be peer reviewed, and if accepted for publication, are subject to publishing fees, which vary depending on the article type (https://www.frontiersin.org/about/publishing-fees). A discount or waiver can be applied for and all applications are considered (https://frontiers.qualtrics.com/jfe/form/SV\\_51IljifwFBXUzY1). - We collaborate with many leading universities making the Open Access publishing process even more accessible for authors. Click here (https://www.frontiersin.org/about/institutional-membership) to see whether your institution is collaborating with us.","date_start":"2022-06-15","date_end":"","important_dates":{"abstract":"","full":"2022-06-15","notification":"","final":""},"topics":["Social Sciences","Sociology","equity and social justice"],"location":{"virtual":"","full":["Online Event","Switzerland"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Switzerland"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}