{"name":"Mobile Device Risks, Records and Compliance Rules: Managing Your Financial Institution's BYOD Program and Policy","series":"","short":"","website":"https://www.complianceonline.com/mobile-device-risks-records-and-compliance-rules-managing-your-financial-institution-byod-program-and-policy-webinar-training-704436-prdw?channel=Brownwalker","content":"This informative training session is a must for anyone who communicates via smartphones or other mobile devices. This session is a cost-effective way to recognize and manage mobile risks facing individual users and financial institutions as a whole. A timely program for professionals who want to ensure that their financial institution’s mobile/electronic content, use, risks, policies, records, privacy, and procedures are managed in compliance with the law, regulatory rules, and organizational guidelines. Why Should You Attend: Employees regularly use smartphones, tablets, and other mobile devices to conduct business and personal conversations and transactions. Some use personal, unsecured smartphones to conduct the financial institution’s business. Others use company-owned phones to hold private, non-business-related conversations. Either way, mobile device use increases your financial institution’s legal, security, regulatory, records, and productivity risks. To help manage potentially costly risks, best practices call for the adoption of a strategic Bring Your Own Device (BYOD) program, incorporating formal policy, supported by employee education and technology tools. This webinar will review the mobile/electronic risks facing financial institutions—and will provide best practices-based rules, policies, and procedures to help employers reduce the likelihood of online disasters, while increasing compliance and enhancing communication. Learn why and how to develop and implement a strategic BYOD policy program, combining written rules, employee training, and technology tools. Don’t let smartphone slip-ups and mobile missteps blemish your financial institution’s reputation, damage customer relationships, or sink your career. Attend this session to help your financial institution minimize mobile device risks, while maximizing compliance and communication. Areas Covered in the Webinar: Anticipating (and in some cases preventing) potentially costly legal liabilities, regulatory disasters, security breaches, records mismanagement, PR nightmares, and other mobile risks Managing mobile device risks and compliance with best practices-based policy Writing and implementing effective BYOD policy Safeguarding customer financials and financial institution data on personal and company-owned mobile devices Communicating clearly, compliantly, and effectively with internal and external audiences via smartphones Choosing the right communications channel and tone to conduct business Preserving, protecting and producing electronic business records created by email and text messages via mobile devices Understanding and adhering to e-discovery requirements Who Will Benefit: HR managers Compliance officers Lawyers Records managers IT professionals Risk managers Operations managers And others charged with writing policy and implementing compliance management programs to help protect the financial institution’s business records, safeguard consumers’ financial data, minimize electronic risks, and maximize compliance","date_start":"2022-03-18","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}