{"name":"5-Day National Level FDP: Transforming A Teaching Faculty to A Facilitator and Mentor","series":"","short":"","website":"https://events.jainuniversity.ac.in/events/5-day-national-level-fdp-transforming-a-teaching-faculty-to-a-facilitator-and-mentor","content":"Register for this Event: https://events.jainuniversity.ac.in/events/5-day-national-level-fdp-transforming-a-teaching-faculty-to-a-facilitator-and-mentor School / Center : School of Humanities and Social Sciences and School of Interior Design Time : 02:00 PM - 03:30 PM Attachment : View Category: Faculty Development Program School of Humanities and Social Sciences and School of Interior Design, JAIN (Deemed-to-be University) is hosting a 5-Day national level Faculty Development Program on Transforming A Teaching Faculty to A Facilitator and Mentor starting from July 27 to 31, 2021 from 02:00 P.M. to 03:30 P.M. Speakers Dr. B.P Nirmala Professor - Department of Psychiatric Social Work Consultant - Neuro Rehabilitation Correctional Social Work, Counselling, Field work in Psychiatric Social Work Social Work Education – NIMHANS Dr. Kanmani T.R Associate Professor Psycho social Consultant - Neurosurgery Unit Emergency and Trauma care, Legal Aid Cell, Information Centre & Organ Transplantation Co-ordinator - Block placement training Department of Psychiatric Social Work - NIMHANS Learning Outcomes: • Engage in discussion with learners • Design activities to forge collaboration • Encourage out of box thinking • Teaching students to think critically and understand how the learning process works • To improve learning transfer • Work with college students to help them address barriers (and potential barriers) to learning • through supportive one-to-one relationships and sometimes small group work. • Ensure the student teacher maintains a steady improvement of student learning in the classroom Who can participate? Academicians, Researchers & Students Contact Details: Organizer: Jain (Deemed-to-be University) Address: #44/4, District Fund Road, Jayanagar 9th Block, Bangalore, Karnataka, India - 560069 Contact Name: Dr. Ruby John Mob: 8310778384 Email: john.ruby@jainuniversity.ac.in","date_start":"2021-07-30","date_end":"2021-07-31","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Bangalore","India"],"name":"","street":"","city":"Bangalore","state":"","ZIP":"","country":"India"},"organizers":["JGI Group"],"societies":[],"indexes":[],"emails":["john.ruby@jainuniversity.ac.in"]}