{"name":"Writing High-Impact Executive Summaries","series":"","short":"","website":"https://www.complianceonline.com/writing-high-impact-executive-summaries-webinar-training-704127-prdw?channel=Brownwalker","content":"This training program will help attendees approach the writing situation with a clear and useful strategy. It will include strategies to fuse the purpose of the summary with the issues that matter to your audience. Attendees will also learn to sort ideas to clarify key points and craft paragraphs that reinforce the intent of the executive summary. Why Should You Attend: When writing an executive summary of research findings, there are many choices because volumes of information about most topics inundate you in a content-crazed world. And when suggesting a course of action, there are again many choices because management’s direction changes course rapidly in a volatile marketplace. For these reasons, businesspeople often ask, “What should go into an executive summary?” In business, many disparate staffers assume the task of summarizing in writing. Some are account executives writing executive summaries of their own proposals for their clients; others are junior executives briefing management on an issue by compiling useful data from numerous reports; still others are administrative assistants writing executive summaries of articles or books to save their managers reading time. Regardless of these roles, possessing the ability to summarize effectively can make a significant difference in your career. Learning Objectives: Approach the writing situation with a clear and useful strategy. Fuse the purpose of the summary with the issues that matter to your audience. Sort ideas to clarify key points. Craft paragraphs that reinforce the intent of the executive summary. Edit language to move the reader to action. Areas Covered in the Webinar: Four power points of executive summaries Revising and editing summaries based on the business context Hitting high notes through solid structure Getting to the point by eliminating verbiage Using lists to capture essential supporting ideas Who Will Benefit: Accounting professionals Banking managers Business forecasters Economic advisors Executive consultants Information technology experts Pharmaceutical representatives Retail specialists Risk analysts","date_start":"2022-02-16","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}