{"name":"I3M 2019 - THE INTERNATIONAL MULTIDISCIPLINARY MODELING & SIMULATION MULTICONFERENCE","series":"","short":"","website":"http://www.msc-les.org/conf/i3m2019/index.html","content":"I3M: The M&S Multiconference moving around the World and along the Years attended by Top Experts from Mediterranean, Latin & North Americas, Europe, Asia, Africa and Australia. The 16th edition of the I3M Multi-Conference will be held in Lisbon, (Portugal) renovating the opportunity to have an International Multiconference involving the different topics related to Modelling & Simulation. ------------------------------------------------------------------------------------------------- Indexing I3M proceedings past editions (including EMSS, HMS, MAS, IMAACA, DHSS, IWISH, SESDE, FoodOPS, VARE proceedings) are indexed by Scopus, in addition the I3M proceedings will be submitted for indexing in ISI Conference proceedings Citation Index and Google Scholar. ------------------------------------------------------------------------------------------------ I3M Conferences I3M includes the following international conferences: EMSS represents the 31th edition of the classic autumn M&S event in Europe; therefore the Symposium is a really International meeting involving world experts in the area; EMSS last editions was held in Budapest, Barcelona, Cyprus, Bergeggi, Calabria, Canary Islands, Fes, Rome, Wien, Bordeaux and Athens (http://www.msc-les.org/conf/emss2019/index.html). HMS Conference is a traditional event and it was held successfully worldwide, usually in the surroundings of major international ports (i.e. Genoa, Marseille, Riga, Rio de Janeiro, Barcelona). It is focused on applications of simulation and computer technologies to logistics, supply chain management, multimodal transportation, maritime environment and industrial logistics (http://www.msc-les.org/conf/hms2019/index.html). MAS Conference concentrates on applied M&S and computer technologies; application fields include production, business and services. Since 2002, it involves Industries and Experts discussion on the potential of M&S applied in real world (http://www.msc-les.org/conf/mas2019/index.html). IMAACA brings experts together for the purpose of presenting and discussing all type of application relevant control and automation problems emphasizing the role of model analysis as integral part of the complete design of the automated and autonomous system. Particularly, it is focusing on new concepts, methods, techniques, and tools conceived in order to support an integrative interplay of modeling, identification, simulation, system analysis and control theory in all the stages of system design (http://www.msc-les.org/conf/imaaca2019/index.html). DHSS 2019 is a workshop focusing on the advances and potential of using M&S in Defense and Homeland Security framework. It will bring experts together for the purpose of presenting and discussing all type of innovation related to the use of Modeling & Simulation in Defense and Homeland Security applications. DHSS will focus on new concepts, methods, techniques and tools for advancing in the modeling & simulation sector (http://www.msc-les.org/conf/dhss2019/index.html). IWISH 2019 is a workshop focusing on the advances and potential of using M&S within Health Care; during the last years Simulation in Health Care and Medicine is exploding both in term of applications as well as innovative solutions; since very long time (i.e.1996 EMSS) the topic was addressed by specific tracks in Conferences and Workshops, while in 2011 several track and internal Workshops was organized on this subject, so finally in 2012 the Health Care Simulation Workshop becomes and independent and active element of the Multiconference. IWISH brings experts together for the purpose of presenting and discussing all type of innovation related to the use of Modelling & Simulation in these areas of applications. IWISH focuses on new concepts, methods, techniques and tools for advancing in this modelling & simulation sector (http://www.msc-les.org/conf/iwish2019/index.html). SESDE 2019 is focusing on using M&S in applications related to Energy, Sustainability and Environmental Issues. Scientists and Subject Matter Experts in these sectors are invited to present innovative papers. The application of M&S to this sector represents a major opportunity considering the nature of the complex systems related to these issues that need to be studied and analyzed (http://www.msc-les.org/conf/sesde2019/index.html). FoodOPS aims at contributing to the literature both in appraising the current state of research and in providing advanced approaches to address key aspects such as modeling and simulation of food processes, comparison and optimization of emerging food technologies, risk assessment, food safety and shelf-life prediction; analysis and modeling of food packaging; food processing sustainability, traceability, production planning and scheduling; supply chain and cold chain design and management; inventory management and storage area design; automation of production processes and logistics (http://www.msc-les.org/conf/foodops2019/index.html).. VARE brings together trainers in all areas of knowledge and educational levels as well as researchers and scientists from virtual technologies as well data advanced visualization and virtualization. In general, main aim is to improve teaching and training, and data analysis through virtual and augmented technologies use and to discuss problems and solutions in mentioned areas to identify new issues, and to shape future directions for research (http://www.msc-les.org/conf/vare2019/index.html).. ----------------------------------------------------------------------------------------- Journal Opportunities It is a long tradition for I3M to provide opportunities to its Authors to extend their work for being published in International Journals; in fact as one of the most important and successful Simulation appointment, I3M2019 includes historical conferences such us EMSS and HMS that this year celebrate respectively the 31th and 21th years edition. Thanks to the invaluable works of the Organizing Committees, International Program Committees, Reviewers and Local Organizers, this year the I3M Multiconference is one of the biggest events of M&S worldwide. So, due to these reasons, the Organization Committee is working in order to set up Special Issues based on a collection of extended versions of best selected papers among those submitted to I3M2019 (EMSS2019, HMS2019, MAS2019, IMAACA2019, DHSS2019, IWISH2019, SESDE2019, FoodOps2019, VARE 2019) on several international journals. ---------------------------------------------------------------------------------------------- For further information, please contact Francesco Longo (f.longo@unical.it)","date_start":"2019-09-18","date_end":"2019-09-20","important_dates":{"abstract":"","full":"2019-04-15","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["LISBON","Portugal"],"name":"","street":"","city":"LISBON","state":"","ZIP":"","country":"Portugal"},"organizers":["Cal-Tek S.r.l."],"societies":[],"indexes":[],"emails":["f.longo@unical.it"]}