{"name":"XI Portuguese Congress of Sociology","series":"","short":"","website":"https://xi-congresso-aps.eventqualia.net/en/2020/home","content":"General Call of the Conference: Equality and difference are dilemmatic dimensions of contemporary times. The increase of inequalities and their multidimensional and cumulative nature have instigated struggles for redistribution, with varying orientations, tones, and contours, but whose main purpose is the search for (greater) equality. The domination and deprivation associated with inequalities have also constituted an inexhaustible source for sociological knowledge, from its early foundation days as a social science to the latest indictments of critical sociology. Simultaneously, we also observe contrasting social dynamics that are anchored in the defence of respect for differences, materializing in struggles for cultural and/or identity recognition. Here, an accumulated sociological legacy has also contributed to the knowledge and understanding of the complex logics underlying the social production of itself and its modes of belonging. Today, the issues surrounding identities are an effervescent topic, for reasons which don’t always coincide. On one hand, increasing legitimacy is given to experiences and paths that were once silenced and made invisible, and which now seek to gain and exercise the right to speak of themselves, on their own terms, in the public sphere. On the other hand, we witness a resurgence of incommunicating differences and exclusion, evidencing that history is not teleological or a one-way route, as crossroads and bifurcations appear in it, prompting regressions that present themselves as increasingly popular and miraculous solutions. The fine analysis of the social anchoring of the production of identities allows us to reveal how ways of acting, thinking, and feeling are forged, through the different social interactions, in accordance with the weights and counterweights of class, gender, ethnicity, sexual orientation, religion, age... It also motivates the need to overcome a current of thought that is lacking and averse to complexity, transits, and intermittences, usually expressed through artificial binary pairs, demanding mediation between the intricate and plural social folds. It is important to determine the extent to which, in practice, a communicating multivocality – that is, a universal culture of recognition and translation of differences, of coexistence among equals – and its representatives and protagonists exist, since only difference creates relations, only it allows, by a shared singularity, to find bridges and build communities. To this end, it is crucial to incorporate the practical awareness of intersectionality and the modalities and metamorphoses through which, as Nancy Frazer proposes, economic, cultural, and political injustices intersect, combining the need for policies of redistribution, recognition of difference, and representation. In parallel, we witness the reactivation of realist identities, based on ideologies of purity and firmly rooted in beliefs of social closure. Some of these movements openly proselytize exclusion and hatred, often resorting to violence, and have gained increasing support, to the point of colonizing state institutions, political parties, and respected international bodies, nourished by the social vulnerability of growing social fringes. Both tendencies – emancipatory and of domination – today shape the processes of globalization and invite the study and debate of their differences, as well as their overlapping areas. To discover the configurations of contemporary identity processes, in their confrontations and complexity, is the goal of the XI Portuguese Congress of Sociology, titled Heated identities: differences, belonging, and populisms in an effervescent world, which will be held in Lisbon, June 29 through July 1, 2020, under the local organization of ESPP/ISCTE-IUL and ICS-ULisboa.","date_start":"2020-06-29","date_end":"2020-07-01","important_dates":{"abstract":"","full":"2020-06-29","notification":"","final":""},"topics":["Social Sciences","Sociology","Sociology, Social Sciences"],"location":{"virtual":"","full":["Lisbon","Portugal"],"name":"","street":"","city":"Lisbon","state":"","ZIP":"","country":"Portugal"},"organizers":["PORTUGUESE SOCIOLOGY ASSOCIATION"],"societies":[],"indexes":[],"emails":[]}