{"name":"12th International Conference on Environmental Pollution and Remediation (ICEPR’22)","series":"","short":"","website":"https://icepr.org","content":"12th International Conference on Environmental Pollution and Remediation (ICEPR'22) will be delivered as a physical conference combining with the opportunity of live presentation for the people who can not travel for any reason. Attendees will be able to connect with researchers from across the globe and network in-person or virtual. The Conference Proceedings will be published with an ISSN and ISBN, indexed in Scopus and Google Scholar, and archived permanently in Portico. The 12th International Conference on Environmental Pollution and Remediation (ICEPR’22) aims to become the leading annual conference in fields related to environmental pollution and remediation. The goal of this environment conference 2022 is to gather scholars from all over the world to present advances in the relevant fields and to foster an environment conducive to exchanging ideas and information. This conference will also provide an ideal environment to develop new collaborations and meet experts on the fundamentals, applications, and products of the mentioned fields. ICEPR is an acronym for International Conference on Environmental Pollution and Remediation. Topics for ICEPR’22 include, but are not limited, to the following: Air pollution and treatment Biofuels Desalination Environmental Protection Environmental Sustainability and Development Greenhouse Effect, Global Warming, and Climate Change Groundwater Issues Soil Pollution and Treatment Wastewater Management and Treatment Water Pollution and Treatment","date_start":"2022-08-03","date_end":"2022-08-05","important_dates":{"abstract":"","full":"2022-01-07","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental","Environmental Pollution"],"location":{"virtual":"","full":["Prague","Czech Republic"],"name":"","street":"","city":"Prague","state":"","ZIP":"","country":"Czech Republic"},"organizers":["International ASET"],"societies":[],"indexes":[],"emails":[]}