{"name":"VII SWS conference on Social Sciences (ISCSS) - Extended Sessions “When Science meets Art”","series":"","short":"","website":"https://www.sgemvienna.org","content":"The International Scientific Conference SWS Vienna ART 2020 is organized as an extended session of the SWS International Scientific Conferences on SOCIAL SCIENCES. The event will be held in the biggest and most historically Schönbrunn Palace, Vienna, Austria in the period of 9 – 12 December 2020\\. You shall experience a fine selection of presentations, studies and papers in the main branches of Social Sciences gathering the more objective and scientific side of human sciences as Political Sciences, Law, Business and Management, Psychology, Human Geography, Cultural Studies, Media and Communications, Social History and Sociology as well as Urban studies, Planning and Development. Special topic: COVID19 - The New Challenge of the Modern Society The aim of the conference is to provide a platform for academicians and professionals with cross-disciplinary interests related to social sciences, to meet, exchange knowledge and interact with each other. All submitted papers are peer-reviewed, evaluated and if accepted published in a conference proceedings /both digital and hard copy version/. It combines papers in the fields of: Every accepted paper is published in the conference proceedings (ISSN/ ISBN) both hard copy and soft copy (DVD). The conference book is also submitted for evaluation and indexation in the biggest scientific databases - ISI Web of Science, ELSEVIER products, Mendeley, EBSCO, ProQuest, British Library and etc. The Conferences include also accompanying events, such as WORKSHOPS, PERFORMING ARTS (live dance performances, theater, and music, etc.) and very interesting cultural trips with historic value. We would like to invite you to share your experience and research in the field of Social Sciences and Arts with experts from all over the world. Keywords: Political sciences, Law, Finance, Psychology, Human Geography, Cultural Studies, Media and Communications, Social History and Sociology as well as Urban studies, Planning and Development, Contemporary Arts, Performing & Visual Arts","date_start":"2020-12-09","date_end":"2020-12-12","important_dates":{"abstract":"","full":"2020-10-01","notification":"","final":""},"topics":["Arts & Humanities","Visual Arts","political science"],"location":{"virtual":"","full":["Vienna","Austria"],"name":"","street":"","city":"Vienna","state":"","ZIP":"","country":"Austria"},"organizers":["European Universities and Academy of Sciences"],"societies":[],"indexes":[],"emails":[]}