{"name":"The Future of Education International Conference - Virtual Edition","series":"","short":"","website":"https://conference.pixel-online.net/FOE/virtual_conference.php","content":"We will deliver a full 2 days programme of inspiring sessions in the framework of a highly interactive virtual conference experience. We will provide enhanced digital contents that will give participants greater access to learning, sharing and networking. - All accepted papers at the virtual conference will be presented in synchronous or asynchronous modes. - Interactive Questions and Answers sessions will follow each paper presentation. - Virtual Poster Presentation Sessions will also be held. - Networking Opportunities will be organized. 18 May 2020: Extended Abstract Submission Deadline 25 May 2020: Notification of Acceptance / Rejection of abstracts 8 June 2020: Deadline for final submission of Papers All accepted papers will be included in the Conference Proceedings published with ISBN, ISSN, DOI and ISPN codes. The publication will be sent to be reviewed for inclusion in the Conference Proceedings Citation Index by Thomson Reuters (ISI-Clarivate). The publication will also be included in Academia and indexed in Google Scholar. Furthermore, among the accepted papers, up to 15 best papers will be selected. Authors of the selected papers will be requested to send an extended version of their articles that will be blind reviewed by MDPI academic editors and the accepted ones will be published in the Special Issues Section, indexed by Ei Compendex, SCOPUS (Elsevier), Emerging Sources Citation Index (ESCI - Web of Science). For further information please check: http://conference.pixel-online.net/FOE/callforpapers.php","date_start":"2020-06-18","date_end":"2020-06-19","important_dates":{"abstract":"","full":"2020-05-18","notification":"","final":""},"topics":["Education / Legal / Other","Education","call for papers"],"location":{"virtual":"","full":["Online Event","Italy"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Italy"},"organizers":["Pixel"],"societies":[],"indexes":[],"emails":[]}