{"name":"Scopus- Indexed Springer International Conference on Evolutionary Computing And Mobile Sustainable Networks","series":"","short":"","website":"http://icscss.com/contact.html","content":"Swarm Intelligence, Memetic Algorithms & Genetic Algorithms, Evolutionary Search and Meta-heuristics, Evolutionary Multi-objective Optimization, Swarm/Collective Intelligence, Evolvable Computing, Evolvable/Adaptive Hardware and Systems, Evolutionary game theory and Evolutionary scheduling, Quantum Computing and Nano Computing, Evolution Strategies and Evolutionary Programming in Swarm Intelligence, Differential Evolution in Artificial Immune Systems, Evolutionary Computation in Bioinformatics, Evolutionary Computation in AI, Modeling and evaluation of sustainable systems, Evolutionary Applications in Games and Entertainment Technologies, Evolutionary, Robotics, Industrial and Real World applications, Cloud Computing, Wearables, Body Sensor Networks, Artificial Intelligence, IoT-based Supply Chains, Industrial IoT Service Creation, Internet of Things, Big Data, Sustainable Energy, Grids and Networks, Green wireless access networks, Energy-efficient sensor networks, Renewable energy sources for communication networks, Sustainable Energy-efficient UAV-based networks, Field Trials of Sustainable Networking and Computing, Energy-efficient public health solutions based on 5G networks, Software Defined Networking (SDN), Network Function Virtualization (NFV), Sustainability in Wireless Body Area Network (WBAN) & Vehicular networks, Low-Power Local and Wide-Area Networks, Mobile social network for wireless communication and cloud computing, Security in wireless communication and mobile cloud computing, Emergency services and disaster recovery of networks and applications, Techniques for flexible spectrum usage for wireless communication, Cloud Computational resources, IoT and blockchain, Cloud-based mobile networks and applications, Cloud-Centric Mobile Security, Big Data Evaluation and Assessment, Real-world practices of big data, Social Networks.","date_start":"2020-02-20","date_end":"2020-02-21","important_dates":{"abstract":"","full":"2019-12-10","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Bangalore.","India"],"name":"","street":"","city":"Bangalore.","state":"","ZIP":"","country":"India"},"organizers":["Sir M. Visvesvaraya Institute of Technology"],"societies":[],"indexes":[],"emails":[]}