{"name":"5th International Workshop on Aircraft Design and Control Engineering","series":"","short":"WADCE 2019","website":"http://www.wadce.org","content":"Call for paper 2019 5th International Workshop on Aircraft Design and Control Engineering (WADCE 2019) Dec. 12-15, 2019/Sanya, China http://www.wadce.org/ 2019 5th International Workshop on Aircraft Design and Control Engineering (WADCE 2019) will be held in Sanya, China, during Dec. 12-15, 2019! WADCE 2019 is organized by Hong Kong Society of Mechanical Engineers. WADEC 2019 is in conjunction with 2019 5th International Conference on Mechanical and Aeronautical Engineering (ICMAE 2019). ●Publication and Indexing All accepted and registered papers will be included in IOP Conference Series: Materials Science and Engineering (ISSN: 1757-899X) ,which will be indexed by EI Compendex, Scopus, Thomson Reuters (WoS), Inspec, and other databases. ●WADCE 2019 Speakers 1.Prof.Y. Lawrence Yao,Columbia University, USA Prof.Y. Lawrence Yao is Professor of Mechanical Engineering at Columbia University, where he directs the Advanced Manufacturing Laboratory. Yao served as Chair of Mechanical Engineering Department at Columbia University between 2005 and 2011\\. Yao has pioneered research in laser materials processing, including laser assisted removal, shaping, joining, and property modification of various materials, and innovative laser applications in renewable energy, biomedical, and art restoration fields. Yao is a Fellow of ASME, SME and Laser Institute of America and currently serves as Editor, Journal of Manufacturing Science and Engineering of ASME. 2.Prof. Andrew Rae,University of the Highlands and Islands, UK Prof Andrew Rae graduated from Imperial College in 1987 and joined the High-Lift Section of the Aerodynamics Department at the Royal Aircraft Establishment (later DRA, DERA and QinetiQ), Farnborough. He was Deputy Chairman of the Technical & Scientific Board of the European Wind Tunnel Association (EWA) and within this framework was the focus for wind tunnel correction and advanced simulation methodologies. He was a QinetiQ Approved Technical Authority and, as such, the signatory for the aerodynamics clearance of flight test aircraft modified to accommodate trials or upgrade equipment, and became a QinetiQ Technical Fellow in 2008 for his contribution to applied and experimental aerodynamics. 3.Prof. Yong Zhao,Nazarbayev University, Kazakhstan Dr. Michael Yong Zhao received his PhD and MSc from the University of Manchester, UK on a Sino-British Friendship Scholarship from the PRC/UK governments, and his BEng from Xi'an Jiaotong University, PRC. He has held faculty and admin positions at Nanyang Technological University (NTU), Singapore from 1992-2010 and Alfaisal University, KSA from 2010-2016\\. Since 2016 he is a professor of Mechanical and Aerospace Engineering at the Nazabayev University in Kazakhstan. His research interests include computational fluid dynamics (CFD) and computational structural dynamics (CSD) and their engineering applications in biomedical engineering, combustion engines and renewable energy systems. 4.Prof. Huang Weimin,Nanyang Technological University, Singapore Dr Wei Min Huang is currently an Associate Professor (tenured) at the School of Mechanical and Aerospace Engineering, Nanyang Technological University, Singapore. With over 20 years of experience on various shape memory materials (alloy, polymer, composite and hybrid), he has published over 180 papers in journals, such as Materials Today, Accounts of Chemical Research and Advanced Drug Delivery Reviews, and has been invited to review manuscripts from over 200 international journals (including Progress in Polymer Science, Nature Communications, Advanced Materials, and Advanced Functional Material, etc), project proposals from American Chemical Society, Hong Kong Research Grants Council, etc, and book proposals from Springer, CRC and Elsevier. ●Topics of interest for submission include, but are not limited to: Airspace Control See-and-avoid Systems Airspace Management Interoperability Security Airworthiness Levels of Safety Sensor Fusion Air Vehicle Operations Manned/Unmanned Aviation Simulation More topics can be found at: http://www.wadce.org/cfp.html ●Paper Submission 1\\. You can choose to submit your paper directly to wadce@smehk.org 2\\. You can submit your full paper through electronic submission system: https://cmt3.research.microsoft.com/WADCE2019 ●Call for participants 1.Presenter: If you are interested in presenting your research on the conference, without publishing your paper in the proceeding, please submit the abstract to us. 2.Listener: You need to complete the registration as Listener before the registration dealdine.Send email to wadce@smehk.org for further information. 3.Reviewer: We sincerely welcome experts in the areas of Aircraft Design and Control Engineering join the conference as reviewer .Contact us at: wadce@smehk.org. ●Contact Us: If you have any question, please feel free to contact our conference secretary. Ms. Linda Lee Tel: +852-30506862 Email: wadce@smehk.org Website: http://www.wadce.org/","date_start":"2019-12-12","date_end":"2019-12-15","important_dates":{"abstract":"","full":"2019-11-10","notification":"","final":""},"topics":["Engineering & Technology","Mechanical/Industrial"],"location":{"virtual":"","full":["Sanya","China"],"name":"","street":"","city":"Sanya","state":"","ZIP":"","country":"China"},"organizers":["Hong Kong Society of Mechanical Engineers"],"societies":[],"indexes":[],"emails":["wadce@smehk.org"]}