{"name":"6th International Conference on Microbiome, Probiotics & Gut Nutrition","series":"","short":"","website":"https://microbiome.conferenceseries.com","content":"Joshua Lederberg, who coined the term “Microbiome”, to signify the ecological community of commensal, symbiotic, and pathogenic microorganisms that literally share our body space. A microbiome is the community of microorganisms such as bacteria, achaea, fungi, as well as viruses that inhabit an ecosystem or organism. Microorganisms dominate all other life everywhere scientists have looked, including the human body, the Earth’s soils and sediments, the oceans and fresh waterways, the atmosphere and even extreme environments such as hydrothermal vents and sub glacial lakes. Scientists also use the term microbiome to refer to all these genes associated with those life forms. We, humans, are mostly microbes, over 100 trillion of them. Microbes outnumber our human cells ten to one. The majority live in our gut, particularly in the large intestine. The number of genes in all the microbes in one person’s microbiome is 200 times the number of genes in the human genome. The microbiome may weigh as much as five pounds; Microbiomes have several things in common. Their inhabitants are plentiful and diverse, varying from place to place and even from person to person. They are also dynamic, changing in response to factors such as diet or climate. Finally, they are interconnected with their host, engaged in a give-and-take relationship that is often beneficial, even essential, to both the host and their resident microorganisms. Both inside and out, our bodies harbor a huge array of micro-organisms. While bacteria are the biggest players, these are dubbed the human microbiota. Your body’s microbiome is all the genes your microbiota contains. The bacteria in the microbiome help digest our food, regulate our immune system, protect against other bacteria that cause disease, and produce vitamins including B vitamins B12, thiamine and riboflavin, and Vitamin K, which is needed for blood coagulation.","date_start":"2022-11-25","date_end":"2022-11-26","important_dates":{"abstract":"","full":"2022-11-01","notification":"","final":""},"topics":["Medicine & Health","Other"],"location":{"virtual":"","full":["Vancouver","Canada"],"name":"","street":"","city":"Vancouver","state":"","ZIP":"","country":"Canada"},"organizers":["Conferenceseries LLC LTD"],"societies":[],"indexes":[],"emails":[]}