{"name":"The Impacts of Civic Technology Conference (TICTeC) 2020","series":"","short":"","website":"https://tictec.mysociety.org/2020","content":"Returning for a sixth year, TICTeC 2020 will focus on the impact that civic technology and digital democracy are having upon citizens, decision makers and governments around the world. Primarily, the goal of TICTeC is to promote and share rigorous and meaningful research into online civic technologies and digital democracy around the world. The conference facilitates discussion and networking amongst individuals and groups to find real-world solutions through sharing evidence of impact, and (importantly) evidence of what doesn’t work. TICTeC 2020 will bring together individuals from academic and applied backgrounds as well as businesses, public authorities, NGOs, funders and education institutions to discuss ideas, present research and build a network of individuals interested in the civic technology landscape. See who’s previously attended TICTeC. This 2 day conference provides the opportunity for researchers to present theoretical or empirical work related to the conference theme. We also welcome proposals for individuals to lead workshops or give presentations relating to the conference theme. We encourage submissions to focus on the specific impacts of technologies, rather than showcase new tools that are as yet untested. We invite individuals to submit abstracts or workshop / presentation proposals of no more than 300 words by 17th January 2020\\. We encourage submissions to focus on the specific impacts of technologies, rather than showcase new tools that are as yet untested. Those selected for inclusion in the conference programme will be notified no later than 24th January 2020\\. Presenters will be required to register for the conference by 7th February in order to confirm their slot (the registration fee will be waived for individuals presenting). Submit proposals here: https://forms.gle/RU9rz5bdDaWFUiH79","date_start":"2020-03-24","date_end":"2020-03-25","important_dates":{"abstract":"","full":"2020-01-17","notification":"","final":""},"topics":["Social Sciences","Political-Science"],"location":{"virtual":"","full":["Reykjavik","Iceland"],"name":"","street":"","city":"Reykjavik","state":"","ZIP":"","country":"Iceland"},"organizers":["mySociety"],"societies":[],"indexes":[],"emails":[]}