{"name":"Pandemic metaphors in language, literature and culture","series":"","short":"","website":"https://sites.google.com/assenglish.org/asseconference2022/call-for-papers?authuser=0","content":"Albanian Society for the Study of English in collaboration with The Department of Foreign Languages, Faculty of Humanities, University of Vlora “Ismail Qemali”, Albania organize The Sixth ASSE International Conference on British and American Studies PANDEMIC METAPHORS IN LANGUAGE, LITERATURE AND CULTURE June 15, 2022 Deadline for abstract submission: 15 April 2022 For the past two years, owing to the spread of the coronavirus, we have learnt to live and cope with new realities, social, political and technological — from a collective scare caused by the horror of death that we all experienced at its outbreak to a discreet acceptance of its presence through our adaptation to the new modes of living, working, behaving, communicating, interacting and thinking that it has dictated. Caught in a Derridean sort of suspension or postponement (‘not yet’) to the end of the pandemic, we have come to learn to arrange our human activities following the order and course of action that the pandemic takes. In this regard, language has had a very important role to play. It presents, shapes and conveys the reality for us. It is through language that we make sense of our experience and the world around us, communicate with others, and respond to them. During unprecedented times of uncertainty, we especially convey our anxieties and fears through metaphors. We quite often, unwittingly, invest in them, through striking analogies, our worries, our attitudes, our responses and also knowledge. In this conference, we invite potential participants to look at how pandemics have shaped our language through metaphors, what metaphors people have used during pandemics, how they address our fears, worries and anxieties, what new mentalities, perspectives and attitudes they produce during the times of pandemic and how they are reflected in language, literature and culture, and how they contribute to the politics of the text. Some possible topics the conference aims at addressing include: Cultural and social constructs in pandemic and post-pandemic times; The role of the media in constructing pandemic metaphors; The present and future of pandemic discourse; Wiredness as a metaphor of our times; Past and present pandemic metaphors; The concept of space and distance, social and physical, in the COVID era – locked up and/or locked down; Suspension, postponement and uncertainty; Shifting pandemic paradigms; Pandemic(s) in discourse; Pandemic representations in literature and culture; New perspectives in language, literary and cultural studies. Proposals are welcome from but not limited to: Language Studies Intercultural Communication British literature; American literature; Literatures in English Literary theory and criticism Translation/ Interpretation studies Comparative linguistics/Corpus linguistics Gender Studies Cultural Studies Media Studies Film Studies Etc. We encourage proposals to explore these topics from a variety of interdisciplinary perspectives. Proposals will be peer reviewed by a panel of experts. A selection of papers will be published after the conference. Language of the conference: The official language of the conference is English. Format of the conference: The conference sessions will take place both on site and online. The online sessions will be conducted via Google Meet. The joining information will be provided for conference participants in the conference programme. Proposals are invited for 15-20 minute paper/ppt presentations (followed by 5-10 minutes’ discussion) in English, in any of the topic areas listed above or other relevant areas. Please send your abstracts (150- 200 words) as an MS word in attachment to the following email address by 15 April 2022: asseconf@assenglish.org. For more information, please visit the conference website, https://sites.google.com/assenglish.org/asseconference2022/home. We look forward to receiving your proposal.","date_start":"2022-06-15","date_end":"","important_dates":{"abstract":"","full":"2022-04-15","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","cultural studies"],"location":{"virtual":"","full":["Vlora","Albania"],"name":"","street":"","city":"Vlora","state":"","ZIP":"","country":"Albania"},"organizers":["Albanian Society for the Study of English"],"societies":[],"indexes":[],"emails":["asseconf@assenglish.org"]}