{"name":"4th International Conference on Aquaculture & Marine Biology","series":"","short":"","website":"https://www.meetingsint.com/agri-aqua-conferences/aquaculture","content":"Aqua 2020 Committee is enchanted to welcome the participants from all over the world to attend the prestigious 4th International Conference on Aquaculture & Marine Biology scheduled during August 19-20, 2020 at London, UK with main theme of Advancing towards an Environment-Resistant Aquaculture. The conference provides the global coliseum to international scholars and researchers to voice their research discoveries to the world. With representatives from all the real aquaculture nations in participation the environment is energizing with open and amicable communication between participants. This is a gathering, giving a chance to the aquaculture and sea life science industry to find out about flow and up and coming issues, investigate new improvements in culture innovation, and interact with others with similar interests. Aqua 2020 Conference brings together a unique and international mix of experts like academicians, scientists, and business professionals, general public, current and prospective fish farmers to share information and ideas about the development of aquaculture & marine biology. Attendees will learn about several topics relevant to aquaculture & marine biology, and find out about the latest aquaculture equipment and products by browsing the on-going Exhibition. Anyone with an interest in aquaculture, marine science, including prospective growers, researchers, teachers, students or agency persons with jobs related to aquaculture & marine biology can attend the conference. The conference is also suited to persons who sell goods or services to the aquaculture & marine biology industry.","date_start":"2020-08-19","date_end":"2020-08-20","important_dates":{"abstract":"","full":"2020-08-19","notification":"","final":""},"topics":["Physical Science & Math","Ocean/Water","Marine biology and ocean sciences"],"location":{"virtual":"","full":["London","Uk","United Kingdom"],"name":"","street":"","city":"London","state":"Uk","ZIP":"","country":"United Kingdom"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}