{"name":"California Leaves of Absence - Employer Obligations, Leave Interactions","series":"","short":"","website":"https://www.complianceonline.com/california-medical-leaves-absence-guide-seminar-training-80620SEM-prdsm?channel=Brownwalker","content":"This course is designed to help HR professionals and anyone else who deals with managing and monitoring leaves of absence in their companies to understand this field for regulatory compliance. California is one of the most complex states in which to do business and that complexity flows through to the complications that employers face when meeting their obligations under CA employment laws. One of these reasons is the many types of leave offered to CA employees and the many reasons for which employees can take leave. Employer requirements for managing leaves especially medical leaves of absence are bewildering. Even human resources professionals can be confused by the myriad of leave types in the state. And for some leaves even local laws must be considered. Just as serious is how these types of leaves interact with federal requirements. Although some provisions under California laws are similar to federal laws, many of them are not and assuming they are can cause big trouble. It can feel overwhelming to manage leaves of absence and feel confident that the employer is compliant. Astute compliance with laws related to the various leave types is critical for any company with California-based employees. Liability costs for non-compliance can be staggering. Just as important is the cost of damaged employee relations and engagement as well as external organizational reputation. While companies will turn to their labor attorneys to walk them through the specific details of employee situations, it’s important for HR professionals and anyone else who deals with managing and monitoring leaves of absence in their companies to understand this field. Learning Objectives: Overview of job protected leave types: California Family Rights Act (CFRA); Family Medical Leave Act (FMLA); Pregnancy Disability Leave (PDL); California New Parent Leave Act (NPLA); baby bonding (“parental leave”); leave for domestic violence victims; leave for alcohol and drug rehabilitation; state paid sick leave under the Healthy Workplace, Healthy Families Act of 2014; and state workers’ compensation. Overview of topics related to protected leave types: Defense of Marriage Act (DOMA); Americans with Disabilities Act Amendments Act (ADAAA), California ADA, Fair Employment and Housing Act (FEHA); and compliance with interactive process requirements. Details about Leaves for Victims of Crime and Victims of Domestic Violence, Sexual Assault, or Stalking, including written documentation and usage of sick leave, vacation or PTO time. Details about federal and state Military Leave and Military Spouse Leave, including the “escalator principle”; reinstatement; and termination restrictions. Areas Covered: Elements of the program’s featured leaves. State leaves in the state of CA. Eligibility requirements for leave. Medical certification, posting and notice requirements for leave. Pay obligations for the employee under certain leave requirements. Benefits provided and methods for employees on leave. Leave integration. How state leaves and FMLA interact. How they do not interreact. Lactation accommodation requirements. Considerations before making decisions to deny requests for leave of absence. Obligations and suggestions for communicating with employees on leaves of absence. The Americans with Disabilities Act (ADA.)","date_start":"2021-04-15","date_end":"2021-04-16","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Human-Resources"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}