{"name":"Twenty-Eighth International Workshop on Matrices and Statistics","series":"","short":"IWMS 2020","website":"https://carams.in/events/iwms2020","content":"The theme of the workshop shall focus on the theory and applications of the following topics in different branches of science such as Biology, Computer and Information Science, Economics, Electronics, Genetics, Office Statistics, Social Statistics and Accountancy: Matrix Analysis Projectors in Linear Models & Multivariate Analysis Growth Curve Models Linear Regression Models Linear Statistical Inference Modelling Covariance Structures Multivariate and Mixed Linear Models Statistics in Big Data Analysis. On behalf of the International Organizing Committee, Scientific Committee, and the Local Organizing Committee we have much pleasure in extending a cordial invitation to participate this workshop. This series of Workshops has a long history, see https://www.sis.uta.fi/tilasto/iwms/IWMS-history.pdf and we welcome the opportunity to hold the workshop once again in India. The 9th Workshop was held at Hyderabad in 2000, celebrating 80th birthday of Calyampudi Radhakrishna Rao, popularly known as C. R. Rao. The present 28th IWMS will be held beside ICLAA 2020 and we are now celebrating 100 years of C. R. Rao, who is among great Statisticians India ever produced. The common day between IWMS and ICLAA, December 17, 2020, will be celebrated as CRR Day in honor of great scholar Prof. Calyampudi Radhakrishna Rao ( https://carams.in/events/crr-day-2020/ ). We are sure that 28th IWMS will be a great success with the participation of prominent researchers from across the globe working in Statistics, Matrix Theory and allied subjects.","date_start":"2020-12-15","date_end":"2020-12-17","important_dates":{"abstract":"","full":"2020-11-20","notification":"","final":""},"topics":["Physical Science & Math","Statistics/Probability"],"location":{"virtual":"","full":["Manipal","India"],"name":"","street":"","city":"Manipal","state":"","ZIP":"","country":"India"},"organizers":["ILAS,CARAMS"],"societies":[],"indexes":[],"emails":[]}