{"name":"International Conference on Music and Sounds","series":"","short":"","website":"https://sounds.lcir.co.uk/?fbclid=IwAR1tp77k9VM9zhJglBAoXuuG8hvNe-heZJD7tgbgzWwGQqlmqboymTQoOPI","content":"The abilities of music to influence and effect human beings are felt every day from the music we listen to for motivation, music played when we work, while we dine, when we shop or while entertaining. Imagine the sensation we get when listening to a skilful singer hit a passionate array of notes, or a crescendo in a piece of symphonic music, a touching lyric uttered with a beautiful melody. Listening to music is the only activity we engage in that uses the entire brain. The right kind of music, a type that is not disruptive or one that breaks your concentration has many beneficial effects including positively influencing intelligence, even stimulating pain reduction responses and is very healing. More than just the music itself it is in the sound we hear, sound that is driven by a desire for quality and created by technology. Thanks to technological advances, there have been great advances in our means to hear the music in a manner that bathes the listener in sound that is transportative and immersive. The conference aims to bring together scholars and professionals and explore various aspects of Music Studies discussing theoretical concepts as well as practical challenges and the solutions of using music and sounds across disciplines. Paper proposals up to 250 words should be sent by 20 April 2021 to: sounds@lcir.co.uk. Please download Paper proposal form. Registration fee – 90 GBP","date_start":"2021-10-02","date_end":"2021-10-03","important_dates":{"abstract":"","full":"2021-08-10","notification":"","final":""},"topics":["Arts & Humanities","Music","interdisciplinary"],"location":{"virtual":"","full":["Online Event","United Kingdom"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["sounds@lcir.co.uk"]}