{"name":"2020 Asia-Pacific Conference on Management and Business @ Bangkok","series":"","short":"","website":"http://www.apcmb.org","content":"Undoubtedly, the travel & tourism industry plays a crucial role in the global economy. As technology of artificial intelligence, 5G and Fin-tech advances, mobile payment, apps, tourism platforms and social media are overturning the consumption patterns and forms of traveling, leading to industrial transformation of tourism and hospitality. To promote sustainability of tourism will be the greatest challenge for the travel industry in the era through various emerging tools and rapidly developing technology. APCMB 2020 will take place from July 14-16, 2020 in Bangkok, Thailand. APCMB offers an opportunity for scholars and practitioners interested in these issues to share their thinking and research findings. The conference intends to attract original, pertinent and relevant contributions on the multidisciplinary field of the travel and tourism industry. All full paper submissions will be peer reviewed and evaluated based on originality, technical and/or research depth, accuracy and relevance to conference theme and topics. APCMB welcomes paper submission of the following topics related to 2 sections: Highlight Tracks Innovation in Tourism Sustainability of Tourism Media & Technology in Tourism Economic /Environmental/Cultural Impacts of Tourism Education on Tourism & Hospitality Hospitality Management Tourism Development and Policy Marketing and Branding Scientific Sessions Communication & Psychology Culture & Social Studies Education, Law & Politics Business & Management Economics & Finance","date_start":"2020-07-14","date_end":"2020-07-16","important_dates":{"abstract":"","full":"2020-03-31","notification":"","final":""},"topics":["Business","Management / Leadership","Business Management & Leadership"],"location":{"virtual":"","full":["Bangkok","Thailand"],"name":"","street":"","city":"Bangkok","state":"","ZIP":"","country":"Thailand"},"organizers":["INEN"],"societies":[],"indexes":[],"emails":[]}