{"name":"Conducting Your 2022 Annual ACH Rules Compliance Audit - a Step-by-Step Guide","series":"","short":"","website":"https://www.complianceonline.com/annual-ach-rules-compliance-audit-webinar-training-705082-prdw?channel=Brownwalker","content":"This session will cover “step-by-step” the audit process and requirements for each participant conducting an annual ACH audit, to help ensure their compliance with the Nacha Operating Rules. Why Should You Attend: The Nacha Operating Rules and Guidelines require that all participating depository financial institutions, third-party senders and third-party service providers that provide ACH services to the RDFI or ODFI, conduct an annual ACH audit by December 31 of each year (ACH Rules, Article 1). There have been many Rules changes since 2019 that affect your annual ACH Rules Compliance Audit in 2022, including the verification of registration and accuracy of the info in the ACH Contact Registry (new in 2020!). The annual ACH Rules Compliance Audit requires a precise examination of all ACH processes that a participant is involved in, then completing the “compliance test” of those processes to ensure compliance with the Nacha Operating Rules. There are NEW Unauthorized Returns processes (with an additional ODFI monitoring requirement), PLUS a NEW ACH Contact Registry verification requirement added to the annual ACH Rules Compliance Audit! Areas Covered in the Webinar: Identify the participants in the ACH network required to conduct an annual ACH Rules compliance Audit Define what the General Audit Requirements are (now in Article 1) Discussion on tools available in the Nacha Operating Guidelines for guidance when conducting the annual ACH Rules Compliance Audit. Review the flexibility for each participant when following the Guidelines, which include the ODFI, RDFI, TPSP and TPS within the Rules Book Describe “how-to” ensure Rules Compliance after determination of what ACH activities are being audited Recommended areas to check (audit) in addition during the ACH Audit Who Will Benefit: ACH Operations staff Compliance Officers Treasury professionals Third-Party Payment Processors Third-Party Senders","date_start":"2022-05-05","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}