{"name":"International Vaccines and Virology Conference (i-Vaccines)","series":"","short":"","website":"https://www.ivaccinesconference.com","content":"The International Vaccines and Virology Conference welcomes you to London on May 09-10, 2022 to share your research findings, promote knowledge exchange, and network with a broad audience in the field of microbiology and immunology. As the world focuses its lens on healthcare, the opportunity, and urgency to discover a new era of agile, patient-centric vaccines have never been greater. i-Vaccines 2022 will provide an unparalleled opportunity to network with leading academicians, practitioners, and business professionals from around the world to share the most significant advances and concerns in the field of vaccines. i-Vaccines features a comprehensive scientific program spanning a wide range of topics including Recent Research in Vaccines, Viral Diagnostics, Antiviral therapy, Cancer Vaccines and Immunotherapy, Vaccines Safety, Clinical Trials, Coronavirus Disease, Covid19 Vaccine, Novel Vaccine Delivery Method Hepatitis viruses, HIV, etc for information exchange and to harness this momentum of change in order to implement a new future shaped in the image of human needs. For more information, please visit: www.ivaccinesconference.com or mail us at info@ivaccinesconference.com. Our team will be happy to assist you. Conference Sessions: • Recent Research and Development • Disease-specific Vaccines • Coronavirus Disease • Covid19 Vaccine • Cancer Vaccines and Immunotherapy • Virology • HIV Research • Vaccines in Specific • Novel Vaccine Delivery Methods • Clinical Trials • Viral Genetics and Evolution • Viral Infections and therapy • Vaccines Safety and Ethics Who Attends • Researchers, Scientist • Microbiologists and Immunologists • Healthcare Professionals • Associations and Societies • Academia: Professors and Students • Policymakers, Influencers • Healthcare Investors • Business Professionals and Representatives • Software for Health industry & management • Key Decision Makers, Government Heads & Officials Why i-Vaccines 2022 • Sharing Knowledge with the Industry • Explore Future Business Opportunities • Meet and collaborate with Pioneers in Health Sector • Share your Products and Services with Professionals • Get the latest updates from experts to Keeping Up-to-date With Trends • Increase your knowledge base & Learn about new technology • Environment for Inspiration in Virology and Vaccine Research Proposal Deadlines Abstract Submissions Open Monday 25th of October 2021 Abstract Submission deadline Monday 4th of April 2022 Registration Deadlines Super Early Bird Registration Friday 7th of January 2022 Early Bird Registration Monday 14th of March 2022 Regular Registration Sunday 8th of May 2022","date_start":"2022-05-09","date_end":"2022-05-10","important_dates":{"abstract":"","full":"2022-04-08","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal","immunology"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["https://www.ivaccinesconference.com/"],"societies":[],"indexes":[],"emails":["info@ivaccinesconference.com"]}