{"name":"Transforming Anger and Conflict into Collaborative Problem Solving: The Stress Docs Four Faces of Anger-Model & Method","series":"","short":"","website":"https://bit.ly/3g9SEa9","content":"Today's always on, TNT – Time-Numbers-Technology/Transition – Driven & Distracted World can breed tension and conflict. Discover the Four Angry \"I\"s and the Stress Doc's \"Four Faces of Anger\" Model for transforming anger, rage, and conflict into productive dialogue and conflict resolution. Learn and practice skills and strategies for: 1) disarming power struggles by asking trust-building, \"good questions\" and 2) providing and receiving all kinds of feedback, even how to deal constructively with a critical aggressor. Understand the difference between \"acknowledgement\" and \"agreement\" and lyrically disarm or emotionally detach from \"Yes, butters\" and self-centered types. Use the Thomas-Kilmann Conflict Styles Inventory to discover your style of conflict; and learn how to engage in collaborative conflict resolution in the workplace. Learn how to appropriately and strategically use humor to disarm pressure packed situations and how to control anger and stress effectively. Why Should You Attend As a workplace becomes more \"TNT\" with ever-changing, 24/7 timeline pressure, and the workplace becomes more diverse, it is more difficult for \"message sent to be message received.\" Communication problems, interpersonal frustrations and conflicts, silo effects, and \"us vs. them\" thinking can negatively impact workplace productivity and a cohesive culture. This webinar is for anyone in an organization or company who depends on efficient and effective communication and collaboration to be productive. It is for anyone interested in managing dysfunctional conflict, learning problem solving skills and anger management strategies, and preventing unspoken or unaddressed anger to spiral in a destructive direction. This webinar will help promote a productive, inclusive, and supportive \"high task/tech and human touch\" culture. Objectives of the Presentation A world of rapid change, uncertainty, and diverse cultures/personalities can easily feed stress and uncertainty… and these can fuel anger and dysfunctional conflict. Discover the Stress Doc’s acclaimed Four Faces of Anger Model. Learn why anger may be constructive or destructive depending on motivation and communication skill level. Defuse destructive anger and power struggles through respectful, effective, and trust-building assertive communication and good listening/questioning skills. All personnel levels — from front-line employees to all levels of management will gain skills, tools, and strategies for: 1) learning to understand different anger dimensions and how to express frustration and anger in a more constructive and professional manner. Participants will gain tools and techniques for transforming conflict into more collaborative problem-solving. And teams and the organization as a whole benefit when a work culture is able to acknowledge and address difference and disagreement, anger and conflict in an open, transparent, and respectful manner. Areas Covered in the Session » Grasp the anger trigger dynamics and anger management strategies — \"The Four Angry \"I\"s » Discover the Stress Doc's \"Four Faces of Anger Model\": whether anger is constructive or destructive, purposeful or spontaneous » Take an Assertiveness Assessment Test; identify your assertive \"hot spots\" » Understand the constructive-destructive difference between assertive \"I\"s and blaming \"You\" messages; practice » Engage in mind exercises that provide tools for disarming critical aggressors and managing dysfunctional conflict; understand the array of emotional responses or reactions to feedback » Learn to disarm \"Yes, butters\" and \"passive-aggressors\" » Discover the five Thomas-Kilmann Conflict Styles for conflict resolution in the workplace; grasp the paradoxical power of collaboration and consensus » Recognize attributional bias and discover an IDEAL Model for disarming conflict Who Will Benefit » Supervisors » Managers » Leaders » Trainers » Educators » Marketers » Clergy » All industries, companies, organizations; all levels of employees and management. To Register (or) for more details please click on this below link: https://bit.ly/3g9SEa9 Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-06-29","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Management / Leadership"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["AbideEdict"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}