{"name":"The Black Arts Movement in the United States and Algeria","series":"","short":"","website":"https://www.univ-mosta.dz/fle","content":"International Conference on: “The Black Arts Movement in the United States and Algeria” 18-19 November, 2019 In the 1960s, one attended the emergence in the United States a movement that came to be known as the Black Arts Movement. According to its founders, the assimilation of the African-American would unquestionably go through loss of identity hence a quest for sovereignty. In the course of time, however, it appeared that in the absence of an international footprint, the BAM would be short-lived and sovereignty sheer utopia. At this juncture myriad African-American singers, musicians, writers, poets, playwrights, and political activists like the Black Panthers, seized the opportunity to attend the First Pan-African Festival, organized and hosted in Algiers by the OAU chairperson, Houari Boumediene. Influenced by Algeria’s War of Independence; the meeting of Algeria’s Premier Ben Bella with Dr Martin Luther King in New York and W. E. Dubois in Accra, and by one of Algeria’s adoptive sons, Franz Fanon, they undertook, once in Algiers, to report on their quest and to highlight their respective contributions with the view to win social and historical international recognition. Possible topics may include (but are not limited to): I. Segregation and Colonialism I.1\\. James Baldwin on Justice/Injustice in the Algerian Context I.2\\. Dr. Martin Luther King and Ahmed Ben Bella: “Linking Two Injustices” I.3\\. Ben Bella, W. E. Dubois and Pan-Africanism II. The Emergence of the Black Arts Movement II.1\\. Negroes with Pens: Male/Female Novelists/ Musicians/ Playwrights etc II.2\\. “Negroes with Guns”: The Black Panther Party for Self-Defense III. The Black Arts Movement in Algeria III.1\\. Connecting Roots: Algeria and the First Pan-African Festival III.2\\. Algeria’s Franz Fanon and the Coining of Black Power III.3.The Revolutionaries: The Black Panther Party in Algeria III.4.The Cultural Nationalists: Emory Douglas/ Archie Shepp/ Nina Simone etc. IV. Assessing the Role of Algeria and the Future of the Black Arts Movement IV.1\\. The Afropolitan Experience IV.2\\. Afro-Centrism IV.3\\. Afro-Futurism/ Black Panther Film/Afro-defeatism V. Assessing the 1960s and 1970s V.1\\. Have the Sixties and Seventies had an impact on today’s world? V.2\\. Is travelling back to the 1960s and 1970s but a matter of sheer nostalgia? V.3\\. Can we consider the 1960s as a short-lived turmoil or a starting point for reforms in the short and long range? V.4\\. Are the visions/expectations of the 1960s and 1970s being countered? Participants are invited to send a 250 word abstract by June 30, 2019, accompanied by a max two- page long cv to: abdeldjallil.larbiyoucef@univ-mosta.dz abbesbahous@yahoo.fr yasmina.kdjafri@gmail.com Registration fees: 200 Euros Queries: please contact: abdeldjallil.larbiyoucef@univ-mosta.dz Link: https://www.univ-mosta.dz/fle","date_start":"2019-11-18","date_end":"2019-11-19","important_dates":{"abstract":"","full":"2019-06-30","notification":"","final":""},"topics":["Arts & Humanities","History","African American Studies"],"location":{"virtual":"","full":["mostaganem","Algeria"],"name":"","street":"","city":"mostaganem","state":"","ZIP":"","country":"Algeria"},"organizers":["Université Abd el Hamid Ibn Badis"],"societies":[],"indexes":[],"emails":["abdeldjallil.larbiyoucef@univ-mosta.dz","abbesbahous@yahoo.fr","yasmina.kdjafri@gmail.com"]}