{"name":"International Conference on London Studies: \"Visions and Revisions of the Metropolis\"","series":"","short":"","website":"https://londonstudies.lcir.co.uk","content":"Since its beginnings, London has been regarded as the epitome of progress and advancement even in times of profound crisis and discord, exerting the charm of the vast setting that concentrates most, if not all, human experiences. From ancient Londinium to the 21st-century metropolis, the ever expanding urban settlement has emerged as a complex heterogeneous entity forging a particular code of conduct governed by imagination and originality, talent and vision that generate almost endless significations of the self. The conference will explore the particular spirit of the English conurbation, one of the most influential cities in the world, aiming to identify some of the features that make up its distinctive personality. It will promote an interdisciplinary perspective on the various issues related to the process of making London into a powerful centre of social, political, economic, scientific, cultural, artistic and literary authority. The conference will also focus on the distinctive symbolism of the city and the particular states of mind generated by the interaction with the insular megalopolis, and the way in which people - Londoners either by birth or adoption, as well as temporary residents and transient visitors - translate geographically recognisable sites into culturally constructed places. The main objective of the event is to bring together all those interested in examining the intersections between their professions and/or interests and some distinct aspects of metropolitan life, providing an integrated approach for the understanding of London’s complex nature as a physical space, a geographic place and a concept: an unpredictable and yet permanent city state, a global hub of learning, knowledge, leisure and creative industries, a state of mind and a lifestyle marked by cosmopolitanism and multiculturalism. Topics include but are not limited to several core issues: London ages: from prehistory to the 21st century London and the rest of Britain myths, legends and tales of the city iconic symbols and landmarks green spaces and landscapes heritage, culture and the arts gentrification and displacement the city and its people what is a Londoner? urban space and gender the language(s) of the city narrative and identity artistic representations of London metropolitan power and subversion utopian/dystopian perceptions of the metropolis urban extremes and mainstreams walking in and around the city old and new secrets of the city love and death in London fun in London, funny London the senses of London the alternative metropolis fictions and futures of the city post-Brexit London the Thames and the lost rivers of London Paper proposals up to 250 words should be sent to: londonstudies@lcir.co.uk by 31 August 2020\\. Please download paper proposal form. Presented papers will be published in a post-conference volume. Registration fee – 90 GBP","date_start":"2020-11-21","date_end":"2020-11-22","important_dates":{"abstract":"","full":"2020-08-31","notification":"","final":""},"topics":["Social Sciences","Other","Humanities"],"location":{"virtual":"","full":["Online Event","United Kingdom"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["londonstudies@lcir.co.uk"]}