{"name":"Hong Kong Institute of Asia-Pacific Studies 30th Anniversary Conference – Mobilizing Regional Collaboration in Policy Research","series":"","short":"","website":"http://www.hkiaps.cuhk.edu.hk/eng/events.asp?details=1&ItemID=E20201104&Year=0000","content":"Introduction Evidence-informed policies will not only bring solutions to current problems but also indicating the directions for future development. Governments all over the world are facing similar social issues. Through comparative studies and regional collaborations, knowledge and information can be shared and enhanced. Policy formulation and academic research create an interactive process. All of us can contribute to this process by providing inputs from academic research to policy formation, and alternatively, assessing the societal impacts of public policy. As the leading platform of interdisciplinary research and community engagement, HKIAPS brings together the policy stakeholders and researchers to thrash out the social issues. With the establishment of the Global China Research Programme and the Policy Research @ HKIAPS platform, HKIAPS has been strategically expanding its research network from Hong Kong to the rest of the world on a long-term and sustainable basis to optimize global and regional knowledge exchange. HKIAPS celebrates its 30th anniversary in 2020\\. This conference will call attention to the institute’s unremitting efforts over the past three decades in linking up different parts of the society in the intellectual accumulation and scholarly exchanges. The conference also accentuates on bridging academic research to policymaking and contribution to society. Keynote Speakers: Prof. Danny QUAH, Dean and Li Ka Shing Professor in Economics, Lee Kuan Yew School of Public Policy, National University of Singapore Prof. Jane FALKINGHAM, Dean, Faculty of Social Sciences, University of Southampton, United Kingdom Prof. CAI Fang, Vice President, Chinese Academy of Social Sciences Date: November 4–5, 2020 (Wednesday & Thursday, UTC+8 Hong Kong Time) Please refer to the poster attached for the conference rundown. Language: English This conference will be conducted via ZOOM. The webinar ID will be sent to registrants by email. Registration Link: https://cloud.itsc.cuhk.edu.hk/webform/view.php?id=11025035 Enquiries: Tel: +852 3943 6740 Email: hkiaps@cuhk.edu.hk","date_start":"2020-11-04","date_end":"2020-11-05","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Social Sciences","Political-Science","Public policy and administration"],"location":{"virtual":"","full":["Online Event","Hong Kong"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Hong Kong"},"organizers":["Hong Kong Institute of Asia-Pacific Studies, The Chinese University of Hong Kong"],"societies":[],"indexes":[],"emails":["hkiaps@cuhk.edu.hk"]}