{"name":"9th International Conference on Sustainable Tourism","series":"","short":"","website":"https://www.wessex.ac.uk/conferences/2020/sustainable-tourism-2020","content":"\\*Status Update\\* Please note that following the recent events on the Coronavirus pandemic and with the main objective to preserve the well being of our delegates, this conference will have a non-attending format. The period for submitting abstracts and papers to this conference continues to remain open. \\*\\*\\* Today tourism is an important component of development, not only in economic terms but also for knowledge and human welfare. Tourism today is an activity accessible to a growing number of people. The phenomenon has many more advantages than disadvantages. New forms of economic development and increasing wealth of human societies depend on tourism. Our knowledge of the world now includes a strong component due to tourism. Human welfare has physiological and psychological elements, which tourism promotes, both because of the enjoyment of knowing new territories and increasing contacts with near or far away societies and cultures. The tourism industry has nevertheless given rise to some serious concerns, including social costs and ecological impacts. Many ancient local cultures have practically lost their identity. Their societies have oriented their economy only to this industry. Both the natural and cultural – rural or urban – landscapes have also paid a high price for certain forms of tourism. These problems will persist if economic benefit is the only target, leading to economic gains that eventually become ruinous. It is also important to consider that visitors nowadays are increasingly demanding in cultural and environmental terms.","date_start":"2020-07-08","date_end":"2020-07-10","important_dates":{"abstract":"","full":"2020-07-07","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental","Tourism and Hospitality"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["Wessex Institute"],"societies":[],"indexes":[],"emails":[]}