{"name":"The 7th International Conference on New Energy and Future Energy Systems","series":"","short":"NEFES 2022","website":"www.intergridconf.org","content":"Conference Date: 2022.10.25-2025.10.28 Conference Website: http://www.intergridconf.org Conference Format: Hybrid of Online and Offline Conference Venue: Online via MS Teams; Offline in Nanjing The 7th International Conference on New Energy and Future Energy Systems (NEFES 2022) will take place between October 25 and 28, 2022 in an online (via MS Teams) and offline (Nanjing, China) merged format. It will be co-hosted by School of Mechanical Engineering, Southeast University. As an annual conference, NEFES 2022 will continue to provide unique platform for researchers, scientists, engineers and professionals from all over the world to present their latest research result and new ideas in terms of new energy and future energy system. The conference program will include keynote speeches, invited speeches, oral presentations and poster presentations and post-conference technical investigation. Researchers and practitioners are encouraged to submit original, unpublished contributions. The topics of interest include but are not limited to new energy resources, advanced energy technology, energy management, smart grid, energy control and storage, new energy materials. Brief Conference Program: October 25, 2022: Conference Registration (Offline); Microsoft Teams Testing (Online) October 26, 2022: Welcoming Speech, Keynote Speeches, Poster Presentations, Invited & Oral Presentations (Online & Offline) October 27, 2022: Invited & Oral Presentations (Online & Offline); Awarding Banquet (Offline Only) October 28, 2022: Field Visit (Offline Only) All accepted papers will be published on the proceedings of NEFES2022, which will be submitted to EI Compendex and Scopus for indexing. Selected full papers will be recommended to the following publications: Proceedings of the Institution of Civil Engineers - Energy (SCI) Energies (SCI)","date_start":"2022-10-25","date_end":"2022-10-28","important_dates":{"abstract":"","full":"2022-08-25","notification":"","final":""},"topics":["Engineering & Technology","Electrical/ Electronic","Energy Conservation"],"location":{"virtual":"","full":["Nanjing","China"],"name":"","street":"","city":"Nanjing","state":"","ZIP":"","country":"China"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}