{"name":"Meridian and National Endowment for the Humanities CALL FOR PAPERS: Global Humanities Symposium on Cultural Diplomacy","series":"","short":"","website":"https://www.meridian.org/announcement/meridian-and-neh-call-for-papers-global-humanities-symposium-on-cultural-diplomacy","content":"The Meridian Center for Cultural Diplomacy and the National Endowment for the Humanities invite proposals for the 2021 Global Humanities Symposium: Observing Cultural Diplomacy. The symposium will be held virtually on Friday, June 11\\. Participation is open to anyone who considers themselves early to mid-career professionals, including post-doctoral fellows, professors of practice, independent scholars, professionals outside of academia, and those in early-stage academic positions. The Global Humanities Symposium is part of the Global Humanities Initiative, a slate of programming carried out by Meridian International Center and the National Endowment for the Humanities, that seeks to amplify contemporary scholarship and scholars that focus on cultural diplomacy. For more information on this initiative, please visit our website at https://meridianculture.org/globalhumanitiesinitiative Cultural diplomacy harnesses visual art, music, literature, film, material culture, and more, resulting in individuals and communities finding common ground, forging more stable relationships, and fostering mutual respect. For the inaugural Global Humanities Symposium, the focus is on “Observe,” often one of the first, crucial steps in building bridges across cultures. Select papers presented during the symposium will be published in an edited volume. We welcome submissions that relate to the below panel topics: - Museums’ role in cultural diplomacy: surveying how museums around the world impact cultural exchange by shaping economies, urban development, politics, and social change while also being a site of contention over cultural objects, authority, and interpretation; - Culture and the Cold War: examining how American artists and art connected global citizens and leaders during the Cold War era; and - Digital public humanities: discussing innovative technologies, methodologies, and collaboration within the digital humanities field as related to cultural diplomacy scholarship. Potential focus areas include, but are not limited to: - Anthropology - Archaeology - History - Art History - Literature - Linguistics - American Studies - Philosophy Other relevant social sciences which have humanistic content and utilize relevant methods Please submit an abstract (250-300 words), along with institutional affiliation and a short biography. Submission should be sent by April 30, 2021\\. Please submit any questions to GHI@meridian.org. The Global Humanities Initiative is implemented by Meridian International Center with support from the National Endowment for the Humanities.","date_start":"2021-06-11","date_end":"","important_dates":{"abstract":"","full":"2021-04-30","notification":"","final":""},"topics":["Arts & Humanities","Other","Humanities"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["https://www.neh.gov/"],"societies":[],"indexes":[],"emails":["ghi@meridian.org"]}