{"name":"Space 4.0 : Management & Monitoring of the Environment","series":"","short":"","website":"www.SpaceTech.tugraz.at","content":"8th SpaceTech Symposium 28 June 2019, ESA ESTEC, Noordwijk, the Netherlands Space 4.0 : Management & Monitoring of the Environment Space 4.0 services from space allow for remote environmental monitoring of resources such as: § Water management and leak detection from space § Pollution management, monitoring of pipelines and spill control § Land management to sustainably manage rain forest, lumber,crops & soil § Detection of liquid resources from space As stated by the Director General of the European Space Agency, Prof. Jan Wörner's Space 4.0 represents the evolution of the space sector into a new era, characterised by a new playing field. This era is unfolding through interaction between governments, private sector, society and politics. Space 4.0 is analogous to, and is intertwined with, Industry 4.0, which is considered as the unfolding fourth industrial revolution of manufacturing and services. The Spacetech Symposia presented by TU Graz will explore, analyze and engage the audience with experts in these and related fields. Join us for the SpaceTech Symposium day, where providers of Space 4.0 services and its customers will talk about their businesses, their business models, and why management of the environment from space is here to stay. Speakers from different parts of the world will join us and share their ideas/views of the enormous potential that managing the environment from space provides for developing unique solutions. To register your interest please contact: Peter Schrotter email : peter.schrotter@tugraz.at Jose Pizarro email : jose.pizarro@esa.int","date_start":"2019-06-28","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Engineering & Technology","Other","Space science"],"location":{"virtual":"","full":["noordwijk","Netherlands"],"name":"","street":"","city":"noordwijk","state":"","ZIP":"","country":"Netherlands"},"organizers":["TUGRAZ ESA"],"societies":[],"indexes":[],"emails":["peter.schrotter@tugraz.at","jose.pizarro@esa.int"]}