{"name":"International Conference on Postcolonial Studies: “Trajectories and Transitions of (Post)colonialism”","series":"","short":"","website":"https://postcolonialism.lcir.co.uk","content":"\\*Selected papers will be published in a post-conference volume with ISBN. The conference will explore the historical and theoretical dimensions of colonial and postcolonial studies and it will focus on the impact colonialism had on political, social, economic and cultural domains. It will examine various forms of colonial domination and control as well as theories and practices of resistance. Recognising the important role of postcolonial thought and scholarship, the conference will consider colonial discourses prevalent in different parts of the world. It will look at the complexities of colonial and postcolonial subjects and identities and analyse ideologies of racial, cultural, class and gender difference. Colonial trauma and psychosocial effects of colonial domination will be discussed, as well as the concepts of authenticity, ambivalence and hybridity. The conference sessions will also address the questions of human rights, environment, neocolonialism and techno-capitalism, to name just a few. Potential topics of interest include, but are not limited to the following: History and ideologies of colonialism Capitalism and imperialism Colonial and anticolonial discourses Anti-colonial movements and theories of resistance Nation and nationalism (Post)colonialism and race (Post)colonialism and language (Post)colonialism and gender (Post)colonialism and education (Post)colonialism and religion Globalisation and postcolonialism Postcolonial subjects and identities Colonial trauma Postmodernism and postcolonialism Diaspora, multiculturalism and cosmopolitanism Postcolonialism and culinary studies Postcolonialism and human rights Indigenous studies Postcolonial spatialities, memory and remembrance (Post)colonialism and the environment (Neo)colonialism and techno-capitalism Decolonisation of knowledge Pandemic and Postcolonialism Adopting an interdisciplinary approach, we invite speakers who work in literary studies, history, philosophy, anthropology, cultural studies, linguistics, psychology, political sciences, sociology, law, economics, IT and other disciplines. Submissions may propose various formats, including: Individually submitted papers (organised into panels by the committee) Panels (3-4 individual papers) Roundtable discussions (led by one of the presenters) Posters Proposals up to 250 words accompanied by a brief biographical note should be sent to: postcolonialism@lcir.co.uk. To download the paper proposal form and find out more about the latest deadline, please visit our website: https://postcolonialism.lcir.co.uk/.","date_start":"2022-09-10","date_end":"2022-09-11","important_dates":{"abstract":"","full":"2022-05-31","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["postcolonialism@lcir.co.uk"]}