{"name":"Sexual Harassment: Managing the Critical Business, Financial & Human Resources Issues","series":"","short":"","website":"https://bit.ly/3szfNse","content":"The proliferation in the sexual harassment cases claims the costs and liabilities related to your significant business, financial, and human resources. This can hinder with the growth and can question the work and reputation of your organization. Potential claims now often exceed six-figure numbers. Imperatively, sexual harassment increases recruitment and hiring costs, absenteeism and turnover costs; it also lowers employee morale, reduces job performance, and results in lost productivity. As a result, if your company has a 6 percent profit margin, it will have to generate $1,667,000 in new sales to indemnify the costs of each sexual harassment claim or otherwise award of $100,000\\. While the financial liabilities of sexual harassment can be substantial, they represent only a part of the total cost. To the extent sexual harassment defines how your organization values its employees, your organization increasingly becomes a place to avoid. To the extent your organization accepts of sexual harassment as an incidental working condition, you tell employees, applicants, and third parties: we don’t value you. And to the extent your organization does not take immediate action to correct problems, you demonstrate that they should look for employment elsewhere. As a result, the marketplace is increasingly asking and evaluating the following critical questions: » Does the organization avoid the growing legal pitfalls to avoid sexual harassment? » Does the organization properly conduct sexual harassment and workplace investigations? » Does the organization properly weight and balance privacy issues and concerns? » Are all employees encouraged to report incidents of sexual harassment; are all supervisors and managers required to take action and report incidents? These critical issues and other important elements of an effective sexual harassment program will be discussed. Why Should You Attend With the substantial increase in the cases of sexual harassment, there is a violent growth that is seen in the amount of significant question, which the corporate world and marketplace has come up with: » Does the organization avoid the growing legal pitfalls to avoid sexual harassment? » Does the organization properly conduct sexual harassment and workplace investigations? » Does the organization properly weight and balance privacy Issues and concerns? » Are all employees encouraged to report incidents of sexual harassment? » Are all supervisors and managers required to take action and report incidents? These critical issues are other important elements of an effective sexual harassment program will be discussed. Objectives of the Presentation » To address the potential element behind the increased sexual harassment cases » To detect and prevent this element at its early stage » To emboss the employees to fight against sexual harassment and raise their voices against its tolerance » To help the employers to gain knowledge on the legal prospective to take action against these cases » What will be the effect of the laws and policies over the organization's structure? » How sexual harassment can impact the work and productivity of the organization? » How you can come over from these harassment cases? Areas Covered in the Session » Discuss the impact of sexual harassment within your organization » Define the definition and types of sexual harassment » Describe how sexual harassment affects the achievement of organizational goals » Discuss the financial impact of sexual harassment on your organization’s bottom line » Discuss the human resources impact on the planning and managing of your workforce » Play a leadership role in reducing sexual harassment Who Will Benefit » HR Professionals » Internal and external auditors » Compliance officers » Risk managers » C-suite executives » Middle and on-line managers To Register (or) for more details please click on this below link: https://bit.ly/3szfNse Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-02-15","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Human-Resources","Human Resource Management"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}