{"name":"7th International Scientific Conference on SOCIAL SCIENCES (ISCSS) 2020","series":"","short":"","website":"http://www.sgemsocial.org ","content":"The International Scientific Conference on SOCIAL SCIENCES (ISCSS) examines the nature of disciplinary and interdisciplinary scientific concepts that arise in the context of ‘real world’ applications. It also interrogates what constitutes ‘Science’ in a Social context. The focus of the papers ranges from the finely grained and empirical principles to wide-ranging multidisciplinary practices and perspectives on knowledge and method. The aim of the conference is to bring together leading academic scientists, researchers and research scholars, to exchange and share their experiences and research results on all aspects of Social Science. We aspire to provide a premier interdisciplinary platform for researchers, practitioners, and educators to present and discuss the most recent innovations, trends, and concerns as well as practical challenges encountered, and solutions adopted in the specific field. The topics the conference covers are Political Sciences, Law, Economics and Finance, Business and Management, Anthropology and Ethnology, Psychology and Psychiatry, Sociology and Social Work, Education and Educational Research, Human Geography and Development, Media and Communications, Information and Library Science, Urban Studies, Planning and Development, Cultural Studies, Digital Societies and Healthcare. All papers presented during the conference will be peer-reviewed and published in a hard copy conference proceedings that will be sent to the conference participants by request. The scientific impact factor of the event is assured by the long-established and strong connections with most of the well-known indexing databases - Clarivate Analytics ISI Web of Science /former Thomson Reuters/, CrossRef, ProQuest, EBSCO, British Library, ELSEVIER products-Mendeley, Google Scholar, and many others. We would like to invite you to share your experience and research in the field of Social Sciences with experts from all over the world.","date_start":"2020-08-23","date_end":"2020-08-27","important_dates":{"abstract":"","full":"2020-06-15","notification":"","final":""},"topics":["Social Sciences","Political-Science"],"location":{"virtual":"","full":["Albena","Bulgaria"],"name":"","street":"","city":"Albena","state":"","ZIP":"","country":"Bulgaria"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}