{"name":"5ème Colloque international sous le thème: Systèmes Socio-Écologiques : des Risques et Insécurité à la Viabilité et Résilience","series":"","short":"SES2019","website":"https://www.ceres-center.org","content":"Présentation L’une des dynamiques les plus marquantes de l’ère Anthropocène est la capacité des systèmes sociaux à interagir avec les systèmes écologiques à grande échelle et à un rythme rapide, avec une intensité accrue et des conséquences incertaines. Les sociétés humaines ont réussi à construire leurs environnements déconnectés tout en franchissant de nombreux seuils écologiques, parfois de manière irréversible. L’incapacité de ces sociétés de se percevoir comme faisant partie du système écologique, et d’agir en conséquence, est de plus en plus associée à l’émergence de risques interdépendants et complexes affectant la sécurité, la viabilité et la résilience des systèmes socio-écologiques à tous les niveaux. Ceci, à son tour, révèle continuellement notre incapacité à gérer efficacement ces risques en utilisant les mêmes systèmes de valeurs, considérés comme principale cause de leur émergence. Le Colloque international SES2019 est conçu comme une opportunité pour approfondir le débat sur les Systèmes Socio-Écologiques (SSE) à l'ère des risques et des dynamiques d'insécurité ayant d’une dimension globale et une ampleur sans précédent. L’approche consiste à : évaluer les facteurs structurels de vulnérabilité des SSE à l’ère des risques et des dynamiques d’insécurité ; identifier les domaines d’interaction, d’intégration et de synergie des SSE ; évaluer la capacité et l’incapacité des dispositifs d’intervention existants (cadres de gouvernance, référentiels conceptuels, modèles de développement et systèmes de valeurs, etc.) à renforcer la résilience et la viabilité des SSE ; et promouvoir les approches et les moyens d’action pouvant inverser les dynamiques destructrices. Les thèmes clés du Colloque sont à caractère multidisciplinaire (permettant des interactions fécondes entre plusieurs disciplines scientifiques) et d’une importance vitale pour les processus décisionnels pertinents (permettant des interactions entre les chercheurs, les experts, les praticiens et les décideurs à tous les niveaux). Publication des travaux du SES2019 Les travaux de recherche présentés lors des éditions précédentes du Colloque ont été publiés par des maisons d’édition de renommée, notamment Springer Nature, Routledge Environment & Sustainability, Laval University Press, IRD Editions, etc. Les participant(e)s au SES2019, souhaitant bénéficier de l’opportunité de publication après la tenue du Colloque, sont invité(e)s à soumettre un papier complet suite à l’acceptation de leurs résumés selon les instructions aux auteurs. La publication du papier complet reste conditionnée par l’acceptation du Comité scientifique selon les critères de qualité, de pertinence scientifique, etc. Langues du SES2019 : anglais, français et arabe","date_start":"2019-10-24","date_end":"2019-10-26","important_dates":{"abstract":"","full":"2019-06-01","notification":"","final":""},"topics":["Social Sciences","Political-Science"],"location":{"virtual":"","full":["Marrakech","Morocco"],"name":"","street":"","city":"Marrakech","state":"","ZIP":"","country":"Morocco"},"organizers":["Centre de Recherche en Environnement, Sécurité Humaine et Gouvernance (CERES)"],"societies":[],"indexes":[],"emails":[]}