{"name":"Fighting Corruption - the FCPA, Anti-Bribery Act, and OECD compliance","series":"","short":"","website":"https://www.complianceonline.com/fighting-corruption-fcpa-anti-bribery-act-and-oecd-compliance-seminar-training-80648SEM-prdsm?channel=brownwalker","content":"In recent years, scores of economies, from Britain to Brazil have followed America’s lead in tightening anti-bribery enforcement. Offences that once drew a mere reprimand now attract fines that run into hundreds of millions of dollars together with long prison terms for offending employees and managers. Bribery directly damages your business and your reputation. However your business is not the only victim. The wider losers are the government and the larger society, both of whom are severely undermined by the weakened rule of law and damaged economic and social development. As such, Governments are making anti-corruption programs an integral part of compliance. All firms, corporate or other need to have an effective compliance program wherever they operate and in whatever industry they operate in. This two-day intensive training course is a practical look at corruption, current anti- corruption practices and how to effectively comply at a level that equips participants with both a clear definition and guidelines as to how this scourge can be fought, as well as a set of detailed issues and checklists to help make setting up your own anti- corruption program doable. Learning Objectives: The objectives of this training course is to provide all staff, irrespective of whether they work in the front-, middle- or back-office, with a sound foundation how to recognize corruption and comply with anti-corruption standards. This training is provided in a practical “hands-on” manner that allows them to implement what they have learned easily and effectively the minute they return to the office. This course provides a complete structured package for learning in all main aspects of the subject of fighting corrupt practices. It will enable participants to prepare and manage the planning and implementation of the necessary control processes in their bank/ financial institution or firm. -What corruption is and how to recognize it -How to set up your own anti-corruption program and ensure compliance with both regulation, as well as international conventions -Red Flags and other warning signs that point to corrupt practices -How to implement a process that will allow you to continually improve your anti-corruption measures without overwhelming your organization -Steps you can take to better understand your global corruption risks -The need for ongoing risk assessments and review -Why third-party due diligence can make or break your program","date_start":"2020-07-27","date_end":"2020-07-28","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Law/Legal-Studies"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}