{"name":"Printing for Fabrication 2019","series":"","short":"","website":"http://www.imaging.org/print4fab","content":"Printing for Fabrication provides attendees with a comprehensive view of transformative innovations in the print ecosystem, from printing techniques and their physics to evolutions in print machinery for 2D and 3D printing to advances in printing materials, as well as applications enabled by the interplay of all these fields. If you're involved in the cross-functional world of printing, submit your research findings and ideas that support the development and success of the next wave of innovations in the print ecosystem. We look forward to welcoming you to San Francisco Bay, an area known as a hub for innovation and development! TOPICS- Complete list on the website • Fundamental Science and Technology of Printing Systems • Printing Materials and Material Interaction • 3D Printing • Digital Packaging • Printed Electronic Functionalities • Printing for Textiles and Nonwovens • Inkjet Printing onto Non-flat Objects • Printing of Biological Materials/Pharmaceuticals • Security Printing SUBMISSION OPTIONS Option 1: Journal of Imaging Science and Technology (JIST-first) Deadline: March 10, 2019 Option 2: Conference Paper or Talk Deadline: March 31, 2019 Final papers are due in electronic format by July 15, 2019\\. CALL FOR SHORT COURSES Participants have the option of attending 2- to 4-hour short courses and workshops presented on a wide range of subjects related to digital printing technologies. In addition to course proposals, we encourage instructors/experts to offer location-based and application/industry-focused classes or workshops, as well as, classes with a hands-on, practical nature, and/or non-traditional format. Submit workshop or course proposals to print4fab@imaging.org Deadline: March 14, 2019 SPECIAL EVENTS • Keynote Presentations • Frontiers in Imaging: Digital Printing for Fabrication • Printing Research Showcase for Students and Young Researchers • Student/Young Professional Event • Colleague Connections • Late Breaking News Submit speaker and session ideas and proposals to print4fab@imaging.org","date_start":"2019-09-29","date_end":"2019-10-02","important_dates":{"abstract":"","full":"2019-03-31","notification":"","final":""},"topics":["Engineering & Technology","Material/Nanotechnology"],"location":{"virtual":"","full":["San Francisco","California","United States"],"name":"","street":"","city":"San Francisco","state":"California","ZIP":"","country":"United States"},"organizers":["Society for Imaging Science and Technology (IS&T)"],"societies":[],"indexes":[],"emails":["print4fab@imaging.org"]}