{"name":"International Conference on European Studies:","series":"","short":"","website":"https://europe.lcir.co.uk","content":"\\*Selected papers will be published in a post-conference volume with ISBN. The conference aims to explore Europe from a variety of perspectives. It will consider its political, social and philosophical dimensions as well as the cultural and intellectual life of Europe. Proposals can demonstrate both national and regional expertise, refer to the past or present, or offer a comparative analysis. The main objective of the event is to bring together international scholars interested in European Studies and willing to examine intersections between their topic of interest and the broader European context. It will provide an integrated approach to the understanding of the processes within Europe. Topics include but are not limited to: Challenges and opportunities of the EU Nationalism and nativism Multiculturalism and cosmopolitanism European languages, literatures and cultures European history and philosophy Education in Europe European Law and international relations with the rest of the world European borders, migration and immigration Politics and policy-making in Europe Trade, commerce and business in and with Europe Conference languages: English, French, Italian, Spanish, Polish, Romanian, Russian. Submissions may propose various formats, including: Individually submitted papers (organized into panels by the committee) Panels (3-4 individual papers) Roundtable discussions (led by one of the presenters) Posters Paper proposals up to 250 words and a brief biographical note should be sent to: europe@lcir.co.uk. To download the paper proposal form and find out more about the latest deadline, please visit our website: https://europe.lcir.co.uk.","date_start":"2022-06-25","date_end":"2022-06-26","important_dates":{"abstract":"","full":"2022-04-30","notification":"","final":""},"topics":["Social Sciences","Political-Science","European Studies"],"location":{"virtual":"","full":["Online Event","United Kingdom"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["europe@lcir.co.uk"]}