{"name":"2021 International Conference on Biomaterials and Applications Engineering (IC-BAE 2021)","series":"","short":"","website":"www.ic-bae.org","content":"2021 International Conference on Biomaterials and Applications Engineering (IC-BAE 2021) will be held in Tokyo, Japan during Dec 15-17, 2021\\. It brings together leading academic scientists, researchers and research scholars to exchange and share their experiences and research results on all aspects of biomaterials and applications engineering (IC-BAE 2021). Prof. Alexander Korsunsky from Department of Engineering Science and Trinity College, University of Oxford, UK will be our conference chair and keynote speaker, Prof. Masaru Tanaka from Institute of Materials Chemistry and Engineering, Kyushu University, Japan will also give keynote speach. All the registered and presented papers will be published in the Journal of Biomimetics, Biomaterials and Biomedical Engineering (JBBBE), which will be Indexed in EI Compendex, Scopus, REAXYS, ESCI (Web of Science, Thomson Reuters), Inspec, and other databases for review and indexing. \\*Selected good quality or extended papers can be recommended for potential publication in Nanomaterials (ISSN 2079-4991) Impact factor: 4.324 Indexing: Scopus, SCIE (Web of Science), PubMed, PMC, CAPlus / SciFinder, Inspec, and many other databases. Special Issue \"Biomaterials and Applications Engineering (ICBAE-2021)\" Topics Biomaterials engineering Biomaterials Biomineralization Self-assembly Structural hierarchy Biohybrid artificial organs Blood-material interactions Tissue engineering Regenerative medicine Biopolymers Biomineralization Joint replacements Bone plates Bone cement Artificial ligaments and tendons Dental implants for tooth fixation Blood vessel prostheses Heart valves Skin repair devices (artificial tissue) Cochlear replacements Contact lenses Breast implants Drug delivery mechanisms Sustainable materials Vascular grafts Stents Nerve conduits Surgical sutures, clips, and staples for wound closure Pins and screws for fracture stabilization Surgical mesh Submission Deadline Before Sept 5, 2021 Notification of Acceptance On Sept 20, 2021 Registration Deadline Before Oct 1, 2021 Conference Dates On Dec 15-17, 2021 Paper submission: 1.Conference Submission System: https://cmt3.research.microsoft.com/ICBAE2021 2.Mail: icbae@isaeri.org Conference Secretary: Ms. Alice Li Tell: +852-30756685 Mail: icbae@isaeri.org Conference website: www.ic-bae.org","date_start":"2021-12-28","date_end":"2021-12-30","important_dates":{"abstract":"","full":"2021-09-05","notification":"","final":""},"topics":["Engineering & Technology","Material/Nanotechnology"],"location":{"virtual":"","full":["Tokyo","Japan"],"name":"","street":"","city":"Tokyo","state":"","ZIP":"","country":"Japan"},"organizers":["Innovative Science and Engineering Research Institute (ISERI)"],"societies":[],"indexes":[],"emails":["icbae@isaeri.org"]}