{"name":"CfP/Essachess - Journal for Communication Studies/Future of Communications and Public Relations (PR). (Re)Imagining the Role, Function and Purpose of the C","series":"","short":"","website":"https://www.essachess.com/index.php/jcs/announcement","content":"Call for Papers for volume 14, n° 1(27)/ 2021 Future of Communications and Public Relations (PR). (Re)Imagining the Role, Function and Purpose of the Communication Profession Guest editors: Ana ADI, Professor of Public Relations/Corporate Communications Quadriga University of Applied Sciences, Berlin, GERMANY e-mail: ana.adi@quadriga.eu Thomas STOECKLE, Lecturer Bournemouth University London, Analytics & Insights Partner at Dot I/O Health, UNITED KINGDOM e-mail: tstoeckle@bournemouth.ac.uk The Covid-19 pandemic has been dubbed the “golden hour for communicators”. As demand for communication services increases, questions about the role, function, ethics and loyalties of the profession become apparent. The misinformation challenges surrounding Covid-19\\[1\\] have become an infodemic alongside the health aspects of the pandemic\\[2\\], and communicators including Public Relations practitioners are called upon to address and mitigate the problem. In a political climate of increased partisanship and polarization, this will bring to the fore issues of social responsibility for organizations and communicators. If Public Relations and Communications practitioners are to be trusted advisors how can they ensure their organizational independence and move away from a “service/servant” approach? Moreover, how can communicators understand and facilitate negotiation and conversation with diverse, international, multicultural stakeholder groups when their teams are non-diverse? On the same note, how can communicators facilitate discussion at societal level on issues that are divisive and divided? What are the implications, ethical and otherwise, of the values-based approach to effective communications? This special edition is seeking contributions in English or French, either empirical or theoretical, considering the role, function and purpose of the communication profession (whether called Public Relations, strategic communication, persuasive communication, communication management) and its built-in challenges and paradoxes particularly considering the future of the profession. In doing so, contributors are invited to consider (but not limited to): - various theoretical perspectives including the interplay between modernist, post-modernist and meta-modernist views on the perceived role of the communication and Public Relations profession; - the built-in traps and paradoxes of the imagined roles of communicators from organizational advocate to persuasive strategic communicator to trusted advisor and beyond; - the historical and practical heritage of the function including its gender and diversity representation, sexism and ageism and their influence on the future of the profession and its ability to connect with diverse audiences in an inclusive manner; - the interplay between values – individual, professional, organizational and societal – and the communicator’s role in uniting and dividing; - the professionalism of Public Relations specialists/Communicators (the criteria, ethics, duties, responsibilities, rewards and punishment); - the skill sets required of Public Relations specialists/Communicators to perform an evolving role in public discourse. Important Deadlines November 30, 2020: submission of the proposal in the form of an extended abstract of maximum 2 pages. The proposal must include a list of recent references and 5 keywords. December 18, 2020: acceptance of the proposal March 15, 2021: full paper submission; April 30, 2021: reviewer’s comments to be communicated to authors May 30, 2021: submission of paper with final revisions (after revisions) July 2021: journal publication Full papers should be between 6,000-8,000 words in length. Papers can be submitted in English or French. The abstracts should be in English and French (150-200 words) followed by 5 keywords. Please provide the full names, affiliations, and e-mail addresses of all authors, indicating the contact author. Papers, and any queries, should be sent to: essachess@gmail.com Authors of the accepted papers will be notified by e-mail. \\[1\\] Pennycook, G., McPhetres, J., Zhang, Y., Lu, J. G. and Rand, D. G., 2020\\. Fighting COVID-19 Misinformation on Social Media: Experimental Evidence for a Scalable Accuracy-Nudge Intervention. Psychological Science, 31 (7), 770-780\\. \\[2\\] Cinelli, M., Quattrociocchi, W., Galeazzi, A., Valensise, C. M., Brugnoli, E., Schmidt, A. L., Zola, P., Zollo, F. and Scala, A., 2020\\. The covid-19 social media infodemic. arXiv preprint arXiv:2003.05004; Cuan-Baltazar, J. Y., Muñoz-Perez, M. J., Robledo-Vega, C., Pérez-Zepeda, M. F. and Soto-Vega, E., 2020\\. Misinformation of COVID-19 on the Internet: Infodemiology Study. JMIR Public Health Surveill, 6 (2), e18444.","date_start":"2020-11-30","date_end":"","important_dates":{"abstract":"","full":"2020-11-30","notification":"","final":""},"topics":["Arts & Humanities","Other","social communication & mass media"],"location":{"virtual":"","full":["France"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":[""],"societies":[],"indexes":[],"emails":["ana.adi@quadriga.eu","tstoeckle@bournemouth.ac.uk","essachess@gmail.com"]}