{"name":"Excel Functions and Lookup Formulas: Using VLOOKUP, HLOOKUP, MATCH, INDEX and more..","series":"","short":"","website":"https://bit.ly/3pohqak","content":"Lookup formulas are far superior to manually searching for specific data elements in a spreadsheet. VLOOKUP, HLOOKUP, INDEX and MATCH are some of the most well-known (and most useful) functions in Excel which are used to return data from other locations in worksheets. If you handle large amounts of data in Excel, this webinar will help you tremendously. This webinar is for any user of Excel who works with large amounts of data and has data in multiple worksheets. Learning about the lookup functions will allow you to match data between databases. VLOOKUP enables you to quickly and easily look for a value down a column of data and return a value from the same row in a different column. Perfect for when working with large tabular data. INDEX and MATCH work in a similar way but provide more flexibility. In just one fast-paced and informative training session, you’ll learn how to use lookup functions to let you work with your data more efficiently and gain powerful new tools to help you manipulate data and make better business decisions. Why Should You Attend If you handle large amounts of data in Excel, this webinar on how to use VLOOKUP, MATCH and INDEX will help you tremendously. The training will be delivered using Excel 2016 for Windows although for users of earlier versions, most of the functionality is available in Excel 2010 and Excel 2013\\. Objectives of the Presentation » Recognize when and why a lookup function is better than a direct cell reference » Gain comfort with the arguments of the functions presented » Utilize Excel lookup functions to become more efficient in Excel » Find alternatives to error messages when data is not available Areas Covered in the Session » Learning the arguments in the VLOOKUP function » Understanding the importance of absolute references within many lookup functions » VLOOKUP function in Excel for performing approximate matches » Simplifying multiple-field look-ups with concatenation (combining fields into a single cell) » Discovering how to use wildcards and multiple criteria within lookup formulas » Using VLOOKUP to look up data from another workbook » Learning how VLOOKUP stops looking after it finds an initial match within a list » Exploring why VLOOKUP sometimes returns #N/A instead of a desired result » Learning about the IFNA function available in Excel 2013 and later » Use the IFERROR function to display something other than an #N/A error value when VLOOKUP can’t find a match » Seeing how the HLOOKUP function enables you to perform horizontal matches » Learning why the INDEX and MATCH combination often is superior to VLOOKUP or HLOOKUP » Using the MATCH function to find the position of an item on a list » Perform dual lookups, allowing you to look across columns and down rows to cross-reference data you need » Future-proof VLOOKUP by using Excel’s Table feature versus referencing static ranges » View two worksheets from within the same workbook at the same time. Who Will Benefit » Business Owners » CEO's / CFO's / CTO's » Managers » Accountants » CPA's » Financial Consultants » IT Professionals » Auditors » Human Resource Personnel » Bookkeepers » Marketers » Anybody with large amounts of Data » Anybody who uses Microsoft Excel on a regular basis, and wants to be more efficient and productive To Register (or) for more details please click on this below link: https://bit.ly/3pohqak Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2020-12-04","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Accounting"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["AbideEdict"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}