{"name":"Introduction to European Good Pharmacovigilance Practices: 4-hr Virtual Seminar","series":"","short":"","website":"https://www.complianceonline.com/eu-gvp-practices-webinar-training-706466-prdw?channel=Brownwalker","content":"This webinar is intended for the pharmaceutical industry and associated service providers. It will provide a robust introduction to Good Pharmacovigilance Practice (GVP) in the European Economic Area, reviewing all modules of the Guidelines on GVP published by the European Medicines Agency. Why Should You Attend: The introduction of Good Pharmacovigilance Practices in Europe had a substantial impact on the conduct of pharmacovigilance activities worldwide, setting a new ‘gold standard’ for pharmacovigilance. It impacts activities conducted by departments, affiliates, service providers, distributors, etc. not only in Europe but across the globe. This webinar will provide a robust introduction to all modules of GVP, enabling the audience to understand the impact of the GVP modules throughout the pharmacovigilance landscape. The Guidelines on Good Pharmacovigilance Practices cover a wide range of topics in extensive detail, ranging from the quality systems that should support a pharmacovigilance system to the details of the pharmacovigilance system itself. Requirements apply from the date a potential marketing authorization holder applies for a marketing authorization anywhere in the European Economic Area, and also apply to all service providers providing pharmacovigilance support to a marketing authorization holder. European regulatory agencies have robust inspection GVP programs that use these Guidelines as the standard against which they inspect, with significant penalties potentially applied to marketing authorization holders found to be non-compliant. Areas Covered in the Webinar: European Guidelines on Good Pharmacovigilance Practices: Modules I through XVI Practical implementation of GVP in pharmacovigilance and quality systems Tips and hints based on practice experience Who Will Benefit: Global and European Pharmacovigilance departments Quality assurance departments responsible for managing procedures, process deviations, audits and personnel training Regulatory departments","date_start":"2021-11-04","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}