{"name":"Global Webinar on Nursing Science and Healthcare","series":"","short":"","website":"https://globalscientificguild.com/nursing","content":"Global Scientific Guild is pleased to announce Global Webinar on Nursing Science and Healthcare which will be held during December 10-12, 2021 as an online event. Global webinar on Nursing Science & healthcare will focus on the Theme: Novel Advancements in Nursing Science and Healthcare Global webinar on Nursing Science and Healthcare is a 3 day event which includes Keynote sessions, Oral Presentations, Poster presentations, Students Forums, Exhibitions. With One single registration you will get access to all sessions. All the registered participants will be provided with e-certificate for participation & presentation and e-abstract book of all accepted Abstracts. Home Page Link: https://globalscientificguild.com/nursing/ Registration Link: https://globalscientificguild.com/nursing/registration.php Key Sessions: Nursing education, nursing and healthcare, role of nurses in diseases control, public health nursing, nurses and covid-19 pandemic, diabetes nursing and gastroenterology nursing, neonatal nursing, cardiac nursing, nephrology nursing, orthopaedic nursing, nursing primary care, midwifery and womens health, nursing management, dermatology nursing, gynecology/obstetrics nurse, cancer and tumour nurse, general issues in cancer nursing, pediatric cancer nursing and care, haematology cancer nursing, critical care nursing, psychiatric nursing, veterinary nursing, nursing care and management, nurses in hospital management, midwifery nursing practice, nursing informatics, nursing research, psychiatric and mental health nursing, rehabilitation nursing, nurse protection during pandemics, clinical nursing, pediatric nursing, genetic nursing, general practice nursing, community and home health nursing, emergency and ambulatory care nursing, men in nursing, health care, risk factors in nursing and healthcare professionals, telemedicine and e-health, disaster nursing, nursing care plans, cancer medical management, women health cancer nursing, nurse practitioners, geriatric nursing, military nursing, Nursing care informatics, patient safety, oncology nursing. For More Details Contact: With Regards Sandy B nursing@gsguild.org +91 9491 456 452","date_start":"2021-12-10","date_end":"2021-12-12","important_dates":{"abstract":"","full":"2021-11-01","notification":"","final":""},"topics":["Medicine & Health","Nursing","Healthcare"],"location":{"virtual":"","full":["Online Event","India"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"India"},"organizers":["Global Scientific Guild"],"societies":[],"indexes":[],"emails":["nursing@gsguild.org"]}