{"name":"THE MAIN DETERMINANTS OF IMPROVING LEARNING OUTCOMES: Analysis of PISA, TIMSS and PIRLS data","series":"","short":"","website":"https://cimqusef.amaquen.ma","content":"Object The 18th Conference on the Quality of Education (CIMQUSEF'18) aims to determine the obstacles and levers of academic success by analysing the variables having an influence on learning outcomes in school through the world. The analysis of data from PISA, TIMSS or / and PIRLS, and the comparison of these data with the reality of the field through the study of a sample of schools must constitute the basic material of the research papers to be submitted to the conference. The proposed research work should make it possible to identify, in a systemic approach, the main determinants of academic success and to propose possible scenarios for improving the quality of the education system. Objectives The main objectives of CIMQUSEF'18 revolve around the following elements: • Understanding the factors that impact learning outcomes in the school; • Identification of the family effect and the institution effect; • Highlighting the decisive role of the teacher in improving the quality of learning; • The proposal of possible scenarios to improve the quality of the education system. Methodology The methodology to be used will combine a quantitative analysis of the data from the case study and data provided by PISA, TIMSS or / and PIRLS, and a qualitative analysis of the information collected during individual interviews and focus groups. The synergy of these two facets of the methodology and their complementarity should make it possible to exploit the multilevel analysis of PISA, TIMSS or / and PIRLS data to distinguish factors linked to the family and the socioeconomic context, from those linked to the school, and more specifically identify the decisive role of the teacher in academic success. Axes The axes foreseen within the framework of CIMQUSEF'18 cover the various disciplinary fields which concern the quality of education, including educational sciences, cognitive sciences, social sciences, human sciences, economic sciences and management sciences. Communications proposals may be of interest to the following areas of intervention: 1\\. Axis 1: The main determinants of academic success; 2\\. Axis 2: Socio-economic factors that impact learning outcomes; 3\\. Axis 3: Multilevel analysis to distinguish between the family effect, or socioeconomic context, and the institution effect; 4\\. Axis 4: Teaching practices that strengthen the teacher effect; 5\\. Axis 5: Teaching practices to improve the quality of learning; 6\\. Axis 6: Cross-analysis of data between PISA, TIMSS and / or PIRLS; 7\\. Axis 7: Comparative analysis between countries of PISA, TIMSS and / or PIRLS data. Instructions Each communication proposal must include: 1\\. Name, first name and brief biography of the author (s); 2\\. Contact details of the author (s): Email, Telephone, affiliation; 3\\. Title of the proposal; 4\\. An abstract of 500 words with a problem related to the axes of the conference; 5\\. The key words of the proposal; 6\\. Bibliography and list of references; 7\\. Identification of the conference axis in the proposal. Proposals must be submitted to the conference website (https://cimqusef.amaquen.ma), and sent to the email address: (amaquen@gmail.com) with a copy to (cimqusef18@amaquen.org), before the 21st May 2021 (midnight). No proposal will be accepted after this date. Schedule • May 21, 2021: Date of submission of proposals; • June 18, 2021: Acceptance response to applicants; • September 10, 2021: Date of submission of full texts of accepted papers (between 4000 and 6000 words); • November 10-26, 2021: Presentation of accepted papers at the conference. Useful information • Languages of the conference: English, Arabic, French; • Each oral communication should not exceed 20 minutes, followed by an exchange of 10 minutes; • The best papers will be published in the indexed journal \"The Journal of quality in education\" edited by the AMAQUEN institute, after the decision of the scientific committee.","date_start":"2021-11-10","date_end":"2021-11-26","important_dates":{"abstract":"","full":"2021-05-21","notification":"","final":""},"topics":["Education / Legal / Other","Education","Quality Management"],"location":{"virtual":"","full":[""],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":["AMAQUEN Institute"],"societies":[],"indexes":[],"emails":["amaquen@gmail.com","cimqusef18@amaquen.org"]}