{"name":"CfP: The Current Challenges of Urban Policy","series":"","short":"","website":"https://econjournals.sgh.waw.pl/KSzPP/announcement/view/38","content":"The scientific journal “Studia z Polityki Publicznej / Public Policy Studies” (http://szpp.sgh.waw.pl) published at the Collegium of Socio-Economics of the SGH Warsaw School of Economics, announces the Call for Papers for the Thematic Issue: The Current Challenges of Urban Policy Deadline for submitting proposals/abstracts of papers: March 25, 2022\\. Notification of abstract acceptance: April 4, 2022\\. Deadline for submitting manuscripts: September 15, 2022\\. The scope of this Call for Papers: The COVID-19 pandemic was and is global, but its impact is felt more acutely in urban than in rural areas. This is due to the concentration of people (population density) in a relatively small area, the use of public places such as enclosed buildings and squares by many people at the same time, and the need to travel by transport – distances in cities rarely allow the necessary distances to be covered on foot. The pandemic has resulted in the emergence of new problems that should be addressed by urban policies. Moreover, the previously diagnosed challenges related to, inter alia, counteracting spatial chaos, suburbanization, adaptation to climate change, and depopulation have meant that urban policy should take new objectives into account. They result from conditions at various levels: - International, for example, United Nations Sustainable Development Goals (2015), especially Goal 11: “Sustainable Cities and Communities.” - European related to the Pact of Amsterdam (2016), the EU Territorial Agenda (2020), and the New Leipzig Charter (2020). - National conditions reflected, for example, in the draft of Polish National Urban Policy 2030 (2022). The Thematic Issue is expected to include papers focusing on theoretical issues, comparative studies of cities from various parts of the world, empirical research, and case studies on policies in and by cities as well as towards cities (e.g., from the national level). The list of potential topics includes, but is not limited to: - Principles for urban development policy (international comparisons). - Changes in the ways of managing cities (e.g., implementation of governance, increased participation). - Challenges for urban policy arising from the experience of the COVID-19 pandemic. - Challenges for shaping urban spaces and implementing urban spatial policy (e.g., the concepts of the 15-minute city, the green city, the healthy city, the age-friendly city). - Building resilient cities, particularly in the context of the need to adapt to climate change. - Analyses concerning the phenomenon of spatial chaos and urban sprawl processes. - Challenges of digitalization in cities (e.g., implementation of the smart cities concept). Submission Procedure: The deadline for interested authors to submit paper proposals/abstracts will expire on March 25, 2022, and for the full manuscripts on September 15, 2022\\. Proposed topics should be sent to the Thematic Editors of the issue (dr Paulina Legutko-Kobus, plegut@sgh.waw.pl and dr hab. prof. ZUT Maciej Nowak, macnowak@zut.edu.pl) and the journal’s Editorial Secretary (dr Andrzej Klimczuk, aklimcz@sgh.waw.pl). Authors should submit manuscripts to the journal “Studia z Polityki Publicznej / Public Policy Studies” only via the Open Journal Systems website: https://econjournals.sgh.waw.pl/KSzPP/about/submissions Texts should be in Word (.docx) format and consist of up to a max 40 000 characters. All texts undergo a review process (double-blind peer-review). Articles are published in Open Access under the CC BY 4.0 licence (authors retain the copyright). Editing and publication of articles in “Studia z Polityki Publicznej / Public Policy Studies” journal are free of charge. Fees or Article Processing Charges (APCs) are not requested from the authors at any point of the peer review and publication. The journal is indexed, among others in the databases: BazEkon, CEEOL, CrossRef, Google Scholar, Directory of Open Access Journals (DOAJ), ERIH PLUS, Polska Bibliografia Naukowa (PBN), Lens, Dimensions, Scite, Scilit, Baidu Scholar, NAVER, KOAR, Informationsdienst Politikwissenschaft (POLLUX), International Political Science Abstracts (IPSA), J-Gate, Research Papers in Economics (RePEc), BASE, Gale Academic OneFile. Manuscripts should include the following elements: - Author(s) contact details (name and surname, institutional affiliation, city, country, e-mail address, and ORCID identifier). - Title of the paper. - Abstract: max 150 words. - 5-7 keywords. - JEL Classification Codes: 3-5 codes; codes are available here. - Main text and subtitles. - Summary. - Endnotes and references in the APA style. We encourage authors to use the article template (in Polish or in English). More information for authors is available on the journal’s website (http://szpp.sgh.waw.pl).","date_start":"2022-09-15","date_end":"","important_dates":{"abstract":"","full":"2022-09-15","notification":"","final":""},"topics":["Social Sciences","Political-Science","Urban Studies, Planning & Design"],"location":{"virtual":"","full":["Online Event","Poland"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Poland"},"organizers":["SGH Warsaw School of Economics, Poland"],"societies":[],"indexes":[],"emails":["plegut@sgh.waw.pl","macnowak@zut.edu.pl","aklimcz@sgh.waw.pl"]}