{"name":"International Conference on Ecosystems and Climate Change","series":"","short":"CECC 2021","website":"http://www.novevents.org/conference/CECC2021","content":"International Conference on Ecosystems and Climate Change (CECC 2021) Conference Date: November 26-28, 2021 Conference Venue: Xiamen, China Website: https://www.novevents.org/conference/CECC2021/ Online Registration System: http://www.novevents.org/RegistrationSubmission/default.aspx?ConferenceID=1403 Email: rolin\\_zhang@163.com International Conference on Ecosystems and Climate Change(CECC 2021) will be held during November 26-28, 2021 in Xiamen, China. This Conference will cover issues on Arid lands and Desertification,Biodiversity and Biological Conservation,Disturbance Ecology and other related fields. It dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal，please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: rolin\\_zhang@163.com Tel: +86 13264702250 QQ: 1349406763, 3025797047 WeChat: 3025797047 Twitter: conf\\_Committee Attendance Methods 1.Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Agro-ecology Arid lands and Desertification Biodiversity and Biological Conservation Biological Invasions Disturbance Ecology Ecohydrology Ecological Complexity Ecological Economics Ecological Engineering Ecological Indicators Ecological Intensification Ecological Modelling Ecosystem Creation and Restoration Ecosystem Health Ecosystem Services Ecotoxicology Fragile Ecosystems and Management Sustainability and Resilience Climate Change and Food Security Climate Prediction Observations for Long-Term Climate Monitoring Climate Change Impacts on Biodiversity Conservation and Natural Resource Climate Change and Energy: Policies, Planning & Management Climate Change and Sustainable Development Climate Change, Extreme Events and Natural Disasters Industry and Business Sector Experiences with Climate Change International Diplomacy, Climate Change and Adaptation Finance Dealing with Climate Change: Poverty and Gender Issues Climate Change Adaptation Climate Change and Technology Climate Change and Desertification Climate Change and Migration","date_start":"2021-11-26","date_end":"2021-11-28","important_dates":{"abstract":"","full":"2021-10-26","notification":"","final":""},"topics":["Life Sciences","Ecology","Climate Change"],"location":{"virtual":"","full":["Xiamen","China"],"name":"","street":"","city":"Xiamen","state":"","ZIP":"","country":"China"},"organizers":["Academic Communications"],"societies":[],"indexes":[],"emails":["_zhang@163.com"]}