{"name":"International Conference on Sports Studies","series":"","short":"","website":"https://sports.lcir.co.uk","content":"Sport has always been a significant aspect of human life. From the Olympic Games in Ancient Greece to the birth of football in the second half of the 19th century England and to contemporary sporting activities around the world, sport has always been a vital element of human activities. Sport is essential to health and happiness of people of all ages, genders, races, etc. and it needs to be studied through an interdisciplinary and international approach. This conference aims to bring together scholars from around the world to present, discuss and exchange their ideas in all relevant aspects of sport. It will provide an effective interdisciplinary platform for academics, practitioners and independent scholars to share the most up-to-date research and innovations, as well as theoretical and practical challenges emerging in the exciting field of sports studies. Topics of interest include, but are not limited to: sports and medical studies; sports law; sports and fans; sports and ethics; professional sports; amateur sports; sports and fashion; sports and gender; sports and violence; sports and literature; sports and festivals; sports and tourism; sports and environment; sports and religion; sports and communities; sports and migration; sports and philosophy; sports and sociology; sports and architecture; sports and engineering; sports and urban studies; sports and society; sports and economics; sports and communication; sports and media; sports history; sports and advertising. We invite proposals from various disciplines, including medicine, law, political studies, literature, philosophy, sociology, architecture, engineering, economics, media, communication, history, etc. Paper proposals up to 250 words and a brief biographical note should be sent by 30 April 2021 to: sports@lcir.co.uk.Please download Paper proposal form. Registration fee – 90 GBP","date_start":"2021-07-17","date_end":"2021-07-18","important_dates":{"abstract":"","full":"2021-04-30","notification":"","final":""},"topics":["Medicine & Health","Other","Healthcare"],"location":{"virtual":"","full":["Online Event","United Kingdom"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["sports@lcir.co.uk.please"]}