{"name":"Ensuring Compliance with Advertising and Promotional Requirements for Drugs and Medical Devices","series":"","short":"","website":"https://www.complianceonline.com/advertising-and-promotional-requirements-for-drugs-and-medical-devices-seminar-training-80066SEM-prdsm?channel=Brownwalker","content":"Federal regulation of the advertising and promotion of pharmaceuticals and medical devices reflects an aggressive attitude on the part of the regulators that demands, in turn, that industry be keenly aware of the legal and regulatory duties, as well as key recent trends in enforcement activities by the Federal Government. This course will explore in detail what FDA requires of drug and device firms as well as recent current hot buttons in FDA enforcement activity for the advertising arena. What’s at stake if your advertising and promotional efforts violate the law? Colossal fines – the latest was $3 Billion; criminal liability, including even prison time; and huge disruption in operations while dealing with federal probes into illegal marketing. Learning Objectives: Key goals of the conference will include learning: The basics of FDA law and regulations governing advertising and promotion, as well as sister agencies such as the Federal Trade Commission, which shares jurisdiction with FDA on certain regulated products (e.g., OTC drugs). The distinctions between labels, labeling and advertising and how that impacts FDA's powers, and How to properly position Direct-to-Consumer (DTC) promotions The Dos and Don'ts of promoting products on the internet, including social media sites such as Facebook and Twitter The perils of off-label promotion, including criminal and civil actions that have led to multi-billion dollar settlements by regulated drug companies Whether the First Amendment provides any insulation for truthful statements regarding regulated products; When disseminating medical educational materials crosses the line into improper promotion; and Key considerations on how to implement appropriate procedures and controls in your company to minimize the potential for regulatory action by the FDA or the FTC relative to promotion and advertising. Who will Benefit: Senior executives, directors, managers and those who have responsibility for implementing advertising and promotional activities, as well as those that have key collateral roles in reviewing advertising for drug and device firms, including officials from these areas within regulated companies: Sales Marketing Medical Affairs Legal Regulatory Compliance","date_start":"2021-03-18","date_end":"2021-03-19","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Engineering & Technology","Mechanical/Industrial"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}