{"name":"International Symposium on Econometrics","series":"","short":"ISE 2020","website":"https://www.marchconf.org/conference/ISE2020","content":"International Symposium on Econometrics (ISE 2020) will be held during March 13-15, 2020 in Guilin, China. This Conference will cover issues on Econometrics, Statistics, Financial engineering, Operational research and other Related Topics. It dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods in related fields. Email: workshop3@126.com Tel: +86 - 15527426990 QQ: 1349406763 WeChat: 3025797047 Publication: All the accepted papers will be published by a peer-reviewed open access journal that can ensure the widest dissemination of your published work, For more information, please contact us(workshop3@126.com). Call For Papers Econometrics Econometrics: methods and applications Econometrics, operations research and statistics Econometrics and statistics Multidimensional data analysis Financial engineering Operational research Financial mathematics and insurance Business informatics Finance: financial crises, risk management, financial markets Applied mathematics in economy, management, logistics The classical multiple linear regression model Least squares Finite-sample properties of the least squares estimator Large-sample properties of the least squares and instrumental Variables estimators Inference and prediction Functional form and structural change Specification analysis and model selection Nonlinear regression models Nonspherical disturbances Heteroscedasticity Serial correlation Models for panel data Systems of regression equations Simultaneous-equations models Estimation frameworks in econometrics Maximum likelihood estimation The generalized method of moments Models with lagged variables Time-series models Models for discrete choice Limited dependent variable and duration models Probability and distribution theory Large sample distribution theory Computation and optimization Data sets used in applications","date_start":"2020-03-13","date_end":"2020-03-15","important_dates":{"abstract":"","full":"2020-02-16","notification":"","final":""},"topics":["Business","Economics","Economics & econometrics"],"location":{"virtual":"","full":["China"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":["Engineering Information Institute"],"societies":[],"indexes":[],"emails":["workshop3@126.com"]}