{"name":"The 11th Spring World Congress on Engineering and Technology","series":"","short":"SCET 2022","website":"https://scetconf.org/conference/scet2022","content":"The 11th Spring World Congress on Engineering and Technology (SCET 2022) Conference Date: April 19-21, 2022 Conference Venue: Suzhou, China Website: https://scetconf.org/conference/scet2022/ Email: scet\\_service@163.com The 11th Spring World Congress on Engineering and Technology (SCET 2022) will be held on April 19-21, 2022 in Suzhou, China. It is composed of 3 Symposiums on the frontier topics in the engineering and technological subjects. It dedicates to facilitating the global development of engineering and technology and exploring ways in which the latest research results can be shared. Symposiums: 2022 Spring International Conference on Material Sciences and Technology (MST-S) 2022 Spring International Conference on Textile Science and Engineering (CTSE-S) 2022 Spring International Conference on Mineral Processing and Metallurgical Engineering (MPME-S) Invited Speakers Prof. Jae-Ho Jeon, Korea Institute of Materials Science, Changwon, Republic of Korea Prof. Alokesh Pramanik, School of Civil and Mechanical Engineering at Curtin University, Australia Prof. Khaled Habib, Kuwait Institute for Scientific Research (KISR), Kuwait Prof. Mohammad Azadi, Semnan University, Iran Prof. Junhui Hu, Nanjing University of Aeronautics and Astronautics, China Prof. G. H. Jain, K.K.H.A. Arts, S.M.G.L. Commerce and S.P.H.J. Science College, India Prof. Kung-Chung Hsu, Department of Chemistry, National Taiwan Normal University, China Prof. Sergei Alexandrov, Beihang University, China Publication and Presentation Part I 2022 Spring International Conference on Material Sciences and Technology (MST-S) The papers of MST-S will be published in the journal of Materials Science Forum owned by TTP publishing in Switzerland and submitted to Ei Compendex databases for indexing. Papers of MST conferences over years had been published and indexed by Ei and Scopus already. Please feel free to contact me if you have any questions about it. Materials Science Forum will not accept full paper submissions since January 15, 2022\\. If you still would like to publish the full paper, you can check another international English journal without EI indexing (CNKI & Google Scholar indexing). Abstract submission and simple attendance (without presentation) is still accepted. Part II 2022 Spring International Conference on Textile Science and Engineering (CTSE-S) 2022 Spring International Conference on Mineral Processing and Metallurgical Engineering (MPME-S) All the accepted papers of CTSE-S and MPME-S in English will be published by a peer-reviewed open access journal that can ensure the widest dissemination of your published work. You will get the hardcopy of the journal on the conference. For more information, please contact us (scet\\_service@163.com). Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: scet\\_service@163.com Tel : +86 18672346485 QQ: 741494290 1349406763 Wechat: 3025797047 Attendance Methods 1.Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by \"Optics and Photonics Journal\"(ISSN: 2160-8881), a peer-reviewed open access journal that can ensure the widest dissemination of your published work. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Fundamentals of Materials Science Materials Physics and Chemistry Mechanics of Materials Phase change of Materials Surface and Interface of Materials Texture, Structure, Defect and Performance of Materials Metallography Ceramography Polymer Materials Science Computational Materials Science Innovations in Materials Technology Design, Modeling and Simulation of Materials Materials Synthesis/Manufacturing Materials Processing Technology Welding and Joining Surface Treatments and Coatings Failure and Protection of Materials Materials Testing and Analysis Thin Film Materials and Technology Green Technology Applications of Materials Science and Technology Polymeric Materials (Plastics, Rubbers, Fibers, Coatings, etc. ) Inorganic Nonmetallic Materials (Glasses, Ceramics, Cement, etc. ) Metallic Materials (Metals and Alloys) Advanced Composite Materials Refractories and Hard Materials Nanomaterials Biomaterials","date_start":"2022-04-19","date_end":"2022-04-21","important_dates":{"abstract":"","full":"2022-03-19","notification":"","final":""},"topics":["Engineering & Technology","Material/Nanotechnology","Materials science, engineering, nanotechnology"],"location":{"virtual":"","full":["Suzhou","China"],"name":"","street":"","city":"Suzhou","state":"","ZIP":"","country":"China"},"organizers":["Academic Communications"],"societies":[],"indexes":[],"emails":["_service@163.com"]}