{"name":"Breaking the Mold: Best Practices for Mycotoxins Prevention and Control in Food","series":"","short":"","website":"https://www.complianceonline.com/mycotoxins-prevention-and-control-best-practices-webinar-training-705848-prdw?channel=Brownwalker","content":"This webinar will discuss what are Mycotoxins, classifications, contamination methods, the Regulations & Recommendations on Maximum Mycotoxin Levels, the risk management and prevention strategies to identify and control the contamination. You will learn the best agriculture practices, storage practices, dispatch and transport practices to prevent contamination. Why Should You Attend: Mycotoxins are a group of naturally occurring toxins produced by molds or fungi in grain while in the field or during storage. Typically triggered by weather extremes, these toxins can impair human health and cause economic losses in livestock. This training is aimed to enhance the knowledge and skills of food processing staff in preventing and controlling mycotoxin contamination in food and feed materials Mycotoxins are toxic secondary metabolites produced by fungi that significantly affect the quality, safety and yield of important crops for food and feed. . Mycotoxins are considered to be among the most significant food contaminants with regard to their negative impact on public health, food security and the national economy of many countries, particularly the developing ones. Mycotoxin contamination of susceptible commodities occurs as a result of environmental conditions in the field as well as improper harvesting, storage and processing operations. Areas Covered in the Webinar: Definition, Classification and Types of Mycotoxins Sources of Mycotoxins Problems caused by Mycotoxins & Toxic Levels Regulations & Recommendation's On Maximum Mycotoxin Levels Risk assessment and regulations for Mycotoxins Detections of Mycotoxins – Sampling and Detection Methods How to Prevent or Control Mould Infection and Mycotoxin Production? Good Agricultural Practices Good Hygiene Practices for Storage Operations Good Hygiene Practices for Dispatch/Delivery and Transport Operations Who Will Benefit: This webinar will provide valuable assistance to: Food Safety Professionals Farmers Laboratory directors, managers, and supervisors Quality assurance Plant Operations Production Regulatory Affairs Lab managers in food manufacturing plants Auditors who review facilities quality assurance programs Food chemists Microbiologists Documentation","date_start":"2022-03-17","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}