{"name":"10 Essential Team Needs During Crisis and Uncertainty : Keys to Encourage Engagement, Productivity and Combat Burnout","series":"","short":"","website":"https://bit.ly/3gQkoRn","content":"Many of our teams were having difficulty coping with stress and were facing burnout and mental health challenges long before COVID-19 came along. Through COVID-19 we are seeing that their stress is heightened even further, and our teams and colleagues will continue to be at risk. Research shows that failing to meet the essential needs of your team will result in burnout, mental health challenges, increased absenteeism, disengagement and lost productivity. Leaders who understand their team’s essential needs will have teams that can thrive during this uncertainty. Why Should You Attend Successful leaders know that healthy employees are a competitive edge and they know that small shifts can have a major impact. By focusing on these 10 Essential Needs, this interactive training will help you to choose the most effective strategies to help your team move forward through this crisis, minimize their negative stress symptoms and reactions, and protect their mental health now and in the future. Discover how to effectively support your team as they respond to challenges, and cope through change. Learn to choose the most effective strategies that will help your team stay engaged, balance the uncertainty, and build resilience. Objectives of the Presentation » Recognize the signs and symptoms that are signaling that your team is not coping with the uncertainty and disruption » Distinguish the 10 Essential Team Needs that must be addressed in supporting your team as they move through this uncertainty » Avoid the pitfalls of managing a team during and after crisis » Discover the 3 C’s that are vital to effective leadership Areas Covered in the Session » Leaders who understand their team’s essential needs will have teams that thrive through this challenge and those organizations that ignore those needs will struggle to be productive, service their customers, and be competitive. » Support is critical in combating mental health challenges. » Resilient people sustain successful performance and positive well-being in the face of adverse conditions. » Resiliency is created and sustained through adaptability, a sense of purpose and vision, insight, and problem-solving, and garnering support. » In the workplace, leaders can not only model resilient behaviour and attitudes, which is critical, but they can also employ strategies to meet the essential needs of their employees to encourage engagement, productivity, and resilience. Who Will Benefit » Human Resources Professionals » Health and Safety Reps » Union Reps » Supervisors, Manager, Directors (Team Leads) » Executive Directors Not-For-Profit To Register (or) for more details please click on this below link: https://bit.ly/3gQkoRn Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-02-01","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Human-Resources"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}