{"name":"HR Analytics Summit","series":"","short":"","website":"https://go.evvnt.com/566397-0?pid=4868","content":"www.hranalyticssummit.com The HR Analytics Summit will feature Senior HR Leaders looking specifically at Data-led HR Transformation and People Analytics to be held on 11th May in Central London. Typically workforce costs represent roughly a third of all company operational costs (hiring, training, attrition etc...) yet HR Analytics represents less than 5% of Analytics investment - this represents a huge waste of efficiency and the loss of competitive advantage. HR is evolving, deeper insights and a stronger connection between the workforce and the business put the HR Leaders in the perfect position to drive effective and measurable change throughout the business. The event will feature: - An end-user driven agenda featuring up to the minute topics - Engagement, diversity, metrics, culture, The future of AI within HR, Data-led HR Transformation and many more will be discussed through a mix of keynote and panel sessions - Most HR Leaders cannot take multiple days out of the office. The HR Analytics Summit is designed to cover a wide range of topics, in detail with brand new real-life implementation focussed case studies as well as 5 hours of networking discussion time - All in one intensive day! - We handpick and strictly limit the number of sponsors at the event - meaning you will meet only truly innovative and credible partners without being swarmed by salespeople. Our event operates on a 5:1 ratio of end-users to sponsors and features both formal (through coffee, breakfast and lunch) and informal networking (through Happy Hour drinks). - Industry-leading speakers from worldwide brands: Facebook, Lloyds Bank, Nestle, Vodafone, Shell, Standard Chartered, Philip Morris International, RSA Group, LEGO, Skanska and Virgin Atlantic. URLs: LinkedIn: https://go.evvnt.com/566397-2?pid=4868 Vimeo: https://go.evvnt.com/566397-3?pid=4868 YouTube: https://go.evvnt.com/566397-4?pid=4868 Prices: Standard Pass: GBP 229.0, Executive Pass: GBP 279.0 Speakers: Harvey Francis, CHRO, Skanska, Scott Smith, Global Head, Workforce Management and Analytics, Standard Chartered, Andreas Kyprianou, People Analytics, International Lead, Facebook, Jennifer Tippin, Group Director, People and Productivity, Lloyds Banking Group, Andres Garcia, People Analytics Lead, RSA Group, Mark Howarth, Director of People and Culture Analytics, Philip Morris International, Jordan Pettman, Global Head, People Data, Analytics and Planning, Nestle, Suzanne Roddie, Vice President, People Experience, Virgin Atlantic, Gerard Penning, EVP HR Downstream, Shell, Melissa Kantor, VP of People Analytics and Insights, LEGO Group, Alessandro Linari, People Analytics Lead, Vodafone Time: 08:30 - 19:00 Venue Details: 58VE, 58 Victoria Embankment, London, England, EC4Y 0DS, United Kingdom","date_start":"2021-05-11","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Human-Resources"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["HR Analytics Summit 2020"],"societies":[],"indexes":[],"emails":[]}