{"name":"Memory Studies Workshop","series":"","short":"","website":"https://memory.lcir.co.uk/memory-studies-workshop/?fbclid=IwAR1dYyiVBFv6EvHaByphC4cCB3Qcw0ICMd0INh8XHJONYGYYt2mLFwLO-6I","content":"Sigmund Freud, in his book The Interpretation of Dreams (1900), wrote: \"Our memory has no guarantees at all, and yet we bow more often than is objectively justified to the compulsion to believe what it says.\" Indeed, from a psychoanalytical perspective, we can never be certain if our perception of the past is completely accurate, yet the narrative we construct has an undeniable impact on how we define ourselves. Often we might summon up seemingly innocuous details about previous events; it's what the conscious mind fails to recollect that becomes the real object of inquiry. The very function of memory is wrapped up in mystery, as is the experiential reality of remembering, which appears closely linked with repetition. | In this webinar by Mary Wild, cinematic representations of memory will be explored, with a special focus on Freud's theory of 'screen memories' and his paper Remembering, Repeating and Working-Through(1914). The following films will be discussed (advanced viewing is optional; brief scenes will be shown): Waltz With Bashir (2008, dir. Ari Folman), Eternal Sunshine of the Spotless Mind (2004, dir. Michel Gondry), Mulholland Drive (2001, dir. David Lynch), and Memento (2000, dir. Christopher Nolan). | Mary Wild is the creator of the PROJECTIONS lecture series at Freud Museum London, applying psychoanalysis to film interpretation. Her interests include cinematic representations of mental illness, doppelgängers and the unconscious in the genres of horror, science fiction and documentary. Mary also co-hosts the Projections Podcast with Sarah Cleaver. | In order to book a place, please fill in the Booking Form and send it by 31 July 2020 to memory@lcir.co.uk. After you receive a confirmation of booking, please register on http://registration.lcir.co.uk. | Registration fee is 65 GBP.","date_start":"2020-08-17","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Arts & Humanities","Other","interdisciplinary"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["London Centre for Interdisciplinary Research and Academic LAB"],"societies":[],"indexes":[],"emails":["memory@lcir.co.uk"]}