{"name":"Invitation and Call for Papers 13th South-Eastern European Economic Research Workshop Organized by the Bank of Albania","series":"","short":"","website":"https://www.bankofalbania.org/Press/Press_Releases/Call_for_papers_13th_South-Eastern_European_Economic_Research_Workshop_5-6_December_2019_Tirana_Albania.html","content":"Invitation and Call for Papers 13th South-Eastern European Economic Research Workshop Organized by the Bank of Albania Bank of Albania has the pleasure to announce its 13th SEE Economic Research Workshop, hosted on 5 and 6 December 2019 in Tirana, Albania. Thirteen years into serving as a cooperation bridge, the workshop is intended to provide a forum for discussing latest economic and finance research, to foster exchanges of views between central bankers, academic community, market practitioners’, researchers and policymakers in the region and beyond. The workshop aims to develop long-term collaborative relationships and encourage interaction among participants in their fields of interests. In line with our tradition, the workshop is open to multidisciplinary research and welcomes theoretical and empirical contributions on central bank relevant topics. This year’s workshop will have special focus on exchange rate developments and their implications for central banks and the economy. Suggested topics We welcome theoretical and empirical contributions on following topics1: · What is driving exchange rate developments and their implications for price and financial stability; · Theoretical and empirical aspects of transmission mechanism and macro prudential policy; · Dynamics in financial innovation and implications for central banks; · Macroeconomic Models for policy analysis and forecasts; · Trade impediment, trade barriers and global capital flows, · Incorporating household and firm behavior into monetary and financial stability analysis. · New technologies, risk behavior and bank supervision. The scope of the conference is not limited to the topics listed above, and submissions on other related topics are also welcome. 1 Please note that it is also possible to participate in the workshop without presenting a paper. Submissions Authors are welcome to submit extended abstracts (300–500 words including the title, keywords, JEL classification, authors’ names and affiliation) or, preferably, full drafts of papers and a short bio, by 30 September 2019 to BoAresearchworkshop@bankofalbania.org. Please tell us in your submission whether you would like also to act as a discussant of another paper presented in the workshop. Submitted papers will be reviewed by a Selection Committee, which will notify the authors of accepted by 10 October 2019\\. Final papers and the PowerPoint Presentations should be sent no later than November 15, 2019 to BoAresearchworkshop@bankofalbania.org. Fee and Financial Support Please note that there is no fee for registration/participation. Participants from central banks and other public institutions will need to cover their own expenses. The Bank of Albania, in line with its internal guidelines, will be happy to cover accommodation costs for a limited number of accepted authors, who are in the final stages of their PhD studies. Coffee breaks and two lunches will be covered by the Bank of Albania. A social program will be also organized on the occasion of this event.","date_start":"2019-12-05","date_end":"2019-12-06","important_dates":{"abstract":"","full":"2019-09-30","notification":"","final":""},"topics":["Business","Economics","Finance"],"location":{"virtual":"","full":["tirana","Albania"],"name":"","street":"","city":"tirana","state":"","ZIP":"","country":"Albania"},"organizers":[""],"societies":[],"indexes":[],"emails":["boaresearchworkshop@bankofalbania.org"]}