{"name":"International Conference on Applied Mathematics, Modelling and Intelligent Computing","series":"","short":"CAMMIC 2021","website":"http://www.cammic.org","content":"International Conference on Applied Mathematics, Modelling and Intelligent Computing (CAMMIC 2021) will be held during March 26-28, 2021 in Guilin China. CAMMIC is organized by Academic Exchange Information Center. The aim of the conference is to provide a platform for researchers, engineers and students from industries and universities to exchange their ideas and technologies on applied mathematics, modelling and intelligent computing. All accepted conference papers will be published by Conference Publishing Services, and then submit to Ei Compendex, Scoups for retrieval. Topics include but are not limited to the following areas: Applied Mathematics Linear algebra Matrix theory Vector analysis Complex analysis Differential equation Laplace transform Fourier analysis Numerical Analysis Probability theory Mathematical Statistics Operations Research Game theory Control theory Combinatorial Mathematics Information Theory Computational Mathematics Information Theory Statistics Applications of Applied Mathematics Modelling and Simulation Simulation tools and languages Discrete event simulation Object-oriented implementation Web-based simulation Monte Carlo simulation Distributed simulation Simulation optimization Numerical Methods Mathematical modeling Agent-based modeling Dynamic modeling Continuous and discrete methods Time series analysis Complex system modeling and simulation Modeling and simulation technology application Intelligent Computing Genetic algorithm Simulated annealing algorithm Tabu search algorithm Evolutionary algorithm heuristic algorithm Ant Colony Algorithm Artificial fish school algorithm Particle swarm algorithm Hybrid intelligent algorithm Immune algorithm Rough set theory Artificial intelligence Artificial neural networks Machine learning Biocomputing DNA computing Quantum computing Intelligent calculation and optimization Fuzzy logic Pattern recognition Knowledge discovery Data mining Economic forecast Financial analysis Information security Medical diagnosis etc. Smart computing applications Other related topics Submission Methods 1.The submitted papers must not be under consideration elsewhere. 2.Please send the full paper(word+pdf) to cammic2021@163.com 3.Please submit the full paper, if presentation and publication are both needed. 4.Please submit the abstract only, if you just want to make presentations. 5.Should you have any questions, or you need any materials in English, please contact us at cammic2021@163.com","date_start":"2021-03-26","date_end":"2021-03-28","important_dates":{"abstract":"","full":"2021-03-19","notification":"","final":""},"topics":["Physical Science & Math","Mathematics","Applied Mathematics & Statistics"],"location":{"virtual":"","full":["Guilin","China"],"name":"","street":"","city":"Guilin","state":"","ZIP":"","country":"China"},"organizers":["Guangzhou Computer Society"],"societies":[],"indexes":[],"emails":["cammic2021@163.com"]}