{"name":"Stress Testing for Banks MasterClass","series":"","short":"","website":"https://glceurope.com/stress-testing-for-banks-masterclass-2-details/?utm_source=brownwalker&utm_medium=media_partner&utm_campaign=STBMC2","content":"Stress testing has become an important tool for risk management and a key part of the regulatory framework. This course discusses various approaches to generating stress scenarios, simple ‘what-if’ scenarios and simulation techniques through to the use of full structural macroeconomic models of the global economy. It will look at examples of impact on the balance sheet and P&L projections under stress scenarios. Many types of risk can be exposed by stress testing that may not be apparent using only models calibrated to recent historical data. These risks are explored by looking at potential impact on regulatory indicators under stress scenarios. Hence the impact on capital ratios is explored and also the LCR and NSFR indicators of liquidity and the impact of stress scenarios on IRRBB (interest rate risk in the banking book) and the leverage ratio. The course will also consider regulatory guidelines to stress testing and looks at regulatory stress testing exercises, for example, EBA/ECB, Bank of England and DFAST/CCAR. An innovative area of focus on the course will be on coherent approaches to risk aggregation in order to construct an economic capital number based on stressed scenarios. Participants will engage in Spreadsheet-based exercises and also role-playing exercises (live courses only) where time constraints and class sizes permit. Role-playing exercises will be used to practice engagement with a regulator, defending assumptions and responding to likely regulatory challenge.","date_start":"2021-05-25","date_end":"2021-05-26","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Finance","Banking finance fintech and regulations financial"],"location":{"virtual":"","full":["Online Event","Hungary"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Hungary"},"organizers":["GLC Europe"],"societies":[],"indexes":[],"emails":[]}