{"name":"Bacterial Endotoxin Test to Include the Latest on Low Endotoxin Recovery","series":"","short":"LER","website":"https://www.complianceonline.com/bacterial-endotoxin-test-to-include-the-latest-on-low-endotoxin-recovery-webinar-training-705433-prdw?channel=Brownwalker","content":"The webinar will review the current testing requirements as defined in the new, revised FDA guidance on Endotoxin and Pyrogen testing. It will further help attendees understand the issues surrounding the Low Endotoxin Recovery (LER) and its regulatory outcome. Why Should You Attend: The objective of this interactive webinar is to explore the new Guidance for Industry on Pyrogen and Endotoxins Testing which addresses those issues that may be subject to misinterpretation, and are not covered in compendial procedures or in the currently available Guidance documents and how they impact testing within the typical Quality Control laboratory. It will also discuss the results of Low Endotoxin Recovery (LER). Areas Covered in the Webinar: Review of the current testing requirements to include Low Endotoxin Recovery (LER) What happened to the old 87/91 LAL Guidance for Industry Document What has replaced it and why Common issues, misunderstandings and misinterpretations Determine who comprise the Agency Guidance team within this new proposed Guidance Documents supporting this new Guidance Sampling, storage, handling and pooling How does transition happen from one bacterial endotoxin test to another Determine when the Rabbit Pyrogen Test is appropriate to use in lieu of the LAL Who Will Benefit: Quality professionals Regulatory professionals Compliance professionals Manufacturing engineers Quality engineers Quality auditors Quality control personnel Microbiology specialists","date_start":"2022-06-07","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Engineering & Technology","Material/Nanotechnology"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}