{"name":"2021 Singapore Conference on Applied Psychology ‘LIVE’","series":"","short":"","website":"https://scap.ear.com.sg","content":"SCAP 2021 is moving forward with a physical event in 2021! We’re pleased to announce that 2021 Singapore Conference on Applied Psychology (SCAP 2021), organized by East Asia Research and supported by Singapore University of Technology and Design and University of Derby, will be live, in-person, in Singapore from December 9-10, 2021! Learn from the masters of Applied Psychology at the premier conference for the global Applied Psychology community. The theme for SCAP 2021 is “Psychological Well-being”. We invite researchers and practitioners from all fields of psychology research and practice to present and discuss recent innovations, trends, concerns, practical challenges encountered and the solutions adopted in the field of Applied Psychology, with a special focus on ‘Psychological Well-Being’. This can include clinical and non-clinical psychological well-being and we encourage submissions that cross disciplines, for example psychological well-being in education and the workplace. Join us for SCAP 2021 at Holiday Inn Singapore Atrium, Singapore and walk away with powerful knowledge that will empower you to forge the path for the future of Applied Psychology. Limited seating may apply. ‘BUY TICKET’ now. Don’t wait – this rate won’t last long! Due to the persistence of COVID-19, the conference will be conducted in a ‘Hybrid Format’. Participants can make oral/poster presentations onsite or send us pre-recorded video presentations and register as a ‘Virtual Presenter’. They will indicate their preferred presentation medium when they register. The ‘Early Bird Registration Deadline’ is on October 11th 2021\\. What can you expect at SCAP 2021? • Ample interaction opportunities for SCAP delegates • Top Singapore hospitality for all attending delegates • An intellectually stimulating scientific program featuring more than 100 presentations by leading researchers, teachers, and practitioners • An opportunity for East-West science and practice collaborations at SCAP Conference Papers Publishing Authors are invited to submit their full papers after the conference for inclusion in the Book Title: Applied Psychology Readings Book Subtitle: Selected Papers from Singapore Conference on Applied Psychology, 2021 to be published by Springer (2017, 2016 edition). All accepted abstracts will be published in ‘Singapore Conference on Applied Psychology 2021 Programme & Abstract Book’, ISBN:978-981-14-4815-7.","date_start":"2021-12-09","date_end":"2021-12-10","important_dates":{"abstract":"","full":"2021-06-15","notification":"","final":""},"topics":["Social Sciences","Psychology","Brain Injury, Rehabilitation, Diagnosis"],"location":{"virtual":"","full":["Singapore","Singapore"],"name":"","street":"","city":"Singapore","state":"","ZIP":"","country":"Singapore"},"organizers":["East Asia Research & University of Derby & SUTD"],"societies":[],"indexes":[],"emails":[]}