{"name":"5th International Conference ComSymbol Mediatization, New Forms of Militancy and Digitalization","series":"","short":"","website":"https://www.iarsic.com/en/appel-a-communications","content":"CALL FOR PAPERS 5th International Conference ComSymbol Mediatization, New Forms of Militancy and Digitalization Conference venue Paul Valéry University Montpellier 3, Centre Universitaire du Guesclin November 11-12, 2021, Béziers, FRANCE https://www.iarsic.com/en/appel-a-communications/ https://calenda.org/857793 Full CfP/AAC in French and English: https://www.iarsic.com/en/appel-a-communications/ https://calenda.org/857793 Themes and issues (non-exhaustive list) - Collective action, concertation with transnational networks of militants and effects of the global contamination: a communicational perspective; - Public and civic religion and religious mobilization networks. Mediatization of Muslim civic and religious activist initiatives; - Mediatization of evangelical civic and religious activist initiatives; - Digital social media and the rise of new forms of militancy; - Impact of new pathologies of augmented communication (trolling, fake news, astroturfing, etc.) on militant mobilizations; - Web 4.0 activism and global themes: gender, post-colonialism, sectarian and jihadist activism, immigration, LGBTI +, etc. ; - Religious activism and post-Internet impact; - Transnational activism: influence of the diaspora on electoral and political activity through media convergence; - Vandalism-activism relationship: media perceptions and representations; - Conflict and activism; - Media representations on activism: new rhetoric (s); Media stories on gender and women activists; - Violent vs. punishable activism in the media; - Mediatization of social activism; - Heritage and cultural activism; - Activism in the company. Managers and employees militancy: a media perspective; - Ecology and youth activism; - Activism and creative / cultural industries; - Activism, diversity and minorities; Volunteer activism, etc. Important Dates 5 Mai 2021: Submission of an abstract of approximately 350-400 words, including spaces, and five keywords. The abstract could be written in French or English. The proposal must include the name and affiliations as well as the email address of all authors. 15 Mai 2021: Notification of abstract acceptance via email 30 Juillet 2021: Submission of the full papers (6000-8000 words with references) 1st September 2021: full paper acceptance The proceedings will be published at an international recognized academic publishing and will be submitted for indexing in a number of citation indexes. Best selected papers will be published in a special issue of the journal Essachess - Journal for Communication Studies. All proposals and questions should be addressed to: essachess@gmail.com All proposals will be double blind peer reviewed. Authors of the accepted papers will be notified by e-mail. Conference organization: The organization will be hybrid in format, with the possibility of online participation via the dedicated platform. Depending on the evolution of the current Covid-19 epidemic situation and the regulations in force, the conference will be organized partially and / or entirely online. Participants will be informed as soon as new information becomes available.","date_start":"2021-11-11","date_end":"2021-11-12","important_dates":{"abstract":"","full":"2021-05-05","notification":"","final":""},"topics":["Social Sciences","Sociology","social communication & mass media"],"location":{"virtual":"","full":["Beziers","France"],"name":"","street":"","city":"Beziers","state":"","ZIP":"","country":"France"},"organizers":[""],"societies":[],"indexes":[],"emails":["essachess@gmail.com"]}