{"name":"Conflict is not Always a Bad Thing: Dealing with Workplace Conflict to Improve Performance","series":"","short":"","website":"https://bit.ly/3aD3eFQ","content":"In this HR compliance webinar attendees will learn the strategies to handle workplace conflicts with confidence and how to drive for harmony, reduced drama, and respectful communication. Also attendees will learn 13 major strategies to manage conflict, 2 models for understanding the dynamics of conflict and 9 hot buttons that can inflame conflict and what to do about it. Why Should You Attend » What impact does dysfunctional conflict have on your workplace? » High tensions, stress, and anxiety? » Reduced effectiveness, productivity, and quality? » Increased absenteeism, turnover, hostility, and possibly violence? » Is conflict displayed as outward aggression and dominance or are their issues with conflict avoidance where important issues are unresolved? Dysfunctional conflict has destructive consequences and studies show that managers spend 20 - 40% of their time resolving or dealing with conflict. The total estimated cost in US business is $259 Billion. Unresolved conflict is tied to 50% of employee turnover. Conflict that results in legal action will cost $$$’s – even if you win. What impact does negative conflict have on your company and what is the personal impact on you? Stress, insomnia, anger, resentment, depression? Do you feel trapped, bullied, taken advantage of? Do you back down or strike back when you shouldn’t? Is the drama more than you want? Dysfunctional conflict has a profoundly negative impact at almost every level of business. Fortunately there are actions you can take to turn it around. Areas Covered in the Session » Strategies to handle conflict with confidence and poise » How to drive for harmony, reduced drama, and respectful communication » Perspective on your role in conflict » Thirteen major strategies to help you manage conflict » Mediating conflict-techniques when employees are at odds » Review 2 models for understanding the dynamics of conflict » The 9 hot buttons that can inflame conflict and what to do about it » Ways managers make conflict worse » Dysfunctional behavior to watch out for based on your personality Who Will Benefit » Managers » Supervisors » Team Leaders » Employees dealing with conflict » Human Resources Professionals To Register (or) for more details please click on this below link: https://bit.ly/3aD3eFQ Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-02-03","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Management / Leadership"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["AbideEdict"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}