{"name":"The Do's and Don'ts of Record Retention and Destruction","series":"","short":"","website":"https://bit.ly/33MuwF4","content":"The failure to maintain adequate and sufficient timekeeping records under the Fair Labor Standards Act (FLSA) can result in a substantial back pay award. Under the FLSA, the burden is on the employer to maintain and preserve such records. If this burden is not properly met, courts will accept as evidence of overtime worked information provided by the employee, whose recollections about the number of hours worked will undoubtedly be much more generous than those of the employer. Also, case law has established that an employer’s failure to produce required records creates a presumption that those records would have been favourable to the plaintiff’s cause of action and detrimental to the employer’s position. Why Should You Attend This Webinar discusses the creation, management, and retention of information, records, and files (IRF). It is designed to familiarize your organization with IRF basics and to assist it in the development of coordinated and effective policies and procedures. It includes risk management and loss management issues you should consider in managing your organization’s record management activities. Objectives of the Presentation As your organization considers this important area of human resource management, it should ask the following questions: » What information, records, and files (IRF) am I required to create, collect, and maintain? » What IRF am I prohibited from creating, collecting, and/or maintaining? » What privacy issues should be considered? » Once my organization has the information and data, what do I ? should I ? do with this material? » Who should have access to this information? » Where should my organization keep it? » How long should my organization keep it? Areas Covered in the Session » An update on 2021 information, records, and files (IRF) should you create, manage, and keep » A discussion of federal law and potential changes » Critical assessment of state UI laws » Managing your organization’s IRF liabilities » Managing employment and record management issues that impact your IFR liabilities and other employment costs Who Will Benefit » HR professionals » Payroll managers » Operations managers » CFOs » Risk managers » Compliance managers » External and Internal Auditors To Register (or) for more details please click on this below link: https://bit.ly/33MuwF4 Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-06-04","date_end":"","important_dates":{"abstract":"","full":"2021-06-04","notification":"","final":""},"topics":["Business","Human-Resources"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}