{"name":"Analytical Instrument Qualification and System Validation","series":"","short":"","website":"https://www.complianceonline.com/analytical-instrument-qualification-computer-system-validation-seminar-training-80617SEM-prdsm?channel=Brownwalker","content":"Analytical equipment should be qualified, and computer systems should be validated to demonstrate suitability for their intended use. To be acceptable to regulatory authorities, electronic records must comply with 21 CFR Part 11, Annex 11 to EU GMPs and more recent data integrity guidance. Recent EU and FDA reports demonstrate that qualification, validation and electronic records are priority areas for inspection. The large number of FDA warning letters and the frequency of EU enforcement action in these areas demonstrate that companies sometimes struggle to understand or implement the regulations. This 2-day course guides attendees through equipment qualification, calibration and computer system validation processes from planning to reporting. It also explains regulatory requirements in these areas, including EU and US GMPs, as well as data integrity guidance documents from national and international regulatory bodies. The course not only ensures a full understanding of the regulations and guidelines for equipment and records but helps attendees to develop a risk-based approach to compliance. Interactive exercises will be dispersed into and between the presentations. Learning Objectives: Learn about the regulatory background and requirements for equipment qualification according to USP <1058> and computer system validation according to GAMP 5 Be able to explain the difference between equipment calibration, qualification and system validation Learn which equipment/systems need to be qualified or validated Be able to allocate equipment and systems to USP <1058> and GAMP 5 categories and to design and execute qualification/validation protocols accordingly Understand the logic and principles of instrument qualification and system validation from planning to reporting Be able to develop a qualification and validation strategy Who will Benefit: IT/IS managers and system administrators QA managers and personnel Laboratory managers and supervisors Analysts Validation specialists Software developers Regulatory affairs Training departments Documentation departments Consultants","date_start":"2022-01-12","date_end":"2022-01-13","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}