{"name":"Transforming Anger and Conflict into Collaborative Problem Solving: The Stress Doc's Four Faces of Anger - Model & Method","series":"","short":"","website":"https://bit.ly/3BDDRgU","content":"Today’s always-on, TNT – Time-Numbers-Techno-Transition – Driven & Distracted World can breed tension and conflict. Discover the Four Angry “I”s and the Stress Doc’s “Four Faces of Anger” Model for transforming anger, rage, and conflict. Learn and practice skills and strategies for 1) disarming power struggles by asking trust-building, “good questions” and 2) providing and receiving all kinds of feedback, even how to deal constructively with a critical aggressor. In particular, learn how to “meta-communicate” – providing constructive feedback in the face of dysfunctional communication. Understand the difference between “acknowledgment” and “agreement” and lyrically disarm or emotionally detach from “Yes, butter” and self-centered types. Use the Thomas-Kilmann Conflict Inventory to discover your style of conflict, and learn how to engage in collaborative conflict resolution. Learn how to appropriately and strategically use humor to disarm pressure-packed situations. » Discover anger triggers » Recognize Four Faces of Anger; why anger can be constructive or destructive » Learn key factors contributing to power struggles » Gain key strategies for disarming power struggles and critical aggressors » Discover the Thomas-Kilmann Inventory for delineating different “Conflict Styles” Why Should You Attend This training is for anyone who wants to manage their own and others anger in a more strategic and effective manner. This webinar helps attendees realize that anger does not have to be destructive; it can be channelled positively to increase energy and focus and to constructively engage with interpersonal or group conflict. This program is for leaders who want to defuse aggression and transform conflict situations into encounters that reduce status barriers and, ultimately, build trust. It’s for leaders who want to be role models for courageous and creative conflict problem-solving. Leaders and inspiring leaders will have more skills, tools, and strategies for engaging all manner of conflict directly or knowing when to call in a third party. These tools not only may defuse a challenging situation but may lead to a give-and-take communication process that actually strengthens relations. This will help facilitate a “high tech and human touch” culture. » Discover positive aspects of anger » Develop “I”-message assertiveness skills » Learn to let go of Blaming “You”-messaging » Discover why “Collaboration” is often the optimal creative conflict problem-solving style » Learn an IDEAL method for constructive and empathetic confrontation Areas Covered in the Session » Grasp the anger trigger dynamics and anger management strategies — \"The Four Angry \"I\"s » Discover the Stress Doc's \"Four Faces of Anger Model\": whether anger is constructive or destructive, purposeful or spontaneous » Take an Assertiveness Assessment Test; identify your assertive \"hot spots\" » Understand the constructive-destructive difference between assertive \"I\"s and blaming \"You\" messages; practice » Engage in mind exercises that provide tools for disarming critical aggressors and managing dysfunctional conflict; understand the array of emotional responses or reactions to feedback » Learn to disarm \"Yes, butters\" and \"passive-aggressors\" » Discover the five Thomas-Kilmann Conflict Styles for conflict resolution in the workplace; grasp the paradoxical power of collaboration and consensus » Recognize attributional bias and discover an IDEAL Model for disarming conflict Who Will Benefit » CEO » COO » HR Professionals » People Manager » Leaders » Directors » Managers » Supervisors » Business Owners To Register (or) for more details please click on this below link: [https://bit.ly/3BDDRgU ](https://bit.ly/3BDDRgU) Email: support@concordeducations.com Tel: +1-989-341-8773 » Business Consultants » Department Managers » Staff at all Levels","date_start":"2021-12-07","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Human-Resources","Business Management & Leadership"],"location":{"virtual":"","full":["New Castle","United States"],"name":"","street":"","city":"New Castle","state":"","ZIP":"","country":"United States"},"organizers":["ConcordEducations"],"societies":[],"indexes":[],"emails":["support@concordeducations.com"]}