{"name":"Autoethnography, Memoir, and Self-Disclosure in Academic Writing: Brinks and Bridges - Workshop","series":"","short":"","website":"https://life-history.lcir.co.uk/workshop","content":"Autoethnography, Memoir, and Self- Disclosure in Academic Writing: Brinks and Bridges Online Workshop 10 October 2020 12:00-15:00 (London Time UTC/GMT +1) London Centre for Interdisciplinary Research and Academic LAB This workshop offers delegates the opportunity to examine personal narrative by exploring appropriate use of autoethnography in qualitative research and focuses on the ’I’ in writing about culture. We also take a closer look at bias and different perspectives on autoethnography in academic writing. We explore research participants’ stories and experiences and how they appear in autoethnographic writing. We will also explore evocative aspects of writing the self, and the way that it encourages a reflexive approach thus embracing social, cultural, political and individual participants’ perspectives. The workshop will be led by Claude Barbre, Ph.D., L.P., Distinguished Full Professor at The Chicago School of Professional Psychology. He is Course-Lead Coordinator of the Psychodynamics Orientation, and lead faculty in Child and Adolescent Studies. Dr. Barbre served for 12 years as Executive Director of The Harlem Family Institute, a New York City school-based, psychoanalytic training program working with children and families. Author of prize-winning articles, books, and poetry, Dr. Barbre is a five-time recipient of the international Gradiva Award for “outstanding writing in psychoanalysis and the arts.” He is a Board Member at the Chicago Center for Psychoanalysis, and in private practice in Chicago. All the registered participants who will attend the workshop will receive certificates. In order to book a place, please register on http://registration.lcir.co.uk by 30 September 2020\\. Contact email: life-history@lcir.co.uk Registration fee: 45 GBP","date_start":"2020-10-10","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["London Centre for Interdisciplinary Research and Academic LAB"],"societies":[],"indexes":[],"emails":["life-history@lcir.co.uk"]}