{"name":"Asia-Pacific Conference on Engineering and Applied Sciences","series":"","short":"APCEAS","website":"http://www.apceas.org","content":"Sustainable Energy and Environmental Development The practice of environmental engineering dates back to the dawn of civilization. Ever since human beings began developing, people have had to deal with the challenges of providing clean water and disposing of solid waste and sewage. With the growth of cities and the advent of large-scale farming and manufacturing, people have also had to worry about air quality and soil contamination. Management of environmental resources to protect human health and the systems that support life are part of the biggest challenges facing modern society. In recognition of the interdisciplinary nature of these challenges, Asia-Pacific Conference on Engineering and Applied Sciences (APCEAS) provides a platform for scholars, professionals, researchers and graduate students not only to present their recent and latest researches but also to share their thoughts and to discuss the future development in, but not limited to the fields of Engineering and Applied Sciences. We invite you to join us on the 26th-28th of December, 2019 in Phuket, Thailand. Both full papers and abstracts are welcome to submit. Topics should be related but not restricted to: Topics Civil Engineering Computer Engineering and Technology Chemical Engineering Electrical and Electronic Engineering Environmental Engineering Fundamental and Applied Sciences Material Science and Engineering Mechanical Engineering Information Engineering and Technology Biological Engineering","date_start":"2019-12-26","date_end":"2019-12-28","important_dates":{"abstract":"","full":"2019-09-30","notification":"","final":""},"topics":["Engineering & Technology","Electrical/ Electronic","environmental engineering"],"location":{"virtual":"","full":["Phuket","Thailand"],"name":"","street":"","city":"Phuket","state":"","ZIP":"","country":"Thailand"},"organizers":["Higher Education Forum"],"societies":[],"indexes":[],"emails":[]}