{"name":"CfP: Re-Inventing Eastern Europe (7th Edition), Prague, Czech Republic, 13 – 14 December 2019","series":"","short":"","website":"http://euroacademia.eu/conference/7th-reinventing-eastern-europe","content":"Call for Papers 7th Euroacademia International Conference Re-Inventing Eastern Europe 30 Years from the Revolutions in Central and Eastern Europe 13 – 14 December 2019 School of International Relations and Diplomacy, Anglo-American University, Prague, Czech Republic Deadline for Paper Proposals: 1 November 2019 Conference Description: The 7th Euroacademia International Conference ‘Re-Inventing Eastern Europe’ aims to make a case and to provide alternative views on the dynamics, persistence and manifestations of practices of alterity making that take place in Europe and broadly in the mental mappings of the world. It offers an opportunity for scholars, activists and practitioners to identify, discuss, and debate the multiple dimensions in which specific narratives of alterity making towards Eastern Europe preserve their salience today in re-furbished and re-fashioned manners. The conference aims to look at the processes of alterity making as puzzles and to address the persistence of the East-West dichotomies. Not a long time ago, in 2010, a British lady was considered bigoted by Gordon Brown upon asking ‘Where do all these Eastern Europeans come from?’. Maybe, despite her concern with the dangers of immigration for Britain, the lady was right in showing that such a question still awaits for answers in Europe. The ironic thing however is that a first answer to such a question would point to the fact that the Eastern Europeans come from the Western European imaginary. As Iver Neumann puts it, ‘regions are invented by political actors as a political programme, they are not simply waiting to be discovered’. And, as Larry Wolff skillfully showed, Eastern Europe is an invention emanated initially from the intellectual agendas of the elites of the Enlightenment that later found its peak of imaginary separation during the Cold War. The Economist, explicitly considered Eastern Europe to be wrongly labeled and elaborated that ‘it was never a very coherent idea and it is becoming a damaging one’. The EU enlargement however, was expected to make the East – West division obsolete under the veil of a prophesied convergence. That would have finally proven the non-ontologic, historically contingent and unhappy nature of the division of Europe and remind Europeans of the wider size of their continent and the inclusive and empowering nature of their values. Yet still, 30 years after the revolutions in the Central and Eastern European countries, Leon Mark, while arguing that the category of Eastern Europe is outdated and misleading, bitterly asks a still relevant question: ‘will Europe ever give up the need to have an East?’ Eastern Europe was invented as a region and continues to be re-invented from outside and inside. From outside its invention was connected with alterity making processes, and, from inside the region, the Central and Eastern European countries got into a civilizational beauty contest themselves in search of drawing the most western profile: what’s Central Europe, what’s more Eastern, what’s more Ottoman, Balkan, Byzantine, who is the actual kidnapped kid of the West, who can build better credentials by pushing the Easterness to the next border. A wide variety of scholars addressed the western narratives of making the Eastern European other as an outcome of cultural politics of enlightenment, as an effect of EU’s need to delineate its borders, as an outcome of its views on security , or as a type of ‘orientalism’ or post-colonialism. Most of these types of approaches are still useful in analyzing the persistence of an East-West slope. The region is understood now under a process of convergence, socialization and Europeanization that will have as outcomes an ‘ever closer union’ where the East and the West will fade away as categories. Yet the reality is far from such an outcome while the persistence of categories of alterity making towards the ‘East’ is not always dismantled. The discourse on core-periphery, new Europe/old Europe is rather gaining increasing ground in the arena of European identity narratives often voiced by the EU. The conference aims to address globally or through case studies the diversity and change within the CEE region 30 years after the fall of the Iron Curtain. The conference is organized yet by no means restricted to the following topics: - The Agenda of the Enlightenment: Inventing Eastern Europe - Thinking Eastern Europe: Contributions to Understanding an Invented Region - Europe East and West: On the Persistence of the Division - Reviewing Alternative Modernities: East and West - Europe and the Inclusive/Exclusive Nexus - Mental Mappings on Eastern Europe - People-ing the Eastern Europeans - Geopolitical Views on the East-West Division - Post-colonial readings of Eastern Europe - Making Borders to the East: Genealogies of Othering - Europe as Seen from its East - Myths and Misconceptions on Eastern Europe - Social Causes and the Pursuit of Social Beliefs in Central and Eastern Europe - Protest and Social Change in Central and Eastern Europe - Central Europe vs. Eastern Europe - Reading the Past: On Memory and Memorialization - The Eastern European ‘Other’ Inside the European Union - Core Europe/Non-Core Europe - European Values and the Process of Europeanization of Eastern Europe as Pedagogy - Assessing Convergence in Eastern Europe - Explaining Divergence and Diversity in Eastern Europe - Central and Eastern Europe and the EU - Scenarios for the Future of Eastern Europe - Debating the End of European Solidarity - Eastern Europe and Asymmetries of Europeanization - Re-making Eastern Europe: Pushing the Easterness to the Next Border - From the Ottoman Empire to Russia: Cultural Categories in the Making of Eastern Europe - Go West! Migration from Eastern Europe and Experiences of ‘Othering’ - Explaining the Growth of Far Right Movements and Populist Parties in Eastern Europe - Lifestyles and the Quotidian Peculiarities of the Invented East - Europe and the Logic of Growth through Austerity: The Impact on Eastern Europe of the Crises - Visual Representation of Eastern Europe in Film: From Dracula to Barbarian Kings - Guidebooks for the Savage Lands: Representations of Eastern Europe in Travel Guides - Urban Landscapes in Eastern Europe - Religion and Politics in Eastern Europe - European Narratives of the Past: The Mnemonic/Amnesic Nexuses - Eastern European Literature and Authors - Changing Politics and the Transformation of Cities in Eastern Europe - Eastern Europe and Artistic Movements - Writing about the East in West - Writing about the West in East - The Eastern European ‘Other’ Inside the European Union - The Formation of European Subaltern Identities - Europe and Russia - European Diplomacy and Consensus in Foreign Policy: What Role for Eastern Europe? - Feminist & Queer Readings of Contemporary Eastern Europe - Gender Politics in CEE - Illiberal States – From Negative Determinants to a Self-Affirming Ideology and State Positioning - Anti-Immigration, Nationalism and Far Right Parties in Central and Eastern Europe - Migration Routes and New Walls in CEE - Assessing the Quality of Democracy and Convergence in the Region DEADLINE FOR 300 WORDS ABSTRACTS SUBMISSION IS 1ST OF NOVEMBER 2019 For on-line application and complete information on the event, please see: http://euroacademia.eu/conference/7th-reinventing-eastern-europe/ The 300 words titled abstract and details of affiliation can also be sent to application@euroacademia.org with the name of the conference specified in the subject line. We will acknowledge the receipt of all proposals. In case you received no confirmation in one day after applying on-line, please re-send your abstract by e-mail as well.","date_start":"2019-12-13","date_end":"2019-12-14","important_dates":{"abstract":"","full":"2019-11-01","notification":"","final":""},"topics":["Social Sciences","Political-Science","European Studies"],"location":{"virtual":"","full":["Prague","Czech Republic"],"name":"","street":"","city":"Prague","state":"","ZIP":"","country":"Czech Republic"},"organizers":["Euroacademia"],"societies":[],"indexes":[],"emails":["application@euroacademia.org"]}