{"name":"Preparing for a US FDA CGMP Compliance Audit Under 21 CFR 210, 211 and 820","series":"","short":"","website":"https://www.complianceonline.com/prepare-fda-cgmp-audit-cfr-webinar-training-706513-prdw?channel=brownwalker","content":"Recent US FDA Inspections (\"audits\") indicate the \"c\" in CGMP is a moving target – with expectations growing upward! In this webinar, learn how to use the FDA's inspection flow charts and questions, past inspections, and key elements of the CGMPs to prepare for an FDA GMP Compliance Inspection. Recognize that past results are not an accurate of future inspection results. You will learn how to incorporate industry findings into your gap analysis and remediation plan. There is an on-going major shift in the emphasis of U.S. FDA CGMP compliance inspections (audits). These changes in focus have a major impact on individual compliance objectives, efforts and measurements of success. All this affects the Agency's approach to audits and their expectations for companies. They also use GMP compliance audits to drive companies to do much of their work for them. Failure to anticipate, find and correct compliance problems before an FDA site inspection can result in unnecessary 483 Observations, possible Warning Letters, or worst, and a competitive “hit” in the marketplace. What can be expected in the weeks before the site visit, during the inspection, and post-inspection actions. Proper responses, timelines, and expected documentation. This webinar will evaluate the chief areas of an FDA CGMP compliance inspection / audit to see actual and anticipated changes in emphasis. This information will be used to add to the FDA’s inspection “model”, to provide a field-tested approach to a company’s preparation for a successful US FDA CGMP compliance inspection.","date_start":"2020-08-25","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Other","Food Science & Safety"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}