{"name":"International Offshore Development Congress","series":"","short":"IODC","website":"http://bit.ly/2C3eWYA","content":"The 1st International Offshore Development Congress (IODC) 2019 is set to be held annually in GCC and will be the region’s premier event dedicated to the offshore industry. The event is organized by Arab Association of Petroleum Professionals (AAPP) & Maarefah Energy and Advisory and Technical Committees which will take place from 28 - 29 April 2019 at the Jumeirah Etihad Towers Hotel, Abu Dhabi, United Arab Emirates. In keeping with the theme, “Delivering the Future Together to Meet Expectations” industry figures & key experts in the relevant fields will speak at the congress Technical and Panel Sessions. We are confident that IODC 2019 will be a unique event which will provide wide opportunities to address current challenges, review recent developments and identify future opportunities to advance and collaborate as industry. We have lined up a high-quality set of keynote Speakers, Panel and Technical sessions that address a broad range of topics, developments, and challenges. With special focus on current and new technology, Human Assets, reaching maximum efficiency, these sessions will feature senior industry leaders, policy makers as well as technical experts. In addition, the congress will comprehensively examine regional & international offshore developments from a specialized perspective whilst emphasizing our commitment to securing the world energy and safe grading the environment. In summary, you will have the who’s who of the industry on a single platform, less than one roof. PRICE:499-999 USD","date_start":"2019-04-28","date_end":"2019-04-29","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Engineering & Technology","Polymer/Petroleum","petroleum & petrochemicals (oil & gas)"],"location":{"virtual":"","full":["Abu Dahbi","United Arab Emirates"],"name":"","street":"","city":"Abu Dahbi","state":"","ZIP":"","country":"United Arab Emirates"},"organizers":["Maarefah Management"],"societies":[],"indexes":[],"emails":[]}