{"name":"9th International Conference on Heat Transfer and Fluid Flow (HTFF’22)","series":"","short":"","website":"https://htffconference.com","content":"9th International Conference on Heat Transfer and Fluid Flow (HTFF'22) will be delivered as a physical conference combining with the opportunity of live presentation for the people who can not travel for any reason. Attendees will be able to connect with researchers from across the globe and network in-person or virtual. The Conference Proceedings will be published with an ISSN and ISBN, indexed in Scopus and Google Scholar, and archived permanently in Portico. The 8th International Conference on Heat Transfer and Fluid Flow (HTFF’21) aims to become the leading annual conference in fields related to heat transfer and fluid flow. The goal of this fluid flow and heat transfer conference 2021 is to gather scholars from all over the world to present advances in the relevant fields and to foster an environment conducive to exchanging ideas and information. This conference will also provide an ideal environment to develop new collaborations and meet experts on the fundamentals, applications, and products of the mentioned fields. HTFF is an acronym for Heat Transfer and Fluid Flow. Topics for HTFF’21 include, but are not limited, to the following: CFD Combustion Direct Numerical Simulations (DNS) Drying Experimental Fluid Flow and Heat Transfer Heat Exchangers, Other Heat Transfer Devices Heat Transfer Enhancement Heat Pipes Non-Newtonian Fluid Flow and Heat Transfer Phase Change Phenomena Porous Media Renewable and Non-Renewable Energies Turbomachinary","date_start":"2022-07-31","date_end":"2022-08-02","important_dates":{"abstract":"","full":"2022-01-07","notification":"","final":""},"topics":["Engineering & Technology","Renewable Energy/Nuclear","heat transfer"],"location":{"virtual":"","full":["Prague","Czech Republic"],"name":"","street":"","city":"Prague","state":"","ZIP":"","country":"Czech Republic"},"organizers":["International ASET"],"societies":[],"indexes":[],"emails":[]}