{"name":"Risk Asean","series":"","short":"","website":"http://go.evvnt.com/635328-2?pid=4868","content":"Risk ASEAN is the leading conference for risk managers, institutional investors and treasury managers to discover the latest regulatory developments, product innovations and investment strategies across South-East Asia. This year, we will be discussing topics including regulatory fragmentation in the Asean region, margin reform phase V and VI, libor transition and more. To view the full programme, click here: https://www.aseanrisk.com/programme-2020 Bank and buy-side professionals working within the following industries can apply for a VIP delegate pass: - Central banks, private banks and local banks - Government departments and regulatory bodies - Corporates - Hedge funds - Pension / superannuation funds - Sovereign wealth funds - Insurance companies - Asset / investment management companies To register, click here: https://www.aseanrisk.com/book-now Sell side-professionals working within the following industries will need to pay a fee for a delegate pass into the conference, or they can enquire about our sponsorship and exhibition opportunities: - Investment banks - Software and technology vendors - Rating agencies - Exchanges - Law firms - Consultants To register or enquire, please contact Louise Lim on louise.lim@infopro-digital.com. We will also be hosting pre-conference workshops. For more details and to register, click here: https://www.aseanrisk.com/workshops For more information, please contact Louise Lim on louise.lim@infopro-digital.com URLs: Tickets https://go.evvnt.com/635328-0?pid=4868 Brochure https://go.evvnt.com/635328-3?pid=4868 Price: General Admission: THB 0.0 Time: 8:50 am - 5:35 pm Venue details: Sofitel Bangkok Sukhumvit, 189 Sukhumvit Road, Bangkok , Khet Watthana, 10110, Thailand","date_start":"2020-10-20","date_end":"","important_dates":{"abstract":"","full":"2020-10-19","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education, teaching"],"location":{"virtual":"","full":["Bangkok","Thailand"],"name":"","street":"","city":"Bangkok","state":"","ZIP":"","country":"Thailand"},"organizers":["Infopro-Digital"],"societies":[],"indexes":[],"emails":["louise.lim@infopro-digital.com"]}