{"name":"International Conference and Exhibition on Industrial Engineering and Applications","series":"","short":"","website":"https://www.olcinternational.com/industrial-engineering-2020/index.php","content":"Global industrial engineering and applications market is expected to reach US$163 billion by 2022\\. Significant increase in different industrial, production and application processes are anticipated to further drive these segments rapidly in the coming years. Further research in this field encourages different strategies to implement in industrial and production processes. To welcome and discuss global perspectives on current research and developments in industrial engineering and applications, OLC International is organizing the International Conference and Exhibition on Industrial Engineering and Applications which is scheduled to be held during July 16-17, 2020 in Krakow, Poland. The theme of the conference is “Effective Use of Applications in Industrial Units”. The conference aims to foster collaborations and to develop cooperation between a wide range of academic and industry professionals from related segments and provide a learning opportunity for all the participants with the inclusion of advanced topics of discussion in this growing field. Scientists, researchers, students, and industry professionals will join together this event to unveil groundbreaking research projects. The field of industrial engineering is experiencing a rapid change with the advent of new technologies and is entering new era of innovation. This meeting provides wonderful opportunities for the participants to hear from leaders in their field and network with an international array of experts. The conference program includes keynote presentations, plenary talks and inspiring oral and video presentations which cover different aspects of subject and theme of this conference while the concurrent exhibition and workshops offer a technical know-how of recent discoveries. We anticipate this conference will offer the best learning experience for all the participants and opens new doors of opportunity in their research.","date_start":"2020-07-16","date_end":"2020-07-17","important_dates":{"abstract":"","full":"2019-12-20","notification":"","final":""},"topics":["Engineering & Technology","Mechanical/Industrial","industrial engineering & design"],"location":{"virtual":"","full":["Krakow","Poland"],"name":"","street":"","city":"Krakow","state":"","ZIP":"","country":"Poland"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}