{"name":"Case Management Boot Camp: Strategies for Success in the Acute Care Setting and Beyond!","series":"","short":"","website":"https://www.complianceonline.com/case-management-boot-camp-seminar-training-80486SEM-prdsm?channel=Brownwalker","content":"Please join us for this intense one-day program that will give you the skills to succeed as a case manager or social worker in the new era of value-based reimbursement and accountable care. The world of healthcare is changing so rapidly and so is the role of case management in that world! Whether you are reading or hearing about value-based reimbursement, the Affordable Care Act, the continuum of care, bundled payments, transitions in care, or accountable care organizations, case management is at the center of it all! Because things are changing so rapidly, it can be a challenge to stay current and knowledgeable in the issues that most greatly impact your role as an acute care case manager or social worker. Reimbursement has changed dramatically as has utilization management, transitional planning and compliance. The Centers for Medicare and Medicaid Services (CMS) has incorporated changes that impact on payments related to readmissions, length of stay and cost of care. Who is in a better place to address these issues than case managers and social workers! Finally, how do you measure your impact on the cost and quality of care and the reimbursement your organization receives for that care? All these topics and more will be covered in this jam-packed one-day program. The day will start with an overview of the state of the art in case management today, how we got here, and where we are going in the future. From there we will discuss the often-confusing subject of all the roles that occur in best practice departments. Learning Objectives: Understand the history of case management, the current state, and directions for the future. Describe contemporary case management roles and models. Review the role of utilization management in an era of value-based purchasing. Discuss how transitional planning can be done most effectively in the new healthcare environment. Ensure that you and your case management department are maintaining compliance. Understand the outcome measures you will need to measure the success of you and your case management department. Who will Benefit: Coordinator Utilization Management/Case Management Account Management/Executive Administrative Director Care Management Population Health Analyst Clinical Documentation & Care Coordination Appeals Manager Patient Care Services and Logistics Clinical Documentation Continuum Care Management Integrated Care Delivery Medical Director Hospitalists Medical and Academic Affairs Medical Officer Clinical & Quality Services Family Medicine","date_start":"2021-11-08","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}