{"name":"Intergenerational Solidarity at the Beginning of the 21st Century","series":"","short":"","website":"https://www.mdpi.com/journal/genealogy/special_issues/intergenerational_solidarity","content":"Call for Papers: “Intergenerational Solidarity at the Beginning of the 21st Century” Special Issue of “Genealogy” journal (https://www.mdpi.com/journal/genealogy/special\\_issues/intergenerational\\_solidarity) Deadline for manuscript submissions: 30 May 2022 Special Issue Information: The year 2022 marks the twentieth anniversary of developing an active ageing framework that coincides with the twentieth anniversary of the United Nations Second World Assembly on Ageing (UN 2002) and the adoption of the Madrid International Plan of Action on Ageing (MIPAA). In 2022, the fourth review and appraisal of the MIPAA implementation will take place at the national, regional, and local levels of governance. Moreover, 2022 is also crucial due to the tenth anniversary of organizing the European Year for Active Ageing and Solidarity between Generations in the European Union (EY2012). One of the core ideas behind that initiative was to integrate activities of various stakeholders at all levels and to redesign public policies (EC 2012). This European Year was aimed not only at underlining the potentials of older people and fostering their active participation in society and the economy. The EY2012 initiative also highlighted the need for future-oriented thinking, planning, and mobilizing relevant actors around building intergenerational solidarity. Intergenerational solidarity could be understood as an expression of unconditional trust between members of the same or different generations that is also the attitude that assumes that “one generation should do something” for other generations (Lüscher et al. 2017). The EY2012 was targeted at including such an approach to legislation, the use of structural and cohesion funds, research and innovation, and supporting national policymakers by coordinated strategies and mutual learning projects. However, the term “intergenerational solidarity” is not even getting close to being as popular as notions “active ageing” and “healthy ageing” (see Google Books Ngram Viewer 2021). This state of affairs is also visible in the recent developments in the field of ageing policies (public policies on ageing). For example, the European Commission focuses on disseminating a rights-based approach and fostering equal access to the services related to active ageing within the European Pillar of Social Rights (EPSR) (EP, CEU, EC 2017; EC 2021b). EPSR is closely combined with implementing the United Nations framework of the Sustainable Development Goals (SDGs) (UN 2015). Also, recently, by publishing Green Paper on Ageing (EC 2021a), the European Commission underlined the importance of rights and investments related to the stimulation of active ageing. On the other hand, the United Nations General Assembly in December 2020 proclaimed the Decade of Healthy Ageing (2021–2030) (WHO 2020). We may risk the statement that all of these latest documents are no longer considering intergenerational solidarity as one of the main goals for public interventions but as one of the core values and guiding principles in supporting health and well-being for all people. This Special Issue aims to underline that intergenerational solidarity should not be narrowed down only to health care and social care sectors. Generations are not only age groups but also socio-cultural and economic formations. Moreover, intergenerational solidarity in broad understanding also refers to improving the distribution of resources between the generations in the context of various social security and welfare state institutions. It also calls attention to minimizing the risk of inequalities and conflicts related to the economic consequences of population ageing, sustainability issues (ecology and public finances), and generational changes of cultural values (Klimczuk 2017). Intergenerational solidarity is not only related to a number of demographic processes such as population ageing, migrations, and progressive depopulation but also to the topics of challenges of democratic order, climate change, new pandemics, new resource wars, unemployment induced by digitalization and automatization, and diversifying the skills and education of generations. This Special Issue will focus both on theoretical and empirical findings, including the conceptual issues and evaluation of results and achievements of activities related to international, national, and regional initiatives and policies in the field of ageing and intergenerational solidarity. Potential topics for papers include, but are not limited to: - A critical review of the ageing policy concepts (such as healthy ageing, active ageing, creative ageing, ageing in place, and intergenerational policy). - Governance and management of ageing and intergenerational policies. - Social, health, and technological innovation in the context of intergenerational relationships. - The development and dissemination of lifelong learning, volunteering, mentoring programs, and intergenerational programs. - Co-design, co-creation, and co-production schemes in the field of ageing and intergenerational policies. - The challenges of establishing age-friendly environments, cities, and communities. - Intergenerational relationships in the alternative economic models such as the silver economy, longevity economy, social economy, circular economy, green economy, and sharing economy. Manuscript Submission Information: “Genealogy” is an international peer-reviewed open access quarterly journal published by MDPI. - Submission form: https://susy.mdpi.com/user/manuscripts/upload/?journal=genealogy - Instructions for Authors: https://www.mdpi.com/journal/genealogy/instructions - Article Processing Charges (APC) Information (including discounts and waivers): https://www.mdpi.com/apc - Institutional Open Access Program (IOAP): https://www.mdpi.com/ioap","date_start":"2022-05-30","date_end":"","important_dates":{"abstract":"","full":"2022-05-30","notification":"","final":""},"topics":["Social Sciences","Political-Science","Economics & Business Management"],"location":{"virtual":"","full":["Online Event","Switzerland"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Switzerland"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}