{"name":"Statelessness in International Relations: Causes, Consequences and Future Directions","series":"","short":"","website":"http://www.ags.edu/news/ags-annual-conference/2020","content":"The American Graduate School in Paris (AGS) is now accepting paper submissions for its 2020 International Graduate Student Conference on the theme: Statelessness in International Relations: Causes, Consequences and Future directions Theme and objectives A stateless person, according to Article 1 of the 1954 Convention relating to the Status of Stateless Persons “is not considered a citizen by any state under its laws.” Most of us around the globe may take for granted our “jus soli” (right of soil,) but there are over 10 million stateless people around the world who have no guarantee of rights, liberties or belonging. Moreover, their children will likely inherit the same condition of living without legal identity and access to everyday socioeconomic basics further perpetuating a vicious cycle which will inevitably lead to a global crisis. Statelessness, “a profound violation of an individual’s human rights,” can occur for several reasons including discrimination against a particular ethnic or religious group, on the basis of gender, due to the emergence of new States, as a result of territory-transfers between existing States, gaps in nationality laws. Whatever the cause may be, statelessness has serious consequences for people affected by it in almost every region of the world. Earl Warren, late US Supreme Court Justice called Statelessness “a form of punishment more primitive than torture.” Created in a moment in history, statelessness can affect generations to follow if action is not taken for these disenfranchised people. Statelessness, however, can also be resolved in a single moment. The # IBelong Campaign of the UNHCR seeks to end statelessness by 2024 although solutions to this daunting issue of marginalization and invisibility remain complex and far from fulfilment. The painful politics of “non-belonging” continues. In an attempt to discuss the various causes, consequences and solutions of statelessness, this one-day conference will bring together inquisitive minds - graduate, postgraduate, senior undergraduate students, practitioners (from NGOs, government agencies and IGOs) and concerned citizens of the world to brainstorm the issue from multiple angles - political, economic, social, cultural, legal and philosophical. Participation on panels is selective. Attendance is open to all. For consideration to present on panels, your paper must be related to the field of International Relations and Diplomacy. Possible themes surrounding Statelessness are: Definitions, Meanings and Interpretations Causes, Consequences and Solutions Describing, Prescribing, Predicting Theoretical Underpinnings Quantitative and Qualitative Data Identity and Nationality Human Rights Gender Discrimination Rights of a Child Migrants and Naturalization Politics of Marginalization National and International Law Global Governance and Role of NGOs State Succession This conference is organized by graduate students enrolled in the American Graduate School’s PhD and MA programs in International Relations and Diplomacy in partnership with Arcadia University. It is coordinated by Terré Lundy (PhD Candidate 2023) and the Graduate Student Association under the faculty supervision of Professor Ruchi Anand. Selected conference papers will be published in the Journal of International Relations, Peace Studies, and Development, an online, open-source, peer-reviewed academic journal published jointly by Arcadia University and the American Graduate School in Paris (https://scholarworks.arcadia.edu/agsjournal/). Date and location The AGS International Graduate Student Conference will take place on Friday, April 24th, 2020 in Paris, from 9 am to 6 pm. It will be held at the American Graduate School in Paris, in the 6th arrondissement, a five-minute walk from the Luxembourg Gardens and the French Senate. The conference will be followed by a reception. Who can submit This is a conference intended for graduate students, but senior undergraduates with faculty, professor, academic or professional recommendation (from fields relating to the conference theme) may also apply. How to submit Abstracts should be 200 to 350 words and submitted electronically to conference@ags.edu as an attachment (Microsoft Word or PDF). The subject line should include the name of the candidate as well as “AGS Conference Abstract Submission.” Please also give a potential, if not finalized, a title for your paper/presentation. In addition, please include the following: • Research topic/ topic of your paper, methodology (if applicable) • University affiliation (degrees earned and those in the process of concentration and completion) • Professional affiliation (if applicable) • Prior conference presentation experience (if applicable) • Letter of reference from institution faculty (required for senior undergraduate students) Full papers are not necessary but highly suggested before the final presentation. Note that for submissions selected for publication in the Journal of International Relations, Peace Studies, and Development, a completed draft will be required two weeks after the conference. Submission deadlines • Abstract: 23 February 2020 • Working draft (suggested, not required): 21 April 2020 Fees and Conditions Fees All accepted candidates will be required to pay a non-refundable 50-euro registration fee (payable at www.ags.edu/payment-online/login.php) that will help pay for organizational and administrative costs. Fees are due from accepted candidates within 10 days of receiving the acceptance letter. Attendance of those who do not present a paper is free. Snacks and meals may be consumed at an additional charge. This fee does not cover personal costs to the applicant, such as transportation, accommodation, etc. Visa The conference committee may provide visa letters upon request to accepted candidates and moderators. In addition to verifying attendance at the conference, candidates may be asked to sign a visa liability agreement and provide a letter of attestation from their school. Please note that participants are responsible for fulfilling the visa procedure according to their home country’s rules and regulations in connection to entering France. Housing and transportation For information on housing and transportation to the venue, please go to www.ags.edu/conference/practical info Contact For any questions about the conference, please feel free to contact Terré Lundy or GSA conference@ags.edu by email or by correspondence: Graduate Student Conference Committee American Graduate School in Paris 101, Boulevard Raspail 75006 Paris, France +33 (0)1 47 20 00 94 Email: conference@ags.edu","date_start":"2020-04-24","date_end":"","important_dates":{"abstract":"","full":"2020-02-23","notification":"","final":""},"topics":["Social Sciences","Political-Science","political science"],"location":{"virtual":"","full":["Paris","France"],"name":"","street":"","city":"Paris","state":"","ZIP":"","country":"France"},"organizers":["Arcadia University, Banque Populaire"],"societies":[],"indexes":[],"emails":["conference@ags.edu"]}