{"name":"Successfully Dealing with Difficult People: The 5 Most Difficult Types of People and How to Effectively Approach Them","series":"","short":"","website":"https://bit.ly/3oZxU9Q","content":"How can you resolve conflicts less painfully, delegate critical tasks more efficiently, energize your employees and transform resistance into support? Adjusting your management and personal styles to complement the culture of your work group and your company as a whole can be the catalyst that motivates your teams to heightened productivity. Utilizing extensive practice in the principles of emotional intelligence, Successfully Dealing with Difficult Peoplecourse underscores the importance of self-awareness in developing sensitivity to and better communication with others. Why Should You Attend » Would you benefit by understanding how to even more effectively motivate and direct the people you rely on? » Would you like to be better at delegating? » How about an opportunity to understand how to turn difficult people and poor performers into team players? If you answered “yes” to any of these questions, then come laugh, listen and learn as Chris DeVany leads us all through those important topics, key questions and answers we all need to be able to address effectively to improve our team members’ and team’s performance! Objectives of the Presentation » Motivate and direct the employees you rely on—even when they don’t share your values » Adjust your management and personal style to the needs of different situations » Get more done by using the appropriate delegation techniques for any given situation » Resolve conflict more effectively in a wide variety of situations » Turn difficult people and poor performers into team players » Win the cooperation and trust from everyone in your organization » Increase your confidence, leadership skills and personal and professional satisfaction in your job » Use coaching to guide and direct your team members to improving performance Areas Covered in the Session » Use coaching to guide and direct your team members to improving performance. Who Will Benefit » CEO » Senior Vice President » Vice President » Executive Director » Managing Director » Regional Vice President » Area Supervisor » Manager To Register (or) for more details please click on this below link: [https://bit.ly/3oZxU9Q Email: support@concordeducations.com Tel: +1-989-341-8773](https://bit.ly/3oZxU9Q)","date_start":"2022-01-19","date_end":"","important_dates":{"abstract":"","full":"2022-01-19","notification":"","final":""},"topics":["Business","Human-Resources","Business Management & Leadership"],"location":{"virtual":"","full":["New Castle","United States"],"name":"","street":"","city":"New Castle","state":"","ZIP":"","country":"United States"},"organizers":["ConcordEducations"],"societies":[],"indexes":[],"emails":["support@concordeducations.com"]}