{"name":"Media Studies: New Media Art (Online)","series":"","short":"","website":"http://media.lcir.co.uk/new-media-art-online-course","content":"Media Studies - New Media Art - Online Course | Course dates: 3-28 August 2020 | The course comprises 3 modules / 30 hours each: lectures/discussions (3 meetings), reading/watching, studying/writing, final assignment: essay on a chosen subject. Duration: 2-4 weeks. | Course overview: The history of new media art forms emerging in the 20th century is increasingly entangled in relationships with technology (i.e. medium), the mass media and visual culture in general. Non-digital artworks have challenged the notions of aesthetics, spatiality, and temporality, by venturing into new fields of spatial installations, happenings, performance, video, and internet art, well into multiplatform immersive projects in which borders between the material and the virtual are breached. This course is designed as an introduction into specific developments that led up to new media/interactive art we encounter in contemporary art galleries. It will introduce groundbreaking artists and their works, areas where various concepts cross over, and technological inventions that allowed particular fields to blossom. These foundations are helpful in understanding the extend to which art and art-related concepts permeate all contemporary spheres of audio-visual discourse – both in mass media, art galleries, on the Internet and in public space. | Course objectives: The sphere of contemporary artistic practices connected with new media is complex and often confusing. It requires prior knowledge of history, culture, aesthetic turns and technological innovations, that help the visitors to situate given pieces and schools within the framework of art history and aesthetic reflection on transformations in the latter. The course aims at equipping the students with a broad knowledge of such, which will allow them to read new media artworks on multiple levels. | For the course outline and more information, please contact us on media@lcir.co.uk. Register on https://registration.lcir.co.uk by 10 July (registration fee: 150 GBP).","date_start":"2020-08-03","date_end":"2020-08-28","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Arts & Humanities","Other"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["media@lcir.co.uk"]}