{"name":"20th International Scientific GeoConference SGEM Vienna Green 2020","series":"","short":"","website":"http://www.sgemviennagreen.org","content":"The SGEM Vienna Green 2020 Conference is organized as an extended Scientific Sessions of the International Scientific GeoConference SGEM. The conference will be held at one of the most historical palace buildings in Vienna - Schönbrunn Palace in the period of 8 – 11 December, 2020\\. During these four days of SGEM Vienna GREEN 2020 this famous Palace will be an epicenter of global interacting between best scientists from more than 25 countries. Their innovative scientific works are devoted to important topics such as: Oil and Gas Exploration, Hydrology and Water Resources, Forest Ecosystems, Nuclear Technologies, Recycling, Air Pollution and Climate Change, Micro and Nano Technologies, Advances in Biotechnology, Green Buildings Technologies and Materials, Green Design and Sustainable Architecture, Modern Energy and Power Sources, Animals and Society. All submitted papers will be peer-reviewed, evaluated and, if accepted, will be published in a Conference proceedings /hard copy version/ with ISSN, ISBN and DOI numbers. Every accepted paper have DOI number and will be also submitted for evaluation and indexation in the biggest scientific databases - ISI WoS, SCOPUS, ELSEVIER products - Mendeley, EBSCO, ProQuest, Mendeley, Russian eLibrary (RSCI), British Library etc. The Conferences include also accompanying events, such as workshops and very interesting cultural activities with historic value","date_start":"2020-12-08","date_end":"2020-12-11","important_dates":{"abstract":"","full":"2020-10-01","notification":"","final":""},"topics":["Life Sciences","Ecology","Energy, clean, renewable"],"location":{"virtual":"","full":["Vienna","Austria"],"name":"","street":"","city":"Vienna","state":"","ZIP":"","country":"Austria"},"organizers":["European Universities and Academy of Sciences"],"societies":[],"indexes":[],"emails":[]}