{"name":"The Uncanny in Language, Literature and Culture” International Conference","series":"","short":"","website":"https://uncanny.lcir.co.uk","content":"The twentieth-century literature and culture tended to explore and to celebrate subjectivity. But this tendency did not mean the turn to the self, but beyond the self, or as Charles Taylor puts it, “to a fragmentation of experience which calls our ordinary notions of identity into question”. In his attempts to define the uncanny Freud asserted that it is undoubtedly related to what is frightening – to what arouses dread and horror. It may be something domestic but at the same time unfriendly, dangerous, something that sets the sense of insecurity within the four walls of one’s house. “Persons, things, sense-impressions, experiences and situations which are known and long familiar arouse in us the feeling of danger, fear and even horror. Everyday objects may suddenly lose their familiar side, and become messengers”. The uncanny suggests an unsettling of the feeling of comfort and reassurance in one’s home, but also in oneself. Architecture takes the place of psychology (Kreilkamp). The perturbed relationship between the characters and their familiar world, the troubled sense of home and self-certainty is a result of a traumatic experience of loss. In the new literary and artistic discourse authors tend to depict the new human being, “psychologically deep and multi-layered, fragmentary, floating on sensation and consciousness, fed by their random thoughts and their half-conscious dream worlds” (Bradbury). The new style relies on fragments, breaks, ellipses and disrupted linearity of the narration. It serves to convey the idea of the fractured character of modern time and fragmentariness and allusiveness of subconscious thought. As “an externalization of consciousness”, the uncanny becomes a meta-concept for modernity with its disintegration of time, space and self. This conference seeks to explore the representations of the uncanny in language, literature and culture. Papers are invited on topics related, but not limited, to: uncanny geographies uncanny technologies the uncanny and visual tropes the uncanny and postcolonialism the uncanny and gender studies the uncanny and sexuality The conference aims to bring together scholars from different fields. We invite proposals from psychology, sociology, anthropology, literature, linguistics, etc. Paper proposals up to 250 words should be sent by 31 May 2020 to: uncanny@lcir.co.uk. Download paper proposal form. Registration fee – 100 GBP Provisional conference venue: Birkbeck, University of London, Malet Street, Bloomsbury, London WC1E 7HX, UK","date_start":"2020-08-15","date_end":"","important_dates":{"abstract":"","full":"2020-05-31","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","Language and Literature"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["LCIR"],"societies":[],"indexes":[],"emails":["uncanny@lcir.co.uk"]}