{"name":"TRAUMA AND NIGHTMARE - 3rd International Interdisciplinary Conference","series":"","short":"","website":"https://traumanightmare.ug.edu.pl","content":"CFP: “Trauma” and “nightmare” have become the most popular metaphors of evil in our times. The old philosophical discussion about “the nature (or mystery) of Evil” has been replaced by modern (and postmodern) studies on trauma. Nightmare is a more and more frequent phenomenon, and it is being studied by dream and sleep researchers. However, nightmare means not only bad dream – today this term describes also a variety of unpleasant experiences, memories, emotions, so it deserves special attention as an important factor which characterizes human condition. Keeping this in mind, during our conference we would like to ask how the discourse on trauma and nightmare helps us to understand our contemporary world. In order to answer this general question, we will have to concentrate on many particular issues. Thus, we are interested in all aspects of traumatic experiences, in their individual and collective dimensions, in the past and in the present-day world. We would like to describe the phenomena of nightmare and trauma in their multifarious manifestations: psychological, social, historical, cultural, philosophical, religious, economic, political, and many others. We also want to devote considerable attention to how these phenomena appear in artistic practices: literature, film, theatre or visual arts. That is why we invite researchers representing various academic disciplines: anthropology, history, psychiatry, psychology, psychoanalysis, sociology, politics, philosophy, economics, law, memory studies, consciousness studies, dream studies, sleep studies, literary studies, theatre studies, film studies, migration studies, gender studies, postcolonial studies, medical sciences, cognitive sciences, and urban studies, to name w few. Different forms of presentations are encouraged, including case studies, theoretical inqueries, problem-oriented arguments or comparative analyses. We will be happy to hear from both experienced scholars and young academics at the start of their careers, as well as doctoral and graduate students. We also invite all persons interested in participating in the conference as listeners, without giving a presentation.","date_start":"2020-03-05","date_end":"2020-03-06","important_dates":{"abstract":"","full":"2020-01-10","notification":"","final":""},"topics":["Social Sciences","Psychology","interdisciplinary"],"location":{"virtual":"","full":["Gdańsk","Poland"],"name":"","street":"","city":"Gdańsk","state":"","ZIP":"","country":"Poland"},"organizers":["INMIND SUPPORT"],"societies":[],"indexes":[],"emails":[]}