{"name":"Institute of Mathematics and Management Conference on Education & Social Sciences 2020, With Workshop on Data Analytics","series":"","short":"","website":"https://imathm.edu.lk/view/immcess-2020-singapore","content":"IMMCESS 2020 Singapore The importance of knowledge creation and sharing are well understood in the knowledge society. Academicians and researchers across the world sweat for making a better world; conduct research, attempt for quality publications, meet other scholars at research forums to share knowledge, etc. Yet factors are hindering the target. Over the decades, it had been observed that a large number of published research articles are erroneous due to a lack of knowledge in quantitative research. Institute of Mathematics and Management (IMM) determined to fill the knowledge gap; take initiative to conduct the conference along with the \"Workshop in Data Analytics\". Original research papers and review papers in Education, Social Sciences, and related disciplines from Undergraduate and Post Graduate Students, Research Scholars, Faculty, Scientists, etc., are invited for presentation and publication. Abstracts of the papers will be published in Conference Proceedings; Hard copy and E-copy, with ISSN number. Selected full papers will be published in the Journal of New Frontiers in Education and Social Sciences (JNFESS) with ISBN, within one month from the date of the conference. Workshop on Data Analytics (WDA) This workshop will be hands-on and driven by examples, using real-life data sets from the fields of; Life Sciences & Health Care, Business & Economics, Finance, Tourism Management, Meteorology, and many more. The intended participants for the course are students and practitioners of a data-driven environment. Outline and Objectives The statistical software; MINITAB, MATLAB / R, SPSS, and Excel will be the main tools utilized in the workshop, but the previous knowledge in handling the above software is not a must. The entire workshop will be example-driven; therefore participants are encouraged to bring a laptop computer (Windows) for optimum benefit. Instructions for installing the necessary software can be sent to the participants before the workshop or trial versions of software can be provided at the workshop. By the end of the day, participants will have learned; Mathematical/ Statistical Modeling; Introduction to Big Data handling and Programming; Parametric VS Non- parametric Statistics; Descriptive Statistics; Inferential Statistics; Univariate and Multivariate Forecasting. Participants can have direct communication with the instructors (via e-mail or Skype); to get guidance for their future work.","date_start":"2020-11-06","date_end":"2020-11-07","important_dates":{"abstract":"","full":"2020-10-01","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education and Social Sciences"],"location":{"virtual":"","full":["Victoria Street","Singapore"],"name":"","street":"","city":"Victoria Street","state":"","ZIP":"","country":"Singapore"},"organizers":["Institute of Mathematics & Management"],"societies":[],"indexes":[],"emails":[]}