{"name":"Method Development and Validation for Assays Supporting Testing of Biologics","series":"","short":"","website":"https://www.complianceonline.com/method-development-validation-assays-supporting-testing-biologics-seminar-training-80492SEM-prdsm?channel=Brownwalker","content":"Biologics continue to be a steadily growing component of the pharmaceutical industry. The advent of large molecule therapeutics requires a different perspective on the assays needed to support development through preclinical and clinical testing. This 2-day virtual seminar is designed to offer a broad overview of developing and validating a range of assay methodologies for biologics with specific key analysis of cell culture, assay variability, and DOE. Specifically, this seminar covers essential concepts related to cell-based potency methods, ELISA, and other methods supporting biologics. In addition to potency methods this seminar addresses immunogenicity methods for preclinical and clinical studies. The format of the seminar offers an examination of current best practices as well as time to dissect examples of documentation with emphasis on beneficial systems to consider. Scientists who attend this 2-day virtual seminar will gain knowledge that will be beneficial in helping to achieve well-controlled validated methods. Learning Objectives: Understanding the different requirements for small versus large molecules Mapping appropriate timelines with decision points Designing, developing, optimizing, and validating key methods Potency methods, other release and stability methods Preclinical and clinical methods Use of DOE and statistical analysis Handling of critical materials Process monitoring concepts Assessment of orthogonal methods Assessing readiness for validation Defining the validation protocol with real-time capture of data analysis Maintaining quality through documentation Who will Benefit: Below titles working in biopharmaceuticals, pharmaceuticals, natural products/botanicals will be benefited by attending this seminar: Validation Scientists QA/QC Regulatory Affairs Laboratory Managers Assay Development Specialists Statistician CMC Titles Bio Assay","date_start":"2021-09-22","date_end":"2021-09-23","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}