{"name":"“Global Festival Culture” International Conference","series":"","short":"","website":"https://celebrations.lcir.co.uk","content":"“Global Festival Culture” International Conference 18 July 2020 – London, UK organised by London Centre for Interdisciplinary Research and Festival Culture, Research and Education Network Global festival culture is a one-day inter-, multi-, trans-, and cross-disciplinary conference that aims to explore the creative practices, social benefits, economic development, tourism, multiculturalism, diversity, local community involvement, partnerships, religion and music entrepreneurial networks that festivals offer. There are many festivals around the world; they all manifest in varying ways and all possess their own social, religious and cultural practices. Festivals both past and present – be it folk, religion, cultural or community-based – illuminate discourses of hegemony, homogeneity, race, politics, nationalism, identity and religion etc. As an emerging discipline, it is important to examine festivals from varying perspectives to understand, broaden and articulate the scope of festival studies. The conference aims to bring together researchers, costume and craft makers, filmmakers, photographers, musicians, organisers, policymakers and stakeholders. We are extending this invitation to academics from across disciplines, postdocs and postgraduates at all stages in their research, as well as to practitioners seeking to give creative demonstrations or performances. We welcome contributions that explore questions such as: How do festivals transform and how much are they a part of our everyday life? What do festivals tell us about history and ourselves? What can we learn about the festive life of the Middle Ages? And what is the significance of Mikhail Bakhtin’s depiction of the festive culture of the Middle Ages in relation to festivity and celebration today? Proposals may also address, but are not limited to, the following themes: • Festival and the community • Festival and education • Festival and religion • Festival and food • Festival in the city • Festival and activism • Researching festivals (methods, methodology) • Archiving the festival as an academic and public resource • Festival event organising/management • Festival art • Festival and craft (craft-making processes, practices e.g. costume and float making etc.) • Festivals as a space for youth entrepreneurship • Festive activities as a form of therapy • Festival funding and policy • Festival politics • Festival and literature • Festival and fan studies • Festivals, tourism and leisure • Mass media and the festival • Social media and the festival • Technology and the festival • Sound and the festival • Folk festivals and music • Medieval festivals and re-enactments • Performance • Festival heritage and traditions Paper proposals up to 250 words should be sent by 31 March 2020 to: festival.culture@lcir.co.uk. Please download paper proposal form. Selected papers will be published in the FCRE journal. Registration fee – 100 GBP Provisional conference venue: Birkbeck, University of London, Malet Street, Bloomsbury, London WC1E 7HX, UK","date_start":"2020-07-18","date_end":"","important_dates":{"abstract":"","full":"2020-03-31","notification":"","final":""},"topics":["Arts & Humanities","Other","interdisciplinary"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research and Festival Culture, Research and Education Network"],"societies":[],"indexes":[],"emails":["festival.culture@lcir.co.uk"]}