{"name":"\"Cosmopolitanism and World Citizenship\" International Conference","series":"","short":"","website":"https://cosmopolitanism.lcir.co.uk","content":"“I am a citizen of the cosmos” Cynic Diogenes replied in the fourth century BCE when he was asked about his origins. What does it mean to be a global citizen today? Highly complex, multilayered and always contemporary, the concept of cosmopolitanism offers fertile ground and uncharted waters for scholarly interpretations. For millennia, philosophers have theorized on the meaning of global citizenship in an effort to identify who are the “kosmopolites”, the real citizens of “the Small World, the Great” in the words of Nobel laureate Odysseus Elytis. The London Centre for Interdisciplinary Research, pluralistic and multicultural itself, wishes to explore this journey of global citizenship over the centuries and identify its past, understand its present and theorize about its future. The roots, developments and faces of global citizenship, its transformation and the identity of citizens in a globalized world will be explored in an effort to understand the challenges we face. Who are cosmopolitans? What are their roles in and contributions to our multicultural global society? What is the role of national citizenship and what are the political and institutional implications? Can cosmopolitanism offer solutions to this challenging and highly controversial era? What are the cultural, social, economic, political and personal dimensions and to what extent can they affect our reality? Are the notions of global citizenship problematic or might cosmopolitanism offer solutions to global problems? Our conference wishes to bring together scholars from various disciplines such as history, philosophy, literature, linguistics, theology, political and social sciences in order to explore the wide spectrum of global citizenship. Multiculturalism, cultural diversity and awareness Social and individual multiculturalism Cultural pluralism and democratic values The politics of multiculturalism Multiculturalism in literature and art Comparative multiculturalisms Psychology of multiculturalism Multiculturalism and cosmopolitanism Multiculturalism in education Multiculturalism, immigration and integration Reflections of multiculturalism in the media Multicultural rights, freedoms and pressures Social justice and multiculturalism Multiculturalism, religion and secularism National and regional multiculturalism Multiculturalism and conflict resolution European and American multiculturalism Multiculturalism between philosophy and reality The history and future of multiculturalism The multiplicities and limits of multiculturalism Submissions may propose various formats, including: All paper submissions and conference activities must be in English. Submissions may propose various formats, including: Individually submitted papers (organized into panels by the committee) Panels (3-4 individual papers) Roundtable discussions (led by one of the presenters) Posters Proposals (up to 250 words) and a brief biographical note should be sent by 30 November 2019 to: cosmopolitanism@lcir.co.uk. Please download Paper proposal form. Registration fee – 100 GBP Provisional conference venue: Birkbeck, University of London, Malet Street, Bloomsbury, London, WC1E 7HX","date_start":"2020-05-16","date_end":"","important_dates":{"abstract":"","full":"2019-11-30","notification":"","final":""},"topics":["Social Sciences","Other","interdisciplinary"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["cosmopolitanism@lcir.co.uk"]}