{"name":"SGEM Vienna Art 2019, Scientific Conference on Social Sciences and Arts","series":"","short":"","website":"https://www.sgemvienna.org","content":"The International Scientific Conference SGEM Vienna ART 2019 is organized as an extended session of the SGEM International Scientific Conferences on SOCIAL SCIENCES and ARTS. The event will be held in the biggest and most historically Palais Niederösterreich, Vienna, Austria in the period of 11 - 14 April, 2019\\. The aim of the conference is to provide a platform for academicians and professionals with cross-disciplinary interests related to Modern Science, Ancient Science, Cultural Studies, Language and Treasure, International Relations, Art and Architecture to meet, exchange knowledge and interact with each other. All submitted papers are peer-reviewed, evaluated and if accepted published in a conference proceedings /both digital and hard copy version/. It combines papers in the fields of: • Modern Science: Political sciences, Law, Finance, • Ancient Science: Archaeology, History, Philosophy • Cultural Studies: Cultural Studies, Medieval & Renaissance Studies, Ethnology and Folklore • Language and Treasure: Language & Linguistics, Literature and Poetry • International Relations, Health Policy & Services, • Art and Architecture: Architecture & Design, History of Arts, Contemporary Arts, Performing & Visual Arts Every accepted paper is published in the conference proceedings (ISSN/ ISBN) both hard copy and soft copy (DVD). The conference book is also submitted for evaluation and indexation in the biggest scientific databases - ISI Web of Sciences, ELSEVIER products-Mendeley, EBSCO, ProQuest, British Library and etc. The Conferences include also accompanying events, such as workshops, performing arts (live dance performances, theater, and music, etc.) and very interesting cultural trips with historic value. We would like to invite you to share your experience and research in the field of Social Sciences and Arts with experts from all over the world. Abstract Deadline: 25 February 2019 Full Paper Deadline: 11 March 2019 Workshop Proposal Submission: 25 February 2019 Live Performance Proposal Submission: 25 February 2019 EARLY-BIRD: 25 February 2019\\. Payment Deadline: 15 March 2019","date_start":"2019-04-11","date_end":"2019-04-14","important_dates":{"abstract":"","full":"2019-02-25","notification":"","final":""},"topics":["Arts & Humanities","Art History"],"location":{"virtual":"","full":["Palais Niederösterreich","Vienna","Austria"],"name":"","street":"","city":"Palais Niederösterreich","state":"Vienna","ZIP":"","country":"Austria"},"organizers":["SGEM World Science"],"societies":[],"indexes":[],"emails":[]}