{"name":"Annual Meeting on Climate & Environmental Sciences","series":"","short":"","website":"http://www.globalepisteme.org/Conference/climate-environmentalscience","content":"Annual Meeting on Climate & Environmental Sciences Theme: Exploring Innovative Technologies to Prevent Global Warming Climate change is one of the world’s greatest challenges. It influences people, the economy and environment; moreover climate change affects development procedures and policies at all levels. GE Conferences invites all the participants who are concerned about sharing their respective views on climate changes & environmental sciences which include global climate change, environmental factors, Occupational hazards, industrial hazards, toxic substances, global environmental health, economic impacts assessments, environmental remediation, infrastructure and surveillance. CliEnviro 2020 spotlights on the most recent research and advancements in the field of Climate change and Environmental Sciences by organizing 2days conference at Bangkok, Thailand to gather all scientists, researchers, scholars, and students from all around the globe to exchange ideas, discover novel opportunities and broaden their knowledge. We provide opportunity for Researcher’s, Advertisers, Exhibitors and Sponsors at this International event to share their ideas and improve their Network. We look forward for your presence at Bangkok, Thailand! Contact: Laura Harrington CliEnviro 2020 Program Manager Global Episteme Inc. NY, USA +1 631 303 3007 Email: climate@globalepisteme.com","date_start":"2020-10-05","date_end":"2020-10-06","important_dates":{"abstract":"","full":"2020-09-30","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental","environmental science & ecology"],"location":{"virtual":"","full":["Bangkok","Thailand"],"name":"","street":"","city":"Bangkok","state":"","ZIP":"","country":"Thailand"},"organizers":["http://www.globalepisteme.org/Conference/climate-environmentalscience"],"societies":[],"indexes":[],"emails":["climate@globalepisteme.com"]}