{"name":"Intern. Workshop on Multimedia Forensic Data Analysis Forensic'2019","series":"","short":"","website":"http://www.data-mining-forum.de/w_forensic.php","content":"Intern. Workshop on Multimedia Forensic Data Analysis Forensic'2019 July 19th, 2019, New York, USA Workshop Chair Petra Perner, Institute of Computer Vision and applied Computer Sciences, IBaI, Germany Workshop Committee Paul Elzinga, Data scientist at Politie Nederland Politie Nederland, The Netherlands Aslo Mattei, Crime Lab Deputy Director, Head of latent print unit Arma dei Carabinieri University of Ferrara , Italy Peter W. Pfefferli, Forensic Expert, Universite de Lausanne, Switzerland Scope of the Workshop The increased usage of digital media in daily life has resulted in the demand for novel multimedia data analysing techniques that can help to use these data for forensic purposes. The processing of these data for police investigation purposes can help to speed up the investigation and make them more effective. If these data should be used in a court of law as evidence, techniques that can confirm the origin and integrity are necessary. These techniques should be robust and reproducible. They should also allow to work on sparse sample sets since in police investigation cases the data are usually rare. Multimedia content is comprised of images, videos, text and audio. These data allow to identify and compare objects or persons based on grey level, texture, color, geometrical or biometrical features. If they serve as evidence in court of law case they need to be trustworthy. The new techniques such as the internet and the new software services such as search engine like google, internet communities such as facebook make these multimedia content available in a new form and allow to derive new information from it such as links between groups, information pieces or events. The developed methods should aim to work on sparse data sets and allow to store the actual case in a data base in such a manner that they can easily retrieved, generalized and used as comparative cases for different police investigations. All kinds of topics related to multimedia forensic data analysis are welcome. Some related topics are but not limited: Person Identification in Images and Videos Analysis of Handwritings Multi Lingual Topic Modelling Gender Recognition Speech Analysis (native speaker recognition) Analysis of Border Control Images Genetic Data Analysis Important Dates Submission Deadline: April 20, 2019 Notification Date: May 20, 2019 Camera-Ready Deadline: June 12, 2019 Workshop date: July 19, 2019 Please submit the electronic version of your camera-ready paper to EasyChair Forensic 2019\\. Submission Requirements All papers will be published in the workshop proceedings by ibai-publishing. Paper submissions should be formatted according to Springer LNCS format, with a maximum of 15 pages. Author's instructions along with LaTeX and Word macro files are available on the web at http://www.springer.de/comp/lncs/authors.html. Please submit to info@data-mining-forum.de and insert in the header of this mail Forensic2019\\. After the conference, authors are invited to submit a revised version of their paper to the International Journal Transactions on Mass Data Analysis of Signals and Images of the ibai publishing house.. Please submit a revised version of your paper after the conference to info@ibai-publishing.org.","date_start":"2019-03-01","date_end":"2019-07-19","important_dates":{"abstract":"","full":"2019-03-01","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","forensic science"],"location":{"virtual":"","full":["New York","United States"],"name":"","street":"","city":"New York","state":"","ZIP":"","country":"United States"},"organizers":["Institute of Computer Vision and Applied Computer Sciences IBai"],"societies":[],"indexes":[],"emails":["info@data-mining-forum.de","info@ibai-publishing.org"]}