{"name":"Education, Society, and Reform Conference 2019","series":"","short":"","website":"www.edusref.org","content":"“Questioning of Changes in Education: Looking for Priorities in Education” Each change or reform initiative in education systems does not produce the expected results. Even, these changes mostly increase the current ball of problems in education systems. Can an education policy or implementation that aims to improve the education quality produce new inequalities or unexpected results? Today also, more than ever, the limited sources entail to draw attention to the essential priorities in education. It is vital to question the changes both today and tomorrow. Some questions that we should think about may be given as follows: What are the essential priorities in education? What kind of changes in education is needless? How are the problems or side effects that appear after the changes in education managed? What kinds of effects do arise during the changes in the social systems especially in education? How should the potential changes both today and tomorrow be planned to minimize the social, economic or technological risks? In this respect we expect the contributions of social researchers dealing with in the conference topic in the field of education, sociology, psychology, philosophy, management, economics, social anthropology, law, social statistics, etc. No particular methodologies will be preferred and we expect the submissions that reflect the widest range of robust and imaginative research designs. Within the need for improvement in the current changes in social systems, the conference aims also to help education policy makers with reform choices. The conference therefore welcomes a range of topics including children and families, academic achievement, curriculum development, education technology, creativity and innovation, comparative education, life-long learning, educational administration, education and development, international education, leadership, teacher quality, equity, policies and practices, economics, accountability, autonomy and other issues related to the main theme of the conference Conference Topics Paper topics may include, but are not limited, to the following: · Educational Policies and Practices · Trends and Challenges Shaping Education · Large-Scale Assessments in Education (PISA, TALIS, PIACC etc.) · Economic Challenges (i.e. BREXIT) and its Reflections on Education Systems · International Benchmarking /Indicators · Comparative Studies in education · Social Transitions & School Culture and Climate · Socio-Psychological Analyses for Education · Social Media and its Reflections on Schools · Migration and Education Studies · Gender and Education Studies · Inclusive Education · School Improvement · Creativity and Innovation in Education · Innovative Learning Environments · Curriculum Critiques · School Leadership · Performance Appraisal in Education · Law of Education · Professional Development · Teacher Education · Developing Higher Education Systems In order to make the productions of the conference efficient, the authors are expected to answer this question “What are the implications based on the results of study for potential education reforms? “ in the conclusion remarks in their study.","date_start":"2019-06-28","date_end":"2019-06-29","important_dates":{"abstract":"","full":"2019-04-15","notification":"","final":""},"topics":["Education / Legal / Other","Education","educational leadership"],"location":{"virtual":"","full":["Ankara","Turkey"],"name":"","street":"","city":"Ankara","state":"","ZIP":"","country":"Turkey"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}