{"name":"1st Coronavirus in Global Contexts","series":"","short":"","website":"https://hedra.eu","content":"Keynote Speaker: Esterbrook Longmaid III This conference brings together academics, lawyers, decision-makers, educators and practitioners from a wide variety of fields, for a collaborative, multidisciplinary exploration of the ways in which the pandemic has impacted global ways of working and governance. Themes and issues for the conference include, but are not limited to: Stream A: Working in the pandemic How has the pandemic impacted employment, and unemployment? What does it mean, to be an employee, supervisor, manager or decision-maker, in a time of pandemic? How will our new understanding of essential workers alter roles, positions and workflow and remuneration? How are businesses, whether SMEs or large corporations, handling the lockdown measures? What is the future of online work; can teleconferencing replace face-to-face interactions? In particular, how has the pandemic impacted the workplace functioning of hospitals, medical centres and clinics? How has it changed the business of medicine, the many different kinds of employees which contribute vitally to their operations, and the achievement of medical outcomes? How has it impacted medical workers? We welcome papers from a variety of global contexts. Stream B: Policy and the pandemic The pandemic gave rise to diverse policy responses, at various levels of government and officialdom. Different places used different quarantine and lockdown measures. How effective were these? What have we learned about preparedness, timing, international cooperation, political functions and interference, global and regional cooperation, relations between governments and the institutions, universities and organisations who attempt to aid in policy-making? How easy is it for policy-makers to integrate their actions with the scientific advice? How should tools such as the media, testing, contact tracing, tracking apps, immunity passports, law, nationalised health services or private medical cooperations, be used? What is effective policing in a pandemic? What are its limits? What can be nudged, and what must be controlled? Overall, how can this pandemic experience help us prepare effectively for the next? We welcome papers from a variety of global and civic contexts. Stream C: Social responses to the pandemic One of the great challenges of the pandemic has been the great variety of social responses, ranging from displays of public gratitude for essential workers and healthcare workers, through clubbing and partying, weaponised coughing and spitting, artistic and musical works, lockdown protests, volunteering, media debates, inter-governmental stresses and international tensions, to conspiracy theories. What are the cultural differences which impact our responses to the pandemic? What do these reveal about the future course of the coronavirus? How to manage social fragmentation, and improve chances for a cohesive response? How we define progress or success? How can we effectively handle other large-scale social challenges? We welcome papers from a variety of global contexts. Stream D: Data analytics and the pandemic In order to find out how the pandemic is impacting business people and employees, as well as those working in hospitals and other medical contexts, governments, organisations and institutions, we are soliciting papers from academics, researchers, and the business and policy communities. These papers use structured interviews, and evaluate the data with content analysis software. Conference participants interested in cooperating with this research project will publish papers in a journal special issue with HEDRA advisory board members. If you are interested in this, please contact us at hedra.eu@gmail.com. The conference welcomes abstracts from academics and researchers, business people, people working in interprofessional fields, and others.","date_start":"2020-12-12","date_end":"2020-12-13","important_dates":{"abstract":"","full":"2020-11-13","notification":"","final":""},"topics":["Business","Management / Leadership","Business Management & Leadership"],"location":{"virtual":"","full":["Online Event","Austria"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Austria"},"organizers":["HEDRA Research Associates"],"societies":[],"indexes":[],"emails":["hedra.eu@gmail.com"]}