{"name":"SOP Writing, Training and Compliance in the Pharmaceutical Industry","series":"","short":"","website":"https://www.complianceonline.com/sop-writing-in-pharma-gmp-environment-seminar-training-80560SEM-prdsm?channel=Brownwalker","content":"Standard Operating Procedures (SOPs) are the basis for a large part of the day-to-day training that most pharmaceutical employees are required to perform. Still, it is not widely understood the extent of the commitments we make when we write an SOP or how the writing of the SOP can have a positive or negative impact on training or job performance. For example, there is an expectation that procedures describe the most critical processes for product manufacturing and will be followed consistently, with few if any deviations. In this course you will learn the keys to writing effective SOPs, the vital connection between the documentation and training spheres, and how to maximize this connection to improve the quality of both SOPs and training. To accomplish these goals, we will review regulatory agency expectations when an SOP is written, provide suggestions for uncovering the process in its entirety and describe it clearly and concisely, indicate how to break portions of the process(es) into logical chunks, and show how the SOP and the training program can work together harmoniously. Understanding how the average employee is swamped with more work than they can manage, we will also provide tips for shortening this process and take advantage of tools that probably already exist in the systems that you use on a day-to-day basis. We will provide valuable insights and examples that reflect the extensive experience of the instructor in the documentation and training fields., and which can assist you in writing and implementing SOPs with maximum efficiency and effectiveness. Learning Objectives: To improve the writing of SOPs for more effective training and reduction of errors. To understand the regulatory implications of what is written in an SOP To learn the parameters of an effective SOP To distinguish a well-written SOP from a poorly written one To define processes better by effective interaction with the SOP process owner and/or author To integrate the SOP effectively into the position curricula of employees To explore the connection between SOPs and job performance, and measure retention of SOP content at the training stage Who will Benefit: Pharmaceutical industry, particularly those areas that develop SOPs for the manufacturing or quality monitoring of pharmaceutical products, as well as Information Technology (IT)","date_start":"2021-10-25","date_end":"2021-10-26","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}