{"name":"Identities and Identifications: Politicized Uses of Collective Identities (8th Edition) Dublin, Ireland, 28 – 29 June 2019","series":"","short":"","website":"http://euroacademia.eu/conference/8th-identities-and-identifications","content":"The 8th Euroacademia International Conference ‘Identities and Identifications: Politicized Uses of Collective Identities’ The Croke Park Hotel Dublin, Ireland 28 – 29 June 2019 CALL FOR PANELS AND PAPERS Deadline for Paper Proposals: 24th of May 2019 Conference description: Identity is one of the crown jewelries in the kingdom of ‘contested concepts’. Few concepts are so integral to social assumptions, beliefs and claims of belonging while simultaneously escaping a clear definition or even a minimal consensus. The idea of identity is conceived to provide some unity and recognition while it also exists by separation and differentiation. From personal to group and collective identities, multiple layers of identifications juxtapose conflict or exclude. Few concepts were used as much as identity for contradictory purposes. From the fragile individual identities as self-solidifying frameworks, to layered in-group identifications in families, orders, organizations, religions, ethnic groups, regions, nation-states, supra-national entities or any other social entities, the idea of identity always shows up in the core of debates and makes everything either too dangerously simple or too complicated. Constructivist and de-constructivist strategies have led to the same result: the eternal return of the topic. Some say we should drop the concept, some say we should keep it and refine it, some say we should look at it in a dynamic fashion while some say it’s the reason for resistance to change. In the meantime, identities are programmatically asserted and promoted to generate cohesion and demand recognition while the process of identification excludes and creates boundaries and alterity making practices. If identities are socially constructed and not genuine formations, they still hold some responsibility for inclusion/exclusion – self/other nexuses. Looking at identities in a research oriented manner provides explanatory tools for a wide variety of events and social dynamics. Identities reflect the complex nature of human societies and generate reasonable comprehension for processes that cannot be explained by tracing pure rational driven pursuit of interests. The feelings of attachment, belonging, recognition, the processes of values’ formation and norms integration, the logics of appropriateness generated in social organizations, are all factors relying on a certain type of identity or identification. Multiple identifications overlap, interact, include or exclude, conflict or enhance cooperation. Identities create boundaries and borders; define the in-group and the out-group, the similar and the excluded, the friend and the threatening, the insider and the ‘other’. Even more, identities generate legitimating circumstances for social and political action; assert the power of naming and rules of belonging while setting the stage for the perception of the other. The other can be internal, as difference and incomplete coherence with the in-group, or external as acknowledged difference or even in cases of radical alterity as perceived threat. The formation of identities can lead to multicultural integration of diversity, tolerance, recognition and pluralism while simultaneously exclude and build walls. The 8th Euroacademia International Conference 'Identities and Identifications: Politicized Uses of Collective Identities' aims to scrutinize the state of the art in collective identities research, to bring once more into debate the processes of identity making, identity building in both constructivist or de-constructivist dimensions. The conference will include a wide variety of contributions on identity making practices while fostering a critical assessment of intended or unintended consequences that lead to the politicization of identities. It is the aim of the Euroacademia conference to open the floor to dynamic multi-dimensional and inter-disciplinary understandings of identities in their historic formation or in the way they shape the present and future of organizations or communities. The conference however seeks also to integrate and address the misunderstandings or misconceptions implicit to identity formation practices. A focal place will be given to methodological refinement and innovation in the research of identities in a broad spectrum of disciplines. Euroacademia aims to bring together a wide network of intellectuals, academics, researchers, practitioners and activists that are willing to share and open to debate their research on identity related topics. Disciplinary, trans and inter-disciplinary approaches, methodological assessments, innovations and recommendations, single case studies or cross-sectional analyses, reflective essays, experience sharing or works addressing new puzzles are all welcomed. Conference panels include the following topics: Welcome to the Land of Disputes: Theoretic Contributions to Understanding Identity \\~ Personal Identity \\~ Individualism and Autonomy \\~ Modernity and Identity \\~ Identities as Endogenous Factors in the Study of Organizations \\~ Critical Approaches to Understanding Identity \\~ Universal and Local in Identity Making \\~ Processes of Identity Building \\~ Practices of Identification \\~ Identity and Inclusion \\~ Identity and Exclusion \\~ The Politicization of the European Identity \\~ European Union and the Claims of an Emerging Supranational Identity \\~ America as a Soft Power: Attraction Through Identitarian Constructs \\~ Normative Powers and the Export of Identities \\~ Identity and the Power of Naming the Other \\~ In-Group – Out-Group Dynamics in Identity Formation \\~ Identities as Endogenous Factors in Explaining Political Behaviors \\~ Religion and Identities \\~ Imagined Communities: Preserving Identity as A Foreigner \\~ Art as an Identity Making Process \\~ Folklore and the National Identity Narratives \\~ History Reading and Identity Making \\~ Ideal and Real Multiculturalism: How Inclusive Our Societies Are? \\~ Regions and Identities \\~ East/West – North/South: Imaginary Geographies of Identities \\~ Core/Periphery Claims in Shaping Identities \\~ Nested Identities \\~ Identitarian Threats \\~ Symbols of Identities: Flags, Coins, Stamps and Anthems \\~ Cosmopolitanism and Supra-National Identities \\~ Film and the Visual Narration of identities \\~ Music and the Identitarian Signifiers \\~ Literature and Identities \\~ Groups, Gangs, Movements and Identities \\~ Protest and Identities \\~ Ethnicity and Identity \\~ Regional Integration Projects and Identity Appropriations \\~ Globalization and Identities \\~ Uses and Miss-uses of Identities for Political Purposes \\~ Organizations and Identities \\~ Markets, Products and Identities \\~ Consumerism and its Impact on Identity Building \\~ Corporate Identity \\~ Brand Identity \\~ Identity and Conflict \\~ Crises of Identity If interested in participating, please read the complete event details on the conference website and apply on-line. Alternatively you can send a maximum 300 words abstract together with the details of your affiliation until 24th of May 2019 by e-mail at application@euroacademia.org For full details of the conference and on-line application please see: http://euroacademia.eu/conference/8th-identities-and-identifications/","date_start":"2019-06-28","date_end":"2019-06-29","important_dates":{"abstract":"","full":"2019-05-24","notification":"","final":""},"topics":["Social Sciences","Political-Science","call for papers"],"location":{"virtual":"","full":["Dublin","Ireland"],"name":"","street":"","city":"Dublin","state":"","ZIP":"","country":"Ireland"},"organizers":["Euroacademia"],"societies":[],"indexes":[],"emails":["application@euroacademia.org"]}