{"name":"3-Hour Excel Automation Boot Camp: Top Ten Excel Functions, Lookup Functions (VLOOKUP, HLOOKUP, MATCH, INDEX) Basics of Excel Macros with an Introduction t","series":"","short":"","website":"https://bit.ly/3qNHJa9","content":"Excel functions can greatly enhance your ability to perform tasks in day to day activities in Excel. While there are hundreds of functions available, there are 10 functions that all Excel users should know. Whether you are an office worker, or a small business owner using Excel to keep track of your finances or just the casual user, these Excel functions can be very important time savers and enhance your ability to create better performing spreadsheets! Learning about the lookup functions in Excel will allow you to match data between databases. VLOOKUP enables you to quickly and easily look for a value down a column of data and return a value from the same row in a different column. Perfect for when working with large tabular data. INDEX and MATCH work in a similar way but provide more flexibility. Why Should You Attend As an intermediate to advanced level user of Excel, not only do you want to take your knowledge and skills to the next level, you want to produce meaningful, impactful and insightful reports in the shortest time possible. These features of the application will help you to do just that. Objectives of the Presentation This Microsoft Excel training session covers THREE intermediate to advanced features of Excel that provide automation within the application. Formulas are equations that can perform calculations, return information, manipulate the contents of other cells, test conditions, and more. Explore what are considered the top 10 functions. Lookup functions in Excel are far superior to manually searching for specific data elements in a spreadsheet. VLOOKUP, HLOOKUP, INDEX and MATCH are some of the most well-known (and most useful) functions in Excel. Being able to create and edit macros is one of the must have skills for Excel Power Users. Having this knowledge will save you hours of time by allowing you to automate any Excel-based task or process. If you’ve never create macros or used VBA before, this advanced Excel training is for you. Areas Covered in the Session » Learn many statistical functions including SUM, AVERAGE, MAX, MIN and COUNT » Use IF and its counterparts COUNTIF, SUMIF, and AVERAGEIF » Calculate dates using TODAY, NOW » Learn many functions to manipulate text once imported including LEFT, RIGHT, LEN, TRIM and CONCATENATE » Learn the arguments in the VLOOKUP function » Understand the importance of absolute references within many lookup functions » Use VLOOKUP to perform approximate matches » Simplify multiple-field look-ups with concatenation (combining fields into a single cell) » Use VLOOKUP to look up data from another workbook » Learn how VLOOKUP stops looking after it finds an initial match within a list » Explore why VLOOKUP sometimes returns #N/A instead of a desired result » Learn about the IFNA function available in Excel 2013 and later » Use the IFERROR function to display something other than an #N/A error value when VLOOKUP can’t find a match » See how the HLOOKUP function enables you to perform horizontal matches » Learn why the INDEX and MATCH combination often is superior to VLOOKUP or HLOOKUP » Use the MATCH function to find the position of an item on a list » Learn the difference between workbook macros and personal macros » Making your macros available to all your workbooks » Use the macro recorder to create a macro » Save a file as a macro enabled excel workbook » Run a macro » View the recorded macro in VBA » Edit the macro Who Will Benefit This session is aimed at Excel users who have intermediate to advanced level knowledge and who wish to take their knowledge and understanding of the application to the next level. » Business Owners » CEO's / CFO's / CTO's » Accountants » Managers » CPA's » Financial Consultants » IT Professionals » Auditors » Human Resource Personnel » Bookkeepers » Marketers » Anybody with large amounts of Data » Anybody who uses Microsoft Excel on a regular basis, and wants to be more efficient and productive To Register (or) for more details please click on this below link: https://bit.ly/3qNHJa9 Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-02-19","date_end":"","important_dates":{"abstract":"","full":"2021-02-19","notification":"","final":""},"topics":["Business","Finance"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}