{"name":"Scopus-Indexed Springer International Conference on Image Processing and Capsule Networks","series":"","short":"","website":"http://icipcn.com/#","content":"The state-of-the-art image processing research works are dedicated to cover a wide range of computational intelligence techniques with a completely new way of neural networks organization concept called Capsule Networks \\[CapsNets\\] that opens up a new era of advanced image-processing applications. It is being organized on May 6-7, 2020 in association with King Mongkut’s University of Technology Thonburi, Thailand, Dayeh University, Taiwan, Tribhuvan University, Nepal, and RVS Technical Campus, India. Moreover, this International Conference on Image Processing and Capsule Networks \\[ICIPCN 2020\\] initiates a capsule network perspective to leverage an authoritative and detailed representation to deliver an enhanced image and video recognition and adaptive processing mechanisms which were closely related to the humanistic way of thinking. This extended ICIPCN 2020 conference will be a dedicated platform for researchers, academicians and scholars to share and exchange their valuable research insights, which may clearly define the image and the family of image processing techniques and applications. Henceforth, this premier International conference motivates the researchers to discover more information from images and perform innovative image analysis procedures by efficiently utilizing the evolving capsule network models.","date_start":"2020-05-06","date_end":"2020-05-07","important_dates":{"abstract":"","full":"2020-04-30","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Signal or Image Processing"],"location":{"virtual":"","full":["Bangkok","Thailand","Thailand"],"name":"","street":"","city":"Bangkok","state":"Thailand","ZIP":"","country":"Thailand"},"organizers":["King Mongkut’s University of Technology Thonburi, Thailand, Dayeh University, Taiwan, Tribhuvan Univ"],"societies":[],"indexes":[],"emails":[]}