{"name":"Internal Audit, Fraud Risk Assessment and Risk Management Annual Plan","series":"","short":"","website":"https://www.complianceonline.com/annual-internal-audit-fraud-risk-assessment-and-management-seminar-training-80379SEM-prdsm?channel=Brownwalker","content":"Performing a corporate wide Risk Assessment can seem like a daunting task for an organization. In reality, it can be done using a template and brainstorming with internal auditors, certified fraud examiners and business unit leaders throughout your organization. Understanding your Company’s Risk Environment is key to having an effective Internal Audit organization and understanding where to focus resources, it helps to have significant experience in internal auditing and a mind for coming up with “what could go wrong” in any control environment. The corporate wide risk assessment can be performed to maximize the efficiency and effectiveness of any organization with a diligent template and process for performing the assessment and presenting it to executive management and the Board. This seminar will equip you with a methodology that has been utilized in a robust internal audit department for a Billion dollar revenue Corporation. Learning Objectives: With an increased awareness of the effectiveness of Internal Audit organizations and the ongoing cost to organizations, an entity wide risk assessment is imperative to all organizations to maximize the efficiency and effectiveness of an Audit Organization. Performing a corporate wide risk assessment is doable, and can provide internal audit and its organization a roadmap for the upcoming audit year and also provide peace of mind for having gone through the process. The methodology has been utilized successfully in billion dollar industries, it is completed on an annual basis using templates that provide the mechanism for documenting the results of numerous meetings with Company Executives and all levels of Management conducted during the risk assessment process. Areas Covered: The key components of a Risk Assessment and Management Program The template for a risk assessment and examples of typical projects that may come up in various departments. We will spend a significant amount of time going through examples in different areas of how the template works. Brainstorming your industry and the unique types of projects that can be worthwhile projects. The methodology for successful Risk Assessment process. The steps involved in the Risk Assessment process, including an extensive explanation of different templates to be utilized, including heat maps and how to present it to the Board. Perform a mock Risk Assessment in a team environment. How to perform a fraud risk assessment. Perform a mock fraud risk assessment in a team environment. Continual refinement of audit projects throughout the Audit Year. Who will Benefit: All professionals who want to expand their knowledge in the Risk Assessment Process for Internal Audit Groups, Operational Processes and Sarbanes Oxley Risk Matrices, including CPAs (partners, managers and staff) responsible for evaluating these areas for their clients. Additionally: Internal Audit personnel involved in performing the annual Risk Assessment Internal Audit Management interested in performing a risk assessment Professionals responsible for performing risk assessment duties Risk/Compliance Officer any industry.","date_start":"2021-05-25","date_end":"2021-05-26","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}