{"name":"REACH and RoHS Compliance: Protecting Revenues with Advanced Compliance","series":"","short":"","website":"https://www.complianceonline.com/reach-rohs-weee-advanced-compliance-program-seminar-training-80469SEM-prdsm?channel=Brownwalker","content":"This 2 day Virtual Seminar will go into the specifics of the REACH and RoHS regulations, provide case studies and share lessons learned so your organization can benefit from the mistakes of others. We will review the latest on both directives and will draw out key developments and key dates (if applicable) with particular emphasis on requirements for US firms. REACH and RoHS have been referred to as \"…one of the most complex regulations in the history of the EU.\" Do not miss this 2 day seminar to find out why. Learning Objectives: After completing this virtual seminar, you will gain a better understanding of: Understanding your organization’s liability under RoHS and REACH. Review case studies. Discuss lessons learned applications to ensure full compliance. RoHS and REACH guidelines REACH Registration of Substances Introduction to REACH Articles and REACH Substances of Very High Concerns (SVHC) Supply chain communication Compliance enforcement Basics of RoHS Areas Covered: REACH Registration of Substances Introduction to REACH Articles and REACH Substances of Very High Concerns (SVHC) Supply chain communication Compliance enforcement Basics of RoHS Background and content of RoHS Responsibility for RoHS Who will Benefit: This seminar will provide valuable assistance to all personnel in: Automotive, Electronics, Medical devices, Chemical, Toys, Industrial machinery Manufacturing Professionals","date_start":"2022-01-27","date_end":"2022-01-28","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}