{"name":"Protecting Yourself From Toxic People","series":"","short":"","website":"https://bit.ly/3pHTFwL","content":"Having to deal with toxic people is overwhelming and frustrating. The non-sensical conversations, ad hominem attacks, misrepresentations, deception, lack of taking responsibility for their actions, defensiveness, back-stabbing, condescension, and sarcasm is exhausting. You'd like to just get the job done, without feeling like you're going into battle. You avoid them as much as possible, find reasons for not working with them, maybe even miss meetings they will be attending, anything to not have to interact with them - but there's no way around it, sometimes you just have to work with them. Toxic people can show up anywhere in your work or personal life – they can be customers, vendors, staff, colleagues or managers. Toxic people have specific behaviours which require specific strategies for dealing them - they are much different from the strategies and tactics for dealing with people who are merely difficult. Learning to distinguish the truly toxic from the difficult and having a range of tools and techniques readily available will give you a major advantage in getting desired outcomes. Toxic people can also be very destructive to relationships – one of the first rules of dealing with toxic people is to learn to protect yourself. In this engaging and practical webinar you will learn key strategies, tactics and skills to protect your emotional and psychological well being, without acquiescing, getting walked on, controlled or dominated, while also getting the job done, efficiently and effectively. Why Should You Attend \"When someone shows you who they are, believe them the first time\" Maya Angelou Toxicity in the workplace acts like an infectious disease - it spreads and infiltrates teams and relationships, Without the understanding, skills and tools applied intentionally, toxicity will continue to spread eventually impairing the organization and burning out the leaders and staff. In some organizations, toxicity has a seemingly intractable hold on the culture - its rampant. In other organizations it is more covert, but no less debilitating to the organization and the people. People who would not normally exhibit toxic behaviour begin reacting to the toxicity of others in ways that are negative and harmful to productivity and relationships. This is the beginning of a downward spiral. Toxicity feeding off toxicity. Good people will leave the team and organization. Toxic behaviours won't go away if they are ignored. They will fester. Specific and intentional action is the only way to counter toxicity. There are skills and tactics that will work once the underlying behaviours are identified and understood. Only by learning how to identify toxic behaviours and developing a specific plan to confront and incapacitate them, will the workplace become safe and harmonious. Objectives of the Presentation » The drivers of toxic behaviour – why they do what they do » Specific tactics, tips and tools for responding to toxic communications » How to stay centered and present when faced with toxicity » A key to relieving your own frustrating » How to get work done, have effective communications and not let them control your life Areas Covered in the Session » You work in a team or group environment » You interact with the public » You have a team or organizational leadership role » You want to have less stress and more control of interactions Who Will Benefit » All sectors and industries. All organizational levels, from senior executive to frontline staff To Register (or) for more details please click on this below link: <https://bit.ly/3pHTFwL> Email: support@concordeducations.com Tel: +1-989-341-8773","date_start":"2021-12-01","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Human-Resources","Business Management"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["ConcordEducations"],"societies":[],"indexes":[],"emails":["support@concordeducations.com"]}