{"name":"English as a Medium of Instruction in Higher Education: Practices and Challenges","series":"","short":"","website":"https://www.emi.tku.edu.tw/projects-3","content":"We are pleased to announce that with the funding support from Taiwan’s Ministry of Education, the EMI Center of Tamkang University will be holding the 2022 International Conference on Bilingual Education. The conference features the theme of English as a Medium of Instruction in Higher Education: Practices and Challenges. As EMI (English as a Medium of Instruction) quickly spreads further and further, it is important that scholars, experts, practitioners, and other stakeholders assemble to share their experiences in and studies on EMI. The 2022 International Conference on Bilingual Education thus serves the best venue for addressing the theories that support EMI, the pedagogies that it has been implemented with, the actual practices that we observe, and the changes, positive or negative, that we and learners have experienced. We look forward to welcoming you. Please refer to the detailed information below. Conference Organizer: EMI Center, Tamkang University Conference Date: April 29, 2022 (Taiwan Time, UTC+8) Venue: Tamkang University (Tamsui Campus) CONFERENCE TOPICS 1\\. English as a Medium of Instruction This strand features research and/or practices that contribute to a deeper understanding of applying English as a medium of instruction in educational contexts where English is not the first language commonly spoken. 2\\. Bilingual and Immersion Education This strand focuses on theories and practices that are related to multilingual educational settings. All aspects of bilingualism and immersion education are welcome, such as the most recent trends, bilingual behaviors, practices, changes, or challenges in the modern educational context. 3\\. Content and Language Integrated Learning This strand features presentations that report on analyses of the pedagogical suitability of content and language integrated learning in all educational levels, from school to higher education. Reports of action research on CLIL are also topics of interest to this strand. Both quantitative and qualitative inquiries into the perceptions/perspectives of CLIL teachers and/or students are welcome. 4\\. Second Language Acquisition This strand features research that examines how a second language is acquired, processed, and used by learners. It welcomes submissions that focus on any of the following aspects (but are not limited to): interactions of learners through a second language, pedagogical practices of second language teachers, and descriptions of the nature of the linguistic input learners receive and the output they produce. 5\\. Hybrid/Blended Learning This strand includes research that has the main focus on the hybrid mode of learning, which is generally defined as a learning method that combines both online learning and the conventional face-to-face learning. This strand is meaningful, particularly given the global pandemic that we are facing now. 6\\. Educational Technologies For many years, educational technologies have been integrated into educational contexts and reported to have positive impacts on both teaching and learning. Different from hybrid learning, however, this strand is given a sole aim at featuring research that looks into technology-enhanced instruction, computer-assisted language learning, computer-mediated communication, and mobile-assisted language learning. 7\\. Corpus Linguistics This strand considers research that explores corpus approaches to linguistic research or language teaching. Research methods could be either quantitative or qualitative, including analyses of any of the following aspects: vocabulary, lexico-grammar, phraseology, prosody, keyness, writing styles, and others. Presentations may also focus on analyses of corpus-aided language learning, such as data-driven learning. 8\\. Teacher Education This strand features research that discusses theories and/or pedagogical training pertaining to language teacher education. Relevant issues may include, but are not limited to, teacher identification, development of teachers’ beliefs, their cognition, and perspectives on and perceptions of a particular pedagogy. 9\\. Translation and Interpretation This strand welcomes researchers, scholars, and practitioners to exchange and share their knowledge of, experience in, and research results on all aspects of translation and interpretation. Topics may include, but are not limited to, the most recent innovations, trends, and challenges encountered. Analyses and reports of translator or interpreter training are also welcome. 10\\. Testing and Assessment As the practice of EMI has been receiving its popularity in tertiary education especially in non-English speaking countries, this strand highlights how testing and assessment in EMI contexts may be used to support or evaluate learning processes and outcomes as well as teaching effectiveness. Papers may cover relevant foci in EMI, such as principles of testing and assessment, types of assessment and tests, assessment for learning, and assessment rubrics for standardized tests. 11\\. Other Relevant Topics Topics related to the main theme or any of the strands listed above are also welcome. TYPES OF PRESENTATION: 1\\. Paper presentation (online: for overseas presenters only) 2\\. Paper presentation (face-to-face: for domestic presenters) 3\\. Graduate students’ sessions a) online paper presentation: for overseas students only b) face-to-face paper presentation: for domestic students only ABSTRACT FORMAT: 1\\. Title: 15 words (Maximum) 2\\. Abstract: Between 180 to 300 words 3\\. Keywords: 3 to 5 IMPORTANT DATES: 1\\. Deadline for Abstract Submission: February 21, 2022 (Monday) 2\\. Notification of Abstract Acceptance: March 10, 2022 (Tuesday) 3\\. Deadline for registration: March 24, 2022 SUBMISSION INFORAMTION: Visit the conference website: https://www.emi.tku.edu.tw/projects-3 CONTACT: Conference Coordinator Mr Daniel Chang Email: emitku2021@gmail.com Tel: +886-2-26215656 # 3673, 2006","date_start":"2022-04-29","date_end":"","important_dates":{"abstract":"","full":"2022-02-21","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["New Taipei","Taiwan","Taiwan","Province Of China"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":[""],"societies":[],"indexes":[],"emails":["emitku2021@gmail.com"]}