{"name":"Non-conforming Materials and Failure Investigations for Medical Devices","series":"","short":"","website":"https://www.complianceonline.com/non-conforming-materials-failure-investigations-medical-devices-webinar-training-706765-prdw?channel=Brownwalker","content":"Non-conforming material happens. And medical device companies must deal it. This 90-minute webinar will help you to make sense of confusing regulations and effectively deal with non-conforming material. You will learn where non-conforming material can occur and how to identify, segregate, control, and disposition non-conforming material. You will learn about when and how to conduct failure investigations and requirements for correction and corrective action. Join industry expert, Susanne Manz from Manz Consulting to learn the essentials of dealing with non-conforming material and performing effective failure investigations. Why Should You Attend: Dealing with non-conforming material is a necessary process for medical device manufacturers. Yet, non-conforming material is a top reason for 483 and Warning letter citations. Even worse, problems in managing non-conforming material can lead to quality problems including complaints, medical device reports, and even recalls. In this webinar, we’ll discuss the requirements for successfully managing non-conforming material and conducting failure investigations. Learning Objectives: Overview of the Regulations FDA Expectations Non-conforming material Segregation, control, and disposition of NC material Failure investigation requirements Correction and corrective action Documentation requirements Lessons Learned and Common Mistakes Preparing for an FDA Inspection Areas Covered in the Webinar: This 90-minute webinar will clarify the confusing regulations for non-conforming material. Topics to be covered include: Overview of the Regulations Definitions and expectations Acceptance activities Segregation and control Disposition types for NC material Concessions Failure investigations, when and how Correction and corrective action Documentation requirements and records Lessons Learned and Common Mistakes Who Will Benefit: Quality Systems Specialists Document Control Specialists Quality and Compliance Specialists Internal Auditors and Managers Quality Engineers Manufacturing Managers CAPA Specialists Supplier Quality Engineers and Auditors","date_start":"2021-12-06","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}