{"name":"Workshop on Disaster Risk Management in Smart City Planning","series":"","short":"","website":"https://www.wessex.ac.uk/courses/disaster-risk-management-2020","content":"This workshop will consider new insights through three recent experiences related to earthquakes and tsunamis that took place in Mexico, Chile and Japan between 2010-2017\\. The case study analysis goes from the theoretical and empirical perspective to practical implementation of solutions. In recent years, there have been two key areas of concern within Urban Planning in general, on the one hand; Threats, Risks, Vulnerabilities and Disasters caused by climate change and natural hazards have made conventional premises about land use and infrastructure management “out-of-date”, on the other hand Smart Planning has emerged as an alternative that seeks to integrate a huge amount of data in order to get key knowledge for decision making in a rapid and responsive manner. An additional challenge lies in the forward-looking nature of risks and vulnerability. That is, risk and vulnerability assessment needs to take into account those factors and processes that may not yet have become evident in past disaster situations. This is particularly valid in highly dynamic environments where both socio-natural hazards and vulnerability patterns might undergo rapid changes in the near- and mid-term future (Garschagen, 2014). The importance of integrating uncertainty in Disaster Risk Management has often been underlined but still remains an issue of concern today. In this regard, Smart City Planning could play a relevant role in considering capabilities for data collection, information processing, real-time monitoring and networked infrastructure management.","date_start":"2020-06-30","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental","Smart City and IoT"],"location":{"virtual":"","full":["Ashurst","United Kingdom"],"name":"","street":"","city":"Ashurst","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Wessex Institute"],"societies":[],"indexes":[],"emails":[]}