{"name":"Human Errors in GMP Manufacturing and Laboratory Processes Identification","series":"","short":"","website":"https://www.complianceonline.com/human-errors-gmp-manufacturing-laboratory-processes-webinar-training-706786-prdw?channel=Brownwalker","content":"This instructor-led live training webinar will discuss regulatory requirements for detecting, correcting and preventing human errors in manufacturing and laboratory environments as well as developing a competent, effective corrective and preventive action system. Why Should You Attend: Analysis of investigation reports reveal that human error is one of the top root causes for deviations, discrepancies and quality incidents in pharmaceutical manufacturing. And when you examine the CAPA's that are developed from these, retraining and rewrite of SOP is top the list. Yet on further re-examination, you find that these problems keep resurfacing again and again. Put in another way, the CAPA's are ineffective. Does it mean that the CAPA's were wrong or is it pointing to another problem? Namely, that the investigation did not pinpoint the root cause of or most probable contributing factors to the problem. Most often \"human error\" is not really the problem but a symptom of a system or facility or operation that is not designed to be run by humans. Humans do contribute to problems but more often than not, because what we are asking them to do is not designed with humans in mind. So a true CAPA should be developed to solve the problems with the system, facility and operation rather than focus on remediation of people. This requires investigations to focus on getting to the real root cause and contributing factors. Areas Covered in the Webinar: Identify why human error is often designated the root cause of deviations and discrepancies. Identify why your CAPA's are less effective than you hoped. Understand why human error is not the real cause of the deficiencies and deviations. How to probe further to identify the causes or contributing factors that really cause the problems you are seeing. How to develop a true CAPA for these problems. Develop an efficient and effective CAPA system to remedy the ingrained problems. Identification and prevention of human error during data entry. Most common GMP issues caused by human error during laboratory and manufacturing processes. Who Will Benefit: Quality Assurance Personnel Quality Control Personnel Supply Chain and Logistics Managers Regulatory Affairs Professionals Process Development Scientists and Management Manufacturing Management and Scientists Project Managers working in the CMC arena","date_start":"2022-02-24","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}