{"name":"Aligning Corporate & Order to Cash Strategies","series":"","short":"","website":"https://bit.ly/3ep9EIo","content":"Multiple functions within a company interact with customers to generate, deliver, and secure payment for orders of products and services. The understanding of their company’s strategy in engaging the marketplace and its procedures for doing so will vary widely unless they are well articulated. Usually, different departments will have different views of the company’s market strategy and its approach to implementing it. These views are supportive of their department’s individual objectives, but maybe in conflict with the company’s overall objectives and success. An example is selling on credit to insolvent customers. While that action may initially boost sales, it will eventually lead to zero sales and a significant wasted cost to fulfill the order and attempt to collect. Alignment between the “Go to Market” and O2C Strategies will minimize the conflicting actions among departments within the company and the sources of serious inefficiency, sub-optimal performance, and damage to the Customer Experience. Knowledge of Customer Facing (i.e., Customer Service) and/or Order-to-Cash processes is advised; the rest will be explained in context during the session. A session attendee does not need to be an expert in all these fields. Why Should You Attend Historically, misalignment of the O2C Strategy and the “Go to Market” Strategy results in conflicting messages received by customers. Customers receive different versions of policies and practices from Sales, Customer Service and Finance. Two examples are: » Order acceptance criteria – what constitutes a valid, acceptable order? » Invoice due dates: are payments due on the due date or within 15 days of the due date? These conflicting messages and actions can seriously degrade the Customer Experience as well as internal efficiency and effectiveness. What mixed signals is your organization presently sending to customers as a result of strategic misalignment? In today’s competitive markets, can your customer-facing departments afford to work in an environment where the “Go to Market “and O2C strategies are not aligned? Join our webinar and learn the principles of aligning your “Go to Market” and O2C strategies and the benefits that will result. Objectives of the Presentation To enable attendees to understand how Senior and Financial Management must harmonize its “Go to Market” and O2C Strategies to eliminate conflicts and give guidance to staff in their performance of everyday O2C duties. Areas Covered in the Session » The elements of a “Go to Market” Strategy » The components of an O2C Strategy » How the two strategies can be aligned » The benefits of aligning the strategies » Optimizing the Customer Experience Who Will Benefit All companies that sell their products and/or services on credit terms. » CFO’s » Controller » Treasurers » Customer Financial Services Managers » Credit Managers To Register (or) for more details please click on this below link: https://bit.ly/3ep9EIo Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2020-12-22","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Finance"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["AbideEdict"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}