{"name":"International Oil Spill Response & Environmental Protection Congress Exhibition","series":"","short":"OSRC 2019","website":"www.oilspillresponsecongress.com ","content":"The 1st International Oil Spill Response & Environmental Protection Congress & Exhibition (OSRC 2019) , scheduled on October 2019 in Manama, Kingdom of Bahrain aims to tackle the most prevalent issues facing by the regional and international oil spill industry. The event is organized by Arab Association of Petroleum Professionals (AAPP) & managed by Maarefah Energy. International Oil Spill Response & Environmental Protection Congress & Exhibition (OSRC 2019) is a must-attend event for those involved in spill prevention and response for oil and hazardous materials in the marine and environment. OSRC 2019 will bring together stakeholders in spill prevention and response from government, environmental, emergency planning, and emergency response industries to share lessons-learned, hear best practices and view new products and services. A selected high caliber national, regional and international speaker will address the conference on varies areas of expertise. The programme will stimulate learning through panel debates, technical case studies and keynote sessions that ensure that attendee's will leave with the skills and knowledge required in overcoming the challenges & risks faced by operators & other stakeholders. In keeping with the theme “Committed to Safeguarding the Energy & Environment” the congress & exhibition will showcase operators & stakeholders’ commitment for Environmental Sustainability, Oil Spill Preparedness & Prevention, the need for Synergy in Oil Spill Response & Excellence in Restoration efforts. Price : USD 699-999","date_start":"2019-10-20","date_end":"2019-10-21","important_dates":{"abstract":"","full":"2019-10-20","notification":"","final":""},"topics":["Engineering & Technology","Other"],"location":{"virtual":"","full":["manama","Bahrain"],"name":"","street":"","city":"manama","state":"","ZIP":"","country":"Bahrain"},"organizers":["Maarefah Management"],"societies":[],"indexes":[],"emails":[]}