{"name":"The 5th Conference on Ordinary Differential Equations and Dynamical Systems","series":"","short":"CODEDS 2021","website":"http://www.seminarjan.org/conference/CODEDS2021","content":"The 5th Conference on Ordinary Differential Equations and Dynamical Systems (CODEDS 2021) Conference Date: January 5-7, 2021 Conference Venue: Sanya, China Website: http://www.seminarjan.org/conference/CODEDS2021/ Online Registration System: http://www.seminarjan.org/RegistrationSubmission/default.aspx?ConferenceID=1321 Email: ic\\_vicky@163.com The 5th Conference on Ordinary Differential Equations and Dynamical Systems (CODEDS 2021) will be held in Sanya, China during January 5-7, 2021\\. CODEDS 2021 will cover issues on Ordinary Differential Equations and Dynamical Systems. It dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal, please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: ic\\_vicky@163.com Tel: +86 132 6470 2250 QQ: 1349406763 WeChat: 3025797047 Twitter: conf\\_Committee Attendance Methods 1.Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Theories of Ordinary Differential Equations (ODEs) Computational Ordinary Differential Equations Numerical Ordinary Differential Equations Integrating Differential Equations Systems of ODEs Solutions of ODEs Numerical Analysis and Methods Reduction of Order Software for ODE Solving Linear Dynamical Systems Local Dynamics Nonlinear Dynamical Systems and Chaos Arithmetic Dynamics Chaos Theory Control Theory Bifurcation Theory Ergodic Theory Complex Systems Graph Dynamical Systems Projected Dynamical Systems Symbolic Dynamics System Dynamics Topological Dynamics Applications of ODEs and Dynamical Systems Theory Other Related Topics","date_start":"2021-01-05","date_end":"2021-01-07","important_dates":{"abstract":"","full":"2020-12-05","notification":"","final":""},"topics":["Physical Science & Math","Mathematics"],"location":{"virtual":"","full":["Sanya","China"],"name":"","street":"","city":"Sanya","state":"","ZIP":"","country":"China"},"organizers":["Academic Communications"],"societies":[],"indexes":[],"emails":["_vicky@163.com"]}