{"name":"International Scientific Conference: INTERPERSONAL COMMUNICATION – Cognitive and praxiological dimensions of communication","series":"","short":"","website":"http://acadintcom.simplesite.com/448313329","content":"Romanian Academy, Iasi Branch - Institute of Economic and Social Research, \"Gh. Zane\", Department of Psychology and Pedagogy invites you to attend the International Scientific Conference: The conference will take place on Friday, 14 may, 9 a.m., 2021, AULA MAGNA – Romanian Academy, Iasi Branch, Avenue Carol I, no. 8\\. The event, at the XII-th edition, addresses the current and complex problem of the communication process, analyzed from multidisciplinary perspectives. OBJECTIVES: 1\\. The event addresses the complex process of interpersonal communication from a psychological, educational perspective but also from the perspective of artistic language. The so-called \"revolution in communication,\" generated by successive waves of technological innovation, is taken into account. 2\\. The theme of the conference reflects the current concern, more intense than ever, that has as center the communication process, connected to the new technological means, which give it a special character in modernity. Discussions and research on communication today have an unprecedented development. Thus, the results of these researches contribute invaluable to the development of communication-based fields: education, philosophy, art, teamwork, leadership, etc. 3\\. We propose the definition of communication from different perspectives, since the areas of communication imply their own specificity: interpersonal communication, in groups, in the media, didactic communication, between the two genres, between the doctor and the patient; intercultural, diplomatic communication, business and work teams, science and art. Each of these communication modalities implies certain conditions of deployment, different ways of approach and different means of realization. 4\\. There is a revolutionary scientific discovery that communication has always been and still is, more important to us, human beings than ever has been supposed. Prior to this century, no major analysis of international relations has explained the unfair standards of life or power as a result of a specific communication model among nations, but this has become a common theme today. 5\\. A more sophisticated understanding of communication has developed in this century. Now, the issue of the \"proper human condition\" is discussed. This new understanding has provoked an increased interest in communication that puts into question three interdependent factors: new communication technologies, an appreciation of the economic and political significance of communication, and developments in thinking humanistic and scientific communication. 6\\. Communication is a fundamental feature of the human being. \"Social capital\" consists of the stock of active connections between people: trust, mutual understanding, common values and behaviors that connect members of the networks and human communities, and make possible a cooperative action. We invite to participate teachers and researchers, psychologists, psychotherapists, and students interested in this topic. The papers will be published in a collective volume with academic recognition. We offer nominal Diploma of participation. DEADLINES 15 april, 2021 - for sending title and abstract in English (up to 250 words and 3-5 keywords): 20 april, 2021 - acceptance of papers. 1 may, 2021 - for sending full papers (8 to 10 pages, font Times New Roman - 12, format A4, fully justified, margins Normal. Bibliography: author, year, title, editor.) We ask participants to comply with the deadlines for submitting materials. All documents will be sent electronically to the following e-mail: acadconference@yahoo.ro The papers will meet the proposed theme and must not have been previously published. Each author can participate with a maximum of two papers. Conference website:  http://acadintcom.simplesite.com/448313329 The conference is registered in the International Database (BDI) 1\\. http://www.eventinn.com/event/1e8156ff-24cb-4541-88c9-4aad5af381d2/manage 2\\. http://www.ourglocal.com/event/?eventid=70944 3\\. https://www.allconferencealerts.com/conference\\_details/112374/ 4\\. https://www.researchgate.net/publication/348933251\\_International\\_Scientific\\_Conference\\_INTERPERSONAL\\_COMMUNICATION\\_Cognitive\\_and\\_praxiological\\_dimensions\\_of\\_communication?channel=doi&linkId=6017f4a4299bf1b33e3dc637&showFulltext=true 5\\. https://euagenda.eu/events/2021/05/14/interpersonal-communication-psychological-and-educational-interpretation 6\\. https://www.papercrowd.com/c/interpersonal-communication-cognitive-and-praxiological-dimensions-of-communication-2021/9310 7\\. https://www.eventbrite.com/e/interpersonal-communication-international-conference-tickets-139418517539","date_start":"2021-05-14","date_end":"","important_dates":{"abstract":"","full":"2021-05-01","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["str. Codrescu nr. 2","Romania"],"name":"","street":"","city":"str. Codrescu nr. 2","state":"","ZIP":"","country":"Romania"},"organizers":["Romanian Academy"],"societies":[],"indexes":[],"emails":["acadconference@yahoo.ro"]}