{"name":"Human Error Reduction Techniques for Floor Supervisors","series":"","short":"","website":"https://www.complianceonline.com/human-error-reduction-floor-supervisors-webinar-training-706137-prdw?channel=Brownwalker","content":"Attend this course to gain practical approaches for supervision on the floor, strategies to get your group in sync and approach issues in GMP related environments by using a specific methodology to correct, prevent and avoid re-occurrence of these issues. Why Should You Attend: This training would provide tools that can be implemented and used after this event. It includes practical tools. We will discuss why supervision is so important in reducing and preventing human error. Supervision approaches near root causes and root causes for supervision related errors and will address the main five elements to assure an error-free environment. Supervision plays a crucial role in Human Error Reduction and Control. Critical Factors like preparation, planning, scheduling, communication, among many others, will be discussed as part of this webinar. People make mistakes because they can; our systems allow it. To work with these challenges, it is essential to understand human behavior and the psychology of error as well as understand exactly where the weaknesses of the system are so that they can be improved and fixed. Key learning objectives: Understand human error: factors and causes. Understand the importance of supervision in creating a highly reliable group for both regulatory and business compliance. Discuss issues related to supervision and how to avoid traps that will allow errors to occur. Identify Root Causes and CAPA associated with supervision. Learn how to measure human error rates at your department and keep track of metrics. Identify what I can do to support human reliability at the site. Who Will Benefit: GMP regulated manufacturing facilities including pharma medical devices, biologics, food and nutrition and any other organization that has employees executing activities in which they can make mistakes Supervisors, managers and directors Operations Manufacturing Plant engineering QA/QC staff Process excellence/improvement professionals Industrial/process engineers Compliance officers Regulatory/legislative affairs professionals General/corporate counsel","date_start":"2021-06-17","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}