{"name":"New Perspectives in Science Education International Conference - Hybrid Edition","series":"","short":"","website":"https://conference.pixel-online.net/NPSE","content":"11th Edition - Hybrid Event – 17-18 March 2022 The Conference brings together teachers, researchers, practitioners and project managers from all over the world to share findings, expertise and experience about innovative science teaching and learning methodologies, through on-site and on-line presentations, and social events. We will deliver a full 2 days programme of inspiring sessions in the framework of a highly interactive hybrid conference experience. We will provide enhanced contents that will give participants greater access to learning, sharing and networking. - All accepted papers at the conference will be presented on-site and on-line. - Interactive questions and answers sessions will follow each paper presentation. - On-site and on-line poster presentation sessions will also be held. - Networking opportunities will be organized. All accepted papers will be included in the Conference Proceedings published with ISBN, ISSN and DOI codes. The publication will be sent to be reviewed for inclusion in the Conference Proceedings Citation Index by Thomson Reuters (ISI-Clarivate). The publication will also be included in Academia and indexed in Google Scholar. Important dates: - 06 February 2022: Extended abstract submission deadline - 09 February 2022: Notification of abstract evaluation - 24 February: Deadline for paper submission - 17-18 March 2022: Conference days There will be five presentation modalities: oral and poster presentation on-site; oral, poster and asynchronous presentation on-line. Contact: science@pixel-online.net Official website: http://conference.pixel-online.net/NPSE/callforpapers.php","date_start":"2022-03-17","date_end":"2022-03-18","important_dates":{"abstract":"","full":"2022-02-06","notification":"","final":""},"topics":["Life Sciences","Food-Science / Forestry"],"location":{"virtual":"","full":["Florence","Italy"],"name":"","street":"","city":"Florence","state":"","ZIP":"","country":"Italy"},"organizers":[""],"societies":[],"indexes":[],"emails":["science@pixel-online.net"]}