{"name":"25th International Conference on Urban Transport and the Environment","series":"","short":"","website":"https://www.wessex.ac.uk/conferences/2019/urban-transport-2019","content":"The International Conference on Urban Transport and the Environment has successfully been reconvened for 25 years, always attracting a wide international spread of delegates. It is well-established as the premier event of its type. The continuing requirement for better urban transport systems and the need for a healthier environment has added to the increasing success of this annual meeting which attracts international delegates from many different countries. Innovative systems, new approaches and original ideas need to be thoroughly tested and critically evaluated before they can be implemented in practice, which highlights the importance of the meeting. Moreover, there is a growing need for integration with telecommunications systems and IT applications in order to improve safety, security and efficiency. The Meeting also addresses the need to solve important pollution problems associated with urban transport in order to achieve a healthier environment. The variety of topics covered by the conference reflects the complex interaction of the urban transport systems with their environment and the need to establish integrated strategies. The aim is to arrive at optimal socio-economic solutions while reducing the negative environmental impacts of current transportation systems. The conference started in Southampton in 1995; continuing in Barcelona (1996); Acquasparta, Italy (1997); Lisbon (1998); Rhodes (1999); Cambridge, UK (2000); Lemnos, Greece (2001); Seville (2002); Crete (2003); Dresden (2004); Algarve (2005); WIT Campus in the New Forest (2006); Coimbra (2007); Malta (2008); Bologna (2009); Limassol (2010); Pisa (2011), A Coruña (2012), Kos (2013), Algarve (2014), Valencia (2015), Crete (2016) and Rome (2017). All papers are included in the WIT Transactions and archived in the Wessex Institute’s eLibrary at www.witpress.com/elibrary, where they are permanently and easily available to the international community.","date_start":"2019-06-25","date_end":"2019-06-27","important_dates":{"abstract":"","full":"2019-06-25","notification":"","final":""},"topics":["Engineering & Technology","Transportation","Urban Studies, Planning & Design"],"location":{"virtual":"","full":["Aveiro","Portugal"],"name":"","street":"","city":"Aveiro","state":"","ZIP":"","country":"Portugal"},"organizers":["Wessex Institute"],"societies":[],"indexes":[],"emails":[]}