{"name":"The Drug Development Process from Concept to Market","series":"","short":"","website":"https://www.complianceonline.com/drug-development-process-concept-and-market-seminar-training-80635SEM-prdsm?channel=Brownwalker","content":"This course is designed to cater for employees of pharmaceutical companies who would like an understanding of the drug development and regulatory approval process. The course starts by considering the global pharmaceutical market, important therapeutic areas and the roles of different pharmaceutical professionals in the development process, as well as a definition of drugs and medical devices. The drug development process, from discovery to post-marketing surveillance, is then explained. Topics include the identification of drug targets, synthesis of chemical drugs and the development of biologics, pharmacokinetics and toxicity screening, pre-clinical development, clinical studies, regulatory submissions, managing post-approval change, pharmacovigilance and an overview of regulations governing drug manufacture and distribution. Learning Objectives: By the end of this course, you will understand: The size of the global pharmaceutical market and the key therapeutic areas being addressed by innovator companies The roles of different pharmaceutical professionals Typical costs and timelines associated with drug development How new drugs are developed against targets in the human body Reasons why drugs fail during development Factors affecting oral bioavailability How drugs are screened for toxicity The potential influence of polymorphism, salt form and isomerism on efficacy and safety How formulation can affect drug performance Who will Benefit: Non-scientific employees of pharmaceutical companies who would like to understand how drugs are developed (e.g. IT, human resources, engineering and administrative staff) Recently-appointed scientific staff with no previous experience of the pharmaceutical industry Any pharmaceutical employee wishing to improve their knowledge of drug development","date_start":"2022-01-24","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}