{"name":"DigiMarCon California 2022 - Digital Marketing, Media and Advertising Conference & Exhibition","series":"","short":"","website":"https://digimarconcalifornia.com","content":"\"DigiMarCon California 2022 is your chance to ... – Experience a safe and intimate gathering with marketing leaders and professionals in a clean and hygienic environment. – Hear from some of the most audacious and thought-provoking speakers in the digital marketing, media and advertising industry. – Gain insight into emerging strategies, the latest innovative technologies, and best practices to move your business to the next level. – Network with thought leaders, reunite with your peers, and build your professional network. DigiMarCon California, the Premier Digital Marketing, Media and Advertising Conference & Exhibition in California, returns June 16th and 17th, 2022 to the luxurious Westin San Diego Gaslamp Quarter Hotel in San Diego, California. Join your peers in-person or online for 2-days jam-packed with digital marketing best practices, latest trends, practical solutions, strategy, and networking, also check out the next generation of technology & innovation; Internet, Mobile, AdTech, MarTech & SaaS Technology. Expand your knowledge on the following topics: Account-Based Marketing, Behavioral & Neuromarketing, Content Marketing, Conversational Marketing, Conversion Rate Optimization, Data Science & Big Data, Email Marketing, Geo-Targeting & Proximity Marketing, Growth Hacking, Inbound & Outbound Marketing, Influencer Marketing, Mobile Marketing, Native & Contextual Advertising, Omnichannel Marketing, Paid Search Marketing, Personalization & Privacy. You’ll also learn the following: Podcast & Webinar Marketing, PR & Cause Marketing, Predictive Analytics & Attribution, Programmatic Advertising, Sales & Marketing Automation, Search Engine Optimization, Shopper Marketing, Marketing & Customer Experience, Social Commerce, Social Media Marketing, UI / UX Design, User-Generated Content, Video Marketing, Viral & Buzz Marketing, Visual & Voice Search, Web Analytics, and much more! Onsite Safety: Your safety is our TOP PRIORITY! Our qualified team is dedicated to ensuring a great experience at our in-person events, and that includes providing a COVID-Safe, clean and hygienic environment for our delegates. 100% Money Back Guarantee: Booking your ticket is RISK-FREE. You can cancel and get a full refund up until 30 days before the event. At DigiMarCon California 2022, you will receive all the elements you need to achieve digital marketing success! Conventional thoughts will be challenged, and new ways of thinking will emerge. You will leave with your head, notebooks, and professional toolkit full of action items and ideas to lead and supercharge your agency/team/account to even greater success. Be a part of DigiMarCon California 2022 and discover how to thrive and succeed as a marketer in a rapidly evolving digital world. Top keynotes, case studies, strategy sessions, networking, and more in a safe and hygienic environment! See why people keep coming back year after year to this must-attend event! Register and secure your seat today. For more details visit https://digimarconcalifornia.com.\"","date_start":"2022-06-16","date_end":"2022-06-17","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Other","Business Management"],"location":{"virtual":"","full":["San Diego","California","United States"],"name":"","street":"","city":"San Diego","state":"California","ZIP":"","country":"United States"},"organizers":["DigiMarCon California"],"societies":[],"indexes":[],"emails":[]}