{"name":"How to Read and Understand an Annual Report","series":"","short":"","website":"https://www.complianceonline.com/how-to-read-and-understand-an-annual-report-webinar-training-706814-prdw?channel=Brownwalker","content":"Accounting and finance is supposed to be the international language of business. If so, then why do we struggle so much to make sense of the numbers? Are we so busy managing our business and leading our staff, that we don’t have time to wade through the financials, discover the trends, draw proper conclusions and take appropriate action? What if our peers, or worse, our competition understands our numbers better than we do? In this session, Miles Hutchinson, experienced accounting and finance expert and business adviser, will explain how to quickly and introduce you to the financial reporting of public and private companies! Why Should You Attend: How did your business perform last year? How did the competition do? What’s the trend in their key business data over the last two years? How can this information help you identify the key things you need to focus on in the upcoming year? Do you struggle with the language of business? How well do you understand terms like, Balance Sheet, Income Statement, P&L, Operations Statement, Cash Flow, MD&A, Business Risk, Top Line Growth, Gross Margin, Gross Profit, Return on Capital, Liquidity, Financial Leverage, EBITDA, Cash flow from Operations, Free Cash Flow, etc.? Grab a cup of coffee and join us to learn how to read and understand an annual report and use this intel to assess the financial condition, results of operations and the cash flows of any company. Join C-suites, business analysts and investors from around the globe and empower your team to maximize the benefit from your crystal clear understanding of the numbers. Areas Covered in the Webinar: Explain the Balance Sheet also known as the Statement of Financial Condition Dissect the Income Statement, also known as the P&L or Results of Operations Statement Demystify the Statement of Cash Flows Understand why the accounting and reporting rules require the use of Accrual Accounting Discover who the rule makers are and how reporting differs for companies organized under the laws of other countries Review the components of the annual report of a prominent publicly traded company and learn how to use this wealth of information to evaluate financial health, strength, risk profile and performance Learn about resources available to advance your learning Who Will Benefit: Nonfinancial Executives Board Members Business Advisors Business Unit Managers Department Managers Budget Managers","date_start":"2022-05-18","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}