{"name":"Memory Studies Summer School","series":"","short":"","website":"https://memory.lcir.co.uk/memory-studies-summer-school","content":"This summer school will cover topics in memory studies, historiographical reflection on narrative, oral history methods, anthropological studies on myth, memory and rituality and cinematic approach to the processes of memory telling. Structured over a week, the school courses will explore to the following topics: Memory Studies: past and present time, social concerns of memory, understanding the past, the shapes of memory; Historical time and human experience; Memory and Historiography in the social context; The rituals of memory and commemoration: the work of memory, the plurality of memories; Memory telling, rituality and experience; Memory practice and subjectivity; We are looking forward to applications from students, researchers and professionals with a particular interest related to Memory Studies, Historiography and Anthropology. The summer school will allow you to deepen critical thinking and theoretical and methodological knowledge in the interdisciplinary field of Memory Studies. The school activities will include lectures, workshops, film screenings, visits, presentation and discussion. Participants will be encouraged to make a short presentation exploring a topic related to the summer school’s content and attend at least two lectures and workshops. A Certificate of Completion will be provided by the end of the school. The fee for participants is 420 GBP, which includes learning materials, coffee breaks, lunches and a number of social events. The fee does not include travel and accommodation costs. In order to book a place, please fill in the Booking Form and send it to memory@lcir.co.uk by 1 March 2020\\. After you receive a confirmation of booking, please register on http://registration.lcir.co.uk.","date_start":"2020-08-11","date_end":"2020-08-16","important_dates":{"abstract":"","full":"2020-03-01","notification":"","final":""},"topics":["Life Sciences","Neuroscience"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["LCIR"],"societies":[],"indexes":[],"emails":["memory@lcir.co.uk"]}