{"name":"How to Conduct an ACH Risk Assessment and Develop an Effective ACH Risk Management Program","series":"","short":"","website":"https://www.complianceonline.com/ach-risk-management-seminar-training-80312SEM-prdsm?channel=Brownwalker","content":"There is risk in every type of payment system and the ACH network is no exception. As a Financial Institution, Third Party Service Provider or a Third-Party Sender, processing ACH transactions, you can encounter a variety of risks such as credit, fraud and operational (to name a few). According to the NACHA Operating Rules, financial institutions are required to assess and manage all ACH risks, particularly when the institutions engage in riskier ACH activities. The risk of fraud can be mitigated through proper due diligence for all originating customers and strict adherence to ACH and credit policies. Why Should You Attend: This virtual 2-day workshop will include a hands-on activity (using provided worksheets) where participants can participate in \"assessing the risk\" of fictitious companies and third parties to help identify the importance of due diligence (KYC-Know Your Customer) and setting exposure limits. In addition, adhering to the financial institutions ACH Policies on Origination and Receipt of ACH Entries is a big part of managing ACH risk. Exposure limits should be appropriate based on the risks of each customer (Originator) and identifying potential companies who may require the use of pre-funding arrangements or reserves (which can both be effective in helping to control losses). ODFI's and RDFI's are exposed to a variety of risks when originating, receiving, or processing ACH transactions, or outsourcing these activities to a third party. Financial Institutions should use guidance provided by FinCEN, the FFIEC and the OCC (in addition to the Rules developed by NACHA) to develop an ACH Risk Management program that reflects the nature and complexity of their activities. This workshop will identify the guidance provided and provide resources for effectively managing ACH Risk in the future. In this session, we will outline the key components of an effective ACH risk management program while participating in developing that program in a fictitious scenario. Learning Objectives: How the ACH Network functions NACHA Operating Rules on conducting an ACH Risk Assessment Developing an effective ACH Risk Management Program The different types of Risk and ways to mitigate What’s needed for a successful ACH Risk Management Program Who will Benefit: Any payments professional working in the ACH Network will benefit from this course; these individuals could include operations, compliance, AR/AP, payroll, risk management, audit, legal counsel, management, risk officers, and AAP’s.","date_start":"2021-07-13","date_end":"2021-07-14","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}