{"name":"2022 Asia-Pacific Conference on Economics and Finance ‘LIVE’","series":"","short":"","website":"https://apef.ear.com.sg","content":"2022 Asia-Pacific Conference on Economics and Finance ‘LIVE’ (APEF2022) 15-16 December 2022 Holiday Inn Singapore Atrium, Singapore With plans to substantially ease travel restrictions, now is the best time to plan your trip to Singapore, the Monte Carlo of Asia! We’re pleased to announce that the 2022 Asia-Pacific Conference on Economics & Finance (APEF 2022), organized by East Asia Research & supported by Universiti Malaysia Sarawak and Loughborough University, UK, will be a hybrid conference happening in Singapore from December 15-16, 2022! Learn from the masters at the premier conference for the Economics and Finance community. This is a good opportunity to meet old friends and make new ones for future research collaborations. Limited seating may apply. ‘BUY TICKET’ now. Don’t wait – this rate won’t last long! Due to the persistence of COVID-19, the conference will be conducted in a ‘Hybrid Format’. Participants can make oral/poster presentations onsite or send us pre-recorded video presentations and register as a ‘Virtual Presenter’. They will indicate their preferred presentation medium when they register. The ‘Early Bird Registration Deadline’ is on October 14th 2022\\. APEF Keynote Speakers: Dr Steven Cochrane, Chief APAC Economist, Moody's Analytics Dr. Kai-Hong Tee, Senior Lecturer in Finance, Loughborough University Dr. Evan Lau, Associate Professor, UNIMAS Abstract Submission Deadline: 15th July 2022 Enquiries: anthonytan@ear.com.sg Web address: https://apef.ear.com.sg Sponsored by: East Asia Research, Universiti Malaysia Sarawak (UNIMAS), Loughborough University, UK P.S. If you are representing an Association or an Institute of Higher Learning and would like to be a conference partner, please get in touch with us. Many benefits await you when joining us!","date_start":"2022-12-15","date_end":"2022-12-16","important_dates":{"abstract":"","full":"2022-07-15","notification":"","final":""},"topics":["Business","Economics","Economics & Business Management"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["East Asia Research, Universiti Malaysia Sarawak (UNIMAS), Loughborough University, UK"],"societies":[],"indexes":[],"emails":["anthonytan@ear.com.sg"]}