{"name":"10th International Conference on Pattern Recognition Applications and Methods - ICPRAM 2021","series":"","short":"","website":"http://www.icpram.org","content":"10th International Conference on Pattern Recognition Applications and Methods ICPRAM website: http://www.icpram.org February 4 - 6, 2021 Vienna, Austria In Cooperation with: IEEE CIS In Cooperation with: INNS, AAAI, AI\\*IA and APRP. Proceedings will be submitted for indexation by: SCOPUS, Google Scholar, DBLP, Semantic Scholar, Microsoft Academic, EI and Conference Proceedings Citation Index. IMPORTANT DATES: Regular Paper Submission: September 14, 2020 Authors Notification (regular papers): November 12, 2020 Final Regular Paper Submission and Registration: November 26, 2020 Position Paper Submission: October 29, 2020 Authors Notification (position papers): December 4, 2020 Final Regular Paper Submission and Registration: December 18, 2020 Scope: The International Conference on Pattern Recognition Applications and Methods is a major point of contact between researchers, engineers and practitioners on the areas of Pattern Recognition and Machine Learning, both from theoretical and application perspectives. Contributions describing applications of Pattern Recognition techniques to real-world problems, interdisciplinary research, experimental and/or theoretical studies yielding new insights that advance Pattern Recognition methods are especially encouraged. Papers describing original work are invited in any of the areas listed below. Accepted papers, presented at the conference by one of the authors, will be published in the proceedings of ICPRAM with an ISBN. Acceptance will be based on quality, relevance and originality. There will be both oral and poster sessions. Special sessions, dedicated to case-studies and commercial presentations, as well as technical tutorials, dedicated to technical/scientific topics, are also envisaged: companies interested in presenting their products/methodologies or researchers interested in presenting a demo or lecturing a tutorial are invited to contact the conference secretariat. Conference Topics: Area 1: Theory and Methods - Advanced Learning Methods - Linear Models and Dimensionality Reduction - Machine Learning Methods - Model Representation and Selection - Shape Representation - Signal Processing - Bayesian Models and Stochastic Methods - Case-Based Reasoning - Classification and Clustering - Deep Learning and Neural Networks - Ensemble Methods - Evolutionary Computation - Feature Selection and Extraction - Knowledge Acquisition and Representation Area 2: Applications - Audio and Speech Analysis - Motion Tracking and Action Recognition - Natural Language Processing - Robotics - Sensors and Early Vision - Virtual Environments - Bioinformatics and Systems Biology - Biometrics - Data Mining and Algorithms for Big Data - Document Analysis - Image and Video Analysis and Understanding - Industry Related Applications - Information Retrieval - Medical Imaging ICPRAM KEYNOTE LECTURE Julian Fierrez, Universidad Autonoma de Madrid, Spain Cornelia Fermüller, University of Maryland, United States Marco Gori, University of Siena, Italy ICPRAM CONFERENCE CHAIR: Ana Fred, Instituto de Telecomunicações and University of Lisbon, Portugal ICPRAM PROGRAM CO-CHAIRS: Maria De Marsico, Sapienza Università di Roma, Italy Gabriella Sanniti di Baja, Italian National Research Council CNR, Italy PROGRAM COMMITTEE http://www.icpram.org/ProgramCommittee.aspx ICPRAM Secretariat Address: Avenida de S. Francisco Xavier, Lote 7 Cv. C Tel: +351 265 520 185 Fax: +351 265 520 186 Web: http://www.icpram.org e-mail: icpram.secretariat@insticc.org","date_start":"2021-02-04","date_end":"2021-02-06","important_dates":{"abstract":"","full":"2020-09-14","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Machine Learning"],"location":{"virtual":"","full":["Vienna","Austria"],"name":"","street":"","city":"Vienna","state":"","ZIP":"","country":"Austria"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["icpram.secretariat@insticc.org"]}