{"name":"21 CFR Part 11 Compliance for SaaS/Cloud Applications","series":"","short":"","website":"https://www.complianceonline.com/21-cfr-part-11-compliance-for-saas-cloud-applications-seminar-training-80202SEM-prdsm?channel=Brownwalker","content":"This highly interactive two-day course uses real life examples and explores proven techniques for reducing costs, usually by two-thirds, associated with implementing, and maintaining computer systems in regulated environments. It details the requirements for Part 11 and Annex 11: SOPs, software product features, infrastructure qualification, and validation. The instructor addresses the latest computer system industry standards for data security, data transfer, audit trails, electronic records and signatures, software validation, and computer system validation. Understand the specific requirements associated with local and SaaS/cloud hosting solutions. Nearly every computerized system used in laboratory, clinical, manufacturing settings and in the quality process has to be validated. Participants learn how to decrease software implementation times and lower costs using a 10-step risk-based approach to computer system validation. The instructor reviews recent FDA inspection trends and discusses how to streamline document authoring, revision, review, and approval. Participants will learn how to write a Data Privacy Statement to comply with the EU General Data Protection Regulation (GDPR). This course benefits anyone that uses computer systems to perform their job functions and is ideal for professionals working in the health care, clinical trial, biopharmaceutical, and medical device sectors. It is essential for software vendors, auditors, and quality staff involved in GxP applications. Learning Objectives: Reduce costs, usually by two-thirds, for compliance with electronic records Learn how to use electronic records and electronic signatures to maximize productivity Understand what is expected in Part 11 and Annex 11 inspections so you are prepared Avoid 483 and Warning Letters Understand the responsibilities and specific duties of your staff including IT and QA Understand your responsibilities and liabilities when using SaaS/cloud Learn how to perform risk-based Computer System Validation using fill-in-the-blank templates How to select resources and manage validation projects \"Right size\" change control methods that allows quick and safe system evolution Minimize validation documentation to reduce costs without increasing regulatory or business risk Who will Benefit: GMP, GCP, GLP, regulatory professionals QA/QC IT Auditors Managers and directors Software vendors, SaaS hosting providers","date_start":"2021-10-13","date_end":"2021-10-14","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}