{"name":"International Conference on Communication and Media Studies: \"Media and Development\"","series":"","short":"","website":"https://media.lcir.co.uk","content":"\\*Selected papers will be published in a post-conference volume. In an ever-changing world swept by online news, global flows of information and stories, entertaining platforms of films and music, understanding media products and outlets has become urgently important and simply fundamental. The steady development of the world has brought a 24/7 attachment to TV sets, mobile phones, PCs, Tablets and all other gadgets and devices. News of rises and falls of regimes, health emergencies and lockdowns, ups and downs of stock markets keeps the world connected to the media and asserts its role in mapping and shaping our views, narratives and cultures. We crave for information locally, nationally and internationally. Media, communication technologies and information tools impact our daily lives in countless ways and we need to find appropriate theoretical frameworks and practical strategies to study them. This conference is an attempt to do so. In the course of the conference we will try to answer questions such as: What is media? What are its different manifestations and functions? What contribution does it make to today’s global world in terms of scientific enhancement, global policies, cultural exchange and awareness, entertainment industry and academic value and engagement? These are some of the themes the conference aims to explore by bringing speakers (both academics and professionals) from various parts of the world and fields of interest. The conference will also provide students with an opportunity to participate through poster presentations and round-table discussions. Proposals up to 250 words accompanied by a brief biographical note should be sent to: media@lcir.co.uk. Please download the paper proposal form on our website: https://media.lcir.co.uk/.","date_start":"2022-07-02","date_end":"2022-07-03","important_dates":{"abstract":"","full":"2022-05-15","notification":"","final":""},"topics":["Arts & Humanities","Visual Arts"],"location":{"virtual":"","full":["London/online","United Kingdom"],"name":"","street":"","city":"London/online","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["media@lcir.co.uk"]}