{"name":"The 5th Int'l Conference on Statistics, Mathematical Modelling and Analysis","series":"","short":"SMMA 2022","website":"https://www.maymeeting.org/conference/SMMA2022","content":"The 5th Int'l Conference on Statistics, Mathematical Modelling and Analysis (SMMA 2022) Conference Date: May 27-29, 2022 Conference Venue: Xi'an, China Website: https://www.maymeeting.org/conference/SMMA2022/ Online Registration System: https://www.maymeeting.org/RegistrationSubmission/default.aspx?ConferenceID=1482 Email: wsconf5@163.com The 5th Int'l Conference on Statistics, Mathematical Modelling and Analysis (SMMA 2022) will be held in Xi'an, China, during May 27-29, 2022\\. The aim of SMMA is to provide a stage for researchers, engineers, academicians as well as industrial professionals from all over the world to present their research results and development activities in Applied statistics, Data modeling and analysis, Design of simulation experiments, Statistical analysis system programming, Statistical applications, Statistical genetics, Statistics and mathematics education, etc. SMMA 2022 will be a valuable and important platform for inspiring international and interdisciplinary exchange at the forefront of Statistics, Mathematical Modelling and Analysis. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal，please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: wsconf5@163.com Tel: +86 132 6470 2250 (From Monday to Friday) QQ: 1349406763 WeChat: 3025797047 Official Account: Academic Communications Attendance Methods 1.Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Actuarial science Applied data mining and statistical learning Applied Simulation Applied statistics Applied time series analysis Biometrics and applied statistics Biostatistics and bioinformatics Data modeling and analysis Design of simulation experiments Econometrics Financial mathematics Geostatistics Image, speech and video processing and analysis Linear algebra and programming models Mathematical modelling Metamodelling and regression Model verification and validation Modeling and simulation Modeling simulation inputs Numerical analysis Pattern recognition and analysis Random processes Real analysis and statistics Sampling techniques Satisfiability modulo theories Sensitivity analysis Singular perturbation theory Smoothing and statistical graphics Social science methodology Statistical analysis system programming Statistical applications Statistical genetics Statistics and mathematics education Statistics for environments Stochastic modelling","date_start":"2022-05-27","date_end":"2022-05-29","important_dates":{"abstract":"","full":"2022-04-27","notification":"","final":""},"topics":["Physical Science & Math","Mathematics","Applied Mathematics & Statistics"],"location":{"virtual":"","full":["Xi'an","China"],"name":"","street":"","city":"Xi'an","state":"","ZIP":"","country":"China"},"organizers":["Academic Communications"],"societies":[],"indexes":[],"emails":["wsconf5@163.com"]}