{"name":"International Conference on Intelligent Computing and Control Systems","series":"","short":"ICICCS 2020","website":"http://iciccs.com/2020/index.html","content":"The advent of ever-augmenting and ubiquitous computational and control resources enhanced the opportunities for developing various intelligent computational and control techniques to solve number of real time issues like uncertainties, vagueness and imprecision techniques. This International Conference on Intelligent Computing and Control Systems (ICICCS 2020) organized on 13-15, May 2020 by Vaigai College Engineering (VCE), Madurai, India rapidly covers the research topics with myriad of applications for developing innovative next- generation technologies. Enormous number of intelligent computational and control algorithms with the increasing computational and control power of computers have significantly extended the focus of researchers and scientists on providing unprecedented innovations in intelligent computing and control systems. ICICCS 2020 will be an international forum for providing intelligent solutions using Artificial Intelligence \\[AI\\], Machine Learning, scientific Computing, evolutionary algorithms, intelligent agents, Fuzzy logic control, neuro-fuzzy control, neural network control, genetic control and so on. ICICCS 2020 provides an interdisciplinary platform for researchers, academicians and scientists to present and discuss the most recent innovations, trends, and concerns along with practical challenges encountered and solutions adopted in the fields of Intelligent Computing and Control Systems.","date_start":"2020-05-13","date_end":"2020-05-15","important_dates":{"abstract":"","full":"2020-03-04","notification":"","final":""},"topics":["Engineering & Technology","Electrical/ Electronic","computer science"],"location":{"virtual":"","full":["Madurai","India"],"name":"","street":"","city":"Madurai","state":"","ZIP":"","country":"India"},"organizers":["Vaigai College of Engineering"],"societies":[],"indexes":[],"emails":[]}