{"name":"A Review of the Latest Prevention and Treatment Strategies For COVID-19","series":"","short":"","website":"https://www.complianceonline.com/covid-prevention-treatment-webinar-training-706536-prdw?channel=brownwalker","content":"There is a lot of confusion around what will happen to individuals, what this new enemy is that has suddenly appeared in our midst, interrupted/threatened our lives and what to do to stay safe. The goal of this webinar it to provide clear information and provide an update to the latest prevention and treatment strategies for COVID-19\\. The Coronaviruses (CoV) are positive sense RNA viruses possessing spike-like projections on the surface creating a crown-like appearance upon magnification with electron microscopy. They are a large family of viruses causing a wide range of illness from the common cold to more severe diseases, such as Middle East Respiratory Syndrome (MERS-CoV) and Severe Acute Respiratory Syndrome (SARS-CoV). The novel coronavirus (2019-nCoV) or the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) is a man-made chimera that was engineered in 2015 in the University of North Carolina at Chapel Hill. This engineered virus claimed its first victim in the Wuhan Institute of Virology, in Wuhan China in December 2019\\. On December 31st 2019, China notified the outbreak to the World Health Organization. The World Health Organization (WHO) on March 11, 2020, declared COVID-19 a pandemic, pointing to the over 118,000 cases of the coronavirus illness in over 110 countries and territories around the world and the sustained risk of further global spread. We consider this epidemic a threat to the entire human life due to the lack of a sufficient preventive and treatment strategy to protect against it until now.","date_start":"2020-08-27","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal","COVID-19"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}