{"name":"Performance Management: Dealing with the difficult employee","series":"","short":"","website":"https://bit.ly/3iNMQEa","content":"In spite of good hiring and inspired leadership, all supervisors ultimately must deal with someone with Toxic Attitude Syndrome. Whether it's crummy attitude, attendance, or just unable to do good work; employee performance issues often consume large amounts of time, energy, and emotion. In fact, 57 pct of employees have witnessed abusive or intimidating behavior and probably 100 pct work with someone who isn't pulling their weight. This webinar is designed to give managers insight and tools for effectively dealing with performance issues.It is a challenging job but with the right preparation, we can hold employees accountable and improve our organizations. You will receive several handouts that will act as a toolkit to get you started with your own program. Why Should You Attend Copy of the presentation. A sample corrective action policy. Sample corrective action documentation form. A termination checklist. A sample Performance Improvement Plan (PIP) form. A sample Investigation Questionnaire Form. Areas Covered in the Session » How to start off on the right foot by creating clear expectations » How poor performance effects organizational performance and work environments » How progressive discipline policies can hurt you » Why probationary periods may be a bad idea » What is employment-at-will and when can you use it? » The key concepts in just cause » Steps for conducting disciplinary investigations » How to hold employees accountable for sustained change » A simple system for determining how to coach employees » Dealing with difficult people » 11 barriers supervisors face in managing behavior » Methods for objectively documenting Toxic Attitude Syndrome » How to prepare for termination » How to prepare for and conduct a disciplinary meeting » Performance Improvement Plans - receive a sample form » Setting SMART goals for employee performance Who Will Benefit » Managers and Supervisors who have responsibility for corrective Action » Human Resources Professionals » People who aspire to Leadership and Supervisory positions To Register (or) for more details please click on this below link: https://bit.ly/3iNMQEa Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-02-22","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Management / Leadership"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}