{"name":"World Cloud Show India 2021","series":"","short":"","website":"https://tresconglobal.com/conferences/cloud/india/?utm_source=trescon_global&utm_medium=brown_walker_press&utm_campaign=wcs_india&utm_id=wcs_india","content":"World Cloud Show India 2021\\. 15 September 2021\\. Navigating the Next Normal With Cloud and Data Centres Exploring the latest cloud and digital infrastructure trends, along with data centers that will drive the next phase of cloud transformation in India. What Is the World Cloud Show? World Cloud Show is a thought-leadership-driven, business-focused, global series of events that takes place in strategic locations across the world. As part of the world tour, this Indian edition is gathering pre-qualified CIOs, CTOs, COOs, Heads of the Cloud, Heads of IT Infrastructure, DevOps Leaders, Heads of Digital Transformation/Innovation, and Experts in Cloud Computing among others from cross-industry verticals across India. The show features exciting keynotes, government and enterprise use-case presentations, product showcase, panel discussions, and tech talks to discuss the latest challenges and explore the latest applications of cloud-based solutions. Why India? Cloud technology has evolved from being a mere back-end storage technology to a front-end technology, enabling on-demand access to resources, flexibility in scaling, cost reduction, and business continuity. The increasing adoption of advanced technologies is thrusting the growth of the Indian cloud infrastructure market. The Indian Government’s 'Cloud Vision for India 2022', DigiLocker, and MeghRaj aim to establish the country as a global hub for cloud computing, content hosting and delivery, data communication systems, and services. Demand for cloud archiving, cloud backup, and disaster recovery is gathering steam in the wake of the Covid-19 pandemic. It is expected that growth in the Cloud Storage-as-a-Service (STaaS) market will peak by 2022\\. \"The Cloud Computing-as-a-Service (CCaaS) market in India is growing at a CAGR of 15 percent from 2019-24\" Source: 451 Research | S&P Global Market Intelligence \"We are extremely impressed and blown away by this experience. Thank you for the amazing platform, the great support, the turnaround on requests and just being ON from the get-go\" - Axis Communications Leaders in Network Cameras, Sweden","date_start":"2021-09-15","date_end":"","important_dates":{"abstract":"","full":"2021-09-14","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","cloud storage & computing"],"location":{"virtual":"","full":["Online Event","India"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"India"},"organizers":["Trescon Global"],"societies":[],"indexes":[],"emails":[]}