{"name":"The 7th Int'l Conference on Advances in Cell Biology","series":"","short":"CACB 2022","website":"https://www.deconf.org/conference/CACB2022","content":"The 7th Int'l Conference on Advances in Cell Biology (CACB 2022) will be held during December 9-11, 2022 in Sanya, China. The conference will cover issues on Cell culture, manipulation and emerging cell technologies/Cell engineering, Cell energy and metabolism, Cell signal transduction, Cell structure, events and functions, Cellular immunology, Cellular physiology, Cellular senescence, apoptosis and autophagy, Cytopathology, etc. It dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods in related fields. Publication and Presentation Publication: All the accepted papers will be published by a peer-reviewed open access journal that can ensure the widest dissemination of your published work, for more information, please contact us (workshop12@163.com). Index: CNKI and Google Scholar Note: 1\\. If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. 2\\. Please click Template for Manuscripts (below the Registration button at the top left corner) to download the Full Paper template and prepare your article according to it. The full length of one paper is suggested to be 8-10 pages (within the template format with all tables, figures and references). If your paper is over 10 pages, you will be kindly requested to pay for extra pages fees. 3\\. The simple Abstract submission should include the title, contents, keywords, authors names, affiliations and emails. The length is suggested to be controlled within 1 page and no more than 2 pages. 4\\. You will receive the review results within 3-5 working days after submission. If you do not get any notification within the time limit, please contact us as soon as possible. 5\\. You are welcome to submit papers in Chinese and please contact us for more details. Contact Us Email: workshop12@163.com Tel: +86 18672346485 QQ: 1349406763 WeChat: 3025797047 Official Account: Academic Communications","date_start":"2022-12-09","date_end":"2022-12-11","important_dates":{"abstract":"","full":"2022-12-09","notification":"","final":""},"topics":["Life Sciences","Biotechnology/ Bioinformatics"],"location":{"virtual":"","full":["Sanya","China"],"name":"","street":"","city":"Sanya","state":"","ZIP":"","country":"China"},"organizers":["Academic Communications"],"societies":[],"indexes":[],"emails":["workshop12@163.com"]}