{"name":"Lecture and Workshop: \"Ecofeminist Readings of Life on Earth\"","series":"","short":"","website":"https://eco.lcir.co.uk/ecofeminism-workshop","content":"What is ecological discourse? How do feminist principles inform one’s environmental awareness? The session commences with a lecture that revolves around some of the tenets of ecocriticism and introduces participants to the ecofeminist worldview. Our intention is to create ecodiscourse as a powerful commentary against transnational (industrial) policies and political grids that sanction ecological deterioration and human exploitation. In the workshop, participants are asked to formulate their unique approach to specific literary excerpts, develop critical judgments and formulate comparative approaches to ecocide. The activities complement the theory by focusing on how capitalism and patriarchy are responsible for the current ecological crisis and the domination of women. An additional activity is the development of visual literacy by relating textual passages to short films, images and/or artifacts. The workshop is designed for students, young scholars and independent researchers with a particular interest related to ecocriticism and/or gender studies. It will allow them to deepen theoretical and methodological knowledge and critical thinking in their area of research. All the registered participants who will attend the workshop will receive certificates. In order to book a place, please register on https://registration.lcir.co.uk by 15 September 2021\\. Registration fee is 45 GBP Contact email address: workshops@lcir.co.uk","date_start":"2021-10-17","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Arts & Humanities","Other","environmental science & ecology"],"location":{"virtual":"","full":["Online Event","United Kingdom"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research and Academic LAB"],"societies":[],"indexes":[],"emails":["workshops@lcir.co.uk"]}