{"name":"Turning Points: Interpreting the Past, Explaining the Present and Imagining the Future","series":"","short":"","website":"https://turningpoints.lcir.co.uk","content":"Why \"Turning Points\"? Because amid history's relentless unfolding come singular years of change. Come fulcrums in time when a genuinely new tomorrow takes hold among people, nations, and states. \"Do not call it fixity, where past and future are gathered\" as the poet wrote, \"there is only the dance\". Why? What's at work? What's the momentum? Why the decisive moment? Who or what drives the forces that make history's twists and turns happen in the dance of the past to the future? The attractions, the repulsions, the needs? This issue is now of particular relevance in light of the recent advanced analysis in the social sciences, history, the humanities and other pertinent domains regarding the hinges of profound alteration that occurred in 1918, 1948, 1968, 1978 and 2018 -- our key case study years. Our Turning Points conference attempts to gather together and expand this work to a new level now that scholarship has achieved an advanced stage of understanding key socio-economic, cultural and policy issues for these times. Other relevant approaches complement specific, by-the-year, Turning Points. They are our newest digital technology and cultural shift changes of the 20th into the 21st century; key expressions of disruptive and creative social protest; the threshold pressures in modern times of monetary shifts, climate changes and the restless, fickle forms of European & US populism; political and cultural leadership in Western nations that have marked the end and the beginning of old and new eras. Turning Points offers ambitious attempts under one intellectual roof to gather the international issues of these debates together, to seek answers and expand analysis into fresh territory. We shall work with milestones rich in contradictions, controversies, evolutions, revolutions and liberations. We invite proposals from various disciplines -- including history, philosophy, sociology, anthropology, media, arts, medical and health studies, technology, cultural studies, gaming, economy, computer science, architecture and literature. We also welcome representatives of artistic groups, think tanks and non-governmental organizations that wish to share their views on society and human identity. Turning Points seeks to promote collaboration for advancement and new innovative outcomes in a scholarly world where interdisciplinarity is often more important in words than in practice. Turning Points seeks to bring together scholars from different fields in order to promote multilevel and multifaceted approaches -- hoping to engender new collaborations, research project ideas and, of course, future publications. \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* Papers, roundtables and workshop proposals are invited on the following themes. Our list is by no means restrictive and we invite additional, germane proposals. War(s) and impact - World War 1, 1918 and related topics. - War’s Aftermath: 1918 as Lethal Jumping Board. - Technological Progress & Media Power in Warfare. - Nation Building: 1918 v. 1948\\. - Leadership and Cultural Identity. - Anticipating Another War -- the Crucial Years. Politics and influential figures -May '68 in Europe -- roots, outcome, legacy. -M. L. King, Jr. Assassination (1968). -Robert Kennedy's Assassination (1968) -- ramifications: social & political, domestic & international impact. -Assassination & the hero-making process (martyrdom) in a national (or) international context. -National, international violence -- trends, methods political & social connections -Execution of the Romanov family (1918) and the eve of the Soviet Union -- impact & legacies of a decisive year. -Nelson Mandela is born (1918); year of his birth & death compared. -Barack Obama's 2008 US Presidential election campaign; Obama's new use of social media & campaign funding; Obama versus Trump; past & current conditions. -Spain becomes a democracy (1978) after the rule of Franco; explaining Spain in the new century; current conditions & (un)European perspectives & prospectives. -The Mexico City 1968 Olympics: Tommie Smith & John Carlos give the Black Power salute as inspiration for people of color & race in the modern world. -1968: non-violence and mass movements of the pre-social media era. Geopolitics -The dissolution of the Austro-Hungarian Empire (1918): the beginnings of global violence and European dream. -The birth of the State of Israel (1948) -- Dream? Survivor? Ruler? Interpreting Israel's key roles in the global arena. -Nuclear Nonproliferation Treaty Opens for Signature (1968). Modern times and global Treaties: reality or joke? -Apollo 8 (1968). The Cold Wa's on-going \"Space Race\", policy, power and propaganda. The impact of the space race on geopolitics and technology advancement. New perspectives on space exploration compared to earlier achievements: necessity or game? -Soviet invasion of Czechoslovakia (1968): realities and legacies; living in a new capitalistic world: pros and cons. -North Korea seizure of USS Pueblo (1968) -- propaganda and new/old worlds. -The beginnings of the Iranian Revolution that took place in 1979: reasons, impact in global geopolitical arena, current developments, the role of Iran in the region, cultural and religious impact. -The Four Asian Tigers: 60 years later: Historical analysis: impact on global economy, political, culture advancements: negatives and positives. -Social Welfare, Health, Rights and Movements National Health Service (NHS) is established in the UK (1948): Social Welfare amid economic neoliberalism. -Women’s right to vote in Britain (1918): impact in other countries: comparisons & meanings. - Spanish Flu (1918-1920) as case study of Epidemics &Historical Development -- Lessons of the Spanish Flu and challenges of current global outbreaks. -The New Arab Protests (2018-19) -- the so-called New Arab Spring: roots, impact and future developments. Popular Culture Our key years all offer outstanding examples of US & European popular culture, ripe for study with serious critical masses in place. For example, US Popular Culture of 1968 offers range of studies that deal with: -Release of the Beatles' \"White Album\" (Nov. 22). -The cultural & social effect from popular music of: “Sittin' On The Dick of the Bay\", Otis Redding \"Jumpin Jack Flash\", Rolling Stones' \"Harper Valley P.T.A\", Jeannie C. Riley' \"Love Child\", Diana Ross & The Supremes \"I Heard It Through the Grapevine\" Marvin Gaye. -Mary Hopkin on Apple Records releases\"Those Were the Days\" and \"Turn Turn Turn\" -- embodying the nostalgia & optimism, brooding and determinism of the era. -Aristotle Onassis and Jacqueline Kennedy marry on 20 October 1968 -- celebrity culture: a tricky leap forward (or not). -Selection of outstanding '68 films released: 2001: A Space Odyssey; The Graduate; Guess Who's Coming to Dinner; Bonnie and Clyde; Valley of the Dolls; Odd Couple; Planet of the Apes; Rosemary's Baby; Funny Girl; Bullitt -- exploitations & innovations, cinematic impact on cultural identity. How were these films expressive of their era? Literature and the Arts Sample assortment of '68 literary publications ripe for analysis: - Myra Breckinridge, Gore Vidal - Couples, John Updike. - Do Androids Dream of Electric Sheep?, Philip K. Dick. - The Public Image, Muriel Spark. - Enderby Outside, Anthony Burgess. - Airport, Arthur Hailey. - Couples, John Updike. - True Grit, Charles Portis. - John Steinbeck dies (1968); his legacy. - The “death” of Cubism (1918) -- a new world without Picasso? Art and impact on culture, political and national identity; artists and global figures; avant-garde art for the masses. Business & Economics -First Boeing 747 Jumbo Jet (1968). Pros and cons of a “smaller” world. -British Railways, 1948-1997\\. Pros and cons of the privatization of mass transportation. -Intel, the chip manufacturing giant is born (1968). Advantages and disadvantages of such a powerful company-monopoly or evolution? \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* In sum, our Turning Points conference impels the analysis of key theoretical questions with practical concerns. How and why do history-altering events come to a head at one time? Are there predicative, universal conditions -- possibly even laws that cause this to happen -- or is each Turning Point case different? Why the curious coincidence of 1918, 1948, 1968, 1978, 2008? How, where, when and why does socio-economic and political policy anticipate, control, foster or deter Turning Points? \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* All paper submissions and conference activities must be in English. Submissions may propose various formats, including: \\*Individually submitted papers (organized into panels by the committee) \\* Panels (3-4 individual papers) \\* Roundtable discussions (led by one of the presenters) \\* Posters \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* Paper proposals up to 250 words and a brief biographical note should be sent by 1 December 2019 to: turningpoints@lcir.co.uk Please download Paper proposal form. Standard registration fee – 220 GBP Student registration fee – 180 GBP \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* Organizing & Academic Committee Chairs: Dr. Konstantinos D. Karatzas, London Centre for Interdisciplinary Research, UK Dr. John Dean, University of Versailles,France, & Institut Catholique de Paris Academic Committee: Prof. Gregory Hall, University of Kentucky, USA Prof. Monia O’Brien Castro, Université de Tours Prof. Yaron Jean, Sapir Sderot & Oranim Colleges, Israel Prof. Michael Butler, Flagler College, USA Prof. Yurika Tamura, Davidson College, USA USA Prof. Philip Armstrong, Ohio State University, USA Prof. Maria Inés Tato, University of Buenos Aires, Argentina Prof. Tenia Kyriazi, Middlesex University Dubai Prof. Stelios Stavridis, University of Zaragoza, Spain Prof. Zeynep Aydogdu, Miami University, USA With the endorsement of: The Municipality of Aigaleo-Athens, Greece Group of Historical War Studies-Ravignani Institute, University of Buenos Aires/CONICET, Argentina Provisional Conference Venues: City Hall, Municipality of Aigaleo, Athens The University of Athens, Greece","date_start":"2020-05-22","date_end":"2020-05-23","important_dates":{"abstract":"","full":"2019-12-01","notification":"","final":""},"topics":["Arts & Humanities","History","interdisciplinary"],"location":{"virtual":"","full":["Athens","Greece"],"name":"","street":"","city":"Athens","state":"","ZIP":"","country":"Greece"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["turningpoints@lcir.co.uk"]}