{"name":"QS Online World Graduate Fair Virtual World Grad School Tour Korea","series":"","short":"","website":"https://go.evvnt.com/742841-0?pid=4868","content":"Masters Fair World Grad School Tour Online Korea | 14 Apr 2021 | 6:30-9PM | Virtual Masters Fair The online seminars and fair will be fully conducted in English. Free pre-registration: http://bit.ly/2YpC8KL online pre-registration open! If you upload English CV at the time of registration, professional foreign headhunters will provide 1:1 CV review! A total of $5.8 million in scholarships Imperial College IE Business School London City University Western Michigan University and more than 30+ universities Participated in QS-hosted International Graduate Fair, known as the world's reputable university evaluation institution in the UK, will be held online in Korea. Are you considering a differentiated career after graduating from university, a master's/doctoral program that can be recognized as a global talent when working abroad as well as domestic employment? Through video sessions for each school, please get information on graduate schools in the US, UK, France, Italy, Australia, and Hong Kong. QS events are different from other fair events that you consult with agents or agencies. Since each school's admissions officer participates directly in the event, you can consult with the school's admissions officer and obtain accurate school-specific program information directly. If you prepare your questions in English, you can leave a good impression on the admissions officer and provide a smoother online consultation. A total of USD $5m worth of scholarship opportunities are available for participants only. Contact KakaoTalk ID: QSAsia or yura@qs.com Price: Free: KRW 0.00 Time: 18:30 - 21:00","date_start":"2021-04-14","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["QS Quacquarelli Symonds"],"societies":[],"indexes":[],"emails":["yura@qs.com"]}