{"name":"New Perspectives in Science Education International Conference","series":"","short":"","website":"https://conference.pixel-online.net/NPSE","content":"Hello everyone, I would like to share with you the following event that might interest some members of this group: Call for Papers: New Perspectives in Science Education International Conference HYBRID edition, 17-18 March 2022 Extended abstract submission deadline: 17 November 2021 - All accepted papers at the conference will be presented on-site and on-line. - Interactive questions and answers sessions will follow each paper presentation. - On-site and on-line poster presentation sessions will also be held. - Networking opportunities will be organized. All accepted papers will be included in the Conference Proceedings published with ISBN, ISSN and DOI codes. The publication will be sent to be reviewed for inclusion in the Conference Proceedings Citation Index by Thomson Reuters (ISI-Clarivate). The publication will also be included in Academia and indexed in Google Scholar. Official website: http://conference.pixel-online.net/NPSE/callforpapers.php Health and Safety issues in relation to COVID-19: In case participants are not able to attend on-site, online, interactive, attendance/presentation opportunities are available. Participants attending/presenting online will benefit of a discounted fee. Every precaution possible is taken to create a safe environment for participants attending on-site (masks, gloves, distance seating, disinfection etc.). Finally, should the conditions do not allow the conference to be held on-site as expected, the event will shift to a fully virtual format. More details can be found at the following page.","date_start":"2022-03-17","date_end":"2022-03-18","important_dates":{"abstract":"","full":"2021-12-16","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education and Social Sciences"],"location":{"virtual":"","full":["Florence","Italy"],"name":"","street":"","city":"Florence","state":"","ZIP":"","country":"Italy"},"organizers":["Pixel"],"societies":[],"indexes":[],"emails":[]}