{"name":"15th International Conference on Web Information Systems and Technologies - WEBIST 2019","series":"","short":"","website":"http://www.webist.org/ ","content":"The purpose of the 15th International Conference on Web Information Systems and Technologies (WEBIST) is to bring together researchers, engineers and practitioners interested in the technological advances and business applications of web-based information systems. The conference has five main tracks, covering different aspects of Web Information Systems, namely Internet Technology, Web Interfaces and Applications, Society, e-Communities, e-Business, Web Intelligence and Mobile Information Systems. WEBIST focuses on real world applications; therefore authors should highlight the benefits of Web Information Systems and Technologies for industry and services, in addition to academic applications. Ideas on how to solve business problems using web-based information systems and technologies, will be discussed at the conference. Papers describing advanced prototypes, systems, tools and techniques and general survey papers indicating future directions are also encouraged. Both technological and social-oriented papers are accepted. All papers must describe original work, not previously published or submitted to another conference. Accepted papers, presented at the conference by one of the authors, will be published in the Proceedings of WEBIST. Acceptance will be based on quality, relevance and originality. Both full research reports and work-in-progress reports are welcome. There will be both oral and poster sessions. Special sessions, dedicated to case-studies and commercial presentations, as well as tutorials dedicated to technical or scientific topics are also envisaged: companies interested in presenting their products or methodologies, or researchers interested in holding a tutorial, workshop or special session, are invited to contact the conference secretariat or visit the conference website. \n Conference Topics: \n Area 1: Internet Technology \n \\- Application, Research Project and Internet Technology \n \\- New Trends in Internet Technology \n \\- Technical Infrastructures Suporting Web Applications \n \\- Web Programming \n \\- Web Security and Privacy, Cyber Criminality and Internet, Dark Web \n \\- Web Services and Web Engineering \n \\- Web Tools and Languages \n \\- Big Data and the Web \n \\- Digitalization/ Digitization \n \\- European Directives and Internet \n Area 2: Mobile and NLP Information Systems \n \\- App Development Methods \n \\- Mobile APIs and Services \n \\- Platforms and Infrastructures to Support Mobile IS \n \\- Protocols, Standards, Interoperability and Mobility \n \\- Risk and Security with Mobility \n \\- Sensor Usage and Networks for Mobility \n \\- Social and Mobile Information Systems \n \\- Application of Mobile Information Systems \n \\- Context Awareness \n \\- Human Computer Interaction \n Area 3: Service Based Information Systems, Platforms and Eco-Systems \n \\- Application, Research Project and Service Based IS \n \\- Web Service and Adaptability \n \\- Web Service Selection \n \\- B2B, B2C and C2C \n \\- Communities of Interest and Practice \n \\- EA, SOA, Cloud Methodologies for Services and Architecture \n \\- Information Systems and SaaS, IaaS, PaaS, Cloud Computing \n \\- Methodologies for Services and Architecture \n \\- New Advances in Service Based Technologies \n \\- Service Based IS Modeling and Methodology \n \\- Services and Repositories, Services Providers and Contractual Points of View for Services \n \\- Services Composition \n \\- Services with Methodological Approaches, Quality, Metrics, BAM \n \\- Society, eBusiness and eGovernment \n \\- Technical Infrastructure for Services \n \\- Architectural Patterns for Services \n \\- Web Based Integration Technologies, Web Services, REST and CRUD Services \n Area 4: Web Intelligence \n \\- Applications, Research Projects and Web Intelligence \n \\- Computational Intelligence on the Web \n \\- Context, Adaptability and Web Intelligence \n \\- Data Web Mining \n \\- Linked Data, Big Data and Applications in Companies \n \\- New Trends in Ontology Management and the Semantic Web \n \\- New Trends in Web Intelligence \n \\- Ontology Discovering, Modelling, Retrieving and the Semantic Web \n \\- Opinion Mining and Sentiment Analysis \n \\- Recommendation Systems \n \\- Social Media Analytics \n \\- Social Web Intelligence \n \\- User-Centric Systems \n \\- WEB 2.0 and Social Networks \n \\- Web Information Filtering and Retrieval \n Area 5: Web Interfaces \n \\- Automation and Web Interface \n \\- Web Interface and Connected Applications \n \\- Web Interfaces and Applications \n \\- Design of Web Interface \n \\- Usability and Ergonomics \n \\- User Modeling, Web Interface Modelling \n \\- Web Interface and Adaptability According to Context And/Or Profile ","date_start":"2019-09-18","date_end":"2019-09-20","important_dates":{"abstract":"","full":"2019-07-12","notification":"","final":""},"topics":["Business","Information-Technology"],"location":{"virtual":"","full":["Vienna","Austria"],"name":"","street":"","city":"Vienna","state":"","ZIP":"","country":"Austria"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":[]}