{"name":"International Conference on Poetry Studies: “Poetry Between Creation and Interpretation“","series":"","short":"","website":"http://poetry.lcir.co.uk","content":"Poetry is a constant, being produced by all known civilisations from ancient to modern times. Throughout its extensive history, the individual art of high emotions sublimated into perfect language has approached a vast array of subject matters, including love, war, social issues, the beauty of nature, etc. A particular exercise of the mind and soul, and a unique way of apprehending reality, poetry is a self-sufficient universe that intensifies and enlarges life experience. Pointing to inner knowledge rather than real circumstance, it activates different layers of perception, sweeps away human thoughts, feeds emotions and soothes suffering. Poetry inspires as well as instructs, as it is an initiation into the concealed order of the world. Its intense gratification, unrivalled in authenticity and honesty, appeals to human nature and makes ultimate sense of the self, opening the individual to interaction and communication. Poetry ennobles, enlightens and entertains because its expressive boundaries are virtually unlimited. With the help of translation, it goes beyond strict localisation and cultural arbitrariness, generating a sense of spiritual compatibility and communion between the collective identities of the world. The conference aims to bring together international poets, literary critics, translators and scholars from diverse contexts and interdisciplinary fields to share their work. As the 2019 edition is dedicated to issues related to poetry, poetics and translation, we invite papers, presentations, manuscripts, panels, roundtables, performances, and other forms of contributions relevant to the areas of investigation. Topics may include, but are not limited to: from Aristotelian poetics to 21st century aesthetics poiesis, mimesis, kinesis (non-)originality/individuality/voice amidst technical innovation subject-construction in poetry gender and poetic imagination tropes and schemes of the 21th century hybrid & cross-genre poetic modes the immeasurable and/or non-measurable in poetry form, proportion and balance: long poems, poetic sequences associations, juxtapositions and connections ekphrasis and ideology poetry and the arts: poetic and artistic collaborations poetry and science poetry and architecture poetry and mathematics language-centered poetics (including Language- and post-Language writing) conceptual and post-conceptual poetry urban poems and poetry poetics and politics poethics and theopoetics ecopoetics and ecocriticism performance or performative? sound and silence poetry between phrase and metaphrase translation, inerpretation, adaptation the translatability of metaphors limits and limitations of the poetic discourse the role(s) of the reader poetry ages and generations publishing poetry today Paper proposals up to 250 words and a brief biographical note should be sent by 30 April 2019 to: poetry@lcir.co.uk. Please download paper proposal form. Standard registration fee – 160 GBP Student registration fee – 140 GBP","date_start":"2019-09-21","date_end":"2019-09-22","important_dates":{"abstract":"","full":"2019-04-30","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","interdisciplinary"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["poetry@lcir.co.uk"]}