{"name":"TICTeC Local 2019","series":"","short":"","website":"https://tictec.mysociety.org/local/2019","content":"TICTeC Local is the annual conference from mySociety that focuses directly on the use of Civic Tech in communities and local government. What are the digital innovations that are helping local communities and local government to foster citizen engagement, drive efficiency, and combat social and environmental problems? Join us at City Hall in London this November to find out. TICTeC Local will bring together attendees from across the public and private sector, academia and civil society for a day of inspiring presentations and knowledge-sharing that will help you forge connections, take home new ideas, and bring increased energy to the challenges ahead. TICTeC Local is part of mySociety’s global The Impacts of Civic Technology Conference (TICTeC) series, which has been examining Civic Tech at the local, national and global levels since 2015\\. TICTeC Local narrows the lens, focusing on where and how Civic Tech connects with and impacts local communities and local government. Call for proposals We invite you to submit presentation abstracts or workshop proposals of no more than 300 words by midnight GMT+1 on 6 September 2019\\. Presentation submissions should focus on specific digital innovations that are helping local communities and/or public authorities to foster citizen engagement/participation, drive efficiency, and combat social and environmental problems. We welcome examples from across the UK or around the world, but the focus must be on local government or communities. We will prioritise submissions that focus on the specific impacts of these digital innovations, rather than those that simply showcase new tools that are as yet untested. Workshop proposals should also be strictly relevant to the conference theme. Those selected for inclusion in the conference programme will be notified no later than Friday 13 September 2019\\. Presenters will be required to register for the conference by midnight GMT+1 on Friday 27 September 2019 in order to confirm their speaking slot (the registration fee will be waived for individuals presenting). To submit your presentation or workshop proposal please fill in this form by midnight GMT+1 on 6 September 2019: https://forms.gle/TYTvkG6obBEfGCBBA","date_start":"2019-11-01","date_end":"","important_dates":{"abstract":"","full":"2019-09-06","notification":"","final":""},"topics":["Social Sciences","Political-Science"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["mySociety"],"societies":[],"indexes":[],"emails":[]}