{"name":"28th International Conference on Modelling, Monitoring and Management of Air Pollution","series":"","short":"","website":"https://www.wessex.ac.uk/conferences/2020/air-pollution-2020","content":"\\*\\*\\* Please note that following the recent events on the Coronavirus pandemic and with the main objective to preserve the well being of our delegates, this conference will have a non-attending format. The period for submitting abstracts and papers to this conference continues to remain open. \\*\\*\\* Air Pollution 2020 is the 28th annual meeting in the successful series of international conferences organised by the Wessex Institute dealing with Modelling, Monitoring and Management of Air Pollution. The meetings in this series have discussed and considered many important air pollution issues and the international nature of the attendees has ensured that the conference findings and conclusions enjoy wide and rapid dissemination amongst the air pollution science and policy communities. Air pollution issues remain one of the most challenging problems facing the international community. The series has demonstrated the wide-spread nature of the air pollution phenomena and has explored in depth their impacts on human health and the environment. The scientific knowledge derived from well-designed studies needs to be allied with further technical and economic studies in order to ensure cost-effective and efficient mitigation. In turn, the science, technology and economic outcomes are necessary but not sufficient. Increasingly, the conference has recognised that the outcome of such research needs to be contextualised within well-formulated communication strategies that help policy makers and citizens to understand and appreciate the risks and rewards arising from air pollution management. Consequently, the series has enjoyed a wide range of high-quality papers that develop the fundamental science of air pollution and an equally impressive range of presentations that places these new developments within the frame of mitigation and management of air pollution. This important conference brings together contributions from scientists from around the world to present recent work on various aspects of air pollution phenomena. Notable in each of the conferences in this series has been the opportunity to foster scientific exchange between participants. Each meeting has provided a further opportunity for identifying new areas of air pollution science demanding a collaborative investigation. These meetings have attracted outstanding contributions from leading researchers. The papers selected for presentation and included in the Conference Proceedings have been permanently stored in the WIT eLibrary (www.witpress.com/elibrary) from where they can be freely downloaded. These collected papers provide an invaluable record of the development of science and policy pertaining to air pollution. The series started in Mexico (1993) and continued in Barcelona (1994); Halkidiki (1995); Toulouse (1996); Bologna (1997); Genova (1998); San Francisco (1999); Cambridge, UK (2000); Ancona (2001); Segovia (2002); Catania (2003); Rhodes (2004); Cordoba (2005); New Forest (2006); Algarve (2007); Skiathos (2008); Tallinn (2009); Kos (2010); Malta (2011); A Coruna (2012); Siena (2013); Split (2014); Valencia (2015); Crete (2016); Cadiz (2017), Naples (2018) and Aveiro (2019). Conference Topics The following list covers some of the topics to be presented at Air Pollution 2020\\. Papers on other subjects related to the objectives of the conference are also welcome. Air pollution modelling Aerosols and particles Emission studies Health effects Indoor air pollution Monitoring and measuring Air pollution control technologies Industrial air pollution Global, regional and local studies Climate change effects Emerging pollutants Air pollution management, policy and legislation Socio-economic issues Public engagement Emerging technologies Respirables Nanoparticles Biohazards Secondary pollutants Biogenic emissions Occupational exposure Mobile sources Biomass emissions Valorisation Atmospheric modelling Pollution dynamics Air quality forecasting using satellite data Case studies","date_start":"2020-06-08","date_end":"2020-06-10","important_dates":{"abstract":"","full":"2020-06-07","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental","Climate Change"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["Wessex Institute"],"societies":[],"indexes":[],"emails":[]}