{"name":"Risk Management in the 21st Century","series":"","short":"","website":"https://bit.ly/35UNmKG","content":"A good basic guide for risk management is ISO 14971 Risk Management for Medical Devices. The integration of this standard into the FDA Design Control Regulations will not only put you in a state of compliance but more importantly effectively manage the risk of your products Why Should You Attend In today’s litigious society, an effective Risk Management program will protect patient health, and prevent costly lawsuits. In addition, regulatory bodies will closely assess your compliance and an effective Risk Management program will help avoid regulatory problems. Objectives of the Presentation » Obtain an understanding of the Standard and Accompanying Guidance » Understand how Good Design Controls reduce product risks » Understand why design controls are not sufficient alone and that Risk Management Is still needed even with good Design Controls » Understand why Risk Management & Design Controls Must Be Linked » Learn how to measure the effectiveness of your Risk Management efforts. Areas Covered in the Session » ISO 14971, Risk management for medical devices. » 21 CFR Part 820.30, FDA design controls » How to create an effective risk management SOP » How to document risk management efforts. Who Will Benefit » VP » Directors or Managers of R&D » Directors or managers of RA/QA » Internal Quality Auditor » Regulatory Consultants To Register (or) for more details please click on this below link: https://bit.ly/35UNmKG Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2020-12-17","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Management / Leadership","Risk Management"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["AbideEdict"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}