{"name":"Migration Studies Online Course","series":"","short":"","website":"https://integration.lcir.co.uk/online-course","content":"Course dates: 20 September – 15 October 2020 Schedule breakdown 3 modules / 30 hours each: lectures/discussions (3 meetings) reading/watching studying/writing final assignment: essay on a chosen subject Duration: 2-4 weeks Course overview Nowadays we live in a society which is completely different from that of the past decades. In fact, multiculturalism has become one of the most characteristic aspects of the current world, particularly in big cities. This phenomenon involves both Western and Eastern countries, almost without exceptions. Through a careful examination of the most actual, significant and problematic aspects of migration and integration, attention will be also paid to the protection of human rights in this subjects. Moreover, the most significant and recent verdicts of international courts (such as the International Court of Justice, the European Court of Human Rights and the European Court of Justice) on these topics will be taken into account during the course. Finally, an overview about the impact of Brexit on Migration Rights will be given to the attendees of the course, in view of the fact that, even if the United Kingdom of Great Britain and Northern Ireland formally left the EU on the 31st of January, 2020, its withdrawal will be completely effective from the 1st of January 2021\\. Course objectives Although the phenomenon of migration has been known to human history for many millennia, its constantly mutating characteristics keep on arising great interest not only in the academic world, but in the whole society. The course aims at analysing the most significant themes connected to migration and at providing participants with tools that can be useful in overcoming the most intriguing challenges arising from migration. Course outline 01) From the countryside to downtown: the growing role of cities in the governance of migration. Significant topics from the European and from the international system. Proposals of new strategies on this subject. The possible impact of Brexit on the regulation of migration in London and in the other EU cities. 02) The immigration of women between tradition and innovation. Cultural trends and future perspectives. The new roles of women in the society. 03) The extremely dangerous new forms of violence which put at risk both physical and mental health of migrants. Limits of current legislation on this significantly problematic aspect. A comparative approach. For more information, please contact us on integration@lcir.co.uk. Registration fee: 150 GBP Register on https://registration.lcir.co.uk by 5 September.","date_start":"2020-09-20","date_end":"2020-10-15","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Social Sciences","Anthropology / Archaeology","anthropology"],"location":{"virtual":"","full":["Online Event","United Kingdom"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["integration@lcir.co.uk"]}