{"name":"ADVANCED CATHETER ABLATION","series":"","short":"","website":"https://go.evvnt.com/584448-0?pid=4868","content":"Catheter ablation is an important therapy for atrial and ventricular arrhythmias. Catheter ablation is now an established first line therapy for many supraventricular tachycardias and ventricular arrhythmia's in patients with structurally normal hearts. Although the approach to many of these arrhythmias is straight forward, all practitioners encounter challenging cases due to anatomic and pathophysiologic variations. This course will provide comprehensive instruction for diagnosing common and complex cardiac arrhythmias in the electrophysiology laboratory and achieving effective and safe ablation. Case-based illustrative presentations will highlight diagnostic dilemmas and key management strategies. Experts discussing detailed patient cases provide a step-by-step analysis and in-depth review of approaches to catheter ablation for the spectrum of cardiac arrhythmias including atrial fibrillation, complex atrial arrhythmias after AF ablation or in congenital heart disease, atrial tachycardias and atypical flutters, and ventricular arrhythmias with and without associated heart disease. Prices: Registration Fee: USD 995.00, Reduced Registration Fee: USD 875.00\\. Speakers: William G. Stevenson, Douglas Packer, Peter Noseworthy, David J. Wilber, Samuel J. Asirvatham, Warren M. Jackman, Gregory F. Michaud, Andrea Natale, Vivek Y. Reddy, Smit Vasaiwala. Time: 8:00 am to 2:00 pm. Venue details: Fairmont Copley Plaza, 138 Saint James Avenue, Boston, Massachusetts, 02116, United States.","date_start":"2020-09-12","date_end":"2020-09-15","important_dates":{"abstract":"","full":"2020-09-11","notification":"","final":""},"topics":["Medicine & Health","Public-Health","cardiology"],"location":{"virtual":"","full":["Boston","United States"],"name":"","street":"","city":"Boston","state":"","ZIP":"","country":"United States"},"organizers":["Mayo Clinic"],"societies":[],"indexes":[],"emails":[]}