{"name":"2nd International Conference on Education","series":"","short":"EDU2020","website":"https://coming.gr/edu2020-call-for-papers","content":"Call for Papers and Participation 2nd International Conference on Education (EDU2020), 10-14 May 2020, Athens, Greece. https://coming.gr/edu2020-call-for-papers/ You are invited to submit your proposal (abstract/ poster/workshop/ round table) to be considered for presentation at t EDU2020), that is taking place 10-14 May 2020, in Athens, Greece, organized by the Communication Institute of Greece and endorsed by endorsed by Kaplan university, Singapore, Beijing Normal University, China & Zhejiang University, China. After the organization of seven (7) successful Annual International Conferences (look at Previous Conferences of COMinG), the 2nd International Conference on Education (EDU2020), aims to provide an opportunity for Academics, Professionals and Industry Experts from various fields, with cross-disciplinary interests, to discuss the future directives and innovations in Education. Please take a look at the conference Provisional Conference Program This year presenters you can either propose a paper presentation, a poster, participate at a round table discussion, propose a workshop, etc. Please find here (https://coming.gr/conferece-formats-and-templates/ ) all the different formats you can propose for EDU2020\\. For paper presentations, please submit your abstract by email to registration@coming.gr , in .doc file using the proposed template. Decisions are reached within 2 weeks after the abstract submission. Deadline to register and to submit full papers will be specified in your acceptance letter. Submissions deadline for ALL formats proposals: Tuesday 18 February 2020 The topics include, but are not confined to, the following areas: ‘Bilingual Education’, ‘Identity and Education’, ‘Educational Psychology’, ‘Teaching Approaches’, ‘Teacher and Student’, ‘Education Strategy’, ‘Teacher Education’, ‘Educational Foundations’, ‘Online Education’, ‘Education Technology’, ‘Special Education’,’ Teaching Methodology’, ‘Art Education/Art therapy’, ‘Bilingual Education’, ‘Computer Education’, ‘Early childhood Education’, ‘Elementary Education’, ‘Secondary Education’, ‘Higher Education’, ‘Multicultural Education’, ‘Science Education’, ‘Educational Psychology’, ‘Educational Foundations’, ‘ Health Education’, ‘Career and Technical Education’, ‘Adult Education’, ‘Business Education’ (‘Education Leadership’), ‘Ethical issues in Education’, ‘Diversity and Equality in Education’, ‘Cross-disciplinary areas of Education’, ‘Life-long Learning Education’. Topics are broadly defined, but not limited to the above. Conference Organisers/ Leaders \\*Dr Margarita Kefalaki, President COMinG & Professor, Hellenic Open University \\*Dr Fotini Diamantaki, Vice President of Research and Academic Affairs, COMinG & Lecturer in Education, UCL Institute of Education, University of London UK \\*Dr Sophie Karanicolas, Ambassador COMinG & Associate Professor, University of Adelaide, Australia \\*Dr Paraskevi Kontoleon, Ambassador COMinG & Lecturer, University of South Australia, Australia \\*Dr Jurgen Rudolph, Ambassador COMinG & Head of Research & Academic Partner Liaison, Kaplan Higher Education, Singapore & Editor, JALT Journal, Singapore. \\*Dr Robert J. Bonk, Ambassador COMinG & Professor of Professional Writing, School of Human Service Professions, Widener University, Chester, USA \\*Dr Chen Wang, Ambassador COMinG & Vice Dean /Professor, Faculty of Education, Beijing Normal University, Beijing, China \\*Dr Kan Yue, Ambassador COMinG & Vice Dean & Professor, Zhejing University, China \\*Dr Matt Glowatz, Ambassador COMinG & Assistant Professor, University College Dublin, Ireland \\*Dr Max Caruso, Ambassador COMinG & Western Co Principal, Yew Wah International Education School of Zhejiang Tongxiang, China \\*Dr Yuan Ying Caruso, Ambassador COMinG & Chinese Co Principal YWIES Shanghai, China Publication Possibilities All accepted papers will be published in the conference proceedings online with ISBN (abstract book of the conference proceedings). Selected papers, after the peer review process, will have the possibility to be published in one of the following journals: \\*Journal of Education, Innovation and Communication (JEICOM) \\*Journal of Applied Learning & Teaching (JALT) \\*Cambridge Scholars \\*Strategy and Development Review \\*Journal of Media Critiques \\[JMC\\] Special arrangements are made with a local hotel for a limited number of rooms at a special conference rate. In addition, a number of special events are organized: Greek symposium with traditional food, and dance, a social dinner, a special Athens educational tour, a one-day educational island tour, a Mycenae and Poros visit, and a day trip to Delphi. Details of the social program are available here. For more information, please contact us at info@coming.gr The Communication Institute of Greece (COMinG) was established in 2003 in France. In Greece, since 2013, it is an independent academic association that has for mission to become a forum, where academics, researchers, professionals, and friends – from all over the world – can meet in Greece to exchange ideas on their research and to discuss future developments in their disciplines.","date_start":"2020-05-10","date_end":"2020-05-14","important_dates":{"abstract":"","full":"2020-03-17","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education, teaching"],"location":{"virtual":"","full":["Athens","Greece"],"name":"","street":"","city":"Athens","state":"","ZIP":"","country":"Greece"},"organizers":["Communication Institute of Greece"],"societies":[],"indexes":[],"emails":["registration@coming.gr","info@coming.gr"]}