{"name":"Anti-Kickback, Fraud, Stark, and Marketing - Where are the Landmines?","series":"","short":"","website":"https://www.complianceonline.com/anti-kickback-stark-laws-and-marketing-webinar-training-704950-prdw?channel=Brownwalker","content":"This webinar will provide an in-depth understanding of the Federal False Claims Act, Federal Anti-Kickback and Stark laws, and discuss how marketing activities can trigger either or both. Why Should You Attend: This webinar will provide the basic building blocks you will need to develop and maintain your company’s precious commodity – your reputation – and eliminate exposure to fraud charges based on marketing practices. It will also cover the practical requirements and operations, principles of compliance and the basic elements that every business has to have to reduce civil and criminal liabilities and economic sanctions. On completing this webinar, you will have an understanding of anti-kickback regulations, Stark laws, and compliance issues that shore up company weaknesses in marketing. You will know how to implement mandatory internal controls to reduce exposure to risks. The course includes a case study discussion of how a company's marketing efforts exposed an organization to many vulnerabilities. Areas Covered in the Webinar: Federal False Claims Act Federal Anti-Kickback Statute Federal Anti-Referral Law (Stark I & 2) Introduction to basic compliance as an effective tool. Case study about an organization and how their marketing efforts exposed the organization to vulnerabilities. Who Will Benefit: This webinar will benefit all healthcare providers (clinical labs, hospitals), related service providers, radiology, radiation therapy, nutrient and prescription drug manufacturers and durable medical equipment suppliers. Practice Owners/ Administrators Providers Sales and Marketing Managers Customer Service Managers Risk Management Medical Providers including Registered Nurses, Physician Assistants, and Administrative Staff Attorneys and Legal Staff","date_start":"2022-02-09","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Palo Alto","United States"],"name":"","street":"","city":"Palo Alto","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}