{"name":"Radiation Sterilization of Medical Products - Beyond the Basics","series":"","short":"","website":"https://www.complianceonline.com/iso-11137-radiation-sterilization-validations-for-medical-products-seminar-training-80161SEM-prdsm?channel=Brownwalker","content":"This two day highly interactive course will cover all aspects of radiation sterilization validation, materials selection and processing implementation. This workshop has been designed to help attendees learn the ins and outs of all the radiation modalities, materials selection, and validation of the sterilization process per ISO 11137\\. Additionally, 483 case studies will explore how to avoid the operational and legal issues that arise from nonconformance with regulators (FDA) and auditors. Learning Objectives: Upon completing this course on radiation sterilization, participants will: Understand how to select product polymer materials for optimal product performance after radiation sterilization processing. Know how to complete an optimal validation test design – inclusive of dose, dosimetry, sample size, accelerated ageing, ASTM standards, and thermal analysis. Understand the effect of product design and assembly on bioburden, product safety and the success in executing the validation journey. Understand all the foundations of a successful radiation sterilization program – materials, bioburden, validation, maintenance of validation. Understand the impacts of all regulatory guidances on the radiation sterilization process. Who will Benefit: This course is designed for medical device, biologic products, and pharmaceutical professionals who desire to get a complete understanding of the validation and use of radiation sterilization for their products. Following personnel will benefit from the course: Senior quality managers Sterilization managers Quality professionals Regulatory and Compliance professionals Production supervisors Manufacturing engineers Production engineers R&D engineers Process owners Quality engineers","date_start":"2021-08-12","date_end":"2021-08-13","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}