{"name":"2nd Global Summit and Expo on Aerospace and Mechanical Engineering","series":"","short":"GSEAME2022","website":"https://www.thescientistt.com/aerospace-mechanical-engineering/2022","content":"Dear Colleagues, It is a great pleasure to announce that The Scientistt will host the 2nd Global Summit and Expo on Aerospace and Mechanical Engineering (GSEAME2022) will be held in Dubai, UAE during October 17-19, 2022\\. GSEAME2022 aims to bring together the renowned researchers, scientists and scholars to exchange ideas, to present sophisticated research works and to discuss hot topics in the field and share their experiences on all aspects of Aerospace and Mechanical Engineering. The GSEMSN2022 will be a 3 days event that means to gather the key players of the aerospace and mechanical engineering community and related sectors. This event is launched with the aims to become an established event, attracting global participants, intent on sharing, exchanging, and exploring new avenues of Aerospace and Mechanical Engineering -related scientific and commercial developments. A wide-ranging scientific program consisting of plenary lectures, keynote lectures, Invited lectures, parallel sessions, as well as poster sessions for young scientists covering all topics in Aerospace and Mechanical Engineering will be scheduled. This conference provides a wonderful opportunity for you to enhance your knowledge about the newest interdisciplinary approaches in Aerospace and Mechanical Engineering. Moreover, the conference offers a valuable platform to create new contacts in the field of Aerospace and Mechanical Engineering, by providing valuable networking time for you to meet great personnel in the field. We look forward to seeing you at GSEAME2022 in Dubai, UAE.","date_start":"2022-10-17","date_end":"2022-10-19","important_dates":{"abstract":"","full":"2022-08-28","notification":"","final":""},"topics":["Engineering & Technology","Mechanical/Industrial","mechanical engineering"],"location":{"virtual":"","full":["dubai","United Arab Emirates"],"name":"","street":"","city":"dubai","state":"","ZIP":"","country":"United Arab Emirates"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}