{"name":"11th International Conference on Knowledge Engineering and Ontology Development - KEOD 2019","series":"","short":"","website":"http://www.keod.ic3k.org/ ","content":"Knowledge Engineering (KE) refers to all technical, scientific and social aspects involved in building, maintaining and using knowledge-based systems. KE is a multidisciplinary field, bringing in concepts and methods from several computer science domains such as artificial intelligence, databases, expert systems, decision support systems and information systems. From the software development point of view, KE uses principles that are strongly related to software engineering. KE is also related to logic (both in mathematics and philosophy domains) and also strongly related with cognitive and social sciences and socio-cognitive engineering, where knowledge is considered to be produced by humans and structured according to our understanding of how human reasoning and logic works. Currently, KE is mostly related with the construction of shared conceptual frameworks, often designated as ontologies, thus the relevance given to this term in our conference. Ontology Development (OD) aims at building reusable semantic structures that can be informal vocabularies, catalogs, glossaries as well as more complex finite formal structures specifying types of entities and types of relationships relevant within a certain domain. Ontologies have been gaining interest and acceptance in computational audiences. For example, formal ontologies are increasingly used as one of the main sources of software development and methodologies for this end can be adapted to include ontology development. A wide range of applications is emerging, especially given the current web emphasis, including library science, ontology-enhanced search, e-commerce and business process design. A particular increasing interest is arising in the development of ontologies and/or methods in the fields of enterprise engineering and enterprise architecture as it has been proven that most problems in software development occur due to incomplete specifications of an enterprise's needs, leading to a huge lack of success in software projects. It is then natural that one should strive to more fully capture and specify the enterprise knowledge of itself and research contributions in this area are especially welcome. KEOD aims at becoming a major meeting point for researchers and practitioners interested in the study and development of methodologies and technologies for Knowledge Engineering and Ontology Development \n Conference Topics: \n Area 1: KEOD - International Conference on Knowledge Engineering and Ontology Development \n \\- Decision Support Systems \n \\- Natural Language Processing \n \\- Ontology Engineering \n \\- Ontology Matching and Alignment \n \\- Ontology Sharing and Reuse \n \\- Semantic Web \n \\- Business Process Management \n \\- Enterprise Engineering \n \\- Domain Ontologies \n \\- Education and Training \n \\- Applications and Case-Studies \n \\- Domain Analysis and Modeling \n \\- Enterprise Ontology \n \\- Expert Systems \n \\- Human-Machine Cooperation \n \\- Integration and Interoperability \n \\- Knowledge Acquisition \n \\- Knowledge Engineering \n \\- Knowledge Representation ","date_start":"2019-09-17","date_end":"2019-09-19","important_dates":{"abstract":"","full":"2019-07-12","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Vienna","Austria"],"name":"","street":"","city":"Vienna","state":"","ZIP":"","country":"Austria"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":[]}