{"name":"The 4th Int'l Conference on Machine Learning, Pattern Recognition and Intelligent Systems","series":"","short":"MLPRIS 2021","website":"https://www.confjuly.org/conference/MLPRIS2021","content":"The 4th Int'l Conference on Machine Learning, Pattern Recognition and Intelligent Systems (MLPRIS 2021) Conference Date: July 16-18, 2021 Conference Venue: Kunming, China Website: https://www.confjuly.org/conference/MLPRIS2021/ Online Registration System: https://www.confjuly.org/RegistrationSubmission/default.aspx?ConferenceID=1367 Email: intelconf@163.com About Conference Important NOTE: Due to COVID-19 epidemic situation all over the world, most countries still maintain a strict policy of no-gathering, no-entering and leaving the country, and 14-days quarantine. We have to postpone the conference till July 16-18, 2021 in Kunming, China. Please visit the official website to get more details: http://www.confjuly.org/conference/MLPRIS2021/ The 4th Int'l Conference on Machine Learning, Pattern Recognition and Intelligent Systems (MLPRIS 2021) will be held from July 16-18, 2021 in Kunming, China. The conference will cover issues on Advanced Control and Detection Technology, Artificial Neural Networks, Audio/Speech Recognition, Music Analysis, Multimedia Systems, Biometrics, Biomedical Pattern Analysis and Information Systems, Data/web Mining and Knowledge Discovery, Human-computer Interaction, etc. It dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods in related fields. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal，please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: intelconf@163.com Tel: +86 132 6470 2250 QQ: 1349406763, 3025797047 WeChat: 3025797047 Attendance Methods 1\\. Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Advanced Control and Detection Technology Applications Artificial Neural Networks Audio/Speech Recognition, Music Analysis, Multimedia Systems Biometrics, Biomedical Pattern Analysis and Information Systems Classification and Clustering Techniques Data/web Mining and Knowledge Discovery Document Processing / Text and Graphics Recognition / Digital Libraries Evolutionary Computation Feature Selection / Dimensionality Reduction / Manifold Learning Graph-based Techniques for Pattern Recognition Human-computer Interaction Intelligent and Fuzzy Control Intelligent Computation Theory / Models and Algorithms for Intelligent Computation Intelligent Computing / Soft Computing Intelligent Robot Technology Invariance in Pattern Recognition Kernel Methods and Support Vector Machines Knowledge Engineering, Cloud Computation, Intelligent Decision and Advanced Management Natural Language Analysis / Information Retrieval Pattern Recognition Algorithms/Systems Raw Data Representation Shape and Texture Analysis Signal Analysis / Image Coding and Processing Special Hardware Architectures and Software Packages / Embedded Systems Statistical Machine Learning Statistical Pattern Recognition Structural and Syntactic Pattern Recognition Web Intelligence and Technology Other Related Topics","date_start":"2021-07-16","date_end":"2021-07-18","important_dates":{"abstract":"","full":"2021-06-16","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Pattern Recognition"],"location":{"virtual":"","full":["Kunming","China"],"name":"","street":"","city":"Kunming","state":"","ZIP":"","country":"China"},"organizers":[""],"societies":[],"indexes":[],"emails":["intelconf@163.com"]}