{"name":"Intercultural Education on the Move: Facing Old and New Challenges","series":"","short":"","website":"https://sae.eap.gr/conferences/iaie2022/ ","content":"The International Association is accepting papers for its online international conference, entitled: Intercultural Education on the Move: Facing Old and New Challenges The forthcoming IAIE International Conference will focus on the multiple challenges that educators around the globe have had to face in recent years and continue to face. Some, like global climate change and increasing diversity in schools and classrooms have been on the radar for some time. Others, like the COVID pandemic and the war in Ukraine, with millions of people forced to flee their homes, have thrown new challenges at educators. Facing these challenges places a great deal of responsibility on the shoulders of educators, engaged in preparing future generations to be thoughtful, critical and responsible global citizens. Intercultural Education on the Move: Facing Old and New Challenges will bring together researchers, scholars and practitioners to share, reflect and discuss how the field can address these challenges and move forward. We hope that the conference with its 5 strands will stimulate new initiatives, new ideas and new research that can benefit society and create a safer, more accepting and more just world. Strand 1: Intercultural and Multicultural Education: theoretical underpinnings and research priorities Strand 2: Inclusive Education and the diversity spectrum Strand 3: Dimensions of diversity: Educational opportunities and challenges connected to human rights Strand 4: Migrant and Refugee Education Strand 5: ICTs, Online learning and vulnerable groups in Covid-19 Pandemic For more information, please visit the Conference site: https://sae.eap.gr/conferences/iaie2022/ For registrations and submissions please visit https://www.conftool.org/iaie2022/ Online submissions only, abstracts (approx. 300-400 words single-spaced), 4-5 key-words, and indicative references from 10th April 2022 until 12th June 2022 In English language only Notification of abstracts’ acceptance by 10th July 2022 FEES-Early Bird registration deadline 20th August 2022! Online payment at Conftool platform. For each abstract submission/presentation, with more than one co-author (up to five co-authors), at least one registration is obligatory. Please visit Conftool! For any queries, please send an e-mail to: iaie2022@conftool.org","date_start":"2022-10-01","date_end":"2022-10-02","important_dates":{"abstract":"","full":"2022-06-12","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education and Social Sciences"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["IAIE, HOU"],"societies":[],"indexes":[],"emails":["iaie2022@conftool.org"]}