{"name":"International Conference on Material and Chemical Engineering","series":"","short":"MACE","website":"http://www.mace-conf.org","content":"Sustainable Plastics Are on the Horizon These years people have taken environmental issues more seriously, because human beings have caused damages to the environment while developing. Take plastic as an example. Plastic materials are widely used due to their excellent material properties: light weight, high plasticity and low production cost. However, people have also found out that current environmental problems such as energy problems, air pollution, marine debris and food safety are all in harmony with plastics. Almost all the environmental issues are related to plastic. But is plastic really evil? Is it really the least environmentally friendly material? Studies have shown that this is not necessarily the case. Therefore, in addition to focus on \"reducing plastics\", we should also pay equal attention to the importance of \"remodeling plastic\". And all these issues and renewable sources have made material and chemical engineering more popular and valuable. The work of the engineers can range from the utilisation of nano-technology and nano-materials in the laboratory to large-scale industrial processes that convert chemicals, raw materials, living cells and energy into useful forms and products. 2019 MACE provides a communication platform for scholars, professionals, academics and graduate students not only to present their recent and latest researches but also to share their thoughts and to discuss the future development in, but not limited to the field of Material Science and Engineering and Chemical Engineering. We invite you to join us on the 26th-28th of December, 2019 in Phuket, Thailand.","date_start":"2019-12-26","date_end":"2019-12-28","important_dates":{"abstract":"","full":"2019-09-30","notification":"","final":""},"topics":["Engineering & Technology","Material/Nanotechnology","chemical engineering"],"location":{"virtual":"","full":["Phuket Island","Thailand"],"name":"","street":"","city":"Phuket Island","state":"","ZIP":"","country":"Thailand"},"organizers":["Higher Education Forum"],"societies":[],"indexes":[],"emails":[]}