{"name":"The International Conference on Surveying and Geoinformation","series":"","short":"CSG 2021","website":"https://www.confjune.org/conference/CSG2021","content":"The International Conference on Surveying and Geoinformation (CSG 2021) Conference Date: June 1-3, 2021 Conference Venue: Guilin, China Website: https://www.confjune.org/conference/CSG2021/ Online Registration System: http://www.confjune.org/RegistrationSubmission/default.aspx?ConferenceID=1409 Email: Editor\\_contact@163.com The International Conference on Surveying and Geoinformation (CSG 2021) will be held from June 1-3 in Guilin, China. This Conference will cover issues on Surveying and Geoinformation. The aim of CSG 2021 is to provide a stage for researchers, engineers, academicians as well as industrial professionals from all over the world to present their latest research results and advanced research methods. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal，please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: Editor\\_contact@163.com (editor.rolinzhang@gmail.com) Tel: +86 18627814037 QQ:1349406763 Wechat: 3025797047 Twitter: conf\\_Committee Attendance Methods 1.Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Theory of Earth's Shape Geometric Geodesy Physical Geodesy Dynamic Geodesy Space Geodesy Cartography Geodetic Surveying Technology Gravity Surveying Photogrammetry & Remote Sensing Techniques Aerial Photogrammetry Remote Sensing Information Engineering Cartographic Technology Map Design & Compilation Civil Engineering Surveying/Hydraulic Engineering Surveying Mine Surveying Marine Geodetic Surveying Bathymetric Surveying Hydrographic Surveying & Charting Military Geodesy & Cartography Instrument of Surveying & Mapping Technology of Surveying and Mapping Informatization Surveying Geographic Information System (GIS) Map Pattern Recognition and Map Databases Geographical Information Science Physiography Human Geography Geomorphology Biogeography Chemical Geography Geonomics Historical Geography Other Related Topics","date_start":"2021-06-01","date_end":"2021-06-03","important_dates":{"abstract":"","full":"2021-05-03","notification":"","final":""},"topics":["Physical Science & Math","Ocean/Water"],"location":{"virtual":"","full":["Guilin","China"],"name":"","street":"","city":"Guilin","state":"","ZIP":"","country":"China"},"organizers":["Academic Communications"],"societies":[],"indexes":[],"emails":["_contact@163.com","editor.rolinzhang@gmail.com"]}