{"name":"Effective Remote Internal Auditing MasterClass","series":"","short":"","website":"https://glceurope.com/effective-remote-internal-auditing-masterclass-details/?utm_source=brownwalker&utm_medium=media_partners&utm_campaign=ERIAMC","content":"The last year has seen even more internal auditors and review teams adapt to the realities of working remotely. We have had to conduct business-critical internal audit engagements and reviews while working away from our desks, distant from our clients and from our management. These engagements may have been part of the annual or periodic plan, but may still be so important that even in the current pandemic, you must successfully deliver them. They could also be new assurance or consultancy engagements thatthe pandemic has prompted. In either case, carrying them out remotely imposes new ways of working – and thinking. Three essential elements – communication skills, internal auditing tools and our core internal auditing principles – are little different from what you are used to undertaking. It’s all about adjusting them to work when conducting an engagement remotely. In an uncertain and challenging environment, organisations expect internal audit to go beyond reviewing historical activity and assessing low value transactions. Our key stakeholders require internal audit engagements that are insightful, forward looking, and go beyond simply preserving value to creating value for the organisations. This course will show you how to provide effective, professional insight and internal audit assurance while working remotely, enabling you to deliver engagements, deliver the plan and deliver the insight our boards need.","date_start":"2021-09-30","date_end":"2021-10-01","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Accounting"],"location":{"virtual":"","full":["Online Event","Hungary"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Hungary"},"organizers":["GLC Europe"],"societies":[],"indexes":[],"emails":[]}