{"name":"3rd Annual Pharma AI, IoT & Blockchain 2020","series":"","short":"","website":"https://www.virtueinsight.com/pharma/3rd-Annual-Pharma-AI-IoT--Blockchain-2020","content":"3rd Annual Pharma AI, IoT & Blockchain 2020 “Competences to Combat Counterfeits & Impact of AI, IoT, Blockchain & Big Data in Pharma” 04th & 05th March 2020, Pestana Chelsea Bridge Hotel, London, UK Our 3rd Annual Pharma AI, IoT & Blockchain 2020 will provide you insight into the current state of play in the EU & US on the vital role of technology impact in the sustainability of pharma and healthcare systems. Our speakers will outline the key recent developments in technology impact in pharma and healthcare in the EU and other international jurisdictions. The event will also address some of the most achievable possibilities of integrating AI, IoT and blockchain within pharma and healthcare through a mixture of practical, lectures and roundtable discussions specifically designed. CONFERENCE SPONSORSHIP: We have sponsorship opportunities available for the event, which gives you an opportunity to sponsor/speak/exhibit/stall/booth and create brand awareness. In addition, the networking opportunities in focused and relevant industry gathering provide the personal contact necessary for business development efforts. For further details please contact Kavitha at Email: kavitha@virtueinsight.co.in CONFERENCE DELEGATE PRICING: Please note that this is a PAID event and NOT A FREE event (no complimentary passes available). Any invite, email or tickets issued mentioning it as a free pass or free ticket to this event through any third party site will strictly not be accepted by the organizer and entry won’t be granted at the event. In order to Register as delegate for the conference please contact Kavitha at kavitha@virtueinsight.co.in Early Bird Discount Price: 1 Delegate @ £899 + VAT (Valid Till 24th Jan 2020) 3 Delegates @ £1798 + VAT (Valid Till 24th Jan 2020) Standard Price: 1 Delegate @ £1299 + VAT (Valid from 25th Jan 2020) 3 Delegates @ £2598 + VAT (Valid from 25th Jan 2020) KEY SPEAKERS: • KONRAD DOBSCHUETZ, Commercial Director published author and speaker., Pfizer • STEVEN ABRAHAMSON, Senior Director, Product Cyber Security, GE Healthcare • PATRIC JARCHOW , Head of Global Multi-Channel Strategy, Merck KGaA • NICLAS NILSSON , Head of Open Innovation in Research, LEO Pharma • STEVEN WILLIAMSON, Audit Account Director, Information Security, GSK • EDDIE GUZDAR , Medical Head UK & Ireland | Physician | Venture Capital & Board Advisor - Digital Technology, Sanofi Genzyme • NATALIA M.MONTEIRO, Clinical Trial Budget & Metrics Management, Takeda Pharmaceuticals • PINGPING NI, Director, Biometrics Team Lead, AstraZeneca • DANILO PAGANO , Vice President Digital & Customer Engagement, Lundbeck • ALAN HOW, Strategy & Operations - Global Commercial, Merck • EBERHARD SCHEUER , Chairman, HIT Foundation • GABOR PURMAN , Senior Account Director, Patient Services and Medical Education, NexGen Healthcare Communications • BRAM VAN LEEUWEN , Lead (digital) Innovation BeNeLux, Sanofi • MYLES FURNACE, Digital Health and Data Lead, UK & Ireland Speciality Care, IPSEN • RAMESH KRISHNAMURTHY , Strengthen international institutions, WHO (World Health Organization) • SIDDHI TRIVEDI, Healthcare Innovator, Co-founder, Beyond Identity • EDITH LECOMTE NORRANT , CEO & CSO, IPSOMEDIC • ROBIN SMITH, Security and Information Assurance Lead, Independent Office for Police Conduct (IOPC) Plus many more KEY THEMES: AI and IoT • Applications in Pharma and Healthcare • Challenges and opportunities • Use of AI in drug discovery • Role of Cyber Security in age of IoT and Healthcare Hacks • IP - Cybercrime in the pharmaceutical industry: a booming business • Transforming the healthcare and pharmaceutical industry Blockchain • How it transforms pharma and healthcare • Blockchain in Logistics and Supply Chain • A must learn technology • Blockchain technology and start-ups – where do you get started? • Application areas for blockchain within healthcare? Big Data • Potential future in synchronicity of data • Big data =Big impact • A Revolution in Drug Discovery and Pharma R&D • How to involve patients better to develop drugs Brexit • Impact on EU, US and Row market Get more from the event, with a broader scope bringing the whole communications value chain together. Enjoy and make the best out of our dedicated networking drinks time, meet the leading companies showcasing the products of tomorrow in the co-located exhibition. Expand your knowledge of the latest business models and strategies in the high-level conference.","date_start":"2020-03-04","date_end":"2020-03-05","important_dates":{"abstract":"","full":"2020-03-04","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal","IOT Internet of Things (IoT)"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["modum.io AG"],"societies":[],"indexes":[],"emails":["kavitha@virtueinsight.co.in"]}