{"name":"Global Meeting on Nanotechnology Nano Tech 2020","series":"","short":"","website":"https://mecglobalevents.com/conferences/nano","content":"We invite all the experts and researchers from the Nanotechnology sector all over the world to attend “Global Meeting on Nanotechnology”(Nanotechnology 2020) which is going to be held on April 8-9, 2020 in London,UK. Nanotechnology 2019 conference includes Keynote presentations, Oral talks, Poster Presentations, Workshops, and Exhibitors. Nanotechnologies are forthcoming use in healthcare, electronics, cosmetics, and other areas. Nanomaterials are the elements with the finest measurement of a size range of 1 to 100 nanometer. The theme of the conference is about “Revolutionary Expansion in the world of Nanotechnology”. International symposiums, Panel Discussion, and B2B meetings, International workshops are conducted based on specific topics related to Nanotechnology. The most other engineering majors work with Nanotechnology, but the heart of nanotechnology is Materials Science across all the disciples. Nanotechnology 2020 conference is also comprised of Best Post Awards, Best Oral Presentation Awards, Young Researchers Forums (YRF) and also Video Presentation by experts. We are glad to welcome you all to join and register for the “World Nanotechnology Congress” which is going to be held during April 8-9, 2020 in London,UK. Kind Regards, Shaila Sumaiya Program Manager| Nanotechnology 2020 London , UK https://mecglobalevents.com/conferences/nano/ Meta Key words : Nanotechnology conferences/ Nanomaterials conference / nanoscience conferences/Nano/2020/London Uk Saleha@123","date_start":"2020-04-08","date_end":"2020-04-09","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Social Sciences","Linguistics"],"location":{"virtual":"","full":["Online Event","Lesotho"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Lesotho"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}