{"name":"Sustainable Compliance for Out of Specifications (OOS) Results","series":"","short":"","website":"https://www.complianceonline.com/qc-laboratory-qms-data-integrity-out-of-specifications-oos-capa-seminar-training-80413SEM-prdsm?channel=Brownwalker","content":"Quality Control (QC) Unit plays a critical role in assuring the identity, strength, quality, purity, and stability of drugs and biologics. QC Unit is responsible to approve or reject all procedures and specifications impacting quality, and all components, raw materials and the drug at all stages of manufacture, including intermediates, drug substance and drug product (21 CFR 211.22). Robust Laboratory Quality Management Systems (QMS) are essential to achieve and maintain sustainable regulatory compliance in a QC Unit. The course will start with an introduction to roles and responsibilities of QC Unit with an overview of Laboratory QMS, then focusing on key quality systems or issues, such as data of exceptions, including out of specifications (OOS), and Corrective and Preventive Actions (CAPA). Out of Specification (OOS) test results have been a major concern during manufacture of drugs for many decades. To avoid OOS in order to release the product, it has been found during audits and inspections that data or testing was manipulated (including compromising data integrity), product was re-tested repeatedly until a passing result was obtained or tests results were averaged using unapproved procedure to mask failing results. As most product specifications are based on statistical principles or methods, these methods were applied in an unethical manner to test a lot repeatedly until a passing result was obtained. The product was released on one passing result. Such practice has been known as \"testing into compliance\" and became a major issue following the 1993 lawsuit between the US Government and Barr Laboratories. Following historic judgement by Judge Alfred M. Wolin in 1993 on US versus Barr and FDA’s OOS Guidance issued in 2006 (Draft Guidance in 1998), handling OOS results and performing investigation into OOS by pharmaceutical companies receive close scrutiny during regulatory inspections. In this Seminar, historical aspects of OOS and understanding of the stigma associated with OOS will be presented in order to mitigate the risk for OOS. A thorough investigation procedure into OOS results following the FDA Guidance will be discussed with an aim to finding a root cause for the OOS. Challenges in Investigating OOS results for Microbiology testing will also be presented. Ways to avoid OOS risk will be discussed. Learning Objectives: Upon completing this course the participants will understand: Role and Responsibilities of Quality Control Unit with regard to assuring manufacture of quality products consistently and to achieve sustainable compliance during laboratory operations Laboratory Quality Management Systems and their role in QC operations Data of Exceptions – Deviations, Non-Conformances, Out of Specifications (OOS), Out of Trend (OOT), Out of Frequency (OOF) Managing Data of Exceptions Biological Deviations Regulations, History, Background and Importance of OOS Uncertainty of Methods & Re-testing Re-test and Investigative Testing during OOS investigation Issues with Testing into Compliance Reportable Results and Averaging of Data OOS investigations for Microbiological data OOS Investigation – Phase I Investigation, Phase II Investigation Re-testing, Re-Sampling, Outlier Tests Who Will Benefit: Pharmaceutical Industry Biotech Industry Managers and Scientists involved in Drug Development Analytical Development Managers and Scientists Quality Control Managers and Scientists Quality Assurance Staff for Informed Review of Data and for Managing and Providing Oversights on data integrity, Investigations, CAPA, etc. Senior Management and Corporate Team","date_start":"2021-11-09","date_end":"2021-11-10","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}