{"name":"TECHSPO Atlanta 2022 Technology Expo (Internet ~ Mobile ~ AdTech ~ MarTech ~ SaaS)","series":"","short":"","website":"https://techspoatlanta.com","content":"\"Where Business, Tech and Innovation Collide in Atlanta! TECHSPO Atlanta 2022 is your chance to … – Experience a safe and intimate gathering with business professionals in a clean and hygienic environment. – Check out exhibitors showcasing the next generation of technology & innovation. – Be inspired, amazed and educated on how these evolving technologies will impact your business for greater growth. – Interact with technology enthusiasts, build your network and reunite with your peers. TECHSPO Atlanta, two-day technology expo returns June 30th and July 1st, 2022 to the luxurious Westin Peachtree Plaza Atlanta Hotel in Atlanta, Georgia. TECHSPO Atlanta brings together some of the best developers, brands, marketers, technology providers, designers, innovators and evangelists looking to set the pace in our advanced world of technology. Watch exhibitors showcase the next generation of advances in technology & innovation, including; Internet, Mobile, AdTech, MarTech and SaaS technologies. Be prepared to be inspired, amazed and educated on how these evolving technologies will impact your business for greater growth. As part of TECHSPO Atlanta is a limited attendance event, DigiMarCon Southeast 2022 Digital Marketing, Media and Advertising Conference (https://digimarconsoutheast.com). If the conference is where the learning, theory and inspiration happens, then the TECHSPO floor is where the testing, networking and product interaction takes place. For complete details visit https://techspoatlanta.com.\"","date_start":"2022-06-30","date_end":"2022-07-01","important_dates":{"abstract":"","full":"2022-06-30","notification":"","final":""},"topics":["Business","Marketing/Social-Networking","Business and Economics"],"location":{"virtual":"","full":["Atlanta","Georgia","United States"],"name":"","street":"","city":"Atlanta","state":"Georgia","ZIP":"","country":"United States"},"organizers":["TECHSPO Atlanta"],"societies":[],"indexes":[],"emails":[]}