{"name":"CfP: The European Union and the Politicization of Europe (8th Edition), 25 - 26 October 2019, Ghent, Belgium","series":"","short":"","website":"http://euroacademia.eu/conference/8eupe","content":"Call for Papers & Panels The 8th Euroacademia International Conference The European Union and the Politicization of Europe 25 - 26 October 2019 Europa Hotel Ghent, Belgium Deadline for Paper Proposals: 25 September 2019 See full details at http://euroacademia.eu/conference/8eupe/ Conference Description: The European Union was described by Jacques Delors as an ‘unidentified political object' and by Jose Manuel Barroso as the first 'non-Imperial empire’. The descriptors assigned to the European Union are creative and diverse yet the agreement on what is the actual shape that the EU is taking is by no means an easy one to be achieved. Historical choices shaped and reshaped the size and functioning of the EU. The goal of an emerging 'ever closer union' is still in search for the paths of realization while pragmatics compete with ideal goals setting. The agreement seems to come when it’s about the growing impact of the decisions taken in Brussels on the daily lives of the European citizens and the increasingly redistributive outcomes of the policy choices inside the EU. These dynamics created the framework for the politicization of Europe and opened a vivid debate about the direction and proportions of such a process. The politicization of Europe is a process that takes various shapes and addresses significant puzzles. While it is clear that the EU doesn’t resemble a state, it is less clear if the decisions that shape its policies are configured by Pareto efficient outcomes or by dynamics that are intrinsic to a political system and defined by emerging party politics within the European Parliament. The democratic problem or the democratic deficit issue was and continues to be one of the main challenges facing the European Union in any terms or from any position is understood or described. As some argue, the lack of fully democratic procedures led to Brexit while many European citizens largely are disenchanted with the way decisions are made in the EU. The problem of accountability for the decision making inside the EU was there from the beginning and it emerged gradually as more emphatic on the agenda of vivid debates as the powers of the EU have grown after the Maastricht Treaty. This was concomitant with a growing disenchantment of citizens from member states with politics in general, with debates over the democratic deficits inside member states, with enlargement and with a visible and worrying decrease in voters’ turnouts at both national and especially European elections. To all that recent times added the economic crisis and a re-emergence of nationalism in many European countries and an increase in anti-EU sentiments. The optimist supporters of EU believe in its power to constantly reinvent and reshape in deepening integration while the pessimists see either a persistence of existing problems or a darker scenario that could lead in front of current problems even to the end of the EU as we know it. The 8th International Conference ‘The European Union and the Politicization of Europe’ aims to survey some of the current debates in EU studies and addresses once more the challenges of the EU polity in a context of multiple crises that confronted Europe in recent years. It supports a transformative view that invites to dialogue balanced weights of optimism and pessimism in a belief that the unfold of current events and the way EU deals with delicate problems will put an increased pressure in the future on matters of accountability and will require some institutional adjustments that address democratic requirements for decision making. However in its present shape and context the EU does not look able to deliver soon appropriate answers to democratic demands. In neo-functionalist slang we can say as an irony that the actual crisis in the EU legitimacy is a ‘spillover’ effect of institutional choices made some time before. To address the EU’s democratic deficit however is not to be a sceptic and ignore the benefits that came with it but to acknowledge the increasing popular dissatisfaction with ‘occult’ office politics and with the way EU tackles daily problems of public concern while the public is more and more affected by decisions taken at the European level. The question to be addressed in the conference is weather the increasing politicization of the EU will lead to a full democratization of EU politics or to increasing fragmentation and division. Is the EU becoming an increasingly politicized entity? Is the on-going politicization of Europe a structured or a messy one? Do political parties within the European Parliament act in a manner that strengthens the view of the EU as an articulate political system? Are there efficient ways for addressing the democratic deficit issue? Can we find usable indicators for detecting an emerging European demos and a European civil society? Does an Europeanization of the masses take place or the EU remains persistently a genuinely elitist project? Did the Lisbon Treaty introduce significant changes regarding the challenges facing the EU? Can we see any robust improvements in the accountability of the EU decision making processes? Are there alternative ways of looking at the politicization processes and redistributive policies inside the EU? What is the impact of Brexit for the future of the EU? Can we expect a future of European solidarity or division? These are only few of the large number of questions that unfold when researchers or practitioners look at the EU. It is the aim of the 8th International Conference ‘The European Union and the Politicization of Europe’ to address in a constructive manner such questions and to offer a platform for dissemination of research results or puzzles that can contribute to a better understanding of the on-going process of politicization within the European Union. The conference welcomes papers advancing contributions from the widest area of inquiry related to the EU, from theoretic contributions and methodological proposals to case studies at EU level and regional or national levels. It aims to be an interdisciplinary event that adds value to the debate about the present and future of the EU based on the firm belief that deepening the specialized dialogue on EU topics leads to asserting the European critical thinking and to a better understanding of European realities. Papers addressing current challenges from the Eurozone crisis to Brexit or re-emergence of nationalist parties and attitudes in member states as well as security studies and IR papers are especially welcomed. The conference is organized yet by no means restricted to the following panels: \\~ The Crisis of Europe and its Political Challenges \\~ Populism and Re-Emergence of Right-Wing Leaning Nationalism in Europe \\~ The Crisis of European Solidarity \\~ Greece and the Questioning of the Factual European Unity \\~ Is Euro-enthusiasm Still Possible? \\~ The Politicization of Europe: Desirable or Contestable \\~ The Neo-medieval EU: Resembling an Enlightened Despotism? \\~ The EU as a Political System: Features and Curiosities \\~ Differentiated Integration and Club Based Hypotheses \\~ Re-distributive Policies inside the EU Impacting the Medium Voter \\~ European Elections and Strategies for Politicization \\~ European Parties and Party Politics in the European Parliament \\~ Strategies for Bringing European Issues to Public Scrutiny \\~ Taking ECB Out of the Political Vacuum: Strategies for Accountability \\~ The Democratic Deficit Issue: A Persistent Anomaly? \\~ In Search of a European Demos \\~ Ethnicity and Migration in Europe \\~ Asylum Policy and the EU \\~ The European Solidarity and the Refugee Crisis \\~ Inclusion/Exclusion Nexuses \\~ Looking for a European Civil Society \\~ Appropriations and Politicization of Wider European Values and Narratives \\~ Persisting Intergovernmentalism? \\~ EU and Traces of Imperial Politics \\~ EU and Identitarian appropriations \\~ Scenarios for Change inside the EU \\~ The Future of EU Enlargement \\~ The Europeanization of Balkans \\~ Taking Euroscepticism Seriously \\~ Assessing the EU External Action \\~ Increasing Public Saliency for Supranational Issues \\~ Lobbying and Policy Making Inside the EU \\~ Cultural Policies and the Politicization of Europe \\~ Educational Policies of Europeanization \\~ Representations of EUrope \\~ Arts and the Imaginary Shape of the EU \\~ Mobility and Europeanization \\~ Europe 2030 - Scenarios for Future \\~ Brexit and its Impact on the Future of EU For complete information before applying see full details of the conference at: http://euroacademia.eu/conference/8eupe/ You can apply on-line by completing the Application Form on the conference website or by sending 300 words titled abstract together with the details of contact and affiliation until 25th of September 2019 at application@euroacademia.org","date_start":"2019-10-25","date_end":"2019-10-26","important_dates":{"abstract":"","full":"2019-09-25","notification":"","final":""},"topics":["Social Sciences","Political-Science"],"location":{"virtual":"","full":["Ghent","Belgium"],"name":"","street":"","city":"Ghent","state":"","ZIP":"","country":"Belgium"},"organizers":[""],"societies":[],"indexes":[],"emails":["application@euroacademia.org"]}