{"name":"International Conference on Communication and Media Studies “Identity and Power”","series":"","short":"","website":"https://media.lcir.co.uk","content":"Nowadays we live and breathe media, minute-by-minute, hour-by-hour. News, television, social media, celebrity culture, music, and more. As the media and communication sector becomes ever more diverse and dynamic, and we are going to consume it, we also need to understand it. Today, the new bio-technical forms of life produced by mainstream digital media and by a whole range of artistic and non-artistic practices confront us with unprecedented theoretical questions, which can be dealt with by combining profound and perplexing perspectives. We need appropriate theoretical frameworks in order to understand the phenomena. Media studies requires the in-depth analysis and criticism. From newspapers, radio and television, to the Internet and mobile technologies, media, communication technologies and information tools impact our daily lives in countless ways. We use them to socialize with others, to seek out or share information and entertainment and to participate in social and cultural debates. But what are media, exactly? How do media institutions and technologies impact the development of society and culture and influence our activities and behaviours? In turn, how do users shape media? What role does the economic structure of media institutions play in shaping our relationship with them? In what ways does the organization and presentation of information influence our understanding of the world and our place in it? How are user-generated forms of media such as social networking sites, blogs, and collaborative informational sources like Wikipedia changing the modern media environment? These are just some of the questions the conference aims to answer. It will also focus on modern communication and information technologies, and try to discover the ways they influence our lives. The conference will bring together speakers from various fields, including mass media, film studies, games industries, political sciences, education, etc., creating closer ties and connections among scholars from different disciplines working on communication and media studies. Papers are invited on topics related, but not limited, to: Media Cultures Cultural representation and power in media Politics of media and media in politics Censorship, affront and censoriousness in media Media Theory Psychology of media and communications The idea of the virtual Cybernetics Media discourses Media analytics Media Technologies and Processes Mass media and broadcast media: television, radio, newspapers, magazines Cinema and documentary Typographic media Internet and online media Social media Media Business Media management Intellectual property Globalization of media Advertising and marketing Media Literacies Media education Media training and workforce development Paper proposals up to 250 words and a brief biographical note should be sent by 15 March 2020 to: media@lcir.co.uk. Please download paper proposal form. Standard registration fee – 220 GBP Student registration fee – 180 GBP Provisional conference venue: Birkbeck, University of London, Malet Street, Bloomsbury, London WC1E 7HX","date_start":"2020-08-01","date_end":"2020-08-02","important_dates":{"abstract":"","full":"2020-03-15","notification":"","final":""},"topics":["Business","Marketing/Social-Networking"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["LCIR"],"societies":[],"indexes":[],"emails":["media@lcir.co.uk"]}