{"name":"Reduce costs for compliance with data integrity: 21 CFR Part 11, SaaS/Cloud, EU GDPR","series":"","short":"","website":"https://www.complianceonline.com/internal-audit-mdsap-webinar-training-706565-prdw?channel=Brownwalker","content":"This course will give an introduction into the Medical Device Single Audit Program (MDSAP) and how to adjust your internal audit program. The introduction will give an overview about the requirements for the quality management system and how to conduct an internal audit with MDSAP requirements to check, if your quality management system meet all MDSAP requirements. Why Should You Attend: You should attend this webinar to understand, what how is MDSAP working in relation to your internal audit program and how to adjust your internal audit program and finally how to conduct an internal audit according MDSAP requirements. This webinar will give you a clear structured overview and introduction, how to apply MDSAP-Requirements in your internal audit program and to conduct internal audits with MDSAP requirements. First you learn to identify the relevant requirements, second you learn how to implement the identified requirements into your audit program. The course based on the MDSAP Companion-Document, issued by the FDA. Areas Covered in the Webinar: What is the Medical Device Single Audit Program (MDSAP)? Which Companies must have MDSAP? Which Companies should have MDSAP? How to setup and audit program under MDSAP? How to conduct an audit under MDSAP? How the MDSAP-Audit is working? Frequently Asked Questions: Can ORA perform a surveillance inspection of a combination product at a firm participating in the Medical Device Single Audit Program (MDSAP)? How will MDSAP ensure that every RA has the same evaluation standards for the Auditing Organization? How do I find out more specific information on the documents, policies, and procedures used in the MDSAP? Can industry provide input into MDSAP documents or the program in general? What is the best way to determine what is expected of the Auditing Organizations with regard to multiple jurisdictions? Can Contract Research Organizations participate in MDSAP and What about Certified Quality Auditors? If an RA decides to change its GMP/QMS or Regulatory requirements, how will the changes be incorporated into MDSAP? Can an Auditing Organization contest an unfavorable recognition decision or a nonconformity and its grading? How do Auditing Organizations ensure that duplicate efforts are not performed during an audit of a manufacturer that sells in multiple jurisdictions? How are nonconformities that are identified during an MDSAP audit managed? What is the timeline for a manufacturer to respond to nonconformities? Where you mentioned outsourced processes are typically not audited via MDSAP, could we anticipate that there is a higher chance that the FDA could choose to perform an inspection of a contract manufacturer? Is the estimated durations what is recommended for internal audits as well as 3rd party? Would it be required to use the MDSAP grading of nonconformities when conducting the internal audit? Is a root cause analysis needed regardless of the finding grade? Can you please highlight country specific requirements? No. if there is a finding grade 5, understandably a root cause analysis is needed. What if it is a finding grade 1, not as severe? I understand the grading. Indirect not repeat without device on the market means 1 and it is typically not high risk. Who Will Benefit: CEO’s of companies, which sell to Australia, Brazil, Canada, Japan or US Regulatory Affairs Managers of Companies, which sell to Australia, Brazil, Canada, Japan or US Quality Managers of Companies, which sell to to Australia, Brazil, Canada, Japan or US Quality Representatives of Companies, which sell to Australia, Brazil, Canada, Japan or US Other managers, which need to deal with regulatory or quality guidelines Medical Device Manufacturers, who develop, manufacture and / or sell to US, CAN, BR, AUS, JP","date_start":"2021-11-01","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}