{"name":"5th International Conference on Research in Social Sciences","series":"","short":"","website":"https://www.icrsh.org/social-sciences","content":"We are happy to announce that the ICRSH social studies conference will be back this June in the beautiful city of Vienna, Austria. The social studies conferences aim to provide a platform for academicians, scholars, researchers, and authors from all around the world to address and discuss themes and topics within the broad field of social sciences including the disciplines of sociology, psychology, geography, anthropology, education, politics, arts communications and many more. You better save the date now and enjoy our early registration rates. Sociology conferences will open the door to new opportunities for you, so do not miss this unique chance to join us from June 10 to 12\\. You will take home a wealth of high-level knowledge and connections earned at the ICRSH communications conference. The Organizing Committee will offer the participants a city tour free of charge, so learn about Vienna city. All accepted papers will be published with ISBN Number in a soft form and all full papers sent for conference proceedings will be accepted through a double-blind review process and will be published electronically in proceedings with a DOI number. All papers have publication opportunities in various indexed international journals: SCOPUS, DOAJ, EBSCO, GOOGLE SCHOLAR, COPERNICUS, and many more. The 5th International Conference on Research in Social Sciences will return as an in-person event in Vienna, Austria this 10-12 June and also include the live-stream Virtual component for those who cannot join physically but wish to learn, connect, and network. Delegates can attend and present their papers either in person or online from wherever they are in the world. An Invitation Letter will be issued and sent after registration and payment of the registration fee.","date_start":"2022-06-10","date_end":"2022-06-12","important_dates":{"abstract":"","full":"2022-05-27","notification":"","final":""},"topics":["Social Sciences","Sociology","Sociology, Social Sciences"],"location":{"virtual":"","full":["Vienna","Austria","Austria"],"name":"","street":"","city":"Vienna","state":"Austria","ZIP":"","country":"Austria"},"organizers":["GLOBAL KNOWLEDGE SHARING"],"societies":[],"indexes":[],"emails":[]}