{"name":"The 13th Int'l Conference on Computational Intelligence and Software Engineering","series":"","short":"CISE 2021","website":"http://www.seminarjan.org/conference/CiSE2021","content":"The 13th Int'l Conference on Computational Intelligence and Software Engineering (CISE 2021) Conference Date: January 5-7, 2021 Conference Venue: Sanya, China Website: https://www.seminarjan.org/conference/CiSE2021/ Online Registration System: http://www.seminarjan.org/RegistrationSubmission/default.aspx?ConferenceID=1315 Email: ic\\_vicky@163.com The 13th Int'l Conference on Computational Intelligence and Software Engineering (CISE 2021) will be held in Sanya, China during January 5-7, 2021\\. CISE 2021 will cover issues on Computational Intelligence and Software Engineering. It dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal, please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: ic\\_vicky@163.com Tel: +86 132 6470 2250 QQ: 1349406763 WeChat: 3025797047 Twitter: conf\\_Committee Attendance Methods 1.Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Artificial Intelligence Artificial Immune Systems Autonomy-Oriented Computing Artificial Neural Systems Bayesian Learning Biological Computing DNA Computing Evolutionary Programming Evolutionary Algorithms Image Understanding Intelligent Systems Knowledge Discovery Learning Algorithms Machine Learning Multi-Agent Systems Multi-Objective Evolutionary Algorithms Neural Networks Particle Swarm Optimization Probabilistic Reasoning Reinforcement Learning Supervised Learning Swarm Intelligence Probabilistic Learning Data Mining Discovering Patterns in Continuous Data Uncertainty Management for Data Mining Clustering Algorithms and Applications Classification Trees Mining Time Series Mining in a Mobile Environment Statistical Considerations in Learning XML Mining Text Mining Distributed Data Mining Database Querying Database Querying and Static Routing Algorithms Cryptography Security and Reliabilities Issues Software Engineering Agile Software Development Autonomic and Self-Managed Software Computer-Supported Collaborative Work Component-based Software Engineering Configuration Management and Deployment Dependendability, Safety and Reliability Distributed, Web-Based and Internet-Scale SE Empirical Software Engineering End-User Software Engineering Engineering Secure Software Feature Interaction and Generative Programming Human and Social Aspects Knowledge-Based Software Engineering Mobile, Embedded and Real-Time Systems Model-driven Software Engineering Patterns and Frameworks Processes and Workflow Program Comprehension and Visualization Requirements Engineering Reengineering and Reverse Engineering Quality and Performance Software Architecture and Design Software Economics and Metrics Software Evolution Software Maintenance Software Policy and Ethics Software Reuse Software Specifications Testing and Analysis Theory and Formal Methods Tools and Environments Validation and Verification Cloud, P2P and Mobile Computing Other","date_start":"2021-01-05","date_end":"2021-01-07","important_dates":{"abstract":"","full":"2020-12-05","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Computational Intelligence"],"location":{"virtual":"","full":["Sanya","China"],"name":"","street":"","city":"Sanya","state":"","ZIP":"","country":"China"},"organizers":["Academic Communications"],"societies":[],"indexes":[],"emails":["_vicky@163.com"]}