{"name":"Flow Chemistry and The Flow Chemistry Masterclass","series":"","short":"","website":"https://go.evvnt.com/577202-4?pid=4868","content":"Flow chemistry has been used in petrochemical and bulk chemical production for over 100 years, but has only seen significant interest in the pharmaceutical and fine chemical industries in the past 10 years. This course aims to give an introduction to this exciting and revolutionary field, to familiarise attendees with the current state of the art. A wide range of highlights from the flow chemistry literature will be discussed, from both academia and industry, with a focus on translating conventional reactions to flow processes. Attendees will become familiar with a number of distinct types of flow reactors, allowing the correct reactor to be chosen to suit the required chemistry. Emphasis will also be placed on the inline and online monitoring of flow reactions, along with the hazards and pitfalls associated with scaling up flow reactions. MASTERCLASS IN FLOW CHEMISTRY | FRIDAY 5 JUNE 2020 After the success of the 1st Masterclass in 2019 we are back at the University of Graz, see below for more information on this unique one-day flow chemistry lab session hosted by the \"Center for Continuous Flow Synthesis and Processing\" (CCFLOW) at the University of Graz. Janssen Delegate 2019 \"It was overall an excellent scientific update and the CCFlow lab visit a must!\" URLs: Tickets: https://go.evvnt.com/577202-0?pid=4868 Booking: https://go.evvnt.com/577202-2?pid=4868 Brochure: https://go.evvnt.com/577202-3?pid=4868 Prices: Course Fee: EUR 1899.0, Masterclass fee: EUR 700.0 Speakers: Professor C Oliver Kappe, Dr Will Watson Time: 9:00 am to 5:00 pm Venue Details: Hotel Das Weitzer, 12-14 Grieskai, Graz, Steiermark, 8020, Austria","date_start":"2020-06-03","date_end":"2020-06-05","important_dates":{"abstract":"","full":"2020-06-02","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education, teaching"],"location":{"virtual":"","full":["Graz","Austria"],"name":"","street":"","city":"Graz","state":"","ZIP":"","country":"Austria"},"organizers":["Scientific Update Ltd"],"societies":[],"indexes":[],"emails":[]}