{"name":"Coronavirus Countermeasures, and Business Risks and Opportunities","series":"","short":"","website":"https://bit.ly/3ve7faG","content":"The health-related dangers of COVID-19 are obvious but the good news is that diligent compliance with the recommended countermeasures, especially social distancing, can end the outbreak very quickly. The consequences of noncompliance are however equally obvious. Force majeure interruptions of supply chains have exposed the risks associated with complex international supply chains, and China has threatened overtly to cut off supplies of rare earth and lifesaving pharmaceutical products. The danger of loss of manufacturing capability has meanwhile been known for centuries, which underscores the need to restore manufacturing. American industrialists such as Henry Ford proved long ago that high-wage American labor can be made sufficiently productive to out-compete cheap offshore labor. Schools and colleges have perforce had to resort to distance education, which eliminates the need for the capital and maintenance cost of physical classrooms. If distance education proves workable, this could hold down school property taxes and tuition costs while offering higher compensation to educators in the bargain. Distance conferencing, meanwhile, eliminates the time and costs associated with travel and lodging, while virtual tourism offers opportunities to experience cultural activities with little cost in time or money. Why Should You Attend The COVID-19 outbreak has generated considerable, and justified, fear, along with incomplete or inaccurate information that can lead to suboptimal decisions. There is for example talk of hundreds of thousands, or even millions, of deaths before the epidemic is contained. This is unfortunately realistic if people do not comply with social distancing and other containment guidelines. The good news is however that, if we do, the human and economic costs will be far lower than expected. If we want to put this more simply, \"Follow the doctors' orders, and we will come out of this in good condition.\" Attendees will acquire the background necessary to make the best decisions possible under uncertain circumstances. Force majeure supply chain disruption has meanwhile been a frequent problem, and no supply chain should tolerate a source that threatens to use its control of vital inputs to inflict consequences on other stakeholders. Attendees will be able to advocate persuasively for reshoring of American manufacturing capability. Attendees will also learn how distance education and virtual conferencing can reduce costs and time expenditures even after the crisis is over. Areas Covered in the Session » Dangers associated with COVID-19 1\\. Health risks 2\\. Supply chain risks including not only the obvious ones related to force majeure, but Chinese threats to intentionally disrupt vital supply chains by restricting exports » The good news; COVID-19 can be stopped by diligent compliance with social distancing and other recommended countermeasures. 1\\. The Susceptible, Infected, Recovered (SIR) model underscores the effect of reducing the disease's basic reproduction number, the number of susceptible people an infected person will infect (on average), to less than 1\\. 2\\. This can be achieved with widespread vaccination (when available) but also with social distancing and similar countermeasures when there is no vaccine or treatment. 3\\. The parallel and series reliability model says that, when multiple countermeasures are deployed, everything must go wrong (for the humans) or right (for the virus) for another infection to occur. The lesson is simply that, the more obstacles (regardless of how imperfect) we can throw into the virus' path, the better. 4\\. The same countermeasures impede seasonal flu as a bonus. » Overview of recommended countermeasures 1\\. Overview of \"Guidance on Preparing Workplaces for COVID-19\" which is downloadable from https://www.osha.gov/Publications/OSHA3990.pdf (free, public domain as a publication of the U.S. Government). Areas covered will include definition of job risks as Very High, High, Medium, or Lower. Grocery shopping is arguably Medium risk for everybody involved if people come within six feet of one another. 2\\. Additional countermeasures including social distancing and even making aisles in supermarkets one-way create more obstacles for viral transmission. 3\\. Effectiveness of face masks in suppressing transmissions (per the UK's Health and Safety Executive, its counterpart of OSHA). The HSE found that even improvised masks offer 50% protection (Howard and Robinson, 2020\\. \"Coronavirus face masks sell out as prices soar 800%: But do they really work and which one should you buy?\" Daily Mail, https://www.dailymail.co.uk/news/article-8050587/Coronavirus-face-masks-selling-one-buy.html) contrary to the World Health Organization's original guidance that healthy people do not need them. The #masks4all movement advocates universal mask usage and the presenter's opinion is that this will create yet another obstacle to COVID-19 transmission. The presenter agrees with the HSE's information rather than the WHO's. » COVID-19 has exposed supply chain risks including China's threats to intentionally curtail exports of rare earths and medical supplies (Fredericks, Bob. 2019\\. \"China threatens to limit rare earths exports in warning over trade war.\" New York Post, May 29 2019\\. https://nypost.com/2019/05/29/china-threatens-to-limit-rare-earths-exports-in-warning-over-trade-war/ and Buncombe, Andrew. 2020\\. \"US and China in war of words as Beijing threatens to halt supply of medicine amid coronavirus crisis.\" The Independent. https://www.independent.co.uk/news/world/americas/us-politics/coronavirus-china-us-drugs-trump-rubio-china-virus-xinhua-hell-epidemic-a9400811.html) 1\\. Alfred Thayer Mahan's The Influence of Sea Power Upon History showed long ago what happens when countries lose their manufacturing capability. This happened to Spain and Portugal when they discovered treasure in the New World and purchased rather than made what they needed from their rivals England and Holland. The United States needs to avoid making the same mistakes and COVID-19 has exposed the U.S.'s vulnerability to unreliable offshore manufacturers. 2\\. American industrialists recognized the threat of cheap offshore labor more than 100 years ago and delivered proven solutions, as exemplified at the Ford Motor Company, that made American labor sufficiently productive to be paid high wages. » Opportunities related to distance education, virtual conferencing, and virtual tourism are likely to persist even after the end of the COVID-19 crisis. Another way to say this is, \"If they work, why not continue to do them?\" 1\\. Consider the capital and upkeep costs for school and college classrooms, and these costs are built into school property taxes and tuition respectively. If distance education works, can these costs be reduced or eliminated? 2\\. Virtual conferencing eliminates travel and lodging costs, and associated time commitments. Attendees will receive a copy of the slides and accompanying notes in pdf form. Disclaimer; no part of this presentation constitutes formal engineering or occupational health and safety advice. Please refer to the authoritative sources cited (e.g. OSHA, CDC, Health and Safety Executive) for specific guidance on how to protect workers and others. Who Will Benefit » All persons in decision making roles (executives, CEOs, managers) in manufacturing and service activities, and people with occupational health and safety (OH&S) responsibilities. To Register (or) for more details please click on this below link: https://bit.ly/3ve7faG Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-05-10","date_end":"","important_dates":{"abstract":"","full":"2021-05-10","notification":"","final":""},"topics":["Business","Human-Resources","COVID-19"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}