{"name":"PHAB 2022: Plant health, Agriculture and Bioscience Conference - September 2022","series":"","short":"","website":"https://go.evvnt.com/717308-0?pid=4868","content":"Dear Colleagues, It is our great pleasure to welcome you, on behalf of CABI, Wageningen University and the Organizing Committee, to the inaugural Plant Health, Agriculture and Bioscience Conference (PHAB 2022) which will be held on 14-16 September, 2022 in The Hague, the Netherlands. Plants are the foundation for all life on earth and improving plant health is the key to feeding the growing global population as well as supporting economic development around the world. Plant health is facing a number of challenges, from plant pests and diseases, to poor soil health and water scarcity, which is why the UN has declared 2020 as the International Year of Plant Health in order to raise awareness of these issues. We invite you to be a part of this global effort by joining us at PHAB 2022, where all plant health stakeholders – from researchers to policymakers and the private sector – will convene with the aim to share, discuss and promote both the latest findings on plant health problems as well as innovative solutions to them. Together, we hope to work towards a sustainable future for plant health. PHAB 2022 promises to be an outstanding event, and we look forward to greeting you in The Hague next year. Yours sincerely, Dr Ulli Kuhlmann, CABI Conference Chair Prof Marcel Dicke, Wageningen University Conference Chair URLs: Facebook: https://go.evvnt.com/717308-2?pid=4868 Twitter: https://go.evvnt.com/717308-3?pid=4868 LinkedIn: https://go.evvnt.com/717308-4?pid=4868 Price: Visit website for details and savings: EUR 450.0 Time: 8:00 am - 8:00 pm Venue Details: World Forum The Hague, 10 Churchillplein, Den Haag, Zuid-Holland, 2517 JW, Netherlands","date_start":"2022-09-14","date_end":"2022-09-16","important_dates":{"abstract":"","full":"2022-09-13","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Den Haag","Netherlands"],"name":"","street":"","city":"Den Haag","state":"","ZIP":"","country":"Netherlands"},"organizers":["Kenes Group on Behalf of PHAB"],"societies":[],"indexes":[],"emails":[]}