{"name":"the 9th WCBM Junior Academic Competition (Virtual Online Conference)","series":"","short":"","website":"http://wcbmjac.pngba.org","content":"WCBM Junior Academic Competition is an international academic event held together with the World Conference on Business and Management (WCBM) and organized by the international scholastic organization - People and Global Business Association (P&GBA). The purpose of the competition is to help bright students develop ideas in a creative and innovative manner. In addition, present them with a chance to develop academic writing and presentation skills necessary for success in the future. For this year, the conference will be held online under the theme of “Vitalizing Valuable Global Culture - Recovery from Pandemic by COVID-19”. The global crisis caused by the COVID-19 has shown us that the daily life that has so far interacted and enjoyed freely around the world is not natural. The recent pandemic did not only have considerable negative impacts on the daily lives of people but also resulted in the interruption of academic research. In response, WCBM is striving to turn this crisis into an opportunity and offer the solution for problems currently faced by providing an online channel for students' research to be shared and participated together in challenge times. Our online channel will enable students to present and share their most contemporary research as well as make it available for a large international audience. WCBM JAC is delighted that you would join us in this momentous occasion to share new ideas and celebrate our achievements on academic research. It will be a unique experience for many outstanding students to access valuable research papers from all over the world via online.","date_start":"2021-07-02","date_end":"2021-07-03","important_dates":{"abstract":"","full":"2021-05-01","notification":"","final":""},"topics":["Business","Other","Economics & Business Management"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["People and Global Business Association (P&GBA)"],"societies":[],"indexes":[],"emails":[]}