{"name":"QS Online MBA Fair Virtual World MBA Tour Japan","series":"","short":"","website":"https://go.evvnt.com/742861-0?pid=4868","content":"Connect MBA Online Japan | 13 Apr 2021 | 7: 00-9.30PM | Virtual Fair The event will be fully conducted in English. This online event will be conducted in English by the admissions officer. --Participants: Those who have a career of 2 years or more and are fluent in English- Explanation of overseas MBA programs by each business school- Admissions examiner reviews applicant's resume and adjusts consultation time - INSEAD - Imperial Business School - Toronto Rotman - Nanyang Business School - Alliance Manchester Business School \\[Participant Benefits\\] In addition to regular MBA consultations, we also offer the following benefits to support highly conscious MBA applicants. We are here. --Free CV correction service by a professional foreign career coach (20min / advance reservation system) --Free study abroad schedule consultation by an advisor (25min / advance reservation system) ---- For those who are uncertain about choosing a school. Free MBA Career Consultation (25min / advance reservation required) --MBA Lounge Connect MBA Japan (Online Fair) is an online event that allows individual meetings and networking with admissions personnel by business school. After entering the basic information, you can make a reservation by uploading your resume (CV) in English. Please use this as a great opportunity to receive direct consulting from an overseas admissions assessor and learn about the strengths and weaknesses of each school. After registration, it may take some time for the admissions officer to check your resume (CV) in English, so if you would like to participate, please complete the registration at least one week before the event. QS Connect MBA Online Japan is a unique opportunity for Japanese candidates to connect online with admissions directors from world-leading MBA programs. No matter where you're located, if you're on a mobile, tablet, or desktop you just need to log in on the day and start your chat with the schools! You'll be able to video / voice / live chat face-to-face with top global business, attend live seminars, and network with successful alumni from international companies. Once registered, our experts will review your experience and aims to create a personalised schedule of meetings with the ideal schools for you. Registration is completely free - we advise registering as soon as possible to ensure your schedule is the best it can be. Please contact yura@qs.com or Line ID: QSLondon with any queries. Price: Free Time: 7:00 pm - 9:30 pm","date_start":"2021-04-13","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["QS Quacquarelli Symonds"],"societies":[],"indexes":[],"emails":["yura@qs.com"]}