{"name":"2nd International Conference on Community Ecology","series":"","short":"","website":"https://go.evvnt.com/362981-0?pid=4868","content":"The second event is specifically focused on the theoretical and applied progress on all aspects and all taxa of community ecology, including the effects of global change on biological communities, landscape ecology, multivariate statistics, systems ecology, vegetation science, macroecology and many other fields. The conference aims to bring together leading academic scientists, researchers and scholars in the domain of interest from all over the world. Main topics of the conference: Community ecology, Island biogeography, Macroecology, Biodiversity and ecosystem functioning, Metacommunities, Diversity partitioning, Ecological networks, Statistical ecology, Dark diversity, Effects of global change, Conservation biology / community conservation. All participants are invited to submit his/her paper to Community Ecology and, following a standard peer review process, a selection of the finest ones will be published in a special issue of the journal in 2020\\. URLs: Tickets: https://go.evvnt.com/362981-1?pid=4868 Facebook: https://go.evvnt.com/362981-2?pid=4868 Time: 19:00 to 19:00 Venue details: Alma Mater Studorium - University of Bologna, 33 Via Zamboni, Bologna, 40126, Italy Prices: Early bird / Full: EUR 410.0, Early bird / Student: EUR 300.0, Regular / Full: EUR 470.0, Regular / Student: EUR 370.0, On-site / Full: EUR 530.0, On-site / Student: EUR 450.0 Speakers: Carl Beierkuhnlein / University of Bayreuth, Germany, Roberto Danovaro / Stazione Zoologica Anton Dohrn, Napoli, Italy, Louise Firth / University of Plymouth, UK, John M. Halley / University of Ioaninna, Greece , Meelis Pärtel / University of Tartu, Estonia, Tamar Zohary / Israel Oceanographic and Limnological Research Institute, Haifa, Israel","date_start":"2019-06-04","date_end":"2019-06-06","important_dates":{"abstract":"","full":"2019-06-03","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education, teaching"],"location":{"virtual":"","full":["Bologna","Italy"],"name":"","street":"","city":"Bologna","state":"","ZIP":"","country":"Italy"},"organizers":["AKCongress / Budapest, Hungary"],"societies":[],"indexes":[],"emails":[]}