{"name":"The 5th International Conference on Microbiology, Virology and Immunology","series":"","short":"CMVI 2021","website":"https://www.deconf.org/conference/CMVI2021","content":"The 5th International Conference on Microbiology, Virology and Immunology (CMVI 2021) Conference Date: December 4-6, 2021 Conference Venue: Sanya, China Website: https://www.deconf.org/conference/CMVI2021/ Online Registration: https://www.deconf.org/RegistrationSubmission/default.aspx?ConferenceID=1412 Email Registration: workshop12@163.com The 5th International Conference on Microbiology, Virology and Immunology (CMVI 2021) will be held during December 4-6, 2021 in Sanya, China. This Conference will cover issues on Microbial Genetics, General Viral Science, Antiviral Medicine, Diagnostic and early detection of viral infections, Cellular Immunology, Vaccines, etc. CMVI 2021 dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: All the accepted papers will be published by a peer-reviewed open access journal that can ensure the widest dissemination of your published work, for more information, please contact us (workshop12@163.com) Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: workshop12@163.com Tel: +86 18672346485 QQ: 1349406763 WeChat: 3025797047 Twitter: conf\\_Committee Attendance Methods 1\\. Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Clinical Microbiology Microbial Genetics General Viral Science Human viral diseases HIV & other retroviral diseases Organ specific cancers & tumor virology Respiratory virus diseases West Nile Virus: Therapeutic approaches & Targets for viral infections Antiviral Medicine Viral break out prevention and measures Diagnostic and early detection of viral infections Viral Hepatitis Viral immunology infection & immunity Neuro & Blood Borne Viral diseases Agriculture & Plant Virology Animal Viruses Microbicidal viruses Mycoplasma, Chlamydia, Rickettsia Bacteriology Mycology Parasitology Pathogen Detection Cellular Immunology Molecular Immunology Clinical Immunology Transplantation Immunology Cancer and Tumor Immunobiology Nutritional Immunology Vaccines Immunotherapy Inflammatory / Autoimmune diseases Infectious Diseases and Immune System Autoimmunity and Therapathies Allergy and Therapathies Antigen Processing T-Cells and B-Cells Neuro Immunology Reproductive Immunology Costimmulatory Pathways Diagnostic Immunology Technological Innovations in Immunology Immunoinformatics and Systems Immunology Rheumatology Translational Approaches","date_start":"2021-12-04","date_end":"2021-12-06","important_dates":{"abstract":"","full":"2021-11-01","notification":"","final":""},"topics":["Life Sciences","Microbiology/ Pathology/ Toxicology","immunology"],"location":{"virtual":"","full":["Sanya","China"],"name":"","street":"","city":"Sanya","state":"","ZIP":"","country":"China"},"organizers":[""],"societies":[],"indexes":[],"emails":["workshop12@163.com"]}