{"name":"Call for Chapters: Handbook of Research on Cultural and Cross-cultural Psychology","series":"","short":"","website":"https://vernonpress.com/proposal/147/448950171cea6c11085ce45bf1c562cd","content":"We are pleased to invite chapter proposals for Handbook of Research on Cultural and Cross-cultural Psychology, an international edited Social Science Reference. This proposed edited book would start with the essentials of culture, its relationship with human psychology, and the origin of cultural and cross-cultural psychology. The book would be focused on dynamics that amplify knowledge, skills, and behaviors relevant to deal with different cultural and cross-cultural issues. It would consider the relationships between the cultural theory and practices, explaining what the character of these relationships might be? If these relationships matter, and if they exist, how and in what ways does they matter? All the prospective chapters are expected to suggest that ‘relevance’ and ‘being critical’ are qualities widely attributed to efforts that fill the gaps between theory and practice in the cultural and cross-cultural psychology. For details including proposed contents, please visit detailed call for chapter proposals via given web link: https://vernonpress.com/proposal/147/448950171cea6c11085ce45bf1c562cd Please submit your chapter proposal on or before May 30, 2021\\. It should be a brief outline of your chapter clearly explaining how the proposal fits into the book’s scope and objective along with your institutional affiliation, position and contact details. Submissions should be submitted to: Dr. Chandan Maheshkar: ch.maheshkar@gmail.com Note: There are no any submission or acceptance fees for manuscripts submitted to this book publication. Please use the subject line: “Submission to Cultural and Cross-cultural Psychology”","date_start":"2021-05-30","date_end":"2021-08-30","important_dates":{"abstract":"","full":"2021-05-30","notification":"","final":""},"topics":["Social Sciences","Psychology"],"location":{"virtual":"","full":["United States"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":[""],"societies":[],"indexes":[],"emails":["ch.maheshkar@gmail.com"]}