{"name":"21 CFR Part 11, FDA's Guidance for Electronic Records and Electronic Signatures","series":"","short":"","website":"https://www.complianceonline.com/21-cfr-part-11-fda-s-guidance-for-electronic-records-and-electronic-signatures-webinar-training-706563-prdw?channel=Brownwalker","content":"The Webinar will focus on the importance of ensuring that electronic record/electronic signature (ER/ES) capability built into FDA-regulated computer systems meets compliance with 21 CFR Part 11\\. This includes development of a company philosophy and approach, and incorporating it into the overall computer system validation program and plans for individual systems that have this capability. Why Should You Attend: This webinar will help you understand in detail the application of FDA’s 21 CFR Part 11 guidance on electronic records/electronic signatures (ER/ES) for computer systems subject to FDA regulations. This is critical in order to develop the appropriate validation strategy and achieve the thoroughness required to prove that a system does what it purports to do. It also ensures that a system is maintained in a validated state throughout its entire life cycle, from conception through retirement. ER/ES capability can vary, and the approach should be based on the specific case and the risk of failing to meet the guidance associated with it. FDA’s 21 CFR Part 11 was enacted in the late 1990s and implementation success across the pharmaceutical and other regulated industries has been mixed. There are very specific limitations that arise when using ER/ES capability, such as the elimination of print capability to prevent users from making decisions based on a paper record as opposed to the electronic record. It also requires very specific identification of users that ensures the person signing the record is the same person whose credentials are being entered and verified by the system. Rules for changing passwords must be rigorously adhered to and the passwords must be kept secure. Who Will Benefit: This webinar is intended for those involved in planning, execution and support of computer system validation activities, working in the FDA-regulated industries, including pharmaceutical, medical device, biologics, tobacco and tobacco-related products (e-liquids, e-cigarettes, pouch tobacco, cigars, etc.). Functions that are applicable include research and development, manufacturing, Quality Control, distribution, clinical testing and management, sample labeling, adverse events management and post-marketing surveillance. Examples of who will benefit from this webinar include: Information Technology Analysts Information Technology Developers and Testers QC/QA Managers and Analysts Analytical Chemists Compliance and Audit Managers Laboratory Managers Automation Analysts Manufacturing Specialists and Managers Supply Chain Specialists and Managers Regulatory Affairs Specialists Regulatory Submissions Specialists","date_start":"2022-03-24","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}