{"name":"4th International Conference on Research in Humanities and Social Sciences","series":"","short":"ICRHS","website":"https://www.icrhs.org","content":"The 4th International Conference on Research in Humanities and Social Sciences, happening on the 7th– 9th May 2021, Milan, Italy is the premier forum for the presentation of new advances and research results in education theory and practice. This conference is a prestigious event, organized to provide an international platform for academicians, researchers, managers, industrial participants, and students to share their research findings with global experts. All full paper/abstract submissions will be peer-reviewed and evaluated based on originality, technical and/or research depth, accuracy and relevance to conference theme and topics. The conference is seeking submissions related to the following conference topics: Social Sciences, Humanities, Language and Literature. Other related tracks and topics will also be considered. Submitted abstracts will be evaluated by the Scientific Committee. If abstract is accepted, author agrees to send full text paper, including results, tables, figures and references. All submissions should report original and previously unpublished research results no matter the type of research paper you are presenting. Full text papers (.docx and .doc) will be accepted by Electronic Submission Form. Manuscripts should meet the format set by the Conference committee and are subject to review. – Please submit your papers via ONLINE SUBMISSION FORM. – For more information about the conference, you are welcome to contact the organizing committee directly via info \\[at\\] icrhs.org . Important deadlines are: Paper Submission Deadline: 16 April 2021 Early Registration Deadline: 15 February 2021 Late Registration Deadline: 26 April 2021 Conference Dates: 7-9 May 2021 We encourage you to invite colleagues to participate in the conference and submit original research for the conference Call for Papers.","date_start":"2021-05-07","date_end":"2021-05-09","important_dates":{"abstract":"","full":"2021-04-16","notification":"","final":""},"topics":["Social Sciences","Anthropology / Archaeology","Sociology, Social Sciences"],"location":{"virtual":"","full":["Milan","Italy"],"name":"","street":"","city":"Milan","state":"","ZIP":"","country":"Italy"},"organizers":["Acavent"],"societies":[],"indexes":[],"emails":[]}