{"name":"If It Wasn't Documented It Didn't Happen: Legal & Effective Discipline & Documentation","series":"","short":"","website":"https://www.complianceonline.com/workplace-documentation-and-employee-discipline-webinar-training-701495-prdw?channel=Brownwalker","content":"This webinar will help managers master the art and science of performance documentation. You will learn about safe, legal, & effective disciplinary practices & documentation. Why Should You Attend: In our litigious society, it has become more and more important for managers to know how to document and discipline employees to avoid law suits and manage employee performance effectively In this 60-minute webinar, Judi gives managers a “crash course” in safe, legal, and effective disciplinary practices and documentation. You will learn how to separate poor performance from poor attitude, counsel employees, and write Performance Improvement Plans. You will learn how to keep a legal performance log and to document both good and substandard performance. You will learn how to implement your organization’s disciplinary policy with confidence & accuracy. Learn how to take the guess work out of documentation and discipline. Areas Covered in the Webinar: Avoid the negative consequences of inadequate documentation & discipline. Utilize the range of disciplinary options. Respond quickly and appropriately to common disciplinary infractions. Keep a legal Performance Log. Distinguish between subjective and objective documentation. Work with employees to develop Performance Improvement Plans. Write and implement Performance Improvement Plans. Fill out formal HR disciplinary paperwork. Who Will Benefit: This webinar will provide valuable assistance to all personnel in: Business, Industry, Manufacturing, Not-for-Profits, Education, Technology, etc. Human Resource Professionals New Supervisors Experienced Managers Upwardly Mobile Professionals Leaders Shift Leaders","date_start":"2021-12-01","date_end":"2021-12-02","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Human-Resources"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}