{"name":"9th International Conference on Photonics, Optics and Laser Technology - PHOTOPTICS 2021","series":"","short":"","website":"http://www.photoptics.org","content":"9th International Conference on Photonics, Optics and Laser Technology PHOTOPTICS website: http://www.photoptics.org February 11 - 13, 2021 Vienna, Austria In Cooperation with: E-MRS, SIF, SIOF and Photonics21\\. Proceedings will be submitted for indexation by: SCOPUS, Google Scholar, DBLP, Semantic Scholar, Microsoft Academic, EI and Conference Proceedings Citation Index. IMPORTANT DATES: Regular Paper Submission: September 14, 2020 Authors Notification (regular papers): November 12, 2020 Final Regular Paper Submission and Registration: November 26, 2020 Position Paper Submission: October 29, 2020 Authors Notification (position papers): December 4, 2020 Final Regular Paper Submission and Registration: December 18, 2020 Scope: Optics has a long and distinct tradition among physical sciences. Ever-present throughout human history, optical systems and phenomena have been subject of interest in all cultures and epochs, from the ancient times of geometrical optics, across the works of Alhazen, Kepler, Descartes, Newton, Huygens, Young, Fresnel, Poisson and many others, to the electromagnetic theory synthesis of Maxwell, culminating in the quantum mechanics revolution of the first half of the 20th century which has come to pave the way for modern laser and photonics technologies. Optical systems are ubiquitous in modern society, with an ever-increasing number of applications covering medical sciences (vision technologies, surgical instrumentation, medical imaging), spatial exploration (telescopes, lenses, spectrometers), telecommunications (fiber optics), information processing (quantum computing), industry (from cutting, welding to precision metrology) and military/weaponry technology, to name but a few examples. Furthermore, laser and optical technology are in general absolutely essential to performing applied research in areas such as chemistry and biology, providing fundamental analysis tools. The success of optical systems and technologies in high-end scientific research has also found its way into everyday consumer products such as printers, displays, discs, cameras and eyeglasses, not to forget that optical fiber is crucial to telecommunications in general and internet in particular. This 9th edition of PHOTOPTICS will feature three different tracks on Optics, Photonics and Lasers, covering both theoretical and practical aspects. Researchers, engineers and practitioners interested in any of these fields are welcome to join us in Vienna, Austria and present their work on new methods or technologies, advanced prototypes, systems, tools and techniques, as well as general survey papers indicating future directions. Accepted papers, presented at the conference by one of the authors, will be published on the Proceedings of PHOTOPTICS, with an ISBN. Acceptance will be based on quality, relevance and originality. Both full research and work-in-progress reports are welcome. There will be both oral and poster sessions. Companies interested in presenting their products or methodologies or even researchers interested in holding a tutorial, workshop or special session are invited to contact the conference secretariat or visit the conference website. Conference Topics: Area 1: Lasers - Biomedical and Therapeutic Laser Applications - Fiber Lasers and Applications - High Intensity Lasers and High Field Phenomena - Laser Spectroscopy and Microscopy - Quantum Electronics and Laser Science - Quantum Information and Communication - Semiconductor Lasers and LEDs - Laser Manufacturing Technology and Processes Area 2: Optics - Adaptive Optics - Applied Industrial Optics - Biomedical Optics - Computational Optical Sensing and Imaging - Fiber Optics Technology - Light-Matter Interaction - Optical Communications and Networking - Optical Instrumentation and Signal Processing - Optical Materials and Devices - Spectroscopy, Imaging and Metrology Area 3: Photonics - Fiber Optics Devices - Terahertz Photonics - Microphotonics, Nanophotonics and Optical Manipulation - Nonlinear Optics and Photonics - Organic and Bio-Photonics - Photodetectors, Sensors, Displays and Imaging - Photonic and Optoelectronic Materials and Devices - Photonics for Energy, Green Photonics and Smart Lighting - Plasmonic Structures and Quantum Dots - Ultrafast Phenomena, Attosecond Science and Technology - Machine Learning in Photonic Systems PHOTOPTICS KEYNOTE LECTURE Dieter Bimberg, Bimberg Chinese-German Center for Green Photonics of the Chinese Academy of Sciences, CIOMP and Center of Nanophotonics, TU Berlin, Germany Jean-Jacques Greffet, Laboratoire Charles Fabry, Institut d'Optique Graduate School, Université Paris-Saclay, France Enzo Di Fabrizio, Polytechnic of Turin, Italy PHOTOPTICS CONFERENCE CHAIR: Paulo Ribeiro, CEFITEC/FCT/UNL, Portugal PHOTOPTICS PROGRAM CHAIR: Maria Raposo, CEFITEC, FCT/UNL, Portugal PROGRAM COMMITTEE http://www.photoptics.org/ProgramCommittee.aspx PHOTOPTICS Secretariat Address: Avenida de S. Francisco Xavier, Lote 7 Cv. C Tel: +351 265 520 185 Fax: +351 265 520 186 Web: http://www.photoptics.org e-mail: photoptics.secretariat@insticc.org","date_start":"2021-02-11","date_end":"2021-02-13","important_dates":{"abstract":"","full":"2020-09-14","notification":"","final":""},"topics":["Engineering & Technology","Other","Photonics, Photochemistry"],"location":{"virtual":"","full":["Vienna","Austria"],"name":"","street":"","city":"Vienna","state":"","ZIP":"","country":"Austria"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["photoptics.secretariat@insticc.org"]}