{"name":"Call for papers: \"I want to die\": The contemporary writer and their suicide","series":"","short":"","website":"https://www.acla.org/i-want-die-contemporary-writer-and-their-suicide","content":"\"I want to die\": The contemporary writer and their suicide Organizer: Josefa Ros Velasco Contact the Seminar Organizers https://www.acla.org/i-want-die-contemporary-writer-and-their-suicide From the turn of the 20th century to the present, debates over the meaning of suicide became a privileged site for efforts to discover the reasons why people commit suicide and how to prevent this behavior. Since Émile Durkheim published his study Suicide in 1897, a reframing of suicide took place, giving rise to a flourishing group of researchers devoting their efforts to understand better the causes and prevention of suicide. A century later, we still keep on trying to reach such an understanding of suicide and its modern conceptualization to prevent suicidal behaviors. Suicide is an act that touches all of our lives and engages with the incomprehensible and unsayable. In searching for solutions to how to make life valuable, modern neuropsychiatric research alone is not able to offer such a chance to people after all. On the contrary, self-reflection and self-analysis, as those made by contemporary writer who committed suicide, seem a good alternative. To explore the place where reasons end, in addition to traditional and clinical suicidology studies, we count on literature and the experience of authors who committed or tried to commit suicide as invaluable resources to approach this issue in modern times. This is a seminar to analyze the social and contextual causes of suicide, the existential, philosophical, and psychological reasons for committing suicide, and the prevention strategies we can learn from contemporary writers across the world who attempted to commit suicide or reached this goal and wrote about this topic in their biographical notes or artistic pieces. Proposals should focus on the clues the authors themselves left before committing suicide (or attempting to) both in their biographical texts and in their literary works, regardless of the literary genre, the sex of the authors or their nationality. Such an analysis will serve the purpose of understanding better the phenomenon of suicide, its most inaccessible impulses, and provide a space to think of how their suicides might have been prevented from the examined clues found both in their biography and their masterpieces. This workshop will be the second part of the one held in 2019 at Georgetown University (with a brief sequel at Harvard University the same year), as part of the ACLA Annual Meeting, focused on the study of suicide through the characters of contemporary fictional works. The results of these meetings will be published in September 2021 by the publisher Springer Nature (https://www.springer.com/gp/book/9783030693916). The proceedings of this second meeting are waiting to be published in another volume with the same characteristics. NOTE: If you are interested ONLY in contributing a chapter to the collective book, please, reach me at josros@ucm.es.","date_start":"2022-06-15","date_end":"2022-06-18","important_dates":{"abstract":"","full":"2021-10-31","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["ACLA"],"societies":[],"indexes":[],"emails":["josros@ucm.es"]}