{"name":"2021 International Conference on Technologies in STEM ‘LIVE’","series":"","short":"","website":"https://sldt.ear.com.sg","content":"ICTSTEM 2021 is moving forward with a physical event in 2021! We’re pleased to announce that 2021 International Conference on Technologies in STEM (ICTSTEM 2021), organized by East Asia Research and supported by Australia’s Curtin University, will be live, in-person, in Singapore from December 14-15, 2021! Learn from the masters of STEM education at the premier conference for the global Educator community. The conference aims to further the application of technology education within STEM and specific learning areas. Within Technology education, students use design and/or computational thinking and technologies to generate and produce designed solutions both digital and physical for authentic problems. As such it applies to many areas of STEM. We invite practitioners and researchers to network and share their experiences. Teachers, and heads of learning areas as well as teacher educators, researchers and HDR researchers from K to higher education are all encouraged to attend. A broad range of technology education topics, including significant developments as well as innovative uses of technology that promote learning, performance, and instruction, will be presented at ICTSTEM 2021\\. Join us for ICTSTEM 2021 at Holiday Inn Singapore Atrium, Singapore and walk away with powerful knowledge that will empower you to forge the path for the future of STEM education. Limited seating may apply. ‘BUY TICKET’ now. Don’t wait – this rate won’t last long! Due to the persistence of COVID-19, the conference will be conducted in a ‘Hybrid Format’. Participants can make oral/poster presentations onsite or send us pre-recorded video presentations and register as a ‘Virtual Presenter’. They will indicate their preferred presentation medium when they register. The ‘Early Bird Registration Deadline’ is on October 13th 2021\\. What can you expect at ICTSTEM 2021? • Ample interaction opportunities for ICTSTEM delegates • Top Singapore hospitality for all attending delegates • An intellectually stimulating scientific program featuring more than 100 presentations by leading researchers, teachers, and practitioners • Selected Authors will be approached to expand their paper to a chapter in a Springer Publication Conference Papers Publishing: Authors are invited to submit their full papers to publish in a Springer Publication. Contemporary Issues in Technology Education Springer series (https://www.springer.com/series/13336). All accepted abstracts will be published in ‘International Conference on Technologies in STEM 2021 Programme & Abstract Book’, ISBN: 978-981-14-4814-0.","date_start":"2021-12-14","date_end":"2021-12-15","important_dates":{"abstract":"","full":"2021-06-16","notification":"","final":""},"topics":["Education / Legal / Other","Education","educational technology"],"location":{"virtual":"","full":["Singapore","Singapore"],"name":"","street":"","city":"Singapore","state":"","ZIP":"","country":"Singapore"},"organizers":["East Asia Research & Curtin University"],"societies":[],"indexes":[],"emails":[]}