{"name":"QS Online World Graduate Fair Virtual World Grad School Tour Korea","series":"","short":"","website":"https://go.evvnt.com/691627-0?pid=4868","content":"Masters and PhD Fair, an online world graduate school fair hosted by QS, a world university evaluation institution in the UK World Grad School Tour Online Korea | 26 Oct 2020 | 6-9.30PM | Virtual Masters Fair The online seminars and fair will be fully conducted in English. Free pre-registration: https://bit.ly/2Sm9yXS Online pre-registration open! If you upload the English CV at the time of registration, professional foreign headhunters will provide 1:1 CV review! $5.8 million total scholarship Imperial College Columbia University UCLA Participated in Singapore National University and 30+ universities An overseas graduate school fair hosted by QS, known as the UK's renowned global university evaluation organization, is held online in Korea. Are you considering a differentiated career after graduating from university, a master's/doctoral program that can be recognized as a global talent when you are employed in Korea as well as overseas employment? Through video sessions for each school, please get information on graduate schools in the US, UK, France, Italy, Australia, and Hong Kong. QS events are different from other fair events that you consult with an agent or agency. Since each school's admissions officer participates directly in the event, you can consult with the school's admissions officer to obtain accurate school-specific program information. If you prepare your questions in English, you can leave a good impression on the admissions officer and provide a smoother online consultation. A total of USD $5.8m worth of scholarship opportunities are available for participants only. Contact KakaoTalk ID: QSAsia or yura@qs.com Price: General Admission: KRW 0.00 Time: 5:00 pm - 9:00 pm","date_start":"2020-10-26","date_end":"","important_dates":{"abstract":"","full":"2020-10-25","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["QS Quacquarelli Symonds"],"societies":[],"indexes":[],"emails":["yura@qs.com"]}