{"name":"Identifying Bankruptcies Sooner Than Later","series":"","short":"","website":"https://bit.ly/3xgFr7N","content":"In a recent survey conducted by The Accounts Receivable Network, 58% of Credit Managers say they have been surprised by a customer’s bankruptcy filing in the past year. Although Credit departments have always managed risk exposure, the speed of bankruptcy filing has accelerated greatly in past years. Whereas in the past, a creditor would receive a number of warning signs (increasingly past due payments, declining credit ratings, operating losses, shrinking of cash reserves, exhausting lines of credit, etc.), from a deteriorating customer, that is no longer the case in many instances. We have observed customers who are moderately past due in their payments to a supplier file bankruptcy. This catches their suppliers by surprise, resulting in higher bad debt loss. “Identifying Bankruptcies Sooner than Later” will equip you with techniques to better forecast a potential bankruptcy and with actions to mitigate the risk of loss. Why Should You Attend This topic will benefit anyone who manages the Accounts Receivable asset and its risk of bad debt and delinquency loss. Credit control teams are continuously asked to deliver improved results with the same or reduced resources. The marketplace has seen a proliferation of private financing tools which can increase customers’ leverage and subordinate unsecured creditors’ claims. Completing this session will enable managers to focus their limited credit resources in the most efficient and effective way. This will result in: » greater recognition of credit risk, even in companies who are currently paying on time » lower bad debt exposure and expense This methodology is designed for business customers, (vs consumer). It is relatively easy to implement without major help from Information Technology and Analytics. It may require a low level investment in subscribing to credit bureaus and other sources. It can be a self-driven quick to medium term win for any Credit department. After attending this live webinar you will be able to design and implement an improved Credit Risk Management process, and better protect yourself from unexpected bankruptcy loss. Objectives of the Presentation » To enable Credit Management to identify potential “pre-packaged” bankruptcy candidates earlier, to enable a reduction of credit exposure. Areas Covered in the Session » Current bankruptcy landscape: bankruptcy as a financing tool » Techniques to identify an impending bankruptcy » Tactics to mitigate risk & exposure to bad debt loss » Top 10 Warning Signs of an Impending bankruptcy Who Will Benefit » Credit Directors and Credit Managers » Treasurers and Controllers » Chief Financial Officers » Risk Officers and Internal Auditors » Customer Financial Services Managers To Register (or) for more details please click on this below link: [https://bit.ly/3xgFr7N Email: support@concordeducations.com Tel: +1-989-341-8773](https://bit.ly/3xgFr7N)","date_start":"2022-01-27","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Accounting"],"location":{"virtual":"","full":["New Castle","United States"],"name":"","street":"","city":"New Castle","state":"","ZIP":"","country":"United States"},"organizers":["ConcordEducations"],"societies":[],"indexes":[],"emails":["support@concordeducations.com"]}