{"name":"The 5th Combinatorics and Graph Theory Conference","series":"","short":"CGT 2020","website":"https://www.maymeeting.org/conference/CGT2020","content":"The 5th Combinatorics and Graph Theory Conference (CGT 2020) Conference Date: May 29-31, 2020 Conference Venue: Xiamen, China Website: http://www.maymeeting.org/conference/CGT2020/ Online Registration System: http://www.maymeeting.org/RegistrationSubmission/default.aspx?ConferenceID=1230 Email: wsconf5@163.com The 5th Combinatorics and Graph Theory Conference (CGT 2020) will be held from May 29-31, 2020 in Xiamen, China. CGT 2020 will cover issues on Algebraic graph theory, Applications of combinatorics and graph theory, Coding theory, Combinatorial algorithms, Combinatorial designs, Combinatorial matrix theory, Combinatorial optimization, Cryptography, Enumerative combinatorics, Finite geometry, Structure graph theory, Topological graph theory, etc. It dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal，please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: wsconf5@163.com Tel: +86 132 6470 2250 QQ: 1349406763 WeChat: 3025797047 Attendance Methods 1.Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Algebraic graph theory Applications of combinatorics and graph theory Coding theory Combinatorial algorithms Combinatorial designs Combinatorial matrix theory Combinatorial optimization Cryptography Enumerative combinatorics Finite geometry Structure graph theory Topological graph theory","date_start":"2020-05-29","date_end":"2020-05-31","important_dates":{"abstract":"","full":"2020-04-29","notification":"","final":""},"topics":["Physical Science & Math","Mathematics"],"location":{"virtual":"","full":["Xiamen","China"],"name":"","street":"","city":"Xiamen","state":"","ZIP":"","country":"China"},"organizers":["Engineering Information Institute"],"societies":[],"indexes":[],"emails":["wsconf5@163.com"]}