{"name":"The 3rd Int'l Conference on Soil Remediation and Plant Protection","series":"","short":"SRPP 2021","website":"http://www.novevents.org/conference/SRPP2021","content":"The 3rd Int'l Conference on Soil Remediation and Plant Protection (SRPP 2021) Conference Date: November 26-28, 2021 Conference Venue: Xiamen, China Website: https://www.novevents.org/conference/SRPP2021/ Online Registration System: https://www.novevents.org/RegistrationSubmission/default.aspx?ConferenceID=1400 Email: rolin\\_zhang@163.com The 3rd Int'l Conference on Soil Remediation and Plant Protection (SRPP 2021) will be held during November 26-28, 2021 in Xiamen, China. This Conference will cover issues on Soil Science Soil and Global Change, Soil Ecology, Soil Environment, Plant Protection and other Related Topics. It dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods in related fields. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal，please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: rolin\\_zhang@163.com Tel: +86 13264702250 QQ: 1349406763, 3025797047 WeChat: 3025797047 Twitter: conf\\_Committee Attendance Methods 1.Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Soil Science Soil and Global Change Soil Biology/Biochemistry Soil Chemistry Soil Degradation and Contamination Soil Ecology Soil Environment Soil Fertility Soil Genesis, Morphology, Classification and Evaluation Soil Geography Soil Information Soil Improvement Studies Soil Microbiology Soil Properties and Processes Soil Protection and Remediation Soil Physics Soil Quality Soil Survey Soil Tillage Soil Use and Management Soil Decontamination Sustainable Land Use and Related Water Management Plant Protection Classes of Plant Hormones Hormones and Plant Propagation Effects of Plant Hormones and other Agrochemicals Field Crops Land and Water Management Fruits and Citrus Fertilizers and Chemicals Plants, Seeds and Propagation Materials Plant Protection and Fertilization Post Harvest Treatment Soil-Plant Interactions Carbon Sequestration Climate Change Impacts and Feed-backs Effects of Plants or Crop Rotations on Soil Retention/Release of Nutrients, Pollutants and Water in the Soil-Plant System Rhizosphere Organisms and Processes Other Related Topics","date_start":"2021-11-26","date_end":"2021-11-28","important_dates":{"abstract":"","full":"2021-10-26","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental"],"location":{"virtual":"","full":["Xiamen","China"],"name":"","street":"","city":"Xiamen","state":"","ZIP":"","country":"China"},"organizers":["Academic Communications"],"societies":[],"indexes":[],"emails":["_zhang@163.com"]}