{"name":"21st International Scientific GeoConference SGEM Vienna Green 2021","series":"","short":"","website":"https://www.sgemviennagreen.org","content":"If there is one event in the world of the Earth & Planetary sciences, that you would not like to miss – this is SGEM Vienna Green 2021! The Conference is organized as an extended Scientific Sessions of the International Scientific GeoConference SGEM. Together with Scientists, Researchers, Educators and Government Representatives from all over the world, by sharing our latest research and exchanging ideas we are going to propose potential solutions of problems related to the global changes and contribute to the integration of environmental consideration into the decision-making process. The 21th International Scientific GeoConference SGEM Vienna Green 2021 will be held at one of the most historical palace buildings in Vienna - Schönbrunn Palace. All accepted, after peer review papers, are published in the Conference Proceedings (ISSN 1314-2704) and yearly are submitted for evaluation and indexation by ISI Web of Science - Clarivate, ELSEVIER products - SCOPUS, Mendeley and COMPENDEX, CrossRef, SPRINGER Nature, EBSCO, ProQuest, RSCI (Russian eLibrary - РИНЦ), Google Scholar, CiteULike, British Library and many others. All the accepted papers receive a unique DOI number, needed for recognition in the International databases. The 21th International Multidisciplinary Scientific GeoConference SGEM Vienna Green 2021 is a conference and exhibition dedicated to solutions and innovations in 12 different scientific fields: Oil and Gas Exploration, Hydrology and Water Resources, Forest Ecosystems, Nuclear Technologies, Recycling, Air Pollution and Climate Change, Micro and Nano Technologies, Advances in Biotechnology, Green Buildings Technologies and Materials, Green Design and Sustainable Architecture, Modern Energy and Power Sources, Animals and Society The SGEM Scientific Committee has a strong commitment of providing opportunities for conference participants to exchange knowledge and ideas, communicate and learn from each other. The conference programme combines number of sessions and events that are designed specifically to promote interactions among the on-site members of the knowledge geo-community. These range from more formal Oral and Poster sessions, through parallel Invited Session presentations and Workshop discussions, to informal coffee breaks and optional social activities.","date_start":"2021-12-07","date_end":"2021-12-11","important_dates":{"abstract":"","full":"2021-10-11","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental","Recycling"],"location":{"virtual":"","full":["Viena","Austria"],"name":"","street":"","city":"Viena","state":"","ZIP":"","country":"Austria"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}