{"name":"Ethics and risk management issues in online and distance behavioral health","series":"","short":"","website":"https://bit.ly/3023FTj","content":"Behavioral health practitioners have become increasingly dependent on technology to provide online and distance (remote) services to clients. This trend has introduced complex and novel ethical and risk management issues. Dr. Frederic Reamer will discuss key ethics challenges; provide an overview of emerging ethical, regulatory and practice standards; and share a series of practical tips. Why Should You Attend Behavioral health professionals must be skilled in their ability to use technology to provide online and distance services to clients. Do I need new informed consent protocols when I provide services to clients remotely? What steps should I take to comply with strict HIPAA regulations? Am I allowed to provide online and distance counseling services to a client who has moved to another state? What should I include in my social media policy? Is it ethical to search online for information about clients without their knowledge or consent? If you find these and other complex issues related to online and distance behavioral health services challenging, this is the webinar for you. Come hear ethics expert Dr. Frederic Reamer share his insights about effective ways to protect clients and prevent litigation and licensing board complaints. Objectives of the Presentation » Identify challenging ethics and risk management issues related to behavioral health practitioners’ use of technology to serve clients remotely » Apply key ethical, regulatory, and practice standards related to use of technology to serve clients » Identify ethical issues that pose malpractice and liability risks » Design strategies to protect clients, practitioners, and employers Areas Covered in the Session » Ethics and risk management issues in online and distance behavioral health: Overview » Key ethics and risk management challenges in online and distance behavioral health » Ethical, regulatory, and practice standards: A summary » Risk management strategies: Protecting clients, practitioners, and employers Who Will Benefit » Clinical Social Workers » Psychologists » Psychiatrists » Mental Health Counselors » Marriage and Family Therapists » Substance use Disorder Practitioners To Register (or) for more details please click on this below link: https://bit.ly/3023FTj Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-03-19","date_end":"","important_dates":{"abstract":"","full":"2021-03-19","notification":"","final":""},"topics":["Medicine & Health","Mental-Health","risk management"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}