{"name":"2021 International conference on Environment Engineering and Energy Science (IC-EEES 2021)","series":"","short":"","website":"www.ic-eees.org","content":"2021 International conference on Environment Engineering and Energy Science (IC-EEES 2021) will be held in Jing De Zhen, China, Sept 28-30, 2021! Prof. Hong Yu from College of Enviromental Science and Engineering, Beijing Foreatry University, China will be our conference chair and keynote speaker. Prof. Dr. Kokyo Oh from Saitama Center for Environmental Science, Japan and Prof. Dr Ahmad Zuhairi Abdullah from School of Chemical Engineering, Universiti Sains Malaysia, Malaysia will give keynote speach. All the registered and presented papers will be published in the following journals: 1\\. E3S Web of Conferences, which will be submitted to EI Compendex, Scopus, SciTech Premium Collection (ProQuest), and other databases for review and indexing; 2\\. The high quality papers with great extension will be recommended to publish in Global Journal of Environmental Science and Management (GJESM) (ISSN: 2383-3572), it will be indexed in Web of Science (ESCI), Scopus (with CiteScore = 2.9), Engineering Village - GEOBASE, Scimago Journal With rank Q2, Rank (Q2), EBSCO, ProQuest, Cabi, Chemical Abstracts, Google Scholar and many more databases which can be traced from the title website. 3\\. Processes EISSN 2227-9717 Impact Factor: 2.753 (2019) It will be indexed within Scopus, SCIE (Web of Science), CAPlus / SciFinder, Inspec, and many other databases. Paper submission: 1.Conference Submission System: https://cmt3.research.microsoft.com/ICEEES2021 2.Mail: iceees@isaeri.org Conference Secretary: Ms. Alice Li Tell: +852-30756685 Mail: iceees@isaeri.org Conference website: www.ic-eees.org","date_start":"2021-09-28","date_end":"2021-09-30","important_dates":{"abstract":"","full":"2021-08-20","notification":"","final":""},"topics":["Engineering & Technology","Renewable Energy/Nuclear"],"location":{"virtual":"","full":["Jing De Zhen","China"],"name":"","street":"","city":"Jing De Zhen","state":"","ZIP":"","country":"China"},"organizers":["Innovative Science and Engineering Research Institute (ISERI)"],"societies":[],"indexes":[],"emails":["iceees@isaeri.org"]}