{"name":"Compliance with the American with Disabilities Act (ADA) in 2022","series":"","short":"","website":"https://www.complianceonline.com/compliance-with-ada-2022-webinar-training-705608-prdw?channel=Brownwalker","content":"The Americans with Disabilities Act (ADA) was signed into law by George H.W. Bush in July 1990\\. The Act is a civil rights law that prohibits discrimination against individuals with disabilities in all areas of public life, including jobs, schools, transportation, and all public and private places that are open to the general public. The purpose of the law is to ensure that people with disabilities have the same rights and opportunities similar to those provided to individuals on the basis of race, color, sex, national origin, age, and religion. Disability accommodation is an important and visible aspect of ethical business practices. Compliance with the Americans with Disabilities Act will ensure your organization is operating in an ethical manner. Why Should You Attend: Non-compliance with the Americans with Disabilities Act (ADA) can prove to be costly for employers. Penalties in excess of hundreds of thousands of dollars for non-compliance put employers at substantial risk. Can your organization afford to be non-compliant? This webinar will provide participants with a comprehensive understanding of the Americans with Disabilities Act and will explain the importance of compliance and the consequences of non-compliance. Participants will gain a solid understanding of the ADA’s disability accommodation process and the interactions between Federal and State laws. Areas Covered in the Webinar: An understanding of employer’s, applicants’, and employees’ rights under the Act Titles I through V of the ADA Definitions of “reasonable accommodation” and “major life activities” Examples of reasonable accommodations that an employer may have to provide Limitations on the obligation to make reasonable accommodations Importance of the employer/employee interactive dialogue Maintaining existing production and performance standards for an employee with a disability Which medical conditions are protected under the ADA Who Will Benefit: Senior Leadership Human Resource Professionals Managers and Supervisors Compliance Professionals Operations Professionals Benefits Professionals Employees","date_start":"2021-11-03","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Human-Resources"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}