{"name":"2022 Singapore Conference on Applied Psychology ‘LIVE’","series":"","short":"","website":"https://scap.ear.com.sg","content":"Who else wants an in-person conference? 2022 Singapore Conference on Applied Psychology ‘LIVE’ (SCAP2022) 8-9 December 2022 Holiday Inn Singapore Atrium, Singapore With plans to substantially ease travel restrictions, now is the best time to plan your trip to Singapore, the Monte Carlo of Asia! We’re pleased to announce that the 2022 Singapore Conference on Applied Psychology (SCAP 2022), organized by East Asia Research and supported by the Singapore University of Technology and Design and University of Derby, will be a hybrid conference happening in Singapore from December 8-9, 2022! Learn from the masters of Applied Psychology at the premier conference for the global Applied Psychology community. The theme for SCAP 2022 is “Psychological Well-being”. We invite researchers and practitioners from all fields of psychology research and practice to present and discuss recent innovations, trends, concerns, practical challenges encountered and the solutions adopted in the field of Applied Psychology, with a special focus on ‘Psychological Well-Being’. This can include clinical and non-clinical psychological well-being and we encourage submissions that cross disciplines, for example psychological well-being in education and the workplace. Join us for SCAP 2022 at Holiday Inn Singapore Atrium, Singapore and walk away with powerful knowledge that will empower you to forge the path for the future of Applied Psychology. Limited seating may apply. ‘BUY TICKET’ now. Don’t wait – this rate won’t last long! Due to the persistence of COVID-19, the conference will be conducted in a ‘Hybrid Format’. Participants can make oral/poster presentations onsite or send us pre-recorded video presentations and register as a ‘Virtual Presenter’. They will indicate their preferred presentation medium when they register. The ‘Early Bird Registration Deadline’ is on October 12th 2022\\. SCAP Keynote Speakers: Dr. Thomas Hunt, Conference Chair, Assoc. Professor, School of Human Sciences, University of Derby Dr. Carrie Childs, Senior Lecturer, School of Human Sciences, University of Derby Abstract Submission Deadline: 13th July 2022 Enquiries: anthonytan@ear.com.sg Web address: https://scap.ear.com.sg Sponsored by: East Asia Research, University of Derby and Singapore University of Technology and Design P.S. If you are representing an Association or an Institute of Higher Learning and would like to be a conference partner, please get in touch with us. Many benefits await you when joining us!","date_start":"2022-12-08","date_end":"2022-12-09","important_dates":{"abstract":"","full":"2022-07-13","notification":"","final":""},"topics":["Social Sciences","Psychology","Brain Injury, Rehabilitation, Diagnosis"],"location":{"virtual":"","full":["Online Event","Singapore"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Singapore"},"organizers":["East Asia Research, University of Derby and Singapore University of Technology and Design"],"societies":[],"indexes":[],"emails":["anthonytan@ear.com.sg"]}