{"name":"8th SEHA International Nursing, Midwifery and Allied Health Conference","series":"","short":"","website":"https://go.evvnt.com/402445-0?pid=4868","content":"It is our great pleasure to invite you to the 8th edition of the SEHA International Nurses, Midwifery and Allied Health Conference, known also as SINMAC. This event will take place at the Jumeirah Etihad Towers Hotel on the 24th - 26th of September 2019\\. The theme for this year's conference is \"Improving Health Outcomes: Innovating Healthy Work Environments and Staff Well Being\". It aims to discover, create and implement innovative healthcare set-up that ensures the well-being of patients and healthcare providers. The Committee has collaborated with several national and international organizations to bring about a unique education experience that covers the most important and current issues related to this ﬁeld. We are expecting more than one thousand delegates to attend this worthy gathering. The meeting will feature several of the world-class experts in this ﬁeld in addition to an elite roster of eminent local speakers that will cover a broad range of topics, state-of-the-art lectures and interactive sessions to encourage exchange of knowledge, experience and best practices in the ﬁeld. As a premier event, we have developed a high-quality scientiﬁc program with your interest in mind. We have not only increased the number of opportunities for you to network with colleagues from across the region but have also introduced more focused sessions that will feature cutting-edge presentations, special panel discussions and lively interaction with leaders and experts. We hope this meeting will be of great beneﬁt to all participants in the UAE and the region and also hope and trust that you will enjoy your visit to Abu Dhabi, the capital of the United Arab Emirates, a vibrant and fast-growing city that combines state-of-the-art facilities and infrastructure, with a glimpse into an ancient and endlessly fascinating past. We very much look forward to your participation in September 2019 and to welcoming you to Abu Dhabi. URLs: Tickets: https://go.evvnt.com/402445-2?pid=4868 Brochure: https://go.evvnt.com/402445-3?pid=4868 Inquiries: https://go.evvnt.com/402445-4?pid=4868 Time: 7:30 am - 5:00 pm Prices: ENA and SEHA Employees (3-DAY Participation) - Regular Rate: AED 800.0, Non-ENA/SEHA Employees (3-DAY Participation) - Regular Rate: AED 850.0, Students (ID Required) - Regular Rate: AED 600.0 Venue Details: Jumeirah At Etihad Towers, Etihad Towers, Abu Dhabi, United Arab Emirates","date_start":"2019-09-24","date_end":"2019-09-26","important_dates":{"abstract":"","full":"2019-05-14","notification":"","final":""},"topics":["Education / Legal / Other","Education","Healthcare"],"location":{"virtual":"","full":["Abu Dhabi","United Arab Emirates"],"name":"","street":"","city":"Abu Dhabi","state":"","ZIP":"","country":"United Arab Emirates"},"organizers":["MENA Conference"],"societies":[],"indexes":[],"emails":[]}