{"name":"Short Course on Computer Assisted Oil Spill Environmental Assessments in Land and Water","series":"","short":"","website":"https://www.wessex.ac.uk/courses/short-course-on-oil-spill-assessment-2019","content":"he huge volume of hydrocarbons transported through pipelines and by ships poses a continuous risk to the environment due to accidental spills. Understanding the processes determining oil trajectory and fate, and learning oil spill simulation tools, allows environmental professionals to design better response plans, and help mitigating future events. This course provides insight into the main processes that govern overland and water oil spills, and offers practical training to perform oil spill simulations using the OilFlow2D computational model. The course offers hands-on experience in setting up and running a variety of scenarios including pipeline spills hitting sensitive areas, and spills in sea and riverine environments, allowing us to determine where the oil will go, giving the spill location and volume. Learning topics include: Type of hydrocarbons and their characteristics. Crude oil properties databases. Behaviour of hydrocarbons in the environment. Concepts and theories of the process of oil spreading on the surface of the water and land. Influence of the wind, currents and waves in the spreading processes. Formulation to calculate Evaporation, infiltration, emulsification, dissolution, interaction with shore, etc. Effect of oil fate processes on oil viscosity and density. Modelling as a tool to support oil spill preparedness and response activities. OilFlow2d spill simulation model. How to use the oil spill model more effectively to evaluate overland and water spills. How to apply oil spill models for planning and decision-making. How to setup spill scenarios to assess spill response. How use OilFlow2D and Geographical Information Systems (GIS) to assess overland spills using Contingency Plans, and Environmental Risk Assessments. The course will cover the following topics: Evaporation, emulsification, dispersion and sinking. Change of physical properties such as viscosity and density. Influence of the wind, currents and waves in the spreading processes. Advantages and limitations of modelling. Methods of control of spills. Dispersants. Application of simulation models for the design of contingency plans. Creating oil spill trajectory animations, Use GIS tools to create oil spill location maps. After completing this course participants will be able to understand the main processes determining the fate and trajectory of oil spills and to apply the OilFlow2D model to assess overland spills and oil spills in rivers and coastal areas. The course includes a USB drive containing: OilFlow2D computer model with a 3-month license. Course Presentations. Videos. Tutorials. Oil property database Comprehensive model documentation.","date_start":"2019-12-03","date_end":"2019-12-05","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Engineering & Technology","Chemical","petroleum & petrochemicals (oil & gas)"],"location":{"virtual":"","full":["Ashurst","United Kingdom"],"name":"","street":"","city":"Ashurst","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Wessex Institute"],"societies":[],"indexes":[],"emails":[]}