{"name":"Purchasing Cards: Overcoming Risks and Creating an Effective Program","series":"","short":"","website":"https://www.complianceonline.com/purchasing-cards-overcoming-risks-and-creating-an-effective-program-webinar-training-704467-prdw?channel=Brownwalker","content":"This training program will detail the components of a successful purchasing card program. It will also discuss implementing proper purchasing card controls, types of risk including fraud and misuse, auditing techniques, and more. Why Should You Attend: If your organization is reluctant to implement or expand a purchasing card program, this webinar will recommend simple yet effective controls that can overcome these concerns. The course will help attendees determine how purchasing cards fit within the overall organization strategy and discuss components of a successful purchasing card program. Further, the webinar will also discuss implementing proper purchasing card controls and highlight pointers that can help you identify high risk transactions (including cybercrime). The course instructor will highlight the types of purchasing cards available and best practices to avoid common purchasing card fraud. Learning Objectives: Determining how purchasing cards fit within the overall organization strategy Components of a successful purchasing card program Implementing proper purchasing card controls How to identify highest risk transactions including cybercrime Types of risk including fraud and misuse Auditing techniques Internal controls and governance Discussion of types of purchasing cards available How to avoid common purchasing card fraud Who Will Benefit: CFOs Controllers Procurement Professionals Accounts Payable Managers and Directors P-Card Administrators Internal Auditors Treasury Leadership","date_start":"2021-11-12","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}