{"name":"2019 International Conference on Metals and Alloys","series":"","short":"","website":"http://www.cmaconf.org","content":"2019 International Conference on Metals and Alloys will be held from August 19 to 22 in Beijing, China, which is sponsored by Ghent University, Nanjing Tech University, Ton Duc Thang University and Duy Tan University. The conference is aimed at bringing together international scientists and engineers in academia and industry in fields related to research in metals and alloys, more specifically related to their mechanical behaviour, material properties, metallurgical behaviour and microstructures etc., and their applications to a wide range of engineering disciplines. ★ Publication and Indexing All accepted and registered papers will be included in IOP Conference Series: Materials Science and Engineering,which will be indexed by EI Compendex, Scopus, etc. ★ Topics of interest for submission include, but are not limited to: -Mechanical Behaviour Wear Creep Dislocation Hardness Material Properties Fatigue and Fracture Mechanical Strength Damage Initiation Crack Propagation Mechanical Testing Failure Analysis and Mechanisms Elastic and Plastic Deformation Brittle and Ductile Behaviours Experimental and Numerical Analysis High Strain-Rate Testing Fretting and Contact Behaviours -Metallurgy and Microstructures Thin Films Microstructure Nanostructures Production Metallurgy Metal Working Powder Metallurgy Metal Composites Welding and Joining Modeling and Validation Nano-Metallic Systems Physical Metallurgy Process Metallurgy Surfaces and Interfaces Corrosion and Coatings 3D Printing Experimental and Theoretical Research Chemical ad Electronic Structures Oxidation, Corrosion and Characterization Atomic and Molecular Arrangements ★ Paper Submission 1\\. Submit original technical papers via Submission System 2\\. Submit original technical papers via email cma@cmaconf.org ★ Call for participants 1\\. Presenter:If you are interested in presenting your research on the conference, without publishing your paper in the proceeding, you only need to submit the abstract to us! 2\\. Listener:If you are interested in attending the conference to understand ongoing research achievements and share with them your ideas, you are welcome to send your name and affiliation to us. 3\\. Reviewer:Experts in the area of metals and alloys are welcome to join the conference as reviewer. If you are interested in reviewing the papers, please send your latest CV. ★ Conference Highlights 1\\. Invited Speakers will have a longer presentation time and we will post your information on the website so that other participants can learn more from you first. If you are interested, please do not hesitate to let us know; 2\\. Conference proceeding will be indexed by Scopus, Engineering Compendex (EI), Inspec and etc; 3\\. Best Oral Presenters will be awarded a free registration for the next conference; 4\\. Lunches and Dinners during August 19-22 are covered; 5\\. One day tourism will be provided. ★ Contact us Ms. Bernice Wu-Conference Secretary E-mail: cma@cmaconf.org Tel.&Wechat: +86-13545231968 LinkedIn: www.linkedin.com/in/cmanme-conference","date_start":"2019-08-19","date_end":"2019-08-22","important_dates":{"abstract":"","full":"2019-06-30","notification":"","final":""},"topics":["Engineering & Technology","Material/Nanotechnology","Materials science, engineering, nanotechnology"],"location":{"virtual":"","full":["Beijing","China"],"name":"","street":"","city":"Beijing","state":"","ZIP":"","country":"China"},"organizers":["Ghent University(Belgium), Nanjing Tech University (China), Duy Tan University (Vietnam), and Ton Du"],"societies":[],"indexes":[],"emails":["cma@cmaconf.org"]}