{"name":"Harold Pinter: Histories and Legacies Conference – University of Leeds","series":"","short":"","website":"https://pinterlegacies.com/events/leeds-conference-harold-pinter-histories-and-legacies-a-three-day-international-conference","content":"A three-day, international conference on Harold Pinter Workshop Theatre, School of English, University of Leeds, Leeds Thursday 19th (15:00) – Saturday 21st September 2019 (17:00) Hosted by the Workshop Theatre in the School of English at the University of Leeds, Harold Pinter: Histories and Legacies is open to scholars and practitioners from any discipline. This international, interdisciplinary conference on Harold Pinter offers a forum to celebrate the late writer, but also to consider new empirical findings and new ways of engaging with Pinter’s life and work. The lapse in time since Pinter’s death can enable a more critical engagement with a figure who has long been a fixture among the twentieth- and twenty-first-century artistic elite, not just in Britain but globally. We welcome proposals for individual, 20-minute presentations concerned with any of Pinter’s varied professional roles and his work for and relationship to the broad range of media he worked in and engaged with. We invite all proposals to focus upon and respond creatively to the keywords in the conference title – Histories and Legacies – and offer the following list of possible topics: •Production genetics – the legacies that significant productions of Pinter’s plays leave for subsequent practitioners and approaches to Pinter's work. •Pinter at the Pinter – how has the recent season of Pinter’s one-act plays contributed to the public perception of the artist or appreciation of individual works or collections of work? •Reputation – how has the construction of Pinter’s celebrity interfered or participated in the reception of his work? •Compositional strategies – how do the evident stages of composition of Pinter’s plays and screenplays expose his relationship with those texts as they are formulated? •Thoughts from the archive – what is there to learn of Pinter’s professional practice from the manuscripts and correspondence available in the Harold Pinter Archive at the British Library, and associated holdings elsewhere? •Exporting Pinter – the nature and impact of British productions of Pinter’s work abroad. •Pinter on the fringes – the prevalence of Pinter’s plays in amateur and student theatre. •Pinter and the Royal Shakespeare Company – the significance of Pinter’s association with the RSC in the 1960s, for the organisation and for his development as an artist. •Pinter at the National Theatre – the role of Pinter as Associate Director of the NT and his relationship with other artists and the institution. •#metoo and Pinter – has the representation of gender and gender conflict evolved in representations of Pinter’s work on stage? •Political praxis – the explicit and implicit contribution made by Pinter himself or by his work in national and international affairs. •Pinter and broadcasting – how the media of radio and TV helped to build the writer’s profile and impact in the UK and further afield. •Pinter in history and theory – how a focus on the writer’s work can reorient or challenge methodologies, analytical discourses or theoretical assumptions. Please submit abstracts of 300 words max. and a biography of 100 words max. by 31 May 2019 to: engbaech@leeds.ac.uk (Include any special requirements you may have regarding access, space and equipment.) Further details: Keynote speaker: Vivienne Jabri, Professor of International Politics, Kings College London Special guest: Jamie Andrews, Head of Culture and Learning, British Library •In-conversation sessions with leading Pinter practitioners including Jamie Lloyd, Samuel West and Douglas Hodge. (Speakers’ appearance subject to scheduling.) •A practical workshop by Harry Burton. •A performance by Jeremy Goldstein: Truth to Power Café on 19 September. •The Harold Pinter: Histories and Legacies database launch on 21 September. Registration for the conference will open in June. There will be reduced rates for PGR students and for those who attended previous conferences arranged by the Pinter: Histories and Legacies project. Also, a limited number of subsidised spaces have been made available at the University nursery for the Friday. Please contact us if you think you might wish to make use of this facility. We look forward to seeing you in Leeds, Conference Organisers and Hosts: Mark Taylor-Batty and Basil Chiasson Supported by the Arts and Humanities Research Council and the University of Leeds","date_start":"2019-09-19","date_end":"2019-09-21","important_dates":{"abstract":"","full":"2019-05-31","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","Humanities"],"location":{"virtual":"","full":["Leeds","United Kingdom"],"name":"","street":"","city":"Leeds","state":"","ZIP":"","country":"United Kingdom"},"organizers":["University of Leeds"],"societies":[],"indexes":[],"emails":["engbaech@leeds.ac.uk"]}