{"name":"Regulatory Compliance for Dietary Supplements in the US, EU and Canada","series":"","short":"","website":"https://www.complianceonline.com/regulatory-compliance-for-dietary-supplements-in-the-us-eu-and-canada-seminar-training-80100SEM-prdsm?channel=Brownwalker","content":"A growing public demand for supplements has resulted in a flurry of companies creating and marketing dietary supplements in the United States, EU and Canada. With the regulatory authorities beginning to take a stronger stance on enforcement of regulatory policies, procedures and GMP compliance, it is important for companies to verify that their products comply with the latest regulations and provisions if they plan to market Supplements in these countries. This 2-day interactive virtual seminar will review the regulations that impact Dietary Supplements in the US, EU and Canada and discuss how to verify that products are compliant with these regulations. Differences with food and drug regulation in these countries will be noted as well. We will also cover what qualifies as a dietary supplement or dietary ingredient, how to ensure GMP compliance as well as detailed requirements for labeling and acceptable marketing claims. An update on current events within the Supplement industry and the potential impacts to Manufacturers and Distributors in the US, EU and Canada will also be presented and discussed. Who will Benefit Executives/Managers within Dietary Supplement or Natural Product companies Regulatory Compliance Professionals in the Supplements or Natural Products area Quality Assurance or Quality Control Professionals Dietary Supplement or Natural Product Manufacturers & Distributors Sales/Marketing Personnel in the Supplement or Natural Product Industries","date_start":"2021-08-26","date_end":"2021-08-27","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}