{"name":"Plant Diversity: sociocultural dimensions and interdisciplinary projections","series":"","short":"","website":"http://iefem.bas.bg/en/call-for-papers-plant-diversity-sociocultural-dimensions-and-interdisciplinary-projections.html","content":"Dear colleagues, ladies and gentlemen, We have the pleasure to invite you to take part in the international scientific conference “Plant Diversity: sociocultural dimensions and interdisciplinary projections”. It focuses on the dynamic human-plant interrelations and impacts, the role of plants in the formation and maintenance of the existential basis, social relations, cultural values and symbols, and vice versa the role of man, their cultural and economic orientations and transformation practices in the plant world. The idea for this conference grew out of the research work of a team from the Institute of Ethnology and Folklore Studies with Ethnographic Museum and the Institute of Biodiversity and Ecosystem Research at the Bulgarian Academy of Sciences, which carries out the project “The Garden: Site of Biocultural Diversity and Interdisciplinary Junction”, funded by the National Science Fund (Project DN10/1/2016). The garden is the place where, the social and cultural contexts of plant biological features and biocultural plant-human interactions are demonstrated in a particularly distinctive way. With this conference continues the series of discussions with the overall topic “Plant Diversity Towards Society” that started in 2015 with the involvement of researchers from the humanities, biological, agricultural, social and economic sciences to expand knowledge and perspectives in the study, conservation and use of plant genetic resources and traditional knowledge related to their cultivation. Our goal is to contribute to the development of a society that is sensitive to today’s environmental and social challenges. The conference topics aim to demonstrate and further develop the knowledge on human-plant interactions and how they can serve as a specific background for sustainable local development in accordance with the present ecological and sociocultural reality. IMPORTANT DEADLINES: Submission of paper/poster proposals with abstracts: 30 April, 2019 Communication of acceptance decisions: 31 May, 2019 Registration: TBA Submission of manuscripts: 30 December, 2019","date_start":"2019-11-21","date_end":"2019-11-22","important_dates":{"abstract":"","full":"2019-03-30","notification":"","final":""},"topics":["Social Sciences","Anthropology / Archaeology","Plant science, biology and genetics"],"location":{"virtual":"","full":["Sofia","Bulgaria"],"name":"","street":"","city":"Sofia","state":"","ZIP":"","country":"Bulgaria"},"organizers":["Institute of Ethnology and Folklore Studies with Ethnographic Museum, Bulgarian Academy of Sciences"],"societies":[],"indexes":[],"emails":[]}