{"name":"International Conference on Myths, Archetypes and Symbols: “Models and Alternatives”","series":"","short":"","website":"http://myths.lcir.co.uk","content":"Humankind has always sought to explain its origins and the mysteries of life to map personal and collective boundaries, and to secure its sense of identity through the power of everyday events and occurrences. Exemplary accounts of imaginary happenings and supernatural creatures from a time beyond history and memory explain the genesis of the universe, the making of a living thing, the formation of an attitude or the inception of an institution. The essence of these traditional narratives reflects a certain system of values and code of self-conduct of a group of individuals bound together by social and cultural ties, and the cardinal virtues and vices of human nature captured in a conventional configuration. Even though the time and place of performance and reception generate numerous variants and a multitude of interpretations, myths encode a universal sensibility and specificity, and propose generic yet unique models of humanity. They reveal a culture’s deepest understanding of its own beginnings, awareness of purpose and destiny, its position in the world, and meaning of existence and experience. A particular culture creates particular characters to embody its spirit and significant traits of personality, and particular images to convey its most representative attributes and attitudes. The two days’ conference aims to explore the mode of organisation, the fundamental patterns and the paradigms of human memory that lie at the root of quintessential stories, tales and beings. It will also focus on the constants and variables of some particular components and their relationship with other fields of study, such as anthropology, arts, cultural history, literature, literary criticism, philosophy, psychology, pedagogy, sociology, theology, etc. The main objective of the event is to bring together all those interested in examining the intersections between their professions and/or interests and some distinct local, regional, national, or global aspects related to myths and mythology, archetypal characters, situations and symbols, providing an integrative approach to their perception and relevance in the 21st century. Topics include but are not limited to several core issues: from The Age of Fable to The Golden Bough and beyond the functions and cultural impact of myths, archetypes and symbols the locality and universality of myths, archetypes and symbols monotheism, polytheism, pantheism gods, demigods and heroes myth, ritual and the sacred holy books and early writings myth-revision from antiquity to the 21st century mythology and language mythology and science mythology and religion mythology and visual arts mythology and music mass-media and myth creation mythography and mythopesis euhemerism – history and imagination patterns, prototypes, stereotypes ethos and eidos Jungian archetypes archetypal characters in literature and film archetypal symbolism archetypal psychology archetypal pedagogy symbols – context and meaning major themes, motifs and symbols the meaning and symbolism of colours the meaning and symbolism of numbers signs, emblems and icons semiotics and symbolism Paper proposals up to 250 words and a brief biographical note should be sent by 30 April 2019 to: myths@lcir.co.uk. Please download paper proposal form: http://myths.lcir.co.uk/ Standard registration fee – 160 GBP Student registration fee – 140 GBP","date_start":"2019-09-28","date_end":"2019-09-29","important_dates":{"abstract":"","full":"2019-04-30","notification":"","final":""},"topics":["Arts & Humanities","History","interdisciplinary"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["myths@lcir.co.uk"]}