{"name":"My Science Message 2019","series":"","short":"","website":"https://www.marcharh.com/my-science-message","content":"My Science Message (MSM) gathers multidisciplinary scientist(s), scholars, editors, writers, advocates, and any scientific affiliations or associations with R&D and scientific educational activities for a: 1\\. collaborative scientific knowledge and research development activity from institutions to society in general. 2\\. solving the issue of peace development, not only for the sustainable planet directions and increasing pragmatic technology innovation at the stages of application and final use of technology to environmental conditions and communities. Tackling climate change issue for instance, is a multidisciplinary dialogue space, under the theme of \"peaceful development for current needs of communities and using best resources efficiently\". 3\\. My Science Message 2019 is an annual initiative, giving a rare opportunity to scholars and all generations of science advocates, to generate discussion and more insightful empirical evidence-based research to how creating a sustainable planet with peace for the quality of life on earth and planet based on the experiences from different academic perspectives, industry results, and exchange of policy decisions. Authors contribution is a recognized gathered expert submission both by the MICS and close collaboration with top-tier scientific experts, and policymakers in various projects and activities of environment, energy, climate change policy, sustainability education, and many types of activities encouraging sustainable management of education and science development. Key issues in the MSM CALLS WILL FOCUS ON (but ARE NOT LIMITED to): Planet resources - technology (energy, renewables, etc.), bioresources (e.g. biomass, waste), fossil fuels (including natural gas), geothermal, hydropower, nuclear, marine, etc. Urban Environment - architecture, buildings, transport, supply chain management, integrated nexus assessment of industries. Utilization of Technologies and Science - conversion technologies, nanotechnology, robotics, systems engineering, technical scaling of expensive R&D, mitigation technologies (e.g. carbon capture and storage CCS, solar radiation management, aerospace management, satellite tracking, etc.) Techno-socio-economic impacts - health, industry, policy, political, regulatory, social (e.g. access, education, equality, equity) Sustainability, Society and Policy - reviews and critiques on United Nations Sustainability Development Goals (SDGs), energy efficiency initiatives, science pedagogy, curriculum development, investments, sustainable business models, etc. A special submission issue of Scopus-indexed proceedings in the main theme of Sustainable Development and Multidisciplinary Research, will be prepared based on extended and reviewed papers which have been successfully presented at the MSM Events. All accepted submissions would be published in the MSM Open-Science Digital Library, and Extended into Special Issue Chapter to be indexed by Scopus. MSM 2019 is organized by Initiative Centre for Sustainable Solutions on behalf of Marcharh Organization of the recommendation by the Energy Council and United Nations Development Programme for Sustainable Development. Contact the MSM secretariat at lead@marcharh.com Visit: https://www.marcharh.com/my-science-message/ For 2019 monthly submission dates.","date_start":"2019-10-04","date_end":"2019-11-11","important_dates":{"abstract":"","full":"2019-10-03","notification":"","final":""},"topics":["Life Sciences","Ecology","Sustainable Development and Engineering"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["Marcharh Organization"],"societies":[],"indexes":[],"emails":["lead@marcharh.com"]}