{"name":"2022 Int'l Symposium on Nuclear Science and Applications","series":"","short":"SNSA 2022","website":"http://www.wsaugust.org/conference/SNSA2022","content":"2022 Int'l Symposium on Nuclear Science and Applications (SNSA 2022) Conference Date: August 13-15, 2022 Conference Venue: Xiamen, China Website: http://www.wsaugust.org/conference/SNSA2022 Online Registration System: https://www.wsaugust.org/RegistrationSubmission/default.aspx?ConferenceID=1499 Email: wsaugust@126.com 2022 Int'l Symposium on Nuclear Science and Applications (SNSA 2022) will be held from August 13-15, 2022 in Xiamen, China. This Conference will cover issues on Nuclear Science and Applications. It dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal，please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: wsaugust@126.com (Editor.RolinZhang@gmail.com) Tel: +86 18627814037 QQ: 1349406763 Wechat: 3025797047 Official Account: Academic Communications Attendance Methods 1.Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Adaptive material and structureNuclear Chemistry Nuclear and Particle Physics Reactor Physics and Transport Theory Reactor Engineering Fast Reactors Advanced/Next Generation Reactors Alternative Reactor Technologies Nuclear Fuels and Materials Fuel Cycle and Isotopes Nuclear and Chemical Waste Disposal/Management Decommissioning Nuclear Radiation Detection and Protection Radiation Shielding / Radiation Applications Thermal-hydraulics / Neutronics Computational Fluid Dynamics (CFD) Fusion Engineering Nuclear Energy / Atomic Energy Innovative Design of Nuclear Power Plant Plant Systems, Structures and Components Plant Operations, Maintenance and Management Nuclear Instrumentation and Control Accelerators, Spectrometers, Detectors and Others Nuclear Magnetic Resonance Spectroscopy Pulse Power Techniques and Applications Nuclear Safety and Security Standardization, Licensing and Regulations Nuclear Education, Public Acceptance and Attitudes Energy Economics and Policy Nuclear Medicine and Biology Other Related Topics","date_start":"2022-08-13","date_end":"2022-08-15","important_dates":{"abstract":"","full":"2022-07-13","notification":"","final":""},"topics":["Physical Science & Math","Physics","Nuclear Science"],"location":{"virtual":"","full":["Xiamen","China"],"name":"","street":"","city":"Xiamen","state":"","ZIP":"","country":"China"},"organizers":["Academic Communications"],"societies":[],"indexes":[],"emails":["wsaugust@126.com","editor.rolinzhang@gmail.com"]}