{"name":"(Re)thinking Socialism. Knowledge, memory and oblivion of the socialist past","series":"","short":"","website":"http://iefem.bas.bg/en/call-for-papers-rethinking-socialism-knowledge-memory-and-oblivion-of-the-socialist-past.html","content":"Thirty years after the end of state socialism, the need to fully comprehend it is still an immediate task. Over the past three decades, the dominant public discourse of the previous historical period has undergone significant changes: from a firm rejection in the first years of the transition to the latest wave of rehabilitation of the regime and nostalgia (socialist nostalgia, Ostalgie, Yugo/Tito-nostalgia). To varying degrees, post-socialist societies in Central, Eastern and Southeastern Europe are still divided in their attitudes to the recent past. Thirty years after the fall of the Iron Curtain, the politics and culture of the memory of socialism continue to be a field of tension and controversy among politicians and among various social groups. The difficulty in understanding and dealing with this legacy is due not only to the (in)actions of political elites or the larger public. Socialism is part of the biographical experience of the people who lived it, and they share their truth about it, based on their undeniable status of witnesses. This experience is diverse, ambiguous and controversial, and so are the memories of it. For the next generations, socialism is “a foreign country”, it is a narrative about someone else’s past, family history, it is an image taken from a movie or a read book, it is post-memory. The academic discourse on socialism/communism, just like the everyday one and the political one, is also highly fragmented. The goal of the international interdisciplinary conference is to discuss various aspects of socialism/communism and its impact on the present. The emphasis is on (re)thinking - it is our aim to thematize the state of research on socialism, to illuminate new fields and to add new details to the knowledge of the period. We are looking forward to proposals for papers that address issues related to the following (suggested) themes: theoretical approaches and methodological challenges in the research of socialism/communism; the socialist lifestyle in the transnational perspective and in the particular national socio-cultural context of the countries of Central, Eastern and Southeastern Europe; empirical studies and case studies on everyday culture during socialism: material culture, labour, leisure, festivity, public and private life, strategies for coping with socialist everyday life, gender regimes; policies of memory and oblivion. We invite researchers working in the fields of social and cultural anthropology, social history, European ethnology, sociology and political sciences. An edited volume of selected conference papers is to be published. Please send us a 350-word abstract along with your paper title and description, as well as a 150-word biography. Conference languages: Bulgarian, German and English. Deadline for submission of proposals: 15 March 2019 Deadline for confirmation of accepted proposals: 30 March 2019 Contact: Yana Yancheva, socialism@abv.bg The conference is free of charge. The cost of accommodation in Sofia will be covered depending on the funding received. Organizing Committee: Assoc. Prof. Dr. Ana Luleva, Ethnology of Socialism and Postsocialism Deprt., IEFSEM, BAS Assoc. Prof. Ivanka Petrova, Ethnology of Socialism and Postsocialism Dept., IEFSEM, BAS Assoc. Prof. Petar Petrov, Ethnology of Socialism and Postsocialism Dept., IEFSEM, BAS SAP Dr. Svetla Kazalarska, Ethnology of Socialism and Postsocialism Dept., IEFSEM, BAS SAP Dr. Yana Yancheva, Ethnology of Socialism and Postsocialism Dept., IEFSEM, BAS Покана","date_start":"2019-11-07","date_end":"2019-11-09","important_dates":{"abstract":"","full":"2019-03-15","notification":"","final":""},"topics":["Social Sciences","Sociology","anthropology"],"location":{"virtual":"","full":["Sofia","Bulgaria"],"name":"","street":"","city":"Sofia","state":"","ZIP":"","country":"Bulgaria"},"organizers":["Institute of Ethnology and Folklore Studies with Ethnographic Museum, Bulgarian Academy of Sciences"],"societies":[],"indexes":[],"emails":["socialism@abv.bg"]}