{"name":"Empowering Women in Organic Chemistry Europe","series":"","short":"EWOC","website":"https://go.evvnt.com/616340-0?pid=4868","content":"Recent data and publications show a persistent lack of women pursuing and maintaining careers in Organic Chemistry. Evidence indicates that providing an opportunity for women to meet, network, and share scientific and career strategies is one effective approach to encourage women to enter and maintain careers in science. A team of US scientists had a vision of an annual meeting of women (students, post-docs, faculty, and professionals) who work or plan to work in the field of Organic Chemistry broadly defined, from all types of institutions (academic, industry, biotech, non-profit and government). A meeting was developed to consist of both science and career topics to provide support and guidance for the next generation of women chemists, as well as provide opportunities for professionals to learn up-to-date science, network, and share experiences. Their goals were to (1) establish a peer group network for collaborating and recruiting; (2) afford a novel mechanism to provide advice and counsel for women organic chemists; (3) provide guidance to graduate students and post-docs making career decisions; and (4) provide community support to enhance retention of women in chemistry. This first meeting was EWOC 2019, held on Friday, June 28, 2019, at the University of Pennsylvania. The event was a huge success with 175 attendees from all over the USA. This our first European Sister event EWOC EU 2020 aims to adopt a similar strategy to support women and institutions supporting female organic chemists within Europe. EWOC is dedicated to equity, justice, diversity, and inclusion. We strive to provide a harassment-free experience for everyone. All communication should be professional; hate speech will not be tolerated. URL: Brochure: https://go.evvnt.com/616340-2?pid=4868 Prices: General Admission: GBP 75.0, Academic Fee: GBP 20.0 Speakers: Dr Malin Lemurell, Dr Monica H. Perez-Temprano, Dr Sarah Skerratt, Professor Veronique Gouverneur, Dr Katherine Wheelhouse, Dr David Ennis Venue Details: AstraZeneca, Charter Way, Macclesfield, SK10 2NA, United Kingdom Time: 9:00 am to 5:00 pm","date_start":"2020-06-11","date_end":"","important_dates":{"abstract":"","full":"2020-04-10","notification":"","final":""},"topics":["Medicine & Health","Medical-Speciality"],"location":{"virtual":"","full":["Macclesfield","United Kingdom"],"name":"","street":"","city":"Macclesfield","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Scientific Update Ltd"],"societies":[],"indexes":[],"emails":[]}