{"name":"The Street and the City – Encounters","series":"","short":"","website":"https://thestreetandthecitylx3.wordpress.com","content":"\\-EXTENDED DEADLINE- The Street and the City – Encounters is the third in a series of multidisciplinary conferences devoted to the study of cities and the ways of living that have evolved in them over time. Although English Studies play a central role in this conference series, both from cultural and geographical points of view, all contributions related to the topic will be considered, in line with the previous conferences: The Street and the City – Awakenings and The Street and The City – Thresholds generated strong interest among researchers from a wide range of disciplines such as literature and cinema, tourism, architecture and sociology. This third conference aims to continue to explore the theme of the street and the city in all its plurality, taking into account its different dynamics. Throughout the ages, cities have been discursive spaces in which cultural experiences and dialogues unfold, uniting diverse people in their public spaces. Their arteries, the streets, the squares where they converge embrace both individuals and groups that experience the current mobility, whether they are there, for instance, through the touristic impulses of exploration or novelty, or because their occupation or business lead them there, or to help others who are trapped or threatened by the perils and privations of the city. Between idle wanderings and diaspora, consequence of the ultimate lottery of reigning antagonisms, the city receives and reinvents itself with its citizens, both permanent and temporary. Vortices of multicultural encounters and confrontations, cities are equally physical structures, the fruits of evolving projects and technologies or even art objects. Hence, the dynamics and the challenges of urban areas continue to generate questions among researchers regarding, for instance, aspects of identity representation, aesthetical and political expressions, as well as how the city is created, interpreted and appreciated. Therefore, studies of such complex urban dynamics have become extremely diverse, fostering a range of perspectives regarding the spaces in which we move and with which we identify. This conference keeps its primary goal of fostering the interdisciplinary debate within the field of English Studies, acting as a productive space for disseminating the most recent academic research concerning Cultural Studies, Urban Studies and Tourism, as well as other fields of interest related to cities, their spaces and cultures. In addition to encouraging dialogue between different scientific perspectives, the Organising Committee wishes to promote informal networking gatherings among its participants. We welcome proposals for papers on topics and themes of interest related to the Street and/or the City that include, but are not restricted to, the following: 1\\. Architectural encounters in the street and the city 2\\. Fashion encounters in the street and the city 3\\. Filmic encounters in the street and the city 4\\. Literary encounters in the street and the city 5\\. Political encounters in the street and the city 6\\. Technological encounters in the street and the city 7\\. Touristic encounters in the street and the city 8\\. Visual encounters in the street and the city We welcome proposals for papers, pre-organised panels, and roundtables (20 minutes per speaker) by 4th February 2019, to be submitted on the conference webpage: https://thestreetandthecitylx3.wordpress.com/","date_start":"2019-04-11","date_end":"2019-04-12","important_dates":{"abstract":"","full":"2019-02-04","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","Film & Cinema"],"location":{"virtual":"","full":["Lisbon","Portugal"],"name":"","street":"","city":"Lisbon","state":"","ZIP":"","country":"Portugal"},"organizers":["University of Lisbon Centre for English Studies (ULICES)"],"societies":[],"indexes":[],"emails":[]}