{"name":"“Narrating Lives”: International Conference on Storytelling, (Auto)Biography and (Auto)Ethnography","series":"","short":"","website":"https://life-history.lcir.co.uk","content":"\\*Selected papers will be published in a post-conference volume with ISBN. Life-history approach occupies the central place in conducting and producing (auto)biographical and (auto)ethnographic studies through the understanding of self, other, and culture. We construct and develop conceptions and practices by engaging with memory through narrative, in order to negotiate ambivalences and uncertainties of the world and to represent (often traumatic) experiences. The “Narrating Lives” conference will focus on reading and interpreting (auto)biographical texts and methods across the humanities, social sciences, and visual and performing arts. It will analyse theoretical and practical approaches to life writing and the components of (auto)biographical acts, including memory, experience, identity, embodiment, space, and agency. We will attempt to identify key concerns and considerations that led to the development of the methods and to outline the purposes and ethics of (auto)biographical and (auto)ethnographic research. We aim to explore a variety of techniques for gathering data on the self-from diaries to interviews to social media and to promote understanding of multicultural others, qualitative inquiry, and narrative writing. Conference panels will be related, but not limited, to: Life Narrative in Historical Perspective Qualitative Research Methods Oral History, Memory and Written Tradition Journalism and Literary Studies Creative Writing and Performing Arts (Auto)Biographical Element in Film Studies, Media and Communication Psychoanalysis and Psychotherapy Storytelling in Education Ethics and Politics of Research Submissions may be proposed in various formats, including: Individually submitted papers (organised into panels by the committee) Panels (3-4 individual papers) Posters Proposals up to 250 words accompanied by a brief biographical note should be sent to: life-history@lcir.co.uk. To download the paper proposal form and find out more about the latest deadline, please visit our website: https://life-history.lcir.co.uk/.","date_start":"2022-08-27","date_end":"2022-08-28","important_dates":{"abstract":"","full":"2022-04-30","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","Oral History"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["life-history@lcir.co.uk"]}