{"name":"2020 Spring International Conference on Textile Science and Engineering (CTSE-S 2020)","series":"","short":"","website":"http://www.scetconf.org/conference/SCET2020/CTSE.htm","content":"2020 Spring International Conference on Textile Science and Engineering (CTSE-S) Conference Date: August 14-16, 2020 Conference Venue: Kunming, China Website: http://www.scetconf.org/conference/SCET2020/ Online Registration System: http://www.SCETconf.org/RegistrationSubmission/default.aspx?ConferenceID=1219 Email: scet\\_service@163.com The 9th Spring World Congress on Engineering and Technology (SCET 2020) to be held on August 14-16, 2020 in Kunming, China, is composed of 3 Symposiums on the frontier topics in the engineering and technological subjects. It dedicates to facilitating the global development of engineering and technology and exploring ways in which the latest research results can be shared. Symposiums: 2020 Spring International Conference on Material Sciences and Technology (MST-S) 2020 Spring International Conference on Textile Science and Engineering (CTSE-S) 2020 Spring International Conference on Mineral Processing and Metallurgical Engineering (MPME-S) Invited Speakers Prof. Bingang Xu, Institute of Textile and Clothing, Hong Kong Polytechnic University, Hong Kong (China) Prof. Sergei Alexandrov, Beihang University, China Prof. Lee D. Wilson, University of Saskatchewan, Canada Prof. Horacio COLINA, ATILH (French Technical Association of the Cement and Hydraulic Lime Industries), France Prof. Marko Vilotic, University of Novi Sad (Serbia), Serbia Prof. King-Chuen Lin, National Taiwan University, China Prof. Hualin Jiang, Nanchang Hangkong University, China Prof. Chunjuan Cui, School of Metallurgical engineering, Xi'an University of Architecture and Technology, China Prof. Jae-Ho Jeon, Korea Institute of Materials Science, Changwon, Republic of Korea Prof. Kung-Chung Hsu, Department of Chemistry, National Taiwan Normal University, China Prof. Md Ahsan Habib, University of Dhaka, Bangladesh Prof. Lugovskoy Alex, Ariel University, Israel Prof. Sabu Thomas, Mahatma Gandhi University, India Prof. Masaji Watanabe, Okayama University, Japan; Andalas University, Indonesia Prof. Henrikas CESIULIS, VU (Vilnius University)/EPT (JSC Elektronikos Perdirbimo Technologijos), Lithuania Dr. Natalia TINTARU (TSYNTSARU), VU (Vilnius University), Lithuania / Institute of Applied Physics, Moldova Prof. Jui-Ming Yeh, Chung Yuan Christian University (CYCU), China Prof. G. H. Jain, K.K.H.A. Arts, S.M.G.L. Commerce and S.P.H.J. Science College, India Prof. Alokesh Pramanik, School of Civil and Mechanical Engineering at Curtin University, Australia If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation All the accepted papers of CTSE-S in English will be published by a peer-reviewed open access journal that can ensure the widest dissemination of your published work. You will get the hardcopy of the journal on the conference. For more information, please contact us (scet\\_service@163.com). Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: scet\\_service@163.com Tel: +86 151 7233 0844 QQ: 741494290 Wechat: 3025797047 Attendance Methods 1.Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by a peer-reviewed open access journal that can ensure the widest dissemination of your published work. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Acrylic and elastomeric fibers Apparel and Handicrafts Basic (cationic) and direct dyes Bleaching Chemical constitution and color Clothing science and technology Color, color specification and color matching Cotton, flax, viscose and cellulose acetates Determination of mixture of fibres Disperse and mordant dyes Dyes, acid and azoic dyes Fabric preparation Fabric technology Fashion and textile product design Fiber polymers and fiber properties Fiber science and smart textile Fibers, dyes and color chemistry Garment industry and merchandise Nano Textiles Narrative textile Art and Craft Natural dyes and dyeing Nonwoven Nylon and polyester fibers Optical properties of textile fibers Reactive, sulfur and vat dyes Spinning, weaving and knitting Technical Textiles Textile Chemistry and Finishing Textile Dyeing and Printing Textile fibres Textile materials and processing Textiles industry The cellulosic fibers The protein fibers The synthetic fibers Wool and silk","date_start":"2020-08-14","date_end":"2020-08-16","important_dates":{"abstract":"","full":"2020-07-14","notification":"","final":""},"topics":["Engineering & Technology","Material/Nanotechnology"],"location":{"virtual":"","full":["Kunming","China"],"name":"","street":"","city":"Kunming","state":"","ZIP":"","country":"China"},"organizers":["Engineering Information Institute"],"societies":[],"indexes":[],"emails":["_service@163.com"]}