{"name":"2nd International Hellenic Conference on Political Sciences: Communicating in Politics?","series":"","short":"HEPO2020","website":"https://coming.gr/hepo2020-call-for-papers","content":"2nd International Hellenic Conference on Political Sciences: Communicating in Politics? (HEPO2020), 3-7 May 2020, in Athens, Greece https://coming.gr/hepo2020-call-for-papers/ You are invited to submit your proposal (abstract/ poster/workshop/ round table) to be considered for presentation at the 2nd International Hellenic Conference on Political Sciences: Communicating in Politics? (HEPO2020) that will take place 3-7 May 2020, in Athens, Greece, organized by the Communication Institute of Greece. After the organization of seven (7) successful Annual International Conferences (look at https://coming.gr/previous-conferences/), the 2nd International conference on political science: Communicating in Politics? , provides an opportunity for Academics, Professionals and Industry Experts from Politics, with cross-disciplinary interests, to discuss the future directives and innovations in their discipline. The thematology of this conference, includes, but not limits to ‘Politics and Mass Media’, ‘Political Rhetoric’, ‘Political Psychology’, ‘Political Socialization’, ‘Methods in Political Psychology’ and ‘Political Communication’. We invite papers that \"address the interface between communication and politics, examine the use of (social) media, visuals, and rhetoric in political campaigns and the presentation, performance and personality of leaders. Cordially welcome are also investigations into communication and political socialization, public opinion formation and political participation. Additionally, we hope to see papers that address the interactions between the (social) media and intermediary organisations such as interest groups and political parties. Last but not least, we welcome scholars with an interest in political marketing and PR processes in government and the role the (social) media play in local and informal forms of governance.\" This year presenters can either propose a paper presentation, or a poster, participate at a round table discussion, propose a workshop, etc. Please find here all the different formats and templates for this conference. For paper presentations, please submit your abstract by email to registration@coming.gr , in .doc file using the proposed template. Decisions are reached within 2 weeks after the abstract submission. Deadline to register and to submit full papers will be specified in your acceptance letter. Submissions deadline for ALL formats proposals: Tuesday 18 February 2020 Conference Leaders \\*Dr Margarita Kefalaki, President COMinG & Professor, Hellenic Open University \\*Dr Christian Schnee, Lecturer in Politics, IES – Institute for the International Education of Students, United Kingdom \\*Dr Christ\\`l De Landtsheer, Professor, director of Political Communication Research Unit, University of Antwerp, Belgium \\*Dr Helen Shestopal, Professor, Chair of Psychology and Sociology of Politics, Lomonosov Moscow State University Special arrangements are made with a local hotel for a limited number of rooms at a special conference rate. In addition, a number of special events are organized: Greek symposium with traditional food, and dance, a social dinner, a special Athens educational tour, a one-day educational island tour, a Mycenae and Poros visit, and a day trip to Delphi. Details of the social program are available here. Please take a look at the conference Provisional Conference Program (https://coming.gr/provisional-conference-program/) Publication Possibilities All accepted papers will be published in the conference proceedings online with ISBN (abstract book of the conference proceedings). Selected papers, after the peer review process, will have the possibility to be published in one of the following journals: \\*Journal of Education, Innovation and Communication (JEICOM) \\*Journal of Applied Learning & Teaching (JALT) \\*Cambridge Scholars \\*Strategy and Development Review \\*Journal of Media Critiques \\[JMC\\] For more information, please take a look at the Call for Papers, Posters, Workshops, and Round Tables you have the possibility to present at HEPO2020: https://coming.gr/hepo2020-call-for-papers/ or/and contact us at info@coming.gr The Communication Institute of Greece (COMinG) was established in 2003 in France. In Greece, since 2013, it is an independent academic association that has for mission to become a forum, where academics, researchers, professionals, and friends – from all over the world – can meet in Greece to exchange ideas on their research and to discuss future developments in their disciplines.","date_start":"2020-05-03","date_end":"2020-05-07","important_dates":{"abstract":"","full":"2020-03-17","notification":"","final":""},"topics":["Social Sciences","Political-Science","Public policy and administration"],"location":{"virtual":"","full":["Athens","Greece"],"name":"","street":"","city":"Athens","state":"","ZIP":"","country":"Greece"},"organizers":["Communication Institute of Greece"],"societies":[],"indexes":[],"emails":["registration@coming.gr","info@coming.gr"]}