{"name":"CONNECTIONS: EXPLORING HERITAGE, ARCHITECTURE, CITIES, ART, MEDIA","series":"","short":"","website":"https://architecturemps.com/canterbury-conference","content":"The conference examines how technology and medias influence and link art, art history and architecture and connect them with industries such as media, film and communications. Based on this interdisciplinary approach, the conference welcomes educators and professionals in: Architecture, Urban design, History, Archaeology, Heritage, Art, Design, Technology, Communications, Media, Film, Cultural studies. -- Call: Today the digital is ubiquitous across all disciplines connected with life in cities: urban history, architecture, planning, art, design, media, communications, and more. Examples abound. As the Western world comes to deeper understandings of its heritage in the 21st Century, technology is ever more present in our reading of the past. Data mapping is standard in conservation and social history. Archaeologists use digital tools in geophysics, laser scanning, and compositional analysis. Landscape and architectural visualizations populate museums across the world. In architecture, computational design uses algorithms to replicate biology. Coding produces self-generated architectural form. Information modeling presents planners with interactive design in real time. The city is seen as ‘smart’. In film and animation, digital models create fictitious places on scales unimagined. Installation artists make space interactive through digitising motion, sound and heat. Projection mapping allows artists to reinterpret the past in-situ. Photographers use digital cameras to document city stories. Marketing, technology and communication mediates the city experience 24/7\\. In every field, educators are responding. As the tools we use today merge and blur across disciplines, this conferences asks educators and professionals to consider the following. How can we best manage, direct and utilize the unique potentialities of this interdisciplinary and technological moment? Are we rethinking objects of art and design from the past and future? Are we reconsidering modes of communication, styles of teaching and ways of living? Are we seeing new links between designed objects, visualized spaces and cultural meanings? Are we understanding creative, documentary and media practices in new ways? Are we developing our own knowledge through the technologies, tools or thinking of other disciplines?","date_start":"2020-06-29","date_end":"2020-06-30","important_dates":{"abstract":"","full":"2020-04-10","notification":"","final":""},"topics":["Social Sciences","Other","Urban Studies, Planning & Design"],"location":{"virtual":"","full":["Canterbury","United Kingdom"],"name":"","street":"","city":"Canterbury","state":"","ZIP":"","country":"United Kingdom"},"organizers":["University of Kent / AMPS"],"societies":[],"indexes":[],"emails":[]}