{"name":"The 7th Int'l Conference on Physical Chemistry","series":"","short":"CPC 2021","website":"https://www.scet-meeting.org/conference/CPC2021","content":"Important NOTE: Due to COVID-19 epidemic situation all over the world, most countries still maintain a strict policy of no-gathering, no-entering and leaving the country, and 14-days quarantine. We have to postpone the conference till April 23-25, 2021 in Xi'an, China. The 7th Int'l Conference on Physical Chemistry (CPC 2021) Conference Date: April 23-25, 2021 Conference Venue: Xi'an, China Website: http://www.scet-meeting.org/conference/CPC2021/ Online Registration System: http://www.scet-meeting.org/RegistrationSubmission/default.aspx?ConferenceID=1341 Email: paper\\_service@163.com The 7th Int'l Conference on Physical Chemistry (CPC 2021) will be held from April 23-25, 2021 in Xi'an, China. This Conference will cover issues on Physical Chemistry. The aim for researchers, engineers, academicians as well as industrial professionals from all over the world to present their latest research results and advanced research methods. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal，please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: paper\\_service@163.com Tel: +86 15527426990 QQ: 3025797047 WeChat: 3025797047 Attendance Methods 1.Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Spectroscopy Molecular Structure Physical Chemistry of Plasma Kinetics Catalysis Nonlinear Dynamics Electrochemistry Biophysical Chemistry Photochemistry Radiation Chemistry Radiochemistry Nuclear Chemistry Material Science Solid State Physical Chemistry Macromolecular Physical Chemistry Environmental Protection Forensic Sciences Pharmaceutical Physical Chemistry Phase Boundaries Complex Compounds General Physical Chemistry Geophysical Chemistry Education History Free Topic","date_start":"2021-04-23","date_end":"2021-04-25","important_dates":{"abstract":"","full":"2021-03-23","notification":"","final":""},"topics":["Physical Science & Math","Chemistry","Physical Chemistry"],"location":{"virtual":"","full":["Xi'an","China"],"name":"","street":"","city":"Xi'an","state":"","ZIP":"","country":"China"},"organizers":["Academic Communications"],"societies":[],"indexes":[],"emails":["_service@163.com"]}