{"name":"International Conference on Oral History","series":"","short":"","website":"https://oralhistory.lcir.co.uk","content":"For decades, oral history was considered less than scholarly, leading to its exclusion from several history books; thus valuable first-hand experiences and information that could alter historical truth were neglected and ultimately lost to oblivion. Our conference wishes to challenge the pervading view that oral testimony can lead to false representation of historical events and underline the significant support it can provide to historical research, especially in lieu of written documentation. The journey of a memory through time may change, transform or even become distorted from its primary form. Oral testimony requires a multilevel examination and verification so it can be considered legitimate and useful as historical information, but despite these difficulties, oral tradition can have the power to present an entirely new perspective on an event, future generations can then interpret it freely. The conference will focus on the connections between oral history, collective memory, and individual memory. Whether from a historical, social, or even psychological perspective, we wish to engage scholars in a multidimensional and interdisciplinary approach in order to deeply explore all aspects of this valuable and fascinating area. We are committed to creating a welcoming space for discussion, collaboration, and exploration of oral history’s potential as a tool for local, national and international projects that would enrich and even revise chapters of history. Conference presentations will be related, but not limited, to: Oral history throughout history Oral historian: a public historian? Oral history as a form of social and communal activity; Promoting oral history and engaging public awareness Conducting oral history research; advantages and disadvantages; limitations and ways to overcome them Archiving oral testimony; examples and presentation of valuable archives Methodologies, techniques and methods in conducting and writing oral history Theories of oral history Re-examining and re-writing history through the lens of oral history; Oral history in the global historical arena The absence of historical facts and the role of testimonies Epistemological and ethical dilemmas in oral history Use and abuse of oral history on the Internet Oral history and the law Cases in which oral testimony changed historical truth Oral history as a form of therapy Collective memory and oral tradition The role of individual memory in oral history Oral history as a revealing or misleading tool Manipulation of memory and the role of oral history Oral history and trauma Oral history in war Oral history in the hands of social scientists Oral history as a tool of revealing/reliving a dictatorship/suppressing regime Altering, exaggerating or forgetting memories; the psychology of a survivor Can individual and collective memory be manipulated in order to present a particular side of an incident? Iconic cases of oral history Why is the oral history project needed? Goals, steps and priorities Oral history in teaching and teaching oral history The conference will bring together scholars from different fields including history, philosophy, religion, sociology, international relations, literature, art, space studies, peace studies, cultural studies, minority studies, war and/or genocide studies, journalism, immigration studies, psychology and psychiatry, political and social studies, and those working in archives, museums and NGOs. We are particularly interested in inviting those with first-hand experiences, amateur archivists and memory collectors to participate in our newly established session “Share your memories and change history.” Submissions may propose various formats, including: \\*Individually submitted papers (organised into panels by the committee) \\* Panels (3-4 individual papers) \\* Roundtable discussions (led by one of the presenters) \\* Posters Paper proposals up to 250 words and a brief biographical note should be sent by 15 October 2019 to: oralhistory@lcir.co.uk.","date_start":"2020-02-08","date_end":"2020-02-09","important_dates":{"abstract":"","full":"2019-10-15","notification":"","final":""},"topics":["Arts & Humanities","History"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["oralhistory@lcir.co.uk"]}