{"name":"5th International Conference on Future of English Teaching","series":"","short":"","website":"https://www.icfte.com/english-teacher-conference","content":"You’re going to be at ICFTE 2022, right? Seems like everyone is! English teacher conference will be an ideal platform for delegates to exchange their ideas and experiences with communities of experts in the field of teaching English. This year’s English teaching conference will address all areas of teaching English in one conference. During the three-day program, you’ll gain insights into new trends and modern approaches in teaching English, emerging technologies, pedagogical methods of teaching English, new trends in research, and global implications of English education. Issues on the concept of English education will be tackled in specialized sessions of English teachers conferences. The Organizing Committee will offer the participants a city tour free of charge, so learn about Rotterdam city. All accepted papers will be published with ISBN Number in a soft form & all full papers sent for conference proceedings will be accepted through a double-blind review process and will be published electronically in proceedings with a DOI number. All papers have publication opportunities in various indexed international journals: SCOPUS, DOAJ, EBSCO, GOOGLE SCHOLAR, COPERNICUS, and many more. The 5th International Conference on Future of English Teaching will return as an in-person event in Rotterdam this February & also include the live-stream Virtual component for those who cannot join physically but wish to learn, connect, and network. Delegates can attend & present their papers either in person or online from wherever they are in the world. An Invitation Letter will be issued and sent after registration and payment of the registration fee.","date_start":"2022-02-25","date_end":"2022-02-27","important_dates":{"abstract":"","full":"2022-02-11","notification":"","final":""},"topics":["Education / Legal / Other","Education","Pedagogy"],"location":{"virtual":"","full":["Rotterdam","Netherlands"],"name":"","street":"","city":"Rotterdam","state":"","ZIP":"","country":"Netherlands"},"organizers":["Global knowledge sharing (GlobalKS)"],"societies":[],"indexes":[],"emails":[]}