{"name":"Quantum Technology International Conference 2020","series":"","short":"","website":"https://premc.org/conferences/qtech-quantum-technology","content":"Quantum Technology International Conference 2020 The growing ability to manipulate quantum systems is paving the way for a second quantum revolution and a number of initiatives worldwide have been formed to foster quantum technologies. These exciting novel applications are exploiting specific quantum properties which are not accessible with classical resources such as superposition and entanglement of individual quantum systems. The objectives of the QTech conference is to present the latest developments of quantum technologies in the domains of quantum communication, computation, simulation, sensors and metrology, and their implementation using various platforms from atoms and ions to solid states, superconducting circuits and optics. TOPICS Quantum information processing and computing Quantum simulation Quantum sensors and quantum metrology Quantum communication Quantum networks and repeaters Fundamental science for quantum technologies Quantum optics and non-classical light sources Quantum light-matter interfaces and memories Solid states and hybrid systems Quantum non-linear optics Chairman : Prof. Dr. Hugues de Riedmatten, ICFO, Barcelona Confirmed speakers Dr. Andrei Faraon Prof. Julien Laurat Prof. Tracy Northup Prof Christine Silberhorn Prof. Jörg Wrachtrup Deadlines Early bird submission - November 6th, 2019 Early bird registration - December 6th, 2019 Regular Submission - January 21th, 2020 Regular Registration - February 21th, 2020 Conference - April 6-8, 2020 Venue Pompeu Fabra University – Balmes building Carrer de Balmes 132, Barcelona https://premc.org/conferences/qtech-quantum-technology/ +331.46.60.89.40 qtech2020@premc.org @QTech\\_Quantum","date_start":"2020-04-06","date_end":"2020-04-08","important_dates":{"abstract":"","full":"2020-01-21","notification":"","final":""},"topics":["Life Sciences","Biotechnology/ Bioinformatics"],"location":{"virtual":"","full":["Barcelona","Spain"],"name":"","street":"","city":"Barcelona","state":"","ZIP":"","country":"Spain"},"organizers":[""],"societies":[],"indexes":[],"emails":["qtech2020@premc.org"]}