{"name":"The Future of Education International Conference – Hybrid Edition","series":"","short":"","website":"https://conference.pixel-online.net/FOE","content":"The 12th Edition of the Conference, on 30 June – 1 July 2022, brings together teachers, researchers, practitioners and project managers from all over the world to share findings, expertise and experience about innovative teaching and learning methodologies, through online presentations. Two days of inspiring sessions in the framework of a highly interactive onsite and online conference experience will be delivered. Enhanced digital contents will give participants greater access to learning, sharing and networking. All accepted papers will be presented on-site and on-line. Interactive Questions and Answers sessions will follow each paper presentation. Poster Presentation Sessions will also be held, on-site and on-line. Networking Opportunities will be organized. Important Dates: 7 April 2022: Extended deadline for submitting abstracts 20 April 2022: Notification of acceptance / rejection of abstracts 6 May 2022: Deadline for final submission of papers 30 June – 1 July 2022: Conference days All accepted papers will be included in the Conference Proceedings published by Filodiritto Editore with ISBN, ISSN and DOI codes. The publication will be sent to be reviewed for inclusion in the Conference Proceedings Citation Index by ISI-Clarivate- Web of Science. The publication will also be included in Academia and indexed in Google Scholar. Contact: foe@pixel-online.net Official website: http://conference.pixel-online.net/FOE/callforpapers.php","date_start":"2022-06-30","date_end":"2022-07-01","important_dates":{"abstract":"","full":"2022-04-07","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","Italy"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Italy"},"organizers":["Pixel"],"societies":[],"indexes":[],"emails":["foe@pixel-online.net"]}