{"name":"The (SCOPUS/ISI) SOAS GLOCAL Conference on Asian Linguistic Anthropology 2022","series":"","short":"","website":"https://cala2021.upd.edu.ph ","content":"GENERAL INFORMATION • The SOAS GLOCAL CALA 2022 (SCOPUS / ISI indexed) is the annual GLOCAL conference and set of workshops and lectures on the Linguistic Anthropology, The Sociolinguistics, and the Language and Society, of Asia. UNIVESITY COLLABORATORS • SOAS (University of London), University College London, Ohio State University, University of Hawai’i at Manoa, Stockholm University, University of Kansas, California State University, Aichi University, University of East Anglia, Temple University, National Chengchi University, Beijing Normal University, University of Illinois, Hong Kong Polytechnic University, University of Indonesia, University of Putra Malaysia, Hankook University of Foreign Studies, Vietnam National University, Adelaide University. • And over 150 other global universities. PUBLISHER COLLABORATORS • Elsevier, Taylor and Francis, Sage, Wiley, John Benjamins, Cambridge University, Oxford University. LOCATION • University of The Philippines Diliman, Diliman, The Philippines. DATES • November 2-5, 2022\\. SESSIONS • General Papers. • Colloquia (including 10 national Philippine Universities presenting individual Colloquia). • Posters. • Workshops / lectures on research and publishing methodology, and on ethnography, by globally prominent academics (including ELAR SOAS) and publishing companies. • Special Panels. • Keynotes: Jack Sidwell (University of Toronto) and other globally prominent scholars in Linguistic Anthropology and Language and Society. DISPLAYS • Publishing companies (Taylor and Francis, Elsevier, Sage, John Benjamins, Wiley). • Universities (20 displays). • The Endangered Alphabets Atlas. • Local and International Ethnographical Associations. • The Endangered Languages Archive (ELAR), University of London. PERFORMANCES • Anthropological and Cultural Performances from Philippines performance companies. ANHROPOLOGICAL EXCURSIONS • Anthropological one day options to sites significant in Philippine language and society . ABSTRACT SUBMISSIONS • The SOAS GLOCALCALA 2022 abstract submission /Second call for abstracts opens on October 23, 2021 and closes on January 23, 2022.The Notification of Acceptance will be no later than October 20, 2021\\. Submit at the following link, with all information. https://cala2021.upd.edu.ph/submit. THEME • Symbol and New Society: The SOAS GLOCAL CALA 2022 invites work on the linguistic symbols of Asian and global Asian society, in a new era. Submissions should acknowledge and describe the transfer of language and communication in this new era. Papers should discuss the ways in which communication takes on both evolutionary and revolutionary form, following recent significant changes in Asian society, and in Asia’s new and revised interrelatedness across global scopes. SCIENTIFIC COMMITTEE • For full Scientific Committee, see: https://cala2021.upd.edu.ph/sc-committee/ PUBLICATIONS • Conference proceedings (ISI / AHCI indexed) • Several special Top Tier (Scopus/ISI /ACHI /SSCI) journal issues and monographs are planned with well ranked publications and publishers only, from papers submitted to The (SCOPUS / ISI) SOAS GLOCAL CALA 202 that meet review requirements. Ample assistance is provided to revise papers. CONTACT Head of Communications: Ms. Nhan Huynh Email: glocal@soas.ac.uk LINKS Website: https://cala2021.upd.edu.ph Submission link: https://cala2021.upd.edu.ph/submit Academia: https://soas.academia.edu/GLOCALSOAS LinkedIn: https://www.linkedin.com/company/SOAS-glocal-UNIT Facebook: https://www.facebook.com/GLOCALSOAS/ GLOCAL website: http://glocal.soas.ac.uk/ GLOCAL App: https://glocal.soas.ac.uk/the-glocal-app/","date_start":"2022-11-02","date_end":"2022-11-05","important_dates":{"abstract":"","full":"2022-01-23","notification":"","final":""},"topics":["Social Sciences","Linguistics","linguistics"],"location":{"virtual":"","full":["Quezon City","Philippines"],"name":"","street":"","city":"Quezon City","state":"","ZIP":"","country":"Philippines"},"organizers":["SOAS University of London"],"societies":[],"indexes":[],"emails":["glocal@soas.ac.uk"]}