{"name":"Leadership: The Art of Knowing How to Say It and Engage It","series":"","short":"","website":"https://bit.ly/3l2Zqll","content":"Today's 24/7, \"always-on\" world often cycles between \"do more with less\" downsizing and ever faster upgrading and can even appear to be spinning out of control. How do you harness the problem-solving support, resiliency and creativity in your work team? Are you ready to cultivate communication and conflict resolution skills that affirm your integrity and also set appropriate boundaries while being collaborative and compassionate? Learn key psychological skills for managing the uncertainty of change and strengthening your capacity for constructive risk-taking. Why Should You Attend All levels of organizational personnel who are involved in teams, as well as all leaders and employees who aspire to leadership. This webinar is for expanding the philosophy of \"winning\" teams from, \"There is no 'I' in team? to \"Winning teams blend Individual Creativity and Interactive Community generating Intimate Collaboration.\" Areas Covered in the Session » Discover Thomas-Kilmann Conflict Styles Inventory and keys to \"Active Listening/Questioning\" » Understand group process dynamics and collaboration to facilitate emotional intelligence and productive problem-solving » Evolve a safe atmosphere for \"helmet's off' communication/facilitation » Enable formal and informal leadership to emerge during free-flowing facilitation » Identify responsible agents group structures for follow-up of targeted issues » Harness conflict and mutual frustration into stress-reducing, creative collaboration and camaraderie- and morale-building interaction Who Will Benefit » CEO » COO » HR Professionals » People Manager » Leaders » Directors » Managers » Supervisors » Business Owners » Business Consultants » Department Managers » Staff at all Levels » All personnel levels, but especially leaders and those who aspire to be engaging – motivating and empathic – high-impact communicators; formal and informal leaders who want to maximize the creative potential. To Register (or) for more details please click on this below link: [https://bit.ly/3l2Zqll Email: support@concordeducations.com Tel: +1-989-341-8773](https://bit.ly/3l2Zqll)","date_start":"2022-01-26","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Human-Resources","Business Management & Leadership"],"location":{"virtual":"","full":["New Castle","United States"],"name":"","street":"","city":"New Castle","state":"","ZIP":"","country":"United States"},"organizers":["ConcordEducations"],"societies":[],"indexes":[],"emails":["support@concordeducations.com"]}