{"name":"HUMANITARIAN ACTION AND GLOCALISM","series":"","short":"","website":"https://glocalismjournal.org/cfp-2022-2-humanitarian-action-and-glocalism","content":"GLOCALISM JOURNAL OF CULTURE, POLITICS AND INNOVATION ISSN 2283-7949 CALL FOR PAPERS “Glocalism”, a peer-reviewed, open-access and cross-disciplinary journal, is currently accepting manuscripts for publication. We welcome studies in any field, with or without comparative approach, that address both practical effects and theoretical import. All papers should be sent to: davide.cadeddu@unimi.it Articles can be in any language and length chosen by the author (abstract and keywords in English). Deadline: May 30, 2022\\. This issue (2022, 2) is scheduled to appear at end-July 2022\\. Website: https://glocalismjournal.org/ Direction Committee: Arjun Appadurai (New York University); Daniele Archibugi Birkbeck, University of London); Seyla Benhabib (Yale University); Sabino Cassese (Scuola Normale Superiore); Manuel Castells (Universitat Oberta de Catalunya); Fred Dallmayr (University of Notre Dame); Anthony Giddens (London School of Economics and Political Science); Sheila Jasanoff (Harvard University); Hans Köchler (University of Innsbruck); Alberto Martinelli (Università degli Studi di Milano); Anthony McGrew (La Trobe University, Melbourne); Alberto Quadrio Curzio (Università Cattolica del Sacro Cuore); Roland Robertson (University of Pittsburgh and University of Aberdeen); Saskia Sassen (Columbia University); Amartya Sen (Har-vard University); Gayatri Chakravorty Spivak (Columbia University); Alain Touraine (École des Hautes Études en Sciences Sociales). the topic of this issue HUMANITARIAN ACTION AND GLOCALISM edited by João Casqueira Cardoso and Cláudia Toriz Ramos (Universidade Fernando Pessoa) Since the post-war, humanitarian action has been rooted on a set of universally agreed-upon values and international norms. Humanitarian action is also a good example of glocalism, as it is based on the encounter between the above-mentioned universal values within diverse political-cultural contexts. From the reasons leading to humanitarian crises (armed conflicts, natural disasters, health emergencies, or mass migrations, among others) to the responses to those crises (peace and rescue operations, healthcare, and assistance to displaced persons, or the many forms of development aid), the links between local actors and international structures are a constant aspect of humanitarian action. This dialectic between the closest possible contact with local populations and the worldwide scale has drawn growing attention – especially after the 2016 World Humanitarian Summit – with the commitment of international agencies and do-nors to transfer more responsibilities to local responders. Still, it remains to be seen whether the legal and political scopes of humanitarian action are effectively opened to change, and how a true humanitarian glocalism may emerge in the future. For both theorists and aid workers, there is space for questioning the implications of recent developments in humanitarian ac-tion: 1) can the contributions of theories on humanitarianism, human rights, or even sustainable development, help to re-think humanitarian action in the light of glocalism? 2) up to what point can the new field practices in humanitarian action, such as culturally sensitive approaches, bottom-up strategies, and local empowerment policies, play a role in the emergence of new, more glocal forms of humanitarian action? This special issue aims at debating these questions both from theoretical and applied perspectives. Articles on debates and problem-oriented issues, as well as fieldwork cases, will be welcome. A focus on the questions faced by both field workers and academics (such as the training of experts in humanitarian action), in all dimensions and relevant aspects of humanitarian action, may also provide good discussion points.","date_start":"2022-05-30","date_end":"","important_dates":{"abstract":"","full":"2022-05-30","notification":"","final":""},"topics":["Social Sciences","Other","humanitarian aid & peace"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["Glocalism. Journal of Culture, Politics and Innovation"],"societies":[],"indexes":[],"emails":["davide.cadeddu@unimi.it"]}