{"name":"International Conference on Narratives of Temporality: Continuities, Discontinuities, Ruptures","series":"","short":"","website":"http://spatiality.temporality.lcir.co.uk","content":"This conference will provide a deeper look into the dynamic and complex relation between construction, codes, language, expression, on one side and the crisis of representations, traumas, discontinuities and tensions in discourses, on the other. This will be conducted according to three research areas: The anachronism Narratives and discourse The temporality of trauma and subjectivity The aim of this conference is to develop a multidisciplinary reflection on the complex relationship between narrative and temporality. The central topics concern the multiple and articulated ways in which narrative practices and forms of temporality dynamically interact, by developing a multifaceted space of concepts, theories, practices and knowledge, in a dynamics of cross-disciplinary thinking. The conference will expand on strategies and constructions, forms and practices concerning time, temporality, periodizations and chronologies, trauma and memory narratives, and research on subjectivity. These topics are strongly connected with the work of narrative, and are critically evaluated in a range of textual productions from novels to short stories, from audiovisual narratives to linguistic constructions of different natures. The act and practices of telling stories, of creating narrative structures, of elaborating narrative practices, and the ruptures of narratives, will be approached. We can think of the following questions in relation to the topic: how has time been represented, coded, understood by humans? In which ways is temporality a dimension of our experience as human subjects? How do human beings apply meaning to temporality? How is trauma experience related to such temporal/subjective narratives? Proposals are welcome, but not limited to, the following research topics: Narrative studies Textuality Studies on time and temporality The anachronism: theories and methodologies Memory studies Trauma studies (in literature, cinema, other forms of expression) Representation: telling and staging of traumas, bereavements, critical moments in temporal development Audiovisual studies (cinema, video, television) concerning experience and subjectivity Psychoanalysis and time, psychoanalysis and trauma Proposals up to 250 words should be sent by 25 March 2020 to: spatiality.temporality@lcir.co.uk. Registration fee – 120 GBP Provisional conference venue: Robinson College, Grange Road, Cambridge CB3 9AN","date_start":"2020-07-25","date_end":"","important_dates":{"abstract":"","full":"2020-03-25","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature"],"location":{"virtual":"","full":["Cambridge","United Kingdom"],"name":"","street":"","city":"Cambridge","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["spatiality.temporality@lcir.co.uk"]}