{"name":"7th International Conference on Sport Sciences Research and Technology Support - icSPORTS 2019","series":"","short":"","website":"http://www.icsports.org/ ","content":"Most human activities, including sports, are becoming more and more technological. Engineering in general and Information Technology in particular are important in the support for many activities directly or indirectly related to sport sciences, including improvement of physical activities, sports medicine, biotechnology and nutrition, sports management, and all other application areas in sports. This conference intends to be a meeting point for both academics, sport professionals and practitioners to exchange ideas and develop synergies. Authors are encouraged to highlight the benefits of technology for sports either in general or in a particular application. Ideas regarding sports related issues using technology will arise from this conference. Papers describing case studies, advanced prototypes, systems, tools and techniques indicating future directions in sports technology are particularly of interest. Papers should describe original work in any of the areas listed below. Accepted complete papers, presented at the conference, will be published in the Proceedings of icSPORTS, with ISBN, both on paper and digitally. All presented papers will be indexed and included in the SCITEPRESS digital library for increased visibility. Acceptance will be based on quality, relevance and originality. Both full research reports and work-in-progress reports are welcome. Presentation format can be chosen between oral and poster sessions. \n Conference Topics: \n Area 1: Computer Systems in Sports \n \\- Augmented Reality, Exergames and Virtual Sports \n \\- Computer Supported Training and Biofeedback \n \\- Multimedia and Information Technology \n \\- Simulation and Mathematical Modeling \n \\- Sports Statistics and Analyses \n \\- Neural Networks and Big Data Analysis in Sports \n Area 2: Health and Support Technology \n \\- Applied Physiology and Exercise \n \\- Health and Fitness \n \\- Technological Support in Sport Medicine \n Area 3: Signal Processing in Human Movement \n \\- Sport Biomechanics \n \\- Biosignals and Biodevices Engineering \n \\- Variability and Signal Analysis in Human Movement Studies \n Area 4: Sport Performance and Support Technology \n \\- Coaching \n \\- Training and Testing \n \\- New Developments in Sports Performance Hardware ","date_start":"2019-09-20","date_end":"2019-09-21","important_dates":{"abstract":"","full":"2019-07-12","notification":"","final":""},"topics":["Education / Legal / Other","Sport/Leisure"],"location":{"virtual":"","full":["Vienna","Austria"],"name":"","street":"","city":"Vienna","state":"","ZIP":"","country":"Austria"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":[]}