{"name":"Conference on Mediterranean and European Linguistic Anthropology 2020","series":"","short":"","website":"https://comela2020.acg.edu ","content":"THE COMELA 2020 - THE CONFERENCE ON MEDITERRANEAN AND EUROPEAN LINGUISTIC ANTHROPOLOGY 2020 GENERAL INFORMATION - The COMELA 2020 (SCOPUS / ISI indexed) is the annual conference/workshops and lectures on the Linguistic Anthropology, The Sociolinguistics, and the Language and Society, of Europe and The Mediterranean. COLLABORATORS - SOAS (University of London), University College London, University of Bologna, Università Cattolica del Sacro Cuore, Temple University, University College Dublin, University of Groningen, University of Bucharest, Polytechnic University of Valencia, Stockholm University, the University of Hawai’i at Manoa - and over 120 other global universities LOCATION - American University in Greece, Athens, Greece. DATES - September 2-5,2020 SESSIONS - General Papers - Colloquia (including 10 national Greek Universities presenting individual Colloquia) - Posters - Workshops/lectures on research and publishing methodology, and on ethnography, by globally prominent academics (including ELAR SOAS) and publishing companies - Special Panel – Anthropological Association of Greece - Special Panel – Ethnographic Society of Greece - Keynotes: Jan Blommaert (Tilburg University), Alexandra Georgakopoulou (Kings College London), Dimitris Dalakoglou (Vrije University) DISPLAYS - Publishing companies - Universities - Endangered Alphabets Atlas - Local and International Ethnographical Association PERFORMANCES - Demonstration by the Anthropological Whistle community from Evia, Greece. - Cultural performance by the globally renowned Likeion Ellinithon Dance troupe. ANTHROPOLOGICAL EXCURSIONS - Meteora Monastery, Greece - Diminitsa Anthropological Village, Greece ABSTRACT SUBMISSIONS - The COMELA 2020 abstract submission deadline has been extended to June 1, 2020, due to the COVID-19 issue (notification within 2 weeks). Submit at the following link, with all information. https://comela2020.acg.edu THEME - Bounded Languages ... Unbounded: The COMELA 2020 invites work on the shifting boundedness of Language Communities of The Mediterranean and Europe. Submissions should acknowledge and describe processes of language shape, change, and ideology, pertinent to social, cultural, and political histories and futures, of the Mediterranean and European regions, or work by those working in Mediterranean and European regions. SCIENTIFIC COMMITTEE For full Scientific Committee, see: https://comela2020.acg.edu/sc-committee/ PUBLICATIONS - Conference proceedings (ISI / AHCI indexed) - Several special Top Tier (Scopus/ISI /ACHI /SSCI) journal issues and monographs are planned with well-ranked publications and publishers only, from papers submitted to The COMELA 2020 that meet review requirements. Ample assistance is provided to revise papers. COVID-19 The COMELA 2020 believes that by September, the COVID-19 issues will be well behind us, but will maintain very strict sanitary regulations throughout the conference, CONTACT Ms. Anastasia Tsantes SOAS, University of London cala@soas.ac.uk LINKS Website: https://comela2020.acg.edu Submission link: https://comela2020.acg.edu/submit Academia: https://acg.academia.edu/COMELA LinkedIn: https://www.linkedin.com/company/the-comela Facebook: https://facebook.com/thecomela","date_start":"2020-09-02","date_end":"2020-09-05","important_dates":{"abstract":"","full":"2020-06-01","notification":"","final":""},"topics":["Social Sciences","Anthropology / Archaeology","anthropology"],"location":{"virtual":"","full":["Athens","Greece"],"name":"","street":"","city":"Athens","state":"","ZIP":"","country":"Greece"},"organizers":["American University of Greece"],"societies":[],"indexes":[],"emails":["cala@soas.ac.uk"]}