{"name":"12th International Conference on Agents and Artificial Intelligence - ICAART 2020","series":"","short":"","website":"http://www.icaart.org","content":"The purpose of the International Conference on Agents and Artificial Intelligence is to bring together researchers, engineers and practitioners interested in the theory and applications in the areas of Agents and Artificial Intelligence. Two simultaneous related tracks will be held, covering both applications and current research work. One track focuses on Agents, Multi-Agent Systems and Software Platforms, Distributed Problem Solving and Distributed AI in general. The other track focuses mainly on Artificial Intelligence, Knowledge Representation, Planning, Learning, Scheduling, Perception Reactive AI Systems, and Evolutionary Computing and other topics related to Intelligent Systems and Computational Intelligence. \n \n A substantial amount of research work is ongoing in these knowledge areas, in an attempt to discover appropriate theories and paradigms to use in real-world applications. Much of this important work is therefore theoretical in nature. However there is nothing as practical as a good theory, as Boltzman said many years ago, and some theories have indeed made their way into practice. Informatics applications are pervasive in many areas of Artificial Intelligence and Distributed AI, including Agents and Multi-Agent Systems; This conference intends to emphasize this connection, therefore, authors are invited to highlight the benefits of Information Technology (IT) in these areas. Ideas on how to solve problems using agents and artificial intelligence, both in R&D and industrial applications, are welcome. Papers describing advanced prototypes, systems, tools and techniques and general survey papers indicating future directions are also encouraged. Papers describing original work are invited in any of the areas listed below. Accepted papers, presented at the conference by one of the authors, will be published in the Proceedings of ICAART with an ISBN. Acceptance will be based on quality, relevance and originality. Both full research reports and work-in-progress reports are welcome. There will be both oral and poster sessions. \n Special sessions, dedicated to case-studies and commercial presentations, as well as tutorials dedicated to technical/scientific topics are also envisaged: companies interested in presenting their products/methodologies or researchers interested in holding a tutorial are invited to contact the conference secretariat. Additional information can be found at http://www.icaart.org/. \n \n Conference Topics: \n Area 1: Agents \n \\- Agent Communication Languages \n \\- Cooperation and Coordination \n \\- Distributed Problem Solving \n \\- Economic Agent Models \n \\- Emotional Intelligence \n \\- Group Decision Making \n \\- Intelligent Auctions and Markets \n \\- Mobile Agents \n \\- Multi-Agent Systems \n \\- Negotiation and Interaction Protocols \n \\- Nep News Detection \n \\- Agent Models and Architectures \n \\- Physical Agents at Work \n \\- Privacy, Safety and Security \n \\- Programming Environments and Languages \n \\- Robot and Multi-Robot Systems \n \\- Self Organizing Systems \n \\- Semantic Web \n \\- Simulation \n \\- Swarm Intelligence \n \\- Task Planning and Execution \n \\- Transparency and Ethical Issues \n \\- Agent Oriented Software Engineering \n \\- Web Intelligence \n \\- Agent Platforms and Interoperability \n \\- Autonomous Systems \n \\- Cloud Computing and Its Impact \n \\- Cognitive Robotics \n \\- Collective Intelligence \n \\- Conversational Agents \n \n Area 2: Artificial Intelligence \n \\- AI and Creativity \n \\- Deep Learning \n \\- Evolutionary Computing \n \\- Fuzzy Systems \n \\- Hybrid Intelligent Systems \n \\- Industrial Applications of AI \n \\- Intelligence and Cybersecurity \n \\- Intelligent User Interfaces \n \\- Knowledge Representation and Reasoning \n \\- Knowledge-Based System \n \\- Ambient Intelligence \n \\- Machine Learning \n \\- Model-Based Reasoning \n \\- Natural Language Processing \n \\- Neural Networks \n \\- Ontologies \n \\- Planning and Scheduling \n \\- Social Network Analysis \n \\- Soft Computing \n \\- State Space Search \n \\- Bayesian Networks \n \\- Uncertainty in AI \n \\- Vision and Perception \n \\- Visualization \n \\- Big Data \n \\- Case-Based Reasoning \n \\- Cognitive Systems \n \\- Constraint Satisfaction \n \\- Data Mining \n \\- Data Science ","date_start":"2020-02-22","date_end":"2020-02-24","important_dates":{"abstract":"","full":"2019-10-04","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Valletta","Malta"],"name":"","street":"","city":"Valletta","state":"","ZIP":"","country":"Malta"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":[]}