{"name":"7 Keys to The Motivating Staff","series":"","short":"","website":"https://bit.ly/3nYz0ju","content":"Engagement, motivation and job satisfaction are inextricably linked. Understanding the difference between intrinsic and extrinsic motivators is key to being able to create engagement and job satisfaction with your staff. People are more motivating by individual internal factors than external. Learn how to identify the unique motivators for each person. Why Should You Attend Are you Disheartened when you see staff who are just going through the motions - not motivated to do a good job, to provide outstanding customer service, go slightly above and beyond, to get that project finished on time, contribute in meetings, add input to the creative process, problem solve on their own, moving in slow motion ... to name just a few. It can be Frustrating and time consuming trying to figure out how to get them out of this moribund state. If you would like staff that are more motivated, set and achieve goals and self-regulate, understanding the key underpinnings of how motivation occurs is essential. You have staff or know people who seem to be intrinsically motivated – they don’t need anyone to tell them what or when to do something – they have already done it. They are very focused on results and taking effective action. You’ve might even have thought, I would like to be more like that, or have some of my staff or team-mates be more like that. It’s possible – by understanding this one core concept about motivation, you will learn how to approach staff, projects and even life differently while feeling more connected and motivated by your work. Learn the core drivers of motivation. This workshop is for anyone who wants to be able to bring the best out in people, have staff more motivated, a high-performing, people centric environment that motivates and excites. People will take great joy in being in that energy. You'll find yourself more motivated too. This is a how-to webinar - you will come away with not only a new understanding of how motivation works, but also a detailed plan, and set of tools for implementing your new understanding. Areas Covered in the Session » The 3 core elements that create job satisfaction » Why putting energy into things you can't change can backfire » Why intrinsic (internal) motivation trumps extrinsic (external) » The flaws that prevent most motivational concepts from working » What you Can and Can't change in relationship to your staff to motivate » The 2 questions to align intrinsic motivation to the external world Who Will Benefit » Leaders and managers who oversee a team or staff » Those who want to create high-performing, people centric environments » Anyone who wants to have better relationships and retention of staff To Register (or) for more details please click on this below link: https://bit.ly/3nYz0ju Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-02-18","date_end":"","important_dates":{"abstract":"","full":"2021-02-18","notification":"","final":""},"topics":["Business","Management / Leadership"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}