{"name":"The 7th Int'l Conference on Microwave and Terahertz Technology (ICMTT_D 2021)","series":"","short":"","website":"https://www.seminarjan.org/conference/ICMTT_D2021","content":"The 7th Int'l Conference on Microwave and Terahertz Technology (ICMTT\\_D 2021) Conference Date: December 24-26, 2021 Conference Venue: Sanya, China Website: https://www.seminarjan.org/conference/ICMTT\\_D2021/ Online Registration: https://www.seminarjan.org/RegistrationSubmission/default.aspx?ConferenceID=1437 Email Registration: conf\\_contact@163.com The 7th Int'l Conference on Microwave and Terahertz Technology (ICMTT\\_D 2021) will be held in Sanya, China on December 24-26, 2021\\. This conference will cover issues on microwave and terahertz technology. It dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: All the accepted papers will be published by a peer-reviewed open access journal that can ensure the widest dissemination of your published work, for more information, please contact us (conf\\_contact@163.com) Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: conf\\_contact@163.com (editor.rolinzhang@gmail.com) Tel: +86 15527426990 QQ: 1349406763 WeChat: 3025797047 Twitter: conf\\_Committee Attendance Methods 1\\. Submit Full Paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit Abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics: Microwave Field and Techniques Field Analysis and Guided Waves Frequency-Domain EM Analysis Techniques Time-Domain EM Analysis Techniques CAD Algorithms and Techniques Linear Device Modeling Nonlinear Device Modeling Nonlinear Circuit and System Simulation Microwave Passive Components Transmission Line Elements Passive Circuit Elements Planar Passive Filters and Multiplexers Non-planar Passive Filters and Multiplexers Active, Tunable and Integrated Filters Ferroelectric, Ferrite and Acoustic Wave Components MEMS Components and Technologies Microwave Active Components Semiconductor Devices and Monolithic ICs Signal Generation Frequency Conversion and Control HF, VHF and UHF Technologies and Applications Power Amplifier Devices and Circuits High-Power Amplifiers Low Noise Components and Receivers Mm-Wave and THz Components and Technologies Microwave Systems and Applications Microwave Photonics Mixed Mode and Digital Signal Processing Circuits and Systems Packaging, Interconnects, MCMs and Integration Instrumentation and Measurement Techniques Biological Effects and Medical Applications Arrays as Antennas and Power Combiners Radar and Broadband Communication Systems Wireless and Cellular Communication Systems Sensors and Sensor Systems RFID Technologies High Power Microwave Industrial Applications Emerging Technical Areas of Microwave RF Nanotechnology Wireless Power Transmission New Technologies and Applications Innovative Systems Microwave/RF Devices for Wireless Health Care Applications Terahertz Theory and Technology Terahertz Devices: Electronics/Photonics/Plasmonics Terahertz Generation, Propagation, and Interaction Passive Components and Materials Issues in Terahertz Terahertz Imaging Terahertz Sources, Detectors and Receivers Terahertz System Architectures and Distributed Networks Terahertz Diagnostics Terahertz Nanoelectronics Terahertz Spectroscopy Terahertz Systems Advanced Materials and Concepts (E.G., Metamaterials, Memristor) Novel Concepts (E.G., Plasmonic THz, Quantum Cascade Lasers) Terahertz to Optical Metamaterials, Assemblies, and Systems New Frontiers and Recent Breakthroughs in Terahertz Research Novel Applications of Terahertz VLSI Trustworthiness and Inspection – Counterfeit IC Detection Industrial Inspection Security and Military Biomedical Information Processing and Computing Electronics/Information/Communication Systems Integration of Advanced Materials with Conventional Devices and Systems","date_start":"2021-12-24","date_end":"2021-12-26","important_dates":{"abstract":"","full":"2021-12-24","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Sanya","China"],"name":"","street":"","city":"Sanya","state":"","ZIP":"","country":"China"},"organizers":[""],"societies":[],"indexes":[],"emails":["_contact@163.com","editor.rolinzhang@gmail.com"]}