{"name":"Secrets of Batch Process Scale-Up","series":"","short":"","website":"https://go.evvnt.com/577176-3?pid=4868","content":"This popular course, designed for those with limited or no pilot plant or scale-up experience, provides a comprehensive overview of the most common problems experienced during the scale-up of laboratory batch processes, and ways to avoid or mitigate them. The difference between laboratory scale techniques and how the major unit operations are carried out in the pilot plant is a key focus of the course. Thus, along the way attendees will examine the many issues associated with raw material handling, conducting synthetic reactions, reaction workup, product crystallization, isolation and drying at the pilot plant or commercial scale. The course also explores some important engineering concepts such as batch mixing, heat transfer, mass transfer, fluid flow and the influence of these factors on the success of large scale chemical operations. With an awareness of these phenomena, the laboratory researcher will have a better understanding of the types of experiments that should be conducted and the types of data that should be collected to ensure a more successful scale-up. Numerous examples and case histories are presented to reinforce the course material, and class exercises provide an opportunity to put some of the lessons into practice. Heavy emphasis is placed on process safety. URLs: Tickets: https://go.evvnt.com/577176-0?pid=4868 Brochure: https://go.evvnt.com/577176-4?pid=4868 Time: 09:00 to 17:00 Venue details: Metro Meeting Centers-Boston, 101 Federal Street, Boston, Massachusetts, 02110, United States Price: General Admission: USD 2299.00 Speaker: Francis X. McConville","date_start":"2020-05-19","date_end":"2020-05-21","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Public-Health","Healthcare"],"location":{"virtual":"","full":["Boston","United States"],"name":"","street":"","city":"Boston","state":"","ZIP":"","country":"United States"},"organizers":["Scientific Update Ltd"],"societies":[],"indexes":[],"emails":[]}