{"name":"VIII International Scientific Conference «FUTURE TRENDS, ORGANIZATIONAL FORMS AND EFFECTIVENESS OF COOPERATION DEVELOPMENT BETWEEN RUSSIAN AND FOREIGN UNI","series":"","short":"","website":"https://unitech-mo.ru/eng/news/viii-international-scientific-conference-","content":"The University of Technology and Canadian Institute of Technology are happy to invite you to participate in the VIII International Scientific Conference «FUTURE TRENDS, ORGANIZATIONAL FORMS AND EFFECTIVENESS OF COOPERATION DEVELOPMENT BETWEEN RUSSIAN AND FOREIGN UNIVERSITIES» Conference will take place in Korolev, Moscow Region, on April, 9-10, 2020 CONFERENCE TOPICS • Crowdsourcing in science and technology as an element of international cooperation between universities. • Theoretical and practical aspects of integration building in the context of global society digitalization. • Innovation and information technology as a factor of improving education quality. • Impact of higher education system on sustainable development of the region and its place in global economy. • Student section: Youth educational integration aspects in the current context. The conference will be held with the participation of leading specialists of Russia and foreign countries, representatives of state structures, institutions of culture and education. Working language of the conference: Russian, English. The conference provides for live, remote and extramural participation. Live participation involves delivering a report on the topic and further discussions in the UNITECH. Extramural participation involves inclusion of the provided research articles in the conference collection of scientific articles. The conference collection is comprised of three sections: higher education, secondary vocational education and general secondary education. Remote participation is possible if a participant organization has the following equipment and software: • OS: Windows 10, 8.1, 8, 7 (32-bit, 64-bit supported) • CPU: Intel i3 or better; • RAM: 2Gb or more; • Data transmission rate – 10 MB or faster; • Webcam 720p (HD) or better. Without the recommended equipment and software the quality of communication may not be guaranteed. Any form of participation suggests a filled application form I. I. Application form and filling requirements Participant’s application form «Future trends, organizational forms and effectiveness of cooperation development between Russian and foreign universities» Form of participation (live, extramural, remote) Article name Number of pages First/last name (participant) Position Title Establishment (full name of the establishment, no abbreviations) Co-authors Phone E-mail Each article has a separate application with indication of all authors. II. The required documents and article content requirements In order to publish the article in the conference collection of scientific articles, one must send the following materials to the organizing committee: - Application for the article publication; - Article text. The provided materials should be original (the originality is checked by the Antiplagiat © system), clearly and logically presented, relevant and scientifically significant. The borrowed materials should have corresponding references in the text, and should be stated in the bibliographic list. In case the materials do not meet the requirements, they will not be included in the conference collection of scientific articles. The organizing committee reserves the right not to respond to the materials authors correspondence. III. Article composition requirements 1\\. Accepted for publication articles should contain not less than 3 typewritten pages. 2\\. Article Submission Guidelines: size of type 12, font “Times New Roman”, line spacing - single, full justification, break line 1.25 cm, sheet orientation - portrait, margins : left - 30 mm, top and bottom - 20 mm, right - 15 mm. Articles title in capital letters, bold, font Times New Roman, size 12, centered. Line below, after an interval - author's name(s) and initials, semi-bold, font Times New Roman 12\\. Next line: the full name of the organization (no abbreviations), city, country. Abstract (50-70 words), 3-5 keywords. Line below, after an interval – main text Pictures and diagrams should be clear, distinct and plain (black and white or shades of grey). The heads and cells of the table should be plain. Manual hyphenation shouldn’t be used. The accentuation should be in Italic semi- bold, the spacing and underlining are not permitted. References are mandatory elements of the text. They should be executed in the text in square brackets linked to the relevant source. The use of automatic on -page references is not allowed. References should be presented strictly in an alphabetical order. Example: THE NAME OF THE ARTICLE Surname, name, second name The name of organization, city, country Then without the word «Annotation» summary of the article is represented. Keywords: list of 3-5 keywords. IV. Conditions of participation Participation in the conference is free of charge. Digital version of the conference collection of scientific articles will be provided for free. All the travel, accommodation, visa, insurance costs + postage should be covered by the participant. All articles will be checked for eligibility. The organizing committee reserves the right to decline the materials, which are not in compliance with the above mentioned requirements or the theme of the conference. The conference contributions collection is published in the authors’ edition. The organizing committee is not responsible for the article composition and contents. The conference collection of articles has an international ISBN index, UDC and LBC codes. Indexed in RSCI in full availability and included in elibrary.ru base. Conference proceedings are sent to the general libraries of Russia and foreign countries. V. Deadlines and contact information: - submit applications and articles till March, 29, 2020 - the conference contributions collection will be published in June 2020 Conference Coordinators: Ruslan Egorov tel. +7 (495) 543 34 30 ext.2112, mob. + 7 (925) 001 97 15 Zhanna Trubina tel. +7 (495) 543 34 30 ext.2119 Conference proceedings should be sent to e-mail: interconf@ut-mo.ru Time and place of the conference: 42, Gagarina str., Korolev, Moscow Region, Russia. March, 9-10, 2020, audience hall № 406\\. Registration start: 10:30 (MSK) Video transmission start: 11:00 (MSK)","date_start":"2020-04-09","date_end":"2020-04-10","important_dates":{"abstract":"","full":"2020-03-29","notification":"","final":""},"topics":["Education / Legal / Other","Education","higher education"],"location":{"virtual":"","full":["Korolev","Russian Federation"],"name":"","street":"","city":"Korolev","state":"","ZIP":"","country":"Russian Federation"},"organizers":[""],"societies":[],"indexes":[],"emails":["interconf@ut-mo.ru"]}