{"name":"Change Control Best Practices - Avoiding Unintended Consequences of Changes","series":"","short":"","website":"https://www.complianceonline.com/fda-change-control-expectations-best-practices-seminar-training-80244SEM-prdsm?channel=Brownwalker","content":"One of the top 10 FDA 483 and Warning Letter citations is for inadequate change control. Change control receives detailed scrutiny during FDA inspections, and FDA reviews change control documentation to determine that changes did not adversely impact products, processes, equipment, facilities, etc. A single inadequate change may lead to significant negative events, including release of sub-standard product or product recall. A pattern of inadequate changes may require costly and time-consuming system remediation efforts. It is therefore critically important to assure that changes are properly described, justified, assessed for risk, implemented, and documented. Changes must also be prospectively reviewed by appropriate subject matter experts. Furthermore, certain major changes (e.g. manufacturing, specifications) may require regulatory filings and/or prior regulatory approval. This seminar will help all personnel involved in proposing, assessing, and implementing changes to understand and successfully apply Change Control best practices. Key focus will be placed on change proposals, justification / risk assessment and change execution / implementation. The importance of proper planning, critical thinking skills, and co-ordination of all change activities will also be discussed. Techniques for assuring robust Change Control programs in light of COVID-19 restrictions will also be discussed. This is a practical how-to course, designed to provide participants with skills they can immediately apply to change controls within their own organizations. Case studies will allow participants to practice skill sets in cooperation with the instructor. Learning Objectives: Upon completing this course, participants should be able to: Understand the purpose of change control Understand regulatory requirements and FDA expectations for change control Identify what types of changes are /are not subject to change control Properly describe changes Properly justify changes Develop a comprehensive Change Execution Plan Conduct a proper change Risk Assessment Ensure proper execution of changes Ensure proper implementation of changes Develop a complete Change Control documentation package Utilize critical thinking skills throughout the change control process Avoid pitfalls during the change control process Who will Benefit: This course is designed for people tasked with: Authoring change proposals Assessing / approving change proposals Executing / implementing changes The following personnel will benefit from the course: Change proposal authors Reviewers / approvers of change controls Change control system owners Production staff / management Engineering staff / management Validation staff /management QC staff / management Regulatory Affairs staff / management QA staff / management","date_start":"2021-01-28","date_end":"2021-01-29","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}