{"name":"2022 Int'l Conference on Heat Transfer and Thermophysics","series":"","short":"HTT 2022","website":"http://www.wsaugust.org/conference/HTT2022","content":"2022 Int'l Conference on Heat Transfer and Thermophysics (HTT 2022) Conference Date: August 13-15, 2022 Conference Venue: Xiamen, China Website: http://www.wsaugust.org/conference/HTT2022 Online Registration System: https://www.wsaugust.org/RegistrationSubmission/default.aspx?ConferenceID=1501 Email: wsaugust@126.com 2022 Int'l Conference on Heat Transfer and Thermophysics (HTT 2022) will be held from August 13-15, 2022 in Xiamen, China. This Conference will cover issues on Heat Transfer and Thermophysics. It dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal，please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: wsaugust@126.com (Editor.RolinZhang@gmail.com) Tel: +86 18627814037 QQ: 1349406763 Wechat: 3025797047 Official Account: Academic Communications Attendance Methods 1.Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Adaptive material and structureAblation Aerothermodynamics and Aerothermal Design Aircraft Thermal Systems and Components Code Verification and Validation Techniques Computational Aspects of Nonequilibrium and Reacting Flows Computational Heat Transfer and Thermophysics Conduction, Convection, Radiation, or Combined Heat Transfer Cryogenics and Cryogenic Systems Direct Simulation Monte Carlo Methods Electronic and Microelectronic Avionics Cooling Energy Conversion in Micro-systems Heat Pipes and Loop Heat Pipes Heat Transfer and Cooling in Turbomachinery High-speed Flows Historical Perspectives in Thermophysics Research Hypersonic and Rarefied Flow Experiments Laser-Material Interactions MEMS and Microfluidics Microgravity Effects on High-power Two-phase Thermal Management Systems Molecular Dynamics Simulations Multiphase Fluid Flow and Heat Transfer Nano- and Micro-scale Heat Transfer Nonequilibrium Radiation Nonintrusive Diagnostics and Evaluation Plumes and Combustion Radiative Property Measurement and Simulation Rarefied Flow Computations Second Law and Exergy Methods Spacecraft Contamination Space Environmental Effects Surface Catalysis Test Facilities and Instrumentation for Aerospace Thermal Engineering Thermal Contact Conductance Thermal Control and Management in Aircraft/Space Systems Thermal Engineering in Microgravity Conditions Thermoelectric Cooling and Generation Thermophysical Properties Turbulent Flow and Heat Transfer Hydro- and Gas-dynamics Heat and Mass Transfer Means and Methods of Aero- and Thermophysical Experiment Physics of Low-Temperature Plasm","date_start":"2022-08-13","date_end":"2022-08-15","important_dates":{"abstract":"","full":"2022-07-13","notification":"","final":""},"topics":["Physical Science & Math","Physics","heat transfer"],"location":{"virtual":"","full":["Xiamen","China"],"name":"","street":"","city":"Xiamen","state":"","ZIP":"","country":"China"},"organizers":["Academic Communications"],"societies":[],"indexes":[],"emails":["wsaugust@126.com","editor.rolinzhang@gmail.com"]}