{"name":"Risk-Based Approach to CSV, 21 CFR Part 11 and FDA Compliance","series":"","short":"","website":"https://www.complianceonline.com/risk-based-approach-csv-cfr-and-fda-compliance-webinar-training-706348-prdw?channel=Brownwalker","content":"FDA’s recent focus on data integrity during computer system validation inspections and audits has brought this issue to the forefront of importance for compliance of systems used in regulated industries. These include all systems that “touch” product, meaning they are used to create, collect, analyze, manage, transfer and report data regulated by FDA. All structured data, including databases, and unstructured data, including documents, spreadsheets, presentations, images, audio and video files, amongst others, must be managed and maintained with integrity throughout their entire life cycle. It is a risk-based approach that leads to the best results and compliance with FDA’s expectations. Why Should You Attend: This webinar will help you understand in detail Computer System Validation (CSV) and how to apply the System Development Life Cycle (SDLC) Methodology when validating computer systems subject to FDA regulations. This is critical in order to develop the appropriate validation strategy and achieve the thoroughness required to prove that a system does what it purports to do, and a key element is a thorough risk assessment. It also ensures that a system is maintained in a validated state throughout its entire life cycle, from conception through retirement, making it critical to continue assessing risk as changes are made. We will discuss the phases within the SDLC, and how these form the basis for any CSV project. The importance of the sequence of steps will also be covered. Computer system validation has been regulated by FDA for more than 30 years, as it relates to systems used in the manufacturing, testing and distribution of a product in the pharmaceutical, biotechnology, medical device or other FDA-regulated industries. The FDA requirements ensure thorough planning, implementation, integration, testing and management of computer systems used to collect, analyze and/or report data. Areas Covered in the Webinar: Learn how to identify “GxP” Systems Discuss the Computer System Validation (CSV) approach based on FDA requirements Learn about the System Development Life Cycle (SDLC) approach to validation Discuss the best practices for documenting computer system validation efforts, including requirements, design, development, testing and operational maintenance procedures Understand how to maintain a system in a validated state through the system’s entire life cycle Learn how to assure the integrity of data that supports GxP work Discuss the importance of “GxP” documentation that complies with FDA requirements Learn about the policies and procedures needed to support your validation process and ongoing maintenance of your systems in a validated state Understand the key components of 21 CFR Part 11 compliance for electronic records and signatures Who Will Benefit: This webinar is intended for those involved in planning, execution and support of computer system validation activities, working in the FDA-regulated industries, including pharmaceutical, medical device, biologics, tobacco and tobacco-related products (e-liquids, e-cigarettes, pouch tobacco, cigars, etc.). Functions that are applicable include research and development, manufacturing, Quality Control, distribution, clinical testing and management, sample labeling, adverse events management and post-marketing surveillance. Examples of who will benefit from this webinar include: Information Technology Analysts Information Technology Developers and Testers QC/QA Managers and Analysts Analytical Chemists Compliance and Audit Managers Laboratory Managers Automation Analysts Manufacturing Specialists and Managers Supply Chain Specialists and Managers Regulatory Affairs Specialists Regulatory Submissions Specialists Risk Management Professionals","date_start":"2022-04-19","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}