{"name":"Biostatistics for the Non-Statistician","series":"","short":"","website":"https://www.complianceonline.com/biostatistics-non-statistician-seminar-training-80644SEM-prdsm?channel=Brownwalker","content":"This seminar is a thorough review of the basics for those who need a refresher on statistical theory and types of statistical analyses. It gives you the information and skills necessary to understand statistical concepts and findings as it applies to clinical research, and to confidently convey the information to others. Why Should You Attend: The use of statistics in clinical trials insures a valid and robust study which minimizes bias in assessing the efficacy of new drug treatment or medical devices. Participants in this 6-hour virtual seminar will learn the fundamentals of statistical theory, and how statistical concepts are applied in analysis and reporting of clinical research findings. The objective of the seminar is to provide information that can be used immediately by personnel involved in analysis of clinical trial data. Emphasis will be placed on the actual statistical (a) concepts, (b) application, and (c) interpretation, and not on mathematical formulas or actual data analysis. A basic understanding of statistics is desired, but not necessary. This seminar also provides a thorough review of the basics for those who need a refresher on statistical theory and types of statistical analyses Learning objectives: Statistics is a useful decision-making tool in the clinical research arena. When working in a field where a p-value can determine the next steps on development of a drug or procedure, it is imperative that decision makers understand the theory and application of statistics. Many statistical software’s are now available to professionals. However, these software’s were developed for statisticians and can often be daunting to non-statisticians. How do you know if you are pressing the right key, let alone performing the best test? This seminar provides a non-mathematical introduction to biostatistics and is designed for non-statisticians. And it will benefit professionals. who must understand and work with study design and interpretation of findings in a clinical or biotechnology setting? The focus of the seminar is to give you the information and skills necessary to understand statistical concepts and findings as applies to clinical research, and to confidently convey the information to others. Therefore, a basic/fundamental to intermediate understanding of statistics is all that is needed to understand and apply the information presented in this seminar. Who will Benefit: Investigators Physicians Clinical Investigators Clinical Research Statisticians Clinical Research Coordinators Clinical Research Nurse Coordinators Clinical Research Associates/Assistants Clinical Project Managers/Leaders Study Managers Regulatory Professionals who use statistical concepts/terminology in reporting Medical Writers and others who need to interpret statistical reports.","date_start":"2021-12-01","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Medical-Speciality"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}