{"name":"The City and Complexity – Life, Design and Commerce in the Built Environment","series":"","short":"","website":"https://architecturemps.com/london-2020","content":"The City and Complexity conference examines the city as a complex and, sometimes contradictory, issue. Not simply a question of built form and planned infrastructure it is also a site of public health concerns, social engagement, business development, cultural identity and both environmental problems and solutions. On that basis it seeks contributions from various disciplines Urban Design | Architecture | Sustainability | Engineering | Housing | Public Health | Sociology | Economics | Business | Governance | Art and Culture | History. Publishers: Routledge Taylor&Francis / UCL Press. - CALL: Today, ideas like the ‘business cluster’ are well established tenets of geographical economics. Research agencies prioritise place based approaches to economic growth as a matter of course. Architects such as Rem Koolhaas and Patrik Schumacher embrace the chaos of the Neoliberal city. Others such as Teddy Cruz emphasise housing, community activism and social responsibility. Engineers offer technical solutions to environmental design while the Rockefeller Foundation has highlighted city resilience. The United Nations has argued that ‘while cities bring opportunities, they also foster health epidemics’. In this complex scenario nothing is isolated. New Urbanism can be analysed using space syntax. The walkable city can be aligned with Transport Orientated Development. Designers can be commissioned as tools of economic regeneration. Housing can be linked to financial crisis. The artistic and cultural heritage of our cities can become touristic futures. Health concerns can dictate urban design and regional planning. This complexity has historical roots. By the early 1970s, spatial relationships had been fully embedded into financial theory. The city as a spatio-economic phenomena had been linked to ‘the right to the city’. Art and design had been fully commodified. The demolition of the Pruitt Igoe housing complex had been identified as the moment of modernism’s death. The Environmental Protection Agency had been set up. Sustainable design was on the agenda and, within a decade, the UN Healthy Cities initiative would be operative globally. Some 50 years after the introduction of complexity theory and the establishment of the city as an interdisciplinary entity, this conference asks where are we now in our understanding of the city as an integrated phenomenon. . Themes: Seeing the urban phenomenon as not reducible to single issues, this conference asks you to bring your disciplinary expertise to a forum examining the city through the lens of complexity theory – as inevitably fragmented but simultaneously interconnected and changing. As such it welcomes contributions on the following strands (click for details): 1) Urban Design | Architecture | Interiors | Landscape 2) Engineering | Infrastructure | Sustainability 3) Housing | Public Health | Sociology | Human Geography 4) Economics | Business | City Management | Government Policy and Planning 5) Cultural Studies | Art History | Social History","date_start":"2020-06-17","date_end":"2020-06-19","important_dates":{"abstract":"","full":"2020-04-01","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental","Sustainable Development and Engineering"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["City - University of London / AMPS"],"societies":[],"indexes":[],"emails":[]}