{"name":"International Conference on Science, Engineering Management and Information Technology","series":"","short":"","website":"http://semit2022.refconf.com","content":"Greetings! It is our great pleasure to invite individuals, institutions, and industries to join the International Conference on Science, Engineering Management and Information Technology 2022\\. It would be a gathering of faculty members, scholars, educators, industry experts, and university students from all around the world. SEMIT 2022 aims to provide a platform to transfer information, experience, and scientific and research findings of the recent theoretical and practical achievements of engineering management and IT in both research and industry. The conference is an extraordinary opportunity to encourage experts to respond to current national and international engineering management and IT issues and to enhance university-industry collaboration. In addition to paper presentations and invited lectures keynote speech, the International Conference on Science, Engineering Management and IT 2022 is also going to provide useful workshops and many other programs, the information of which is presented on this website. The conference will warmly welcome all researchers, lecturers, and students, as well as managers and experts in the field of engineering management and IT. The Conference language would be English and the papers could be in English and Turkish. The selected papers will be sent for publication to the journals that are mentioned on the website. Conference Topics: All submissions falling within the broad area of Science, Engineering Management and Information Technology are welcome. In addition to research papers, case studies would be perfectly welcome. Full papers and abstracts are accepted for presenting in the conference and publishing in the proceeding. The conference topics include, but not limited to the following subjects: Case studies of manufacturing/ service industries (including Automotive, Food, Tourism, Petroleum, Healthcare, Insurance and Banking, Energy, etc.) Strategic Management Decision making in an uncertain environment and Risk Management Industry 4.0, supply chain 4.0, and logistics 4.0 Supply Chain Management (Green SCM, Sustainable SCM, Agile SCM, JIT SCM, Global SCM, etc.) Logistics/Transportation/Distribution Management Optimization and Decision Making: methods and algorithms Inventory control, production planning and scheduling Manufacturing or service systems design/ analysis Mathematical modelling, statistics and numerical algorithms for management decisions Metaheuristic algorithms and applications Quality management and tools Productivity and process improvement Human Resource Management Project Management Financial engineering, investment analysis and economics Marketing and supply/ demand management E-Government, E-Commerce, E-Learning Data Science, Big Data, Data Mining and Knowledge Discovery Blockchain in engineering management Soft computing Artificial intelligence and expert systems Digital city Internet of Things (IoT) Information security Pattern recognition Smart card and RFID technologies Wireless communication and mobile computing Other fields of study related to Science, Engineering Management and IT Submit Paper Journal Publishers","date_start":"2022-02-02","date_end":"2022-02-03","important_dates":{"abstract":"","full":"2021-12-10","notification":"","final":""},"topics":["Business","Information-Technology"],"location":{"virtual":"","full":["Online Event","Turkey"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Turkey"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}