{"name":"Enterprise Risk Management","series":"","short":"ERM","website":"https://www.complianceonline.com/enterprise-risk-management-erm-seminar-training-80650SEM-prdsm?channel=Brownwalker","content":"Enterprise risk management (ERM) includes the strategies, methods and processes used by business organizations to manage risks. ERM sets out a framework for risk management. Typically this involves identifying specific events or circumstances relating to the business organization's objectives (in terms of risks and opportunities), assessing them on the basis of their likelihood of occurrence & their magnitude of impact on the firm, determining a response strategy, and monitoring progress of the event, the response and the outcome. By being proactive in the identification and addressing such risks and opportunities, business organizations protect shareholder value as well as create additional value for their stakeholders, including the owners, employees, customers, regulators, and ultimately society overall. ERM can may also be seen as a risk-based approach to managing a business, integrating the concepts of internal control, regulatory requirements (such as the Sarbanes–Oxley Act), and strategic planning. ERM continues to evolve and aims to address the needs of various stakeholders, who want to understand the broad continuum of risks that face complex organizations to make certain they are managed appropriately. Regulators and rating agencies have also increased their scrutiny on the risk management processes of companies and firms. This increased scrutiny today makes up an important component of how the outside world views business organizations. This practical 2-day hands-on training course provides you with an understanding of the requirements needed to design and implement an appropriate Enterprise Risk Management system, i.e. policies, procedures, practices, and accountability required to establish the right levels of Risk Management in compliance with current standards and other requirements for their organizations. It will benchmark their ERM practices against the COSO – ERM framework, and learn how to implement an effective ERM system. Methodology: This is a highly interactive course comprised of presentations, case studies, multidirectional discussions and comprehensive exercises. Most importantly it will offer participants, opportunities to plan such work within small working groups, providing practice in the application of the techniques and tools generating active participation. Who will Benefit: This practical hands-on training course is designed for all businesses both large and small. The following job titles/ positions will benefit from participating; Ethics & Compliance Executives/Managers General / Corporate Counselors Corporate Legal Executives/Managers Business Division Managers Branch and Regional Management Supply chain and procurement directors, managers and their staff Board members, especially risk and audit committee chairs and members","date_start":"2022-04-11","date_end":"2022-04-12","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Information-Technology"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}