{"name":"5th International Conference on Mechanical, Manufacturing, Modeling and Mechatronics (IC4M 2020)","series":"","short":"","website":"http://www.ic4m.net","content":"Call for Papers 5th International Conference on Mechanical, Manufacturing, Modeling and Mechatronics (IC4M 2020) 27-29, Feb, 2020./Shenzhen, China Web: http://www.ic4m.net/ 2020 5th International Conference on Mechanical, Manufacturing, Modeling and Mechatronics (IC4M 2020) is organzied by Hong Kong Society of Mechanical Engineers(HKSME). The conference will be held in Shenzhen, China, from Feb. 27 to 29, 2020, in conjunction with 2020 5th International Conference on Design Engineering and Science (ICDES 2020)! ●Publication Information 1\\. All the registerd and presented papers of IC4M 2020 will be included in Conference Proceeding , which will be indexed by Ei compendex, Scopus and Conference Proceedings Citation Index (Web of Science), etc. 2\\. High quality papers\\* will be recommended to publish in Journal of Remanufacturing (ISSN: 2210-464X (Print) 2210-4690 (Online)) 3.High quality papers\\* will be recommended to publish in International Journal of Advanced Materials and Production (IJAMP),ISSN 2520-436X( Online). 4\\. Selected papers with great extension will be recommended to publish in Open Access journal - Journal of Manufacturing and Materials Processing (JMMP), free of charge. #IC4M 2019 Conference proceeding will be published in IOP Conference Series: Materials Science and Engineering(ISSN: 1757-899X) ● Keynote Speakers 1\\. Prof. Mohd Hamdi Bin Abd Shukor, University of Malaya,Malaysia Prof Hamdi is a senior professor at the Department of Mechanical Engineering, University of Malaya. He received his bachelor degree from Imperial College London and his master degree from the University of Manchester. He was awarded the Monbusho scholarship to do his doctoral studies in Kyoto University. He is a Fellow of the Institution of Mechanical Engineers, UK. Prof Hamdi is a Charted Engineer with the Engineering Council, UK and a Professional Engineer with the Board of Engineers Malaysia. He is also a director and founder of the Centre of Advanced Manufacturing & Materials Processing, in which has grown from a modest-size team of researchers and engineers to an interdisciplinary research hub. 2\\. Prof. Jan Detand, Ghent University, Belgium Jan Detand's field of research is situated in the domain of industrial design engineering. The research group of industrial design engineering (IDE) is an open research community that focuses on transdisciplinary research through design. IDE utilizes design skills such as design thinking, creativity and prototyping to interact with different stakeholders involved in the transdisciplinary research. ●Topics(for more topics: http://www.ic4m.net/CFP.html) Mechanical Engineering Complex mechanical-electro-liquid System Mechanism and Machine Science High-speed/precision machining Laser Processing Technology CAD/CAM Integration Technology Manufacturing Engineering Precision Manufacturing & Measurement Flexible Manufacturing Technology & System Manufacturing Process Simulation Advanced Manufacturing Technology ●Paper Submission Submission Email: ic4m@smehk.org Submission System: https://cmt3.research.microsoft.com/IC4M2020 ●Call for participants 1,Presenter: If you are interested in giving presentation on conference, without publishing your paper in the proceeding, you need to submit the abstract and title of your presentation to us: ic4m@smehk.org 2,Listener: If you are interested in attending the conference to participant this gathering on the field of Mechanical, Manufacturing, Modeling and Mechatronics, you are welcome to join us and share your ideas! 3,Reviewer: Experts in the area of Mechanical, Manufacturing, Modeling and Mechatronics are welcome to join the conference as reviewer. Send your CV to: ic4m@smehk.org ●Contact Us Ms. Amber Cao Email: ic4m@smehk.org Tel:+852-30506862( Hong Kong) Web: http://www.ic4m.net/","date_start":"2020-02-27","date_end":"2020-02-29","important_dates":{"abstract":"","full":"2020-01-30","notification":"","final":""},"topics":["Engineering & Technology","Mechanical/Industrial","Manufacturing and Industrial Engineering"],"location":{"virtual":"","full":["Shenzhen","China"],"name":"","street":"","city":"Shenzhen","state":"","ZIP":"","country":"China"},"organizers":["Hong Kong Society of Mechanical Engineers(HKSME)"],"societies":[],"indexes":[],"emails":["ic4m@smehk.org"]}