{"name":"9th SEHA International Radiology Conference","series":"","short":"","website":"https://go.evvnt.com/548153-0?pid=4868","content":"Advances in medical imaging continue to occur quite rapidly, making the clinical practice of radiology extremely demanding. The information presented in this conference aims to discuss latest developments, updates of the practical aspects of all major subspecialties of Diagnostic Radiology. The meeting will feature some of the world-class experts in Clinical Radiology from USA, Europe, Middle East, in addition to an elite roster of eminent local speakers that will cover a broad range of topics, state-of-the-art lectures and interactive sessions, case studies and demonstrations and hands on workshops to encourage exchange of knowledge, experience and best practices. The SIRC conference agenda is specially designed to discuss the current technology trends and practices in the radiology industry. New advances in imaging technology, more precise medical imaging equipment, new diagnostic approaches, interventions and therapies. With access to latest technologies such as Artificial Intelligence, 3D Printing and Robotics in medicine, radiology has quickly transformed from being an independent department in a healthcare setting to becoming a key foundation of modern medicine. Diagnostic tips, techniques and pitfalls will be stressed and differential diagnoses of common radiological findings will be covered. Unknown case reviews will be discussed as well as practical clinical problems and differential diagnoses will be presented. We have organized a balanced scientific program, catering specifically to the needs of General as well as sub-specialized Radiologists, Radiology Residents and Technologists. Other physicians will also find it useful in terms of building a basic insight about medical imaging. The conference also encourages the active participation of young researchers as we are hosting Poster Award Competition at the conference venue. We hope this meeting will be of great benefit to all participants in the region, we also hope and trust that you will enjoy your visit to Abu Dhabi, the capital of the United Arab Emirates, and a vibrant and fast-growing city that combines state-of-the-art facilities and infrastructure, as well as a glimpse into an ancient and endlessly fascinating past. We very much look forward to your participation in February 2020 and to welcoming you to Abu Dhabi. Time: 08:00 to 17:00 Venue details: Rosewood Abu Dhabi, Al Maryah Island, Abu Dhabi, United Arab Emirates Prices: Physicians / Specialists: AED 1100.00, Nurses and Allied Health Professionals: AED 750.00, Residents/Interns/Students: AED 550.00","date_start":"2020-02-20","date_end":"2020-02-21","important_dates":{"abstract":"","full":"2020-02-19","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Abu Dhabi","United Arab Emirates"],"name":"","street":"","city":"Abu Dhabi","state":"","ZIP":"","country":"United Arab Emirates"},"organizers":["MENA Conference LLC"],"societies":[],"indexes":[],"emails":[]}