{"name":"Law, Business and Innovation Studies (LBIS) Conference","series":"","short":"","website":"https://lbisconference.com","content":"Law, Business and Innovation Studies (LBIS) Conference has been organized to create a platform that the scholars present their studies and exchange the ideas in order to develop their research. The conference location is in London, United Kingdom and the conference will be held in ZOOM which is an online platform because of the Covid-19 outbreak. LBIS Conference invites academics and scholars from all the relevant disciplines to submit their papers and ongoing research results/findings. As a peer-reviewed conference, we aim to bring the world’s leading scholars and opinion leaders to the conference to raise critical issues regarding the fields of law, business and innovation. We create sub-sessions for the related fields. Please, engage freely in discussions, share your ideas and build relationships among the group of leading researchers. The presented papers in the conference will be published in an e-book as an abstract or full paper. The selected papers, after the examination of the Scientific Board, will be published in the conference journals as full papers following on acceptance after the review process in the journals. The theme of the conference is “emerging perspectives in social science”, and the official language of the conference is English. SUBMISSION AND WORKSHOPS • The papers must be uploaded to the submission form in accordance with the manuscript submission guidelines. • Abstracts should be between 200 – 300 words. • If you submit a full paper, it must be at least 4 pages based on the template of the conference. • If you want to submit your full paper, two options will be offered by the system: First, ‘please consider it for the full paper proceedings book’. Second, ‘please consider it as an article’. Based on your chosen option, your paper will be considered. • If your full paper is not ready, you can still submit your abstract; and you can choose “I will submit my full paper later”. If you only want to submit abstract and you do not want any full paper, you can choose” please consider it only in the abstract book”. • Please use the templates of the conference even if you want us to consider your paper as a journal article. If your paper is selected, then you can adopt the journal authors’ guidelines. • Please use the template below for the abstract and full papers and please submit your file in a Word Document. • This conference employs double-blind peer review, where the author and referee remain anonymous throughout the process. For more information: https://lbisconference.com/submission-and-workshops/ ------------------------------------------------------------------------------ Workshop Topics: https://lbisconference.com/track/ Publication Opportunities: https://lbisconference.com/publication-opportunities/ Contact us: lbisconference@gmail.com","date_start":"2021-09-09","date_end":"2021-09-11","important_dates":{"abstract":"","full":"2021-08-20","notification":"","final":""},"topics":["Education / Legal / Other","Social-Work","Law and legal studies"],"location":{"virtual":"","full":["Online Event","United Kingdom"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United Kingdom"},"organizers":[""],"societies":[],"indexes":[],"emails":["lbisconference@gmail.com"]}