{"name":"The Fair Labor Standards Act (FLSA): Wage and Hour Compliance for 2022","series":"","short":"","website":"https://www.complianceonline.com/flsa-wage-hour-compliance-2022-webinar-training-706747-prdw?channel=Brownwalker","content":"The Fair Labor Standards Act (FLSA), commonly referred to as the Wage and Hour Act, is considered to be an employee protection act. This Act was passed in 1938\\. Since then, the FLSA has been amended many times. The major provisions of the Act are concerned with Federal minimum wage rates, overtime payments, child labor, equal pay, and recordkeeping. The US Department of Labor, Wage & Hour Division, oversees Federal labor laws. Additionally, State DOLs administer state labor laws. Failure to comply with wage and hour laws may result in the employer paying the employee back wages, damages, penalties, attorney fees and court costs, plus the prospect of civil and criminal penalties from federal and/or state governments. Therefore, wage and hour compliance are of the utmost importance. Why Should You Attend: Civil lawsuits for wage and hour violations are always a threat to businesses. Violations of the Fair Labor Standards Act (FLSA) can result in astronomical financial judgements against employers, lawsuits, criminal charges, and/or being debarred from being awarded Federal contracts for a period of three years. By understanding the provisions of the FLSA, you can protect your company from major financial consequences. This webinar will provide a comprehensive understanding of the provisions of the FLSA. You will learn how to properly calculate overtime pay and become familiar with the 3 tests used to determine FLSA exemptions. Participants will gain an understanding of what constitutes hours worked, what to do when state and federal laws differ, how final pay checks need to be handled, and when employees must be compensated for training, travel time, meal breaks, and on-call status. Terminology used throughout the Act will be explained. Additionally, each of the FLSA exemptions will be discussed in detail. Participation in this webinar will assist you in ensuring wage and hour laws are being followed properly and consistently in your organization. Participation will also ensure you are familiar with changes to the overtime payment rules under FLSA which are effective January 1, 2020\\. Areas Covered in the Webinar: Provisions of the Fair Labor Standards Act Changes to the Act in 2020 The three tests used to determine if an employee is exempt from the FLSA The six exemptions under the FLSA Federal minimum wage laws vs. State minimum wage laws Calculating overtime pay Timeliness of overtime payments Treatment of meal breaks, travel, training, on-call time and outside sales under the FLSA Proper handling of termination paychecks Minimum wage requirements Equal Pay Child Labor Who Will Benefit: Senior Leadership HR Professionals Compliance Professionals Payroll Professionals Operations Managers Managers and Supervisors Employees","date_start":"2021-11-15","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Human-Resources"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}