{"name":"The 3rd Int'l Conference on Electrochemistry and Energy Storage","series":"","short":"CEES 2019","website":"http://www.deconf.org/conference/CEES2019","content":"The 3rd Int'l Conference on Electrochemistry and Energy Storage (CEES 2019) Conference Date: December 6-8, 2019 Conference Venue: Sanya, China Website: http://www.deconf.org/conference/CEES2019/ Online Registration System: http://www.deconf.org/RegistrationSubmission/default.aspx?ConferenceID=1183 Email: workshop12@163.com The 3rd Int'l Conference on Electrochemistry and Energy Storage (CEES 2019)will be held from December 6-8, 2019 in Sanya, China. This Conference will cover issues on Bioelectrochemistry, Nanoscale electrochemistry, Electrochemistry of Functional Materials, Electrochemical Energy Storage and Conversion, Electrocatalysis, Energy Storage Materials and Technology, Capacitor and Supercapacitor, Capacitor Battery, etc. It dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal，please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: workshop12@163.com Tel: +86 15172479625 QQ: 3025797047 WeChat: 3025797047 Attendance Methods 1.Submit full paper ( Regular Attendance+Paper Publication+Presentation ) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract ( Regular Attendance+Abstract+Presentation ) 3\\. Regular Attendance ( No Submission Required ) Conference Topics Electrochemistry Bioelectrochemistry and Biological Interfaces Electrochemistry in Biomedical Science and Technology Bioenergetics and Photobioelectrochemistry Artificial photosynthesis and photo-electrochemistry Nanoscale electrochemistry Electrochemistry for environmental applications Electrochemical Process Technology and Engineering Frontiers in Analytical Electrochemistry and Sensing Electrochemistry of Functional Materials Electrochemical Energy Storage and Conversion Interfacial Electrochemistry and Spectroelectrochemistry Theoretical and Computational Electrochemistry Electrocatalysis Electrodeposition and electroplating Corrosion and Passivity Advances in Molecular Electrochemistry Photoelectrochemistry and Electrochemiluminescence Hyphenated Electrochemical Techniques Electrochemical Instrumentation Applications of Electrochemical Engineering Education for Electrochemistry and Electrochemical Engineering (co-sponsored by The Electrochemical Society) Energy Storage Materials and Technology Capacitor and Supercapacitor Capacitor Battery Electrolyte Battery Management System Power Storage Devices Fuel Cell Materials Solar Cell Materials Materials for the Hydrogen Economy Heat Storage Materials Pumped-Storage Power Compressed Air Energy Storage Capacitive Energy Storage Superconducting Energy Storage Inductance Energy Storage Lead Acid Battery Lithium Ion Battery Sodium-Sulfur Battery Heat-Conducting Property Energy Storage Technology and Smart Grid Energy Storage Technology for Application Other Related Topics","date_start":"2019-12-06","date_end":"2019-12-08","important_dates":{"abstract":"","full":"2019-11-06","notification":"","final":""},"topics":["Engineering & Technology","Renewable Energy/Nuclear"],"location":{"virtual":"","full":["Sanya","China"],"name":"","street":"","city":"Sanya","state":"","ZIP":"","country":"China"},"organizers":[""],"societies":[],"indexes":[],"emails":["workshop12@163.com"]}