{"name":"Stop Letting that Difficult Person Ruin your Day-Effectively Handle Toxic People for Better Productivity and Less Drama","series":"","short":"","website":"https://bit.ly/3hSvfuu","content":"Through COVID-19 we are seeing that stress, fear, and uncertainty impacts how we communicate, collaborate, and engage. Research shows that there is a direct relationship between an increase in stress and negativity and the resulting difficult behaviours in our organizations. How you and your team effectively deal with negative and difficult people can mean the difference between having a toxic, drama-filled workplace, and an engaged, collaborative, and productive organization. Why Should You Attend Successful leaders know that the survival of our organization during this uncertainty depends not just on the technical skills within our team, but also on their ability to deal respectfully and collaboratively with their colleagues and customers, and remain energized at the same time. We all have people who push our buttons and create drama in our lives. Within our team, these interactions can drain our energy, take us off track, and infect the other areas of our life. By focusing on effective ways to work with negative and difficult people, you will be able to increase productivity, collaboration, customer service, and overall engagement. Many of us have learned to avoid, rather than deal with the bullies, know-it-alls, and other difficult people on our team, because it is easier than confronting the source of the problem. But, overlooking the problem is the worst thing we can do. Under stress and surrounded by uncertainty, some people are simply more difficult to deal with. What we can change is our reaction. Reducing the drama within our team depends on being able to understand and respond appropriately to their behaviours. Learn successful strategies and tips for building a positive, productive workplace by knowing WHAT to focus on to move these interactions forward, HOW to effectively respond, and WAYS to manage the impact of their behaviour. End frustration. Act rather than re-act, and ensure a respectful, effective, and collaborate team. Objectives of the Presentation » Develop an understanding for those exhibiting typical difficult behaviours in order to effectively meet their needs and move the interactions forward. » Identify and control the impact of difficult people so that you can keep the situation from escalating further. » Increase insight and differentiate the 4 types of attitudes and understand how they develop in order to keep your cool in a variety of situations. » Utilize various verbal and non-verbal communication techniques and situational strategies that you can use to de-escalate and effectively handle upset people. » Learn how to gain control and handle these situations by identifying the payoff. » Uncover the secret to moving difficult conversations forward. » Know how to act, not react, in solving situations so that you can lead with more confidence, feel less stress, and gain more success in working and interacting with your team. Areas Covered in the Session » Negative attitudes decrease the ability to problem-solve, effectively communicate and collaborate, and increases the risk of mental health issues, absenteeism, and difficult behaviours such as back-stabbing, finger-pointing, and gossiping. » Not dealing with negativity and difficult behaviours rob us of time and energy. » Negative attitudes and difficult behaviours are contagious and can create a toxic workplace culture. » Leaders who can appropriately manage any negativity and difficult behaviours will create teams that can effectively collaborate and thrive through this challenge, and those organizations that try to simply ignore those people and attitudes will struggle to be productive, service their customers, and be competitive. Who Will Benefit » Human Resources Professionals » Health and Safety Reps » Union Reps » Supervisors, Manager, Directors (Team Leads) » Executive Directors Not-For-Profit To Register (or) for more details please click on this below link: https://bit.ly/3hSvfuu Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-02-11","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Human-Resources"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}