{"name":"Implementing UDI (Unique Device Identification) - Plan Now for Success","series":"","short":"","website":"https://www.complianceonline.com/medical-device-udi-implementation-seminar-training-80303SEM-prdsm?channel=Brownwalker","content":"The one-day virtual seminar provides the information you need to implement UDI. An effective implementation gives your customers the information they need. It will also help you avoid an FDA 483 and a Warning Letter. The virtual seminar gives you hands on experience to understand UDI and your device. You bring a laptop computer and some information about your device. During the seminar you receive toolkits to determine the compliance dates, packaging configurations, and the attributes you will load to GUDID The seminar helps you identify the requirements for the UDI elements: Procedure changes Label UDI Package UDI Direct marking UDI Date format Entry into GUDID The seminar helps you implement the changes, update your procedures, and determine when you need to revalidate databases. Who will Benefit: Regulatory Managers Design Engineers Labeling Specialists Project Managers Quality Managers Quality Engineers Executive management R&D staff Strategic planning staff Topic Background: All medical devices marketed in the US, with limited exceptions, must have unique device identification. The first phase is the revised regulations with an effective date of Dec. 23, 2013\\. The subsequent phases depend on device attributes such as regulatory class, intended use (life sustaining or life supporting), reusable & reprocessed, etc. FDA-CDRH published a simple table, by compliance date. However, device manufacturers need a more refined analysis to classify their products and determine the compliance dates. For each compliance date, depending on the device characteristics, the manufacturer puts the UDI on the label, changes the label’s date format, includes the UDI on packaging configurations, and enters information into the FDA-CDRH database called the GUDID. In some case, the manufacturer puts the UDI on the device itself. By September 24, 2016, all manufacturers of Class 2 devices must implement UDI (label, package, and GUDID). You need to understand the regulation and develop your plans now or you won’t be ready. There are a lot of details in the implementation and you will need time to handle all of them.","date_start":"2021-03-16","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Information-Technology"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}