{"name":"\"Front-End, Middle, and Back-End\" Approach to Credit Management","series":"","short":"","website":"https://www.complianceonline.com/front-end-middle-and-back-end-approach-to-credit-management-webinar-training-705808-prdw?channel=Brownwalker","content":"This credit management webinar will discuss the credit analysis process, how to do financial statement analysis and how to do effective cash management using various tools and techniques and how to use various collection techniques (manage legal issues and using negotiation skills) and overall how to manage the collection process. Why Should You Attend: Efficient Credit management helps companies to improve revenue and decrease financial risks. To have an effective credit management it is essential to have effective policies meeting company’s objectives, proper financial and non-financial analysis to be done to assist credit decision making, clear definition of the function of Account Receivable and its role in organization and effective collection policy to be maintained. This credit management best practices webinar is a must for all Credit Managers who really want to improve their “upfront underwriting, cash management, and back-end collections skill set”! The session will begin with the “front-end” or credit analysis (five “Cs” of credit outline) and financial statement analysis (“five-step” key ratio model). This will be followed by the “middle” or cash management approach (including basic and advanced tools & techniques). The session will conclude with the “back-end” or collection techniques (including legal issues and negotiation skills) and the management (human factor) of the collection process. Areas Covered in the Webinar: Front-End: Review credit analysis including the five “Cs” of credit Front-End: Utilize a “five-step” key ratio analysis model Liquidity Activity Leverage Operating performance Cash flow analysis Middle: Analyze “cash management” tools Back-End: Cover effective “collection” techniques (legal and negotiations) Back-End: Explore the “management” (human factor) of collections Who Will Benefit: Accounts Receivable (AR) department managers Credit managers AR staff AR and Revenue accountants Credit officers Billing and collection clerks AR specialists Professionals in accounting, finance, operations Chief Accountant Finance Managers Financial Controllers Sales staff who interact with Accounts Receivable and credit management department","date_start":"2021-05-17","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}