{"name":"Online Course: The Afterlife of Gothic Fiction","series":"","short":"","website":"http://neo-victorian.studies.lcir.co.uk/gothic","content":"ONLINE COURSE 3 modules / 30 hours including: lectures/discussions (3 meetings); reading/watching; studying/writing; final assignment in the form of an essay. Course overview: From Gothic Revival in late 18 th century's architecture to the resurgence of haunting tales on streaming services, like Lovecraft Country (2020) or The Haunting of Bly Manor (2020), the aesthetics, atmosphere and ambiguities characteristic of this pre-Victorian genre remain a potent source for uncanny narratives, which had nothing to do with actual Visigoths in the first place. Since its origins with the castle of Otranto, Gothic fiction became a mode of sublime storytelling, which could be identified by its ambiance more immediately than by the sum of their distinctive features. Recurring motifs, clear-cut characters, and otherworldly settings will come into spotlight during a cycle of meetings dedicated to the genre's evolution, with an emphasis on the counterfeit nature of this Romantic re-imagining of “dark ages”, and its geographically-diverse 'cultural appropriations'. While the initial meeting will introduce Gothic literature's complicated birth (Walpole, Beckford, Radcliff, Lewis, Shelley), its defining hallmarks, and canonical texts, the remaining ones will inspect its developments from the perspective of how, ever since its beginnings, the authors incorporated exotic themes, settings, and episodes, creating an idiosyncratic vision of the Oriental Other (e.g. William Beckford's Vathek). In the 20 th century Gothic-themed writings were all but a stereotype in search for an invigoration. Aside from the highest wave that came from the side of horror films, the most interesting takeover occurred with World Literatures writings, which incorporated this mode for reinterpreting folk tales and repressed histories – everything Walpole's idea of a “Gothic story” could provide for misrepresented ethnic groups and traumatized post-colonial subjects. The third, and final, meeting will therefore feature a look into late 20 th and early 21 st century narratives that intercept the convention, while enriching it with their own traditions – Nigerian (Amos Tutuola's My Life in the Bush of Ghosts, 1954), Indian (Arundhati Roy's The God of Small Things, 1997), and Japanese (Junji Itō's Uzumaki, 2002). Each sets out a template, to which the aforementioned shows constantly relate, breathing life into this Frankenstein's monster. Students and independent researchers interested in horror fiction in books, as well as those adapted for the screen, are welcome to attend The Afterlife of Gothic Fiction workshop-form course, finding in it their own Arkham. For more information, please contact us on academiclab@lcir.co.uk. Registration fee: 150 GBP Register on https://registration.lcir.co.uk by 30 December 2020","date_start":"2021-01-15","date_end":"2021-02-10","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","interdisciplinary"],"location":{"virtual":"","full":["Online Event","United Kingdom"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research and Academic LAB"],"societies":[],"indexes":[],"emails":["academiclab@lcir.co.uk"]}