{"name":"EXTENDED CFP: “How Higher Education Should Respond to Fake News and the Post-Truth World”","series":"","short":"","website":"https://digitalcommons.du.edu/theliminal","content":"EXTENDED CFP: “How Higher Education Should Respond to Fake News and the Post-Truth World” Fake news, a generic term with a political origin that refers to misinformation, disinformation, misrepresentations, information pollution, false narratives, propaganda, and conspiracy theories spread on the web, have become a major issue for educational institutions concerned with students’ ability to distinguish factual from nonfactual information. Tesich (1992), Keyes (2004), and Crouch (2004) argued that we have entered into a post-truth world and political environment in which rhetorical arguments are largely designed to solely appeal to the audience’s emotions (pathos) while ignoring facts and policies, and that fake news are products of the current post-truth moment. West (2018) argued that misinformation is being shared all over the web because people are able to share information widely without having that information pre-vetted by journalists and editors. The threat of fake news to education is so alarming that the majority of sessions presented at the 2018 Modern Language Association (MLA) conference were devoted to addressing this issue. To remedy the fake news problem, educators and universities have emphasized information literacy education mostly taught in first year English Composition courses (FYC), but information literacy alone does not prepare students to identify deep fakes, which are media designed to confuse human sight and hearing for the purpose of evading detection. In most FYC courses, students are asked to apply an evaluation checklist, such as the popular “currency, relevance, authority, accuracy, and purpose” (CRAAP) test, to assess the credibility of web sources. However, the evaluation criteria of the CRAAP test are insufficient for identifying deep fakes created by AI propaganda machines to mimic the appearance of legitimate sources (Anderson & Horvath, 2017). A demonstration of a deep fake is China’s AI news presenter that mimics human appearance and speech patterns, making the AI news presenter almost indistinguishable from its human counterpart. In 2017, Stanford conducted a research study on people’s ability to evaluate information accuracy by sampling “45 individuals: 10 Ph.D. historians, 10 professional fact checkers, and 25 Stanford University undergraduates” (Wineburg & McGrew, 2017, p. 1). Researchers found that professional fact-checkers outperformed Ph.D. historians and Stanford undergraduate students who were more easily manipulated by online content. The result demonstrated that a person with more education on information literacy might not be better at recognizing fake news than professional fact checkers. Providing information literacy education may be one piece of the big puzzle for addressing the fake news crisis in higher education. Some scholars have proposed solutions in addition to information literacy education to address the fake news problem. Mackey & Jacobson (2016) called for teaching students metaliteracy, or the ability to reflect on the process by which one arrives at literacy, to identify and reject fake news. Metaliteracy is, in essence, a type of epistemological investigation of information literacy. Mackey & Jacobson suggest that one should consider the following issues to develop metaliteracy: 1) question the sources of information; 2) be mindful of one’s feelings when reading information to avoid confirmation bias; 3) challenge one’s own assumptions about the reading; 4) question the packing and delivery of the information; 5) contribute information responsibly. Other proposals include Mike Caufield’s Digital Polarization Project that offer courses on more complex issues in digital literacy, such as: 1) the use of algorithms to moderate and accommodate user behavior; 2) the problem of normalizing fake news that support one’s worldview; 3) web harassment by social media mobs; 4) state-sponsored hacking of institutions. VoteSmart, a political advocacy group that has created a database of political speeches and other information, is partnering with universities such as Duke Univ., Oregon State Univ., and Univ. of Texas to address fake news as a threat to democracy. For the first issue of the Liminal, we are interested in papers that address the following topics: - Evaluation criteria beyond CRAAP for identifying misinformation and disinformation (e.g. rhetorical elements, design elements, algorithms, etc.). - Digital lessons or curriculum for identifying and disproving conspiracy theories. - Digital lessons or curriculum on the linguistics, rhetoric, ethics, history, psychology, journalism, computer science, political science, information science, data science, cybersecurity, artificial intelligence, digital forensics, programming, media studies, design, visual theory, music theory, and/or the multimodality of fake news or deep fakes. - Digital lessons or curriculum for identifying fake news on specific social media platforms (e.g. Reddit, Facebook, Twitter, Instagram, etc.). - Misinformation and fake publications infiltrating scholarly research. - Misinformation and fake publications infiltrating open educational resources (OER). - The effects of the post truth era on the future of higher education. - The politics of fake news and the post truth world (and how higher education should respond to this problem). - The problem of deep fakes and propaganda generated by artificial intelligence (AI). - Methods, software concepts, software prototypes, or digital games for identifying and/or reverse engineering deep fakes. - The problem of data analysis of the spread of fake news. - The problem of fake news being shared in classrooms and on LMSs. - The problem of deep fakes infiltrating higher education. - Technological solutions with instructional activities for identifying misinformation and disinformation. - Software concepts, software prototypes, or digital games for evaluating web sources. - Quantitative or qualitative research on students or faculty awareness of specific fake news topics or items. - The future of first year English Composition courses (FYC) and information literacy courses in response to fake news. - The role of faculty and researchers (in different disciplines) in the post truth era. - Creating digital repositories or databases with evaluation criteria for fake news. We welcome both industry leaders and scholars to contribute to the Liminal. Sherry Jones, Editor The Liminal: Interdisciplinary Journal of Technology in Education https://digitalcommons.du.edu/theliminal/ Email: theliminaljournal@gmail.com Manuscript Guidelines Research Papers (2000 - 4000 words) The Liminal publishes peer-reviewed empirical research. Research may employ a variety of quantitative, qualitative and mixed method approaches. We welcome action research and design research articles. We welcome critical theory approaches in education to include critical pedagogy, critical discourse analysis among others. All Innovative or provocative approaches to research or the way research is reported is encouraged. Graduate Student Articles (2000 - 4000 words) The Liminal welcomes submissions from graduate students in the disciplines of education, instructional design, educational technology, computer science, online teaching, hybrid teaching, digital humanities, digital rhetoric, media studies, media arts, digital ethnography, game studies, and any discipline that addresses issues at the intersection of technology and education. We ask that these articles provide findings and implications for practitioners, scholars and administrators. Book Reviews (1000 - 2000 words) Guidelines for Volume 1 Book Reviews Book Review List for Volume 1 Sign up for Book Review for Volume 1 Book Review Editors: Donna Hall, Chris Luchs Scholarly Review Articles (2000 - 4000 words) Review articles present critical evaluations of articles that has been previously published. Review articles should include 1) issue being considered 2) relevance to readers of The Liminal 3) summary of previous literature 4) discussion of areas of agreement 5) inconsistencies gaps, and disagreements Opinion Pieces (500 - 700 words) Op-Eds are short, narrowly focused articles on issues of contemporary interest, viewpoints on published research, or emerging issues relevant to eLearning professionals, educators and scholars. Please review Tips for Writing a Scholarly Op-Ed for guidelines on writing this type of article. Game Review (1000 - 2000 words) Please contact editor Kae Novak novak.kae@gmail.com if you would like to submit a game review. Submission Directions Visit the journal website at https://digitalcommons.du.edu/theliminal/. Click on the \"Submit Article\" link and follow the submissions directions. Prior to submission, please remove all personal identifiable information from the paper(s) and format the entire paper in APA style. We look forward to reading your thought provoking and/or innovative pieces.","date_start":"2019-02-18","date_end":"","important_dates":{"abstract":"","full":"2019-02-18","notification":"","final":""},"topics":["Education / Legal / Other","Education","interdisciplinary"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["eLearning Consortium of Colorado"],"societies":[],"indexes":[],"emails":["theliminaljournal@gmail.com","novak.kae@gmail.com"]}