{"name":"Root Cause Analysis and CAPA using 8-D Problem Solving Method","series":"","short":"","website":"https://www.complianceonline.com/root-cause-analysis-and-capa-8d-problem-solving-method-seminar-training-80449SEM-prdsm?channel=Brownwalker","content":"In this interactive virtual seminar, you’ll learn how to apply the many tools used to identify possible causes, determine (with data) which is the true root cause (or causes, as there may be some compounding of problems occurring), and how to fix them – permanently. 8D is used by a wide variety of industries – from service to design, manufacturing, and fulfillment. 8D has been used by sales forces, development teams, hourly personnel, and C suite effectively, and is a technique that is easily mastered. One of the biggest detractors to using the 8D technique is that it does not always address the issue fully. However, after studying the reasons behind this weakness, I’ve developed an additional emphasis to minimize risk and maximize success using the 8D framework. This is the only course that teaches this additional emphasis, and I developed this methodology when I was hired by Motorola to eliminate returns for a particular defect (after previous efforts had seen the defect return). I’ve been teaching this “magic bullet” method ever since. The course is highly interactive and will require all participants to work through examples in class, allowing you to learn experientially as well as through lecture. Class notes are provided so you can concentrate on what we’re talking about vs. taking copious notes. In this two-day virtual seminar, you’ll learn how broad-based this technique is, how it can be easily adapted for a wide variety of industries, and how to participate in, and lead, an 8D team. Learning Objectives: Upon completing this course participants should be able to: Explain what 8D is and how it is applied Understand where 8D is used in the PDCA cycle Apply various tools and techniques to describe the problem more accurately Understand what is a Root Cause of a problem, vs. what is a symptom of the problem Understand which types and severity of problems should initiate a formal Root Cause Analysis (RCA) Utilize a Risk Based approach to identifying Root Cause Analysis Apply RCA to Context of the Organization and Risk Analysis Evaluate effectiveness of proposed Corrective Actions in addressing the Root Cause Who Will Benefit: This course is designed for anyone who is participates in addressing Supplier Corrective Actions, internal corrective action programs, or who is tasked for eliminating or minimizing defects as part of a Continual Improvement (CI) program. This includes those that have Quality, Environmental, or Occupational Health/Safety Management Systems responsibilities for making general improvements in their organization’s performance, as well as the specialists in various areas who are the subject matter experts. A partial list of personnel who will benefit from the course: Senior managers Quality professionals Environmental professionals Occupational Health/Safety (OHS) professionals Regulatory professionals Production supervisors and managers Manufacturing engineers Production engineers Design engineers Process owners","date_start":"2021-03-30","date_end":"2021-03-31","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}