{"name":"Towards 2030: Sustainable Development Goal 8: Decent Work and Economic Growth. A Sociological Perspective","series":"","short":"","website":"https://www.frontiersin.org/research-topics/30652","content":"In collaboration with the Open Access journal “Frontiers in Sociology: Work, Employment and Organizations” (www.frontiersin.org) we are bringing together a selected group of international experts to contribute to an article collection: \"Towards 2030: Sustainable Development Goal 8: Decent Work and Economic Growth. A Sociological Perspective\" Submission Deadlines: 15 March 2022 - Abstract 15 June 2022 - Manuscript Visit the collection homepage for the full description of the project: https://www.frontiersin.org/research-topics/30652/ About this Research Topic: This Research Topic addresses the eight Sustainable Development Goal, which is to “Promote sustained, inclusive and sustainable economic growth, full and productive employment and decent work for all.” Progress toward this goal is measured by a number of individual targets and indicators. As highlighted in the UN’s most recent SDG progress report, the COVID-19 pandemic has heavily impacted progress toward this goal. The pandemic has “initiated the worst global economic recession since the Great Depression and has had a great impact on both working times and incomes”. Gender pay gaps increased with the pandemics, as undeclared employment. Global unemployment increased by 33 million in 2020, with the unemployment rate increasing by 1.1 percentage points to 6.5 per cent and many people struggled to find a job. This Research Topic will address the eighth Sustainable Development Goal from a sociology-specific perspective. It will not only enquire into its global promulgation and into individual local, national, and international cooperative programs in support of it but it will also consider the framing and elaboration of the goal, its adaptation to particular geographical contexts, stakeholder involvement in it, and the issues concerning decent work conditions worldwide. This Research Topic welcomes papers that will provide both theoretical and empirical findings. Potential issues include, but are not limited to: - Gender gaps and their eradication in employment and education, including access to skills, equal wages, labor force participation, occupational bias, occupational inequalities, as well as discrimination and stereotyping in the workplace. - Unemployment in society with a special focus on labor market-related issues in the Global South such as closing labor-productivity gaps in low-income countries and ways to increase aid for trade support for developing countries. - The effects of lack of decent jobs, coupled with weak social insurance schemes and poverty among the workers (working poor and precarity). - Equality and inclusion at work during the COVID-19 pandemic, including challenges of employment in the informal economy. - Technological challenges for the world of work, including information and communications technologies (ICTs), artificial intelligence, automation, robotics, and advances in working conditions. - New forms and models of employment and education, including developments in the fields of telework and remote work. - Transformations of labor rights and secure working environments for all workers. - Open, dynamic, and inclusive labor markets that respect fundamental principles and rights at work, with simple, transparent, flexible, and predictable legal employment frameworks. - Policy measures needed to address global, national, regional, and local asymmetries in resource mobilization, technological know-how, and market power. - Development-oriented policies and comprehensive employment services to support productive activities, decent job creation, entrepreneurship, and youth employment. - Tensions between national and international employment policies in global unemployment challenges. - Evaluation of socio-economic impacts of active and passive labor market policies and other unemployment preventive measures (e.g., outplacement programs, professional reorientation schemes). Keywords: SDG8, Pay gap, Unemployment, Labor-market issues, Social insurance, Working poor, Precarity, Remote work Co-Editors: - Andrzej Klimczuk, SGH Warsaw School of Economics, Poland - Minela Kerla, The Association of Online Educators, Bosnia and Herzegovina - Magdalena Klimczuk-Kochańska, University of Warsaw, Poland - Piotr Toczyski, The Maria Grzegorzewska University, Poland - Delali A. Dovie, University of Ghana, Ghana SUBMISSION: Papers should be submitted through this link, using the \"Submit your manuscript\" button: https://www.frontiersin.org/research-topics/30652/ and must follow paper templates available here: https://www.frontiersin.org/about/author-guidelines#Templates Publishing solutions: - Manuscripts will be peer reviewed, and if accepted for publication, are subject to publishing fees, which vary depending on the article type (https://www.frontiersin.org/about/publishing-fees). A discount or waiver can be applied for and all applications are considered (https://frontiers.qualtrics.com/jfe/form/SV\\_51IljifwFBXUzY1). - We collaborate with many leading universities making the Open Access publishing process even more accessible for authors. Click here (https://www.frontiersin.org/about/institutional-membership) to see whether your institution is collaborating with us.","date_start":"2022-06-15","date_end":"","important_dates":{"abstract":"","full":"2022-06-15","notification":"","final":""},"topics":["Social Sciences","Sociology","Economics & Business Management"],"location":{"virtual":"","full":["Online Event","Switzerland"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Switzerland"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}