{"name":"7th International Conference on Neurotechnology and Physiological Computing Systems - NEUROPhyCS 2019","series":"","short":"","website":"http://www.neurophycs.org ","content":"Computer systems are increasingly pervasive, in particular in biomedical applications. Physiological data in its different dimensions, either bioelectrical, biomechanical, biochemical or biophysical, collected through specialized biomedical devices, involving image, video and other types of signal, in wireless body networks or otherwise, is opening new boundaries in the field of human-computer interaction into what can be defined as physiological computing. \n Neurotechnology is one of the most promising areas within physiological computing, where some of the most significant advances are being witnessed, including extensive research on brain-computer interfaces. NeuroPhyCS brings together researchers and practitioners interested in creating and using novel interaction devices, adaptable interfaces, algorithms and tools, through the study, planning, and design of interfaces between people and computers, supported by multimodal biosignals. Researchers attending NeuroPhyCS will interact with other researchers and practitioners that seek to push forward the state-of-the-art. \n We seek original submissions that describe novel methodologies, technologies and applications in this field, and greatly encourage authors to complement their oral and poster communications, with demonstrations showing novel physiological computing and human-computer interaction concepts or systems. \n Conference Topics: \n Area 1: Sensors and Devices \n \\- Biomedical Devices for Computer Interaction \n \\- Biochips and Nanotechnology \n \\- Bionic Vision \n \\- Cochlear Implants \n \\- Deep Brain Stimulation \n \\- Functional Electrical Stimulation (FES) \n \\- Non-Invasive Brain Stimulation \n \\- Haptic Devices \n \\- Brain-Computer Interfaces \n \\- Health Monitoring Devices \n \\- Physiology-Driven Robotics \n \\- Wearable Sensors and Systems \n \\- Cybernetics and User Interface Technologies \n \\- Robotic Interfaces Mediated by Biosignals \n \\- Telerehabilitation \n Area 2: Methodologies and Methods \n \\- Biosignal Acquisition, Analysis and Processing \n \\- Cognitive Science and Psychology \n \\- Augmentative and Alternative Communication \n \\- Privacy, Security and Neuroethics \n \\- Intelligent Diagnosis Systems \n \\- Brain Models and Functions \n \\- Computational Neuroscience \n \\- Simulation of Physiological Processes \n \\- Pattern Recognition \n \\- Neural Networks \n \\- Observation, Modeling and Prediction of User Behavior \n \\- Video and Image Analysis for Physiological Computing \n \\- Motion and Tracking \n \\- Virtual Reality Tools \n \\- Brain Imaging \n Area 3: Human Factors - User Experience - Usability - Human Factors in Physiological Computing - Learning and Adaptive Control of Action Patterns - Speech and Voice Data Processing - Understanding Expressivity from Physiological Data - Guidelines for the Design of Physiological Interfaces - Clinical and Social Impact of Neurotechnology Area 4: Applications - Physiology-Driven Computer Interaction - Translating into Clinical and Industrial Outcomes - Biofeedback Technologies - Affective Computing - Pervasive Technologies - Assistive Technologies - Interactive Physiological Systems - Characterisation of Psychophysiological Constructs - Mobile and Embedded Devices - Sleep Analysis","date_start":"2019-09-20","date_end":"2019-09-21","important_dates":{"abstract":"","full":"2019-09-20","notification":"","final":""},"topics":["Medicine & Health","Other"],"location":{"virtual":"","full":["Vienna","Austria"],"name":"","street":"","city":"Vienna","state":"","ZIP":"","country":"Austria"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":[]}