{"name":"HIPAA Privacy Rule Compliance-Understanding New Rules and Responsibilities of Privacy Officer","series":"","short":"","website":"https://www.complianceonline.com/hipaa-privacy-rule-compliance-new-rules-and-responsibilities-of-privacy-officer-seminar-training-80142SEM-prdsm?channel=Brownwalker","content":"While the HIPAA rules have been in place for many years now, the focus of their application has recently changed as technologies and practices have changed, emergencies have been dealt with, and changes to the rules and guidance have occurred, and more changes are on the horizon. In addition, there are changes in other regulations that interact with HIPAA requirements, and that require consideration in your planning. This session will focus on understanding what are the challenges that a HIPAA Privacy Officer faces today, and what are the areas of HIPAA that have changed and are changing still. The session will discuss the latest topics of interest in detail and describe how they relate to the regulations and their enforcement today. Patient Rights and controls on uses and disclosures will be explored in depth, including an examination of how the rules work in emergency circumstances, and how they can be changed during declared emergencies. This session is designed to provide intensive, two-day training in HIPAA Privacy Rule compliance designed for both the seasoned HIPAA professional as well as the individual newly appointed to the position of HIPAA Privacy Officer, covering: The foundations of HIPAA and how they relate to the issues of today Privacy, Security, and Breach Notification under HIPAA Changes in Rules, Technologies, and Practices that Impact HIPAA Compliance Patient Rights and Controls on Uses and Disclosures Managing Patient Communication Rights, Texting, and Telemedicine Considerations for Circumstances Such As Declared Emergencies New Guidance, Court Decisions, and Other Regulations Related to Personal Information Challenges with New Issues, such as insecure communications, Ransomware, and the E.U.’s GDPR Interactions with the SAMHSA 42 CFR Part 2 regulations on Information Relating to Substance Use Disorders Learning Objectives: This Seminar is designed for the HIPAA expert and HIPAA newbie alike who wishes to stay up with changes to HIPAA and related regulations in personal information privacy and security, as well as understand the regulatory issues most frequently encountered in day-to-day operation of health care entities, as well as during emergencies. Objectives include learning related to a variety of topics, including:/p> Understanding the variety of forms entities can take under HIPAA and how they relate to one another Learning about the roles of HIPAA Business Associates and obligations for their management Learning about patient rights, such as access and amendment of information, and how such rights are protected and enforced under HIPAA How uses and disclosures may take place in a wide variety of circumstances, including such hot topics as sharing information with the family and friends of a patient How the rules support emergency responses and how they may be applied in declared emergencies What is current enforcement and audit activity, including an emphasis on patient access of information Using new communications technologies such as texting and telemedicine according to the rules Learn about new and upcoming changes to Substance Use Disorder records confidentiality under 42 CFR Part 2 Who will Benefit This seminar will provide valuable assistance to all personnel in medical offices, practice groups, hospitals, academic medical centers, insurers, business associates (shredding, data storage, systems vendors, billing services, etc.). The following personnel will find this session valuable: Compliance director CEO COO CFO Privacy Officer Security Officer Information Systems Manager HIPAA Officer Chief Information Officer Health Information Manager","date_start":"2021-02-17","date_end":"2021-02-18","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Medical-Speciality"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}