{"name":"8th Annual Pharma AntiCounterfeiting & Serialisation 2020","series":"","short":"","website":"https://www.virtueinsight.com/pharma/8th-Annual-Pharma-AntiCounterfeiting--Serialisation-2020","content":"8th Annual Pharma AntiCounterfeiting & Serialisation 2020 04th & 05th March 2020, Pestana Chelsea Bridge Hotel, London, UK 8th Annual Pharma AntiCounterfeiting & Serialisation 2020 will provide you insight into the current state of play in the EU & US on the vital role of technology impact in the sustainability of pharma and healthcare systems. Our speakers will outline the key recent developments in technology impact in pharma and healthcare in the EU and other international jurisdictions. The event will also address some of the most achievable possibilities of integrating AI, IoT and blockchain within pharma and healthcare through a mixture of practical, lectures and roundtable discussions specifically designed. CONFERENCE SPONSORS: • MODUM.IO AG We have sponsorship opportunities available for the event, which gives you an opportunity to sponsor/speak/exhibit/stall/booth and create brand awareness. In addition, the networking opportunities in focused and relevant industry gathering provide the personal contact necessary for business development efforts. For further details please contact Kavitha at Email: kavitha@virtueinsight.co.in CONFERENCE DELEGATE PRICING: In order to Register as delegate for the conference please contact Kavitha at kavitha@virtueinsight.co.in Please note that this is a PAID event and NOT A FREE event (no complimentary passes available). Any invite, email or tickets issued mentioning it as a free pass or free ticket to this event through any third party site will strictly not be accepted by the organizer and entry won’t be granted at the event. Early Bird Discount Price: 1 Delegate @ £899 + VAT (Valid Till 24th Jan 2020) 3 Delegates @ £1798 + VAT (Valid Till 24th Jan 2020) Standard Price: 1 Delegate @ £1299 + VAT (Valid from 25th Jan 2020) 3 Delegates @ £2598 + VAT (Valid Till 25th Jan 2020) KEY SPEAKERS: • NICHOLAS CALL, Special Agent, FDA • GALIT MEYRAN, Serialization Global Program Manager, Teva • MARCEL DE GRUTTER , Project Manager Serialization - Regulatory & Government Affairs Liaison, Abbott • PATRIK MERCKELL, External Business Process Analyst and Project Manager, Roche • EIKE HILLBRICHT , Corporate Security Manager, Boehringer Ingelheim • JACK JING , Global Business Development Director / Head of EU Commercial Operations, Seacross Pharmaceuticals • LEYLA HANNBECK , CEO, Association of Independent Multiple Pharmacies • SULTAN DAJANI , Pharmacist Superintendent, Wainwrights Chemists • TRACQ ANTOINE, Head of Commercial Logistics & Serialization, Galderma • ADRIAN VAN DEN HOVEN, Director General of Medicines for Europe, European Medicines Verification Organisation (EMVO) • MIKE ISLES, Executive Director, European Alliance for Access to Safe Medicines • MONIKA DERECQUE POIS, Director General, GIRP—European Healthcare Distribution Association • BILL ARONSON , COO, Artificial Intelligence Research Group • MARIE MANLEY , Partner, Head of the UK Life Sciences Practice, Sidley Austin • SANDY EISEN, Chief Medical Officer, Fromtline Pharma Plus many more KEY THEMES: Anti-counterfeiting, Serialisation, T&T • Shaping the future for Healthcare • Effect of Post (FMD) Deadline • Serialisation strategies- Choosing a Serialisation solution • AI algorithms to crack down on fake products • Fight the FAKE – Protect the public • Technology Impact - Current digital world • Serialisation and Compliance • Penetrating the legitimate supply chain • Packaging Techniques – Protecting your products Brexit • Impact on EU, US and Row market Get more from the event, with a broader scope bringing the whole communications value chain together. Enjoy and make the best out of our dedicated networking drinks time, meet the leading companies showcasing the products of tomorrow in the co-located exhibition. Expand your knowledge of the latest business models and strategies in the high-level conference.","date_start":"2020-03-04","date_end":"2020-03-05","important_dates":{"abstract":"","full":"2020-03-04","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal","Supply chain management (logistics)"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["modum.io AG"],"societies":[],"indexes":[],"emails":["kavitha@virtueinsight.co.in"]}