{"name":"International Conference on Food Studies \"Culinary Evolutions\"","series":"","short":"","website":"https://food.lcir.co.uk","content":"Food is a basic foundation of culture and society, it is vital to our health and well-being and it plays a significant role in our everyday creative engagement with nature. The shifts in activities surrounding food acquisition, preparation and consumption are not only essential for learning a culinary tradition but for examining a broader societal change. This conference will explore food as a complex cultural product, an indicator of social, religious and political identity. It will focus on people's relationship with food and discuss how food choices are determined by historical period, region, class, gender, kinship and/or ethnicity. The conference will approach the study of food across a range of disciplines such as history, sociology, anthropology, philosophy, literature, culture studies, politics, economics, medicine, biology, psychology, etc. Papers are invited on topics related, but not limited, to: Food systems and diets Eating/drinking habits and etiquettes Food and rituals Cooking/eating spaces Culinary professions Food and health Food and power Hunger, starvation, and malnutrition Dangerous foods and poisons Cookbooks and food magazines Culinary festivals and TV shows Food in social media Food as pleasure Gastronomic tourism Food, biodiversity and sustainability Agriculture and food technology Food safety and quality Proposals up to 250 words accompanied by a brief biographical note should be sent to: food@lcir.co.uk. To download the paper proposal form and find out more about the latest deadline, please visit our website: https://food.lcir.co.uk/.","date_start":"2022-08-20","date_end":"2022-08-21","important_dates":{"abstract":"","full":"2022-04-30","notification":"","final":""},"topics":["Life Sciences","Food-Science / Forestry","Food and Nutrition"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["food@lcir.co.uk"]}