{"name":"The 3rd Int'l Conference on Advanced Functional Materials","series":"","short":"CAFM 2022","website":"http://www.wsaugust.org/conference/CAFM2022","content":"The 3rd Int'l Conference on Advanced Functional Materials (CAFM 2022) Conference Date: August 13-15, 2022 Conference Venue: Xiamen, China Website: https://www.wsaugust.org/conference/CAFM2022/ Online Registration System: https://www.wsaugust.org/RegistrationSubmission/default.aspx?ConferenceID=1504 Email: wsaugust@126.com The 3rd Int'l Conference on Advanced Functional Materials (CAFM 2022) will be held from August 13-15, 2022 in Xiamen, China. This Conference will cover issues on Applications of functional materials, Functional materials, Luminescent and Radiation Sensing Materials, Physics of functional materials, Smart materials, Smart Structures and Materials. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal，please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: wsaugust@126.com (Editor.RolinZhang@gmail.com) Tel: +86 18627814037 QQ: 1349406763 Wechat: 3025797047 Official Account: Academic Communications Attendance Methods 1.Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Adaptive material and structure Applications of functional materials Bioinspired Smart Materials and Systems Classify and order Conductive materials Electrooptic and Magnetooptic Materials Environmental protection with intelligence material Functional materials Functional materials and their applications Fundamental Physics of Functional Materials Green Materials and Technologies for Sustainable Development Hard and Soft Magnetic Materials Luminescent and Radiation Sensing Materials Magnetic, optical, catalytic properties Magnetoelastic and Adaptive Materials Materials for Medical Applications; Biosensors Materials for Spintronics and Photonics Mechanical, thermal, electrical and dielectrical properties Mechanics and Behavior of Active Materials Microwave and THz Materials; Metamaterials Multiferroics and Magnetoelectric Materials Multifunctional Materials Nanotechnologies for Functional Materials New techniques and equipment for Materials Research Optical fiber and semiconductor materials Phases and crystals Phenomenological properties of functional materials Physics of functional materials Shape memory materials Smart materials Smart Structures and Materials Structure-property-correlations","date_start":"2022-08-13","date_end":"2022-08-15","important_dates":{"abstract":"","full":"2022-07-13","notification":"","final":""},"topics":["Engineering & Technology","Material/Nanotechnology"],"location":{"virtual":"","full":["Xiamen","China"],"name":"","street":"","city":"Xiamen","state":"","ZIP":"","country":"China"},"organizers":["Academic Communications"],"societies":[],"indexes":[],"emails":["wsaugust@126.com","editor.rolinzhang@gmail.com"]}