{"name":"Social Media Strategies Summit - First Responders | Virtual Conference","series":"","short":"","website":"https://go.evvnt.com/709522-0?pid=4868","content":"We bring over 10 years of experience in social media education. That means you can count on a vetted, specially curated series of sessions and seasoned, experienced speakers to tackle topics that have the biggest impact on your agency or department's social media strategy. At the Social Media Strategies Summit, First Responders - you can expect to: - Share experiences and learn new social media strategies with your first response and public safety colleagues from around the globe - virtually! - Network with agency peers from across the country. With professionals representing agencies large and small from all around the globe, SMSsummit is your best resource for fresh social media ideas and community building strategies. - Get all your social media questions answered through speaker Q and A, live chat, and discussions with other attendees. - Be your team's social media champion! We'll help you build the foundations of a sustainable, scalable social media policy that you can easily share with leadership and use to train and empower your team. - Learn strategies and tips for tackling issues most important to first responders including social media and crisis communications, humanizing staff, improving agency reputation, and building relationships with your community. - Assess and audit your current social media initiatives. Leave with and results-focused initiatives you can immediately apply to your agency or department. URLs: Tickets: https://go.evvnt.com/709522-1?pid=4868 Twitter: https://go.evvnt.com/709522-3?pid=4868 Time: 09:00 to 15:00 Prices: Early Bird Sale Pricing (Expires Dec 3rd): USD 395.00, Standard Pricing (Expires Jan 14th): USD 495.00, Last Chance Pricing (Begins Jan 15th): USD 595.00","date_start":"2021-02-02","date_end":"2021-02-03","important_dates":{"abstract":"","full":"2021-02-01","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Virtual","United States"],"name":"","street":"","city":"Virtual","state":"","ZIP":"","country":"United States"},"organizers":["Global Strategic Management Institute"],"societies":[],"indexes":[],"emails":[]}