{"name":"Institute of Mathematics and Management Conference on Management & Social Sciences 2020 with Workshop on Data Analytics","series":"","short":"","website":"https://imathm.edu.lk/view/immcmss-2020-melbourne","content":"The importance of knowledge creation and sharing are well understood in the knowledge society. Academicians and researchers across the world sweat for making a better world; conduct research; attempt for quality publications, meet other scholars at research forums to share knowledge, etc. Yet, large numbers of published research articles are erroneous due to a lack of knowledge in quantitative research. Institute of Mathematics and Management (IMM) determined to fill the knowledge gap; take initiative to conduct the conference along with the “Workshop in Data Analytics”. Original research papers and review papers in Mathematical Sciences, Biological Sciences, and related disciplines from Undergraduate and Post Graduate Students, Research Scholars, Faculty, Scientists, etc., are invited for presentation and publication. Abstracts of the papers will be published in Conference Proceedings; Hard copy or E-copy, with ISSN. Selected full papers will be published in the Journal of New Frontiers in Economics and Business (JNFEB) or Journal of New Frontiers in Education and Social Sciences (JNFESS) with ISSN, within three months from the date of the conference. This workshop will be hands-on and driven by examples, using real-life data sets from the fields of; Life Sciences & Health Care, Business & Economics, Finance, Tourism Management, Meteorology, and many more. The intended participants for the course are students and practitioners of a data-driven environment.","date_start":"2020-10-29","date_end":"2020-10-30","important_dates":{"abstract":"","full":"2020-08-10","notification":"","final":""},"topics":["Social Sciences","Other"],"location":{"virtual":"","full":["Melbourne","Victoria","Australia"],"name":"","street":"","city":"Melbourne","state":"Victoria","ZIP":"","country":"Australia"},"organizers":["Institute of Mathematics & Management Pvt. Ltd."],"societies":[],"indexes":[],"emails":[]}