{"name":"International Conference on Immunology and Microbiology","series":"","short":"","website":"https://www.pagesconferences.com/immunology-microbiology-congress","content":"To further analyze key factors that are instrumental in changing the market scenario and to provide a forecast for immunology and microbiology markets, Pages Conferences is organizing International Conference on Immunology and Microbiology which is going to be held in Brussels, Belgium, from September 17-18, 2020\\. The theme of this conference is \"Exploring Recent Advances in Immunology & Microbiology\" which rightly envision the future of research in this direction. This two-day event invites participants across the globe to share their research findings, experiences and results on all the aspects concerning immunology and microbiology. Microbiology and immunology professionals, business professionals, scientific communities, professors, researchers, students, delegates and policymakers from all over the world will take part in this enriching event which focuses on recent developments in these fields. SESSIONS: Microbiology and Immunology Virology Global Market on Vaccines and Drugs Veterinary Microbiology Immunotherapy Pathogen Detection Rheumatology Diagnostic Microbiology Reproductive Immunology Innate and Adaptive Immunity Nutritional Immunology Latest Trends in Medical Microbiology Infectious Diseases in Plants Dental Microbiology and Infections Clinical Microbiology Antimicrobials and Antimicrobial Resistance Applied and Environmental Microbiology Food Microbiology Pharmaceutical Microbiology","date_start":"2020-09-17","date_end":"2020-09-18","important_dates":{"abstract":"","full":"2020-04-22","notification":"","final":""},"topics":["Life Sciences","Microbiology/ Pathology/ Toxicology","immunology"],"location":{"virtual":"","full":["Brussels","Belgium"],"name":"","street":"","city":"Brussels","state":"","ZIP":"","country":"Belgium"},"organizers":["PAGES LLC"],"societies":[],"indexes":[],"emails":[]}