{"name":"Talent Management Every Day: Making Talent a Priority All the Time","series":"","short":"","website":"https://bit.ly/31M3ZqM","content":"Too often, operating managers have not been properly prepared to juggled the daily responsibilities of getting work done while also attracting, onboarding, engaging, deploying, developing and retaining people. What is the job of the manager, and what is the job of the HR function/department in attracting, developing and retaining talented people on a daily basis. That is what this session is all about. Why Should You Attend » What tactical talent management is and how it differs from strategic talent management » Why daily or tactical talent management is more important than strategic or long-term talent management » How talent management relates to replacement planning, succession planning and talent management » Specific tactics that managers and supervisors may use every day to attract, develop and retain top performers and high potentials Objectives of the Presentation » Attract high potentials and top performers during the recruitment » Onboard the best people » Develop people for more responsibility » Retain the best people Areas Covered in the Session » Introduction » What is tactical talent management, and how does it differ from strategic talent management? » Why is a tactical talent management important, and what should be the roles of the HR department and operating managers in talent management? » What specific tactics can be used by operating managers to attract, develop, and retain talented people? » Conclusion Who Will Benefit » Front-line supervisors » Operating managers/middle managers » Chief executives » C-suite executives » Vice Presidents of HR » HR managers and HR professionals » Directors of Organization Development » Directors of Talent Management » Learning and Development (L & D) professionals To Register (or) for more details please click on this below link: https://bit.ly/31M3ZqM Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-12-02","date_end":"2021-02-02","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Management / Leadership","Leadership development"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["AbideEdict"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}