{"name":"CfP: ESPAnet 2022 conference - Stream: Citizen Social Science and Social Innovation: New Practices for the Local Evidence-Based Social Policies","series":"","short":"","website":"https://www.espanet-vienna2022.org/call-for-abstracts","content":"We invite you to submit abstracts for the ESPAnet 2022 conference, Vienna (14-16 September 2022). Stream/Track 7: \"Citizen Social Science and Social Innovation: New Practices for the Local Evidence-Based Social Policies\" Timeline: Deadline for abstracts submission: 4 April Notification of acceptance: 13 May Deadline for papers submission: 15 August Conference: 14-16 September Available Presentation Forms: in-person or online; posters and papers. Abstract Submission (max 500 words): https://www.espanet-vienna2022.org/call-for-abstracts Stream Convenors: - Andrzej Klimczuk, Ph.D. (SGH Warsaw School of Economics, Warsaw, Poland) - Egle Butkeviciene, Ph.D. (Kaunas University of Technology, Kaunas, Lithuania) - Minela Kerla, Ph.D. (Association of Online Educators, Sarajevo, Bosnia and Herzegovina) Stream Description: Social innovations are new ideas, initiatives, or solutions that meet the challenges in social security, education, employment, culture, health, environment, housing, and economic development. Citizen science activities serve to achieve scientific as well as social and educational goals, opening an arena for introducing social innovations. Such innovations are further developed, adapted, or altered after the involvement of scientist-supervised citizens (laypeople or volunteers) in research and with the use of the citizen science tools and methods. The combination of these approaches leads to the development of citizen social science, which involves citizens in the design and conducting of social research, including engagement in research processes similarly to co-production and participatory action research (Albert et al. 2021). Citizen social science is recognized as crucial for gathering data, responding and resolving local development challenges, and cooperation between citizens and professional scientists. However, there are also various barriers to recognition of citizens’ contributions and inclusion of innovations in public policies. In this stream, we want to gather papers on both theoretical and empirical findings. Potential topics include, but are not limited to: - Citizen social science and social innovations in addressing public and social issues, problems and challenges. - Innovations and engagement of citizens in the mixed economy of welfare, including co-production of social services delivered by public, private, non-governmental organizations, and non-formal entities. - The potential of citizen social science in the improvement of local welfare programs. - Research methods related to citizen social science and social innovation (e.g., collective intelligence, participatory and grassroots activities, hardware and software development). - Digital social innovation and citizen social science, usage of big data analytics, ICT, and smart solutions. - Design, evaluation, communication, and dissemination of results of the citizen social science and social innovation initiatives. - Strategies for transferability and scaling of social innovations and citizen social science projects. - Good practices of collaboration between scholars and citizens in cities and communities. - Case studies and good practices summarizing lessons learned from a collaboration between scholars and citizens, including co-creation and co-production processes.","date_start":"2022-09-14","date_end":"2022-09-16","important_dates":{"abstract":"","full":"2022-04-04","notification":"","final":""},"topics":["Social Sciences","Political-Science","equity and social justice"],"location":{"virtual":"","full":["Vienna","Austria","Austria"],"name":"","street":"","city":"Vienna","state":"Austria","ZIP":"","country":"Austria"},"organizers":["ESPAnet"],"societies":[],"indexes":[],"emails":[]}