{"name":"Masterclass: Digital opportunities","series":"","short":"","website":"https://strategiabusiness.com","content":"Strategia business school is an occupational training organization based in Rotterdam Netherlands. We have partnered with Invest in Africa to present a Masterclass on investing and doing business in Africa. The Masterclass will provide training and guidance needed to do business in Africa by providing a platform for learning, sharing, and networking to realize the opportunities Africa has to offer. The program includes carefully selected topics that provide training on the procedures, guidelines, and opportunities of doing business in Africa. These topics will be delivered through online webinars in collaboration with leading industry experts, speakers, investment companies, Government Ministries, and partners across Africa North America and Europe. Among the key modules to be offered include: • Doing Business in Africa • Raising Investment and Trade Finance • Importing from Africa and Exporting to Africa • Agribusiness Opportunities in Africa • Setting up a Profitable Business in Africa • Opportunities in the Africa Continental Free Trade Area • Understanding the African Market • Social Media Marketing In addition to this, all participants will receive an investor directory with over 3000 list of investors, and automatically be enrolled to the Africa Business Club. The Masterclass programme will begin on 1st July 2021\\. A cohort will run for 8 weeks, with a different topic offered each week for two hours. The cost for the Master class is €499\\. Registration for the Masterclass is open. To register send an email to masterclass@strategiabusiness.com and you will be guided on the next steps.","date_start":"2021-07-01","date_end":"2021-09-01","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Industry-Specific"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":[""],"societies":[],"indexes":[],"emails":["masterclass@strategiabusiness.com"]}