{"name":"5 Reasons Teams Fail - How To Build a Strong and Resilient Team that Creates Impressive Results","series":"","short":"","website":"https://bit.ly/35o3k0N","content":"You know what it feels like to be on a great team. There's trust, collaboration, caring, and incredible energy. You want to look forwarding to going to work everyday. On the other hand, you also know what it feels like to be on a dysfunctional team. It's exhausting. You feel like you're swimming against an incoming tide all the time. On some teams the failures are painfully obvious. On others they are nuanced and not easily identifiable. In either case, you need to know the specific steps to transform a dysfunctional team into a high-functioning, collaborative, and supportive team. That's what this webinar will address. Learn how to manage a failing team and how to diagnose the 5 primary reasons teams fail. Learn the corrective actions for each of those reasons. Learn key elements of a successful team and the hierarchy - what has to come first to build a foundation. If a solid foundation is not in place, nothing else you do will work. Why Should You Attend Leading or being on a team that is not functioning at optimum levels can be frustrating and exhausting. Thinking about how to figure out where the problems originate can seem overwhelming - not to mention how to go about changing the situations. You have good people, it’s just not clicking like it could. You've tried a number of \"solutions\" that either haven't worked, or maybe even made things worse. What to do now? Hire a consultant? But you're not confident that will solve the problem. The first step to any corrective action is understanding what's happening. Where exactly is the dysfunction? There is a 5-part hierarchy for constructing a high functioning team. Understanding the hierarchy will allow you to pinpoint exactly where the functionality bottle neck is on your team. With that knowledge, you will be able to go straight to the problem, fix it, develop team cohesion strategies and move the team on to a higher functioning level. Objectives of the Presentation Team performance is directly related to the functionality of the team. Most teams have some degree of dysfunction. It doesn’t have to be that way. There are specific markers or metrics for evaluating a team’s level of dysfunction and zeroing in on the specific area of focus to correct the dysfunction. Once the area of dysfunction is diagnosed, corrective action can be applied and the team will be more functional. Areas Covered in the Session » The 5 critical reasons why teams fail in the workplace » A scorecard to diagnose a team's health » Why focusing on productivity, quality or customer service can be a problem if one indispensable factor is missing » How to stop gossip at work » The difference between constructive and destructive conflict and how to transform conflict from destructive to productive » Get everyone of the team on the same page » Team cohesion strategies and a proven model to build accountability » Understand the key elements of a successful team » Why is resilience important in business and developing resilience in the squad Who Will Benefit » You’re frustrated and exhausted with some of the dysfunction on your team » You lead, manage or are on a team or work group » Want to be on a high-performing, high functioning team » You want to have fun and feel fulfilled by working collaboratively with others on your team » You spend way too much time thinking about how to deal with gossip, lack of accountability, hidden agendas and destructive conflict. » You want specific practical tips, tools, techniques, tactics and strategies to effectively deal with the most difficult people in your life To Register (or) for more details please click on this below link: https://bit.ly/35o3k0N Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2020-12-07","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Human-Resources"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["AbideEdict"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}