{"name":"Social Media Strategies Summit for Small Businesses - Virtual Conference","series":"","short":"","website":"https://go.evvnt.com/687842-0?pid=4868","content":"The Social Media Strategies Summit for Small Businesses, happening December 8-9, features 2 days of case studies and how-to sessions to help small business owners leverage social media marketing to grow their customer base. Event sessions will help you: - Understand how small business owners doing it all can find ways to strategically invest in social media marketing initiatives built for efficiency - Learn proven frameworks to leverage the massive impact of social media marketing. You'll be able to turn your followers into customers (and keep them loyal to your brand!) - Get all your social media advertising questions answered through speaker Q and A, live chat, and active discussions with other attendees. - Learn to build a social media strategy that sets you up for success. Leave with tips on how to streamline content creation, plan consistent social media calendars, and use reliable social media tools. - Share experiences with and new ideas from other small business owners across industries to spark fresh, creative ideas in your own marketing. - Discover the best ways to find and target your niche audience online. You'll learn how to build brand awareness and stay active on the social media channels most relevant to your customers. URLs: Tickets: https://go.evvnt.com/687842-1?pid=4868 Twitter: https://go.evvnt.com/687842-3?pid=4868 Prices: Presale Tickets (Expires October 22): USD 199.0, Early Bird Tickets (Expires November 19): USD 249.0, Last Chance Tickets (Expires December 3): USD 299.0, At The Door Tickets (Begins December 4): USD 349.0 Time: 09:00 - 14:00","date_start":"2020-12-08","date_end":"2020-12-09","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["Global Strategic Management Institute"],"societies":[],"indexes":[],"emails":[]}