{"name":"5th International Conference on: Social-Ecological Systems: From Risks and Insecurity to Viability and Resilience","series":"","short":"","website":"https://www.ceres-center.org","content":"Background One of the most striking dynamics of the Anthropocene Era is the ability of social systems to interact with ecological systems on a large scale and at a rapid rate, with greater intensity and uncertain consequences. Human societies have managed to build their disconnected environments while crossing many ecological thresholds, sometimes irreversibly.The failure to perceive these societies as part of the Earth System, and act accordingly, is increasingly associated with the emergence of interdependent and complex risks – that are mostly global in scope and unprecedented in scale – affecting the security, viability and resilience of both social and ecological systems at all levels. This, in turn, continuously unveils our incapacity to efficiently manage these risks by using the same value systems, which are the main cause of their emergence. Failure to mitigate and adapt to climate change, biodiversity loss, man-made environmental disasters, and the collapse of many ecosystems represent, among others, the chief risks to social systems. These risks affect the human food chain, health and socio-economic development with many implications for well-being, productivity, and even regional and domestic security. Similarly, many risks affecting social systems, such as poverty, conflicts, displacement, injustice, inequalities, etc. are increasingly induced by ecological systems' dynamics, especially environmental and climate changes. As it is recently expressed, of all the risks to the globe, it is in relation to the environment that the world is most clearly sleepwalking into catastrophe. In general terms, such dynamics urgently press us to rethink the nature of interaction between social and ecological systems from different perspectives and new paradigms. The social systems currently bear the main responsibility to change their relationship with the ecological systems, given the available capacities (i.e. knowledge, technology, power of action) that can be mobilized to reverse destructive trends. The shifts to be made should cover all aspects of interaction between the two systems such as: The integration and restructuring of governance frameworks (multilevel norms, actors, values and deliberations…) from a SES perspective; the reorganization of production and consumption systems far from the growth model and consumerism; the elaboration of mitigation and adaptation measures from a resilience and viability perspective; and the consideration of imposing approaches and paradigms while elaborating and implementing response mechanisms. SES2019 Objectives & Approach The upcoming International Conference SES2019 — as the 5th edition of a series of science-policy fora organized by CERES along with many partners — is an opportunity to deepen the debate about Social-Ecological Systems (SES). The approach consists of: - Assessing the structural factors of SES vulnerability in an era of global risks and insecurity dynamics; - Identifying areas of SES interactions, integration and synergy; Assessing the ability and inability of existing response mechanisms (governance frameworks, conceptual referential, cultural patterns and values...) to foster the resilience and viability of SES; and - Promoting approaches and ways of action to reverse undesirable trends. Speakers from different perspectives will be provided the opportunity to present their research, insights, and successful practices, and explore innovative options to guide future processes of change with regard to the resilience and viability of SES. The Conference topics are multidisciplinary (enabling fruitful interactions between numerous scientific fields) and relevant to policy-making processes (enabling interactions among researchers/experts/practitioners and decision makers from different scales and spheres). Tracks & Sub-thèmes The structure of SES2019 consists of the following four thematic tracks across which different sessions will be formed to address related topics in an innovative way. Prospective speakers are recommended to send proposals covering the following areas of research from multidisciplinary and multi-scale (global, regional and local) perspectives. The lists of sub-themes within each track are only indicative, therefore other areas of research linked to the conference key tracks may be considered. TRACK 1 l IDENTIFICATION OF STRUCTURAL DRIVERS OF VULNERABILITY, CRISES & INSECURITY TRACK 2 - INTERDEPENDENCE OF SOCIAL-ECOLOGICAL SYSTEMS: AREAS OF INTEGRATION AND SYNERGY TRACK 3 l ASSESSING SOCIAL-ECOLOGICAL SYSTEMS THROUGH THE GENDER LENS TRACK 4 l IDENTIFICATION AND ASSESSMENT OF EXISTING RESPONSE MECHANISMS FROM EMERGING APPROACHES AND PARADIGMS + SHIFTS TO BE MADE TO FOSTER THE VIABILITY AND RESILIENCE OF SOCIAL-ECOLOGICAL SYSTEMS","date_start":"2019-10-24","date_end":"2019-10-26","important_dates":{"abstract":"","full":"2019-06-01","notification":"","final":""},"topics":["Life Sciences","Ecology","Climate Change"],"location":{"virtual":"","full":["Agadir","Morocco"],"name":"","street":"","city":"Agadir","state":"","ZIP":"","country":"Morocco"},"organizers":["CERES"],"societies":[],"indexes":[],"emails":[]}