{"name":"21st Annual Drug Discovery Summit and 8th Annual Drug Design & Medicinal Chemistry Congress","series":"","short":"","website":"https://bit.ly/33r8ULN ","content":"Join over 400 leaders, experts and scientists at the renowned R&D Series, helping to shape the future of drug discovery and development at Oxford Global’s 20th Annual Drug Discovery Summit and 7th Annual Discovery Chemistry and Drug Design Congress, 26th – 27th May 2020, Berlin, Germany. The events are aimed at VPs and senior directors of discovery in biology and chemistry from global pharmaceutical and biotech organisations. New for 2020, the event features focused R&D leaders sessions on Drug discovery Modalities and AI in drug development. It will also highlights successful strategies in delivering On Target Discovery, Phenotypic/Crispr Screening, Applications Of Organ-In-A Chip Platforms As Well As Tissue And 3D Culture For Disease Modelling. Empowering Drug Discovery with Chemical Biology, senior experts will also learn about enabling technologies that facilitate quicker drug development timelines such as protein degradation tools, target-based discovery techniques including RNA as novel targets. Do not miss out on cutting edge insights into computational chemistry and drug design methods. Key opinion leaders joining our events include: • Steve Rees, Vice President Discovery Biology, AstraZeneca R&D Biopharmaceuticals Discovery Sciences • Ulrich A.K. Betz, Vice President Innovation, Department Head Future Insight, Merck KGaA • Thorsten Thormann, Vice President, Research, LEO Pharma • Alex Gouliaev, Vice President, Amgen • Michael R. Myers, Senior Director, LRL - Due Diligence, Eli Lilly and Company • Oliver Rausch, CSO, Storm Therapeutics The two-day congress format combines dedicated networking breaks, pre-organised 1-2-1 meetings and our popular drinks reception. The exhibition hall and poster presentation spaces offer a relaxed and professional environment for discussion These events form part of the R&D Series EU and are co-located with our 2nd Annual Neuroscience in Discovery & Development Congresses. View the Agenda: https://bit.ly/34wMgmE For more information contact g.alonso@oxfordglobal.co.uk or visit the website: https://bit.ly/33r8ULN Go Social: Join our Drug Discovery & Development Network on LinkedIn, follow us on Twitter @drugdiscovery1 and & join the conversation at #RNDSeries20","date_start":"2020-05-26","date_end":"2020-05-27","important_dates":{"abstract":"","full":"2020-05-26","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal","Drug development & safety"],"location":{"virtual":"","full":["Berlin","Germany"],"name":"","street":"","city":"Berlin","state":"","ZIP":"","country":"Germany"},"organizers":["Oxford Global"],"societies":[],"indexes":[],"emails":["g.alonso@oxfordglobal.co.uk"]}