{"name":"3rd International Conference on Research in Management and Economics","series":"","short":"IMECONF","website":"https://www.imeconf.org","content":"The 3rd International Conference on Research in Management and Economics, 11 – 13 September, 2020 in Brussels, Belgium, encourages all to present their recent research work. This conference is considered a prestigious event organized with a motivation to provide excellent international platform for the academics, researchers, managers, industrial participants and students to share their research findings with the global experts. All full paper submissions will be peer reviewed and evaluated based on originality, technical and/or research depth, accuracy and relevance with the theme of the conference. TOPICS: MANAGEMENT Public Administration Quality Management Operations Management Critical Management Information System Management Strategic Management Organizational Behavior and Human Resource Management Information Technology Management Tourism Management Marketing Management Foresight Management Project Management Financial Management Insurance Management Behavioral Sciences in Business Management Business Management Operations Management Investment Management Tax Management Expense Management ECONOMICS Microeconomics Macroeconomics Econometrics Economic Systems Development Economics Agricultural Economics Economic Planning Urban Economics Energy Economics International Economics Banking Taxation and Tax Advice International Taxation CONFERENCE THEMES AND TOPICS The conference is seeking submissions related to the following conference topics: Management and Economics .Other related topics will also be considered. Submitted abstracts will be evaluated by the Scientific Committee. If abstract is accepted, author agrees to send full text paper, including results, tables, figures and references. All submissions should report original and previously unpublished research results no matter the type of research paper you are presenting. Full text papers (.docx and .doc) will be accepted by Electronic Submission Form. Manuscripts should meet the format set by the Conference committee and are subject to review. Please submit your papers via ONLINE SUBMISSION FORM. – For more information about the conference, you are welcome to contact the organizing committee directly via info\\[at\\]imeconf.org . Important Deadlines are: Paper Submission Deadline: 17 August, 2020 Early Registration Deadline: 12 June, 2020 Late Registration Deadline: 27 August, 2020 Conference Dates: 11\\_ 13 September, 2020 We encourage you to invite colleagues to participate in the conference and submit original research for the conference Call for Papers","date_start":"2020-09-11","date_end":"2020-09-13","important_dates":{"abstract":"","full":"2020-08-17","notification":"","final":""},"topics":["Business","Economics","Business and Economics"],"location":{"virtual":"","full":["Brussels","Belgium"],"name":"","street":"","city":"Brussels","state":"","ZIP":"","country":"Belgium"},"organizers":["Acavent"],"societies":[],"indexes":[],"emails":[]}