{"name":"RehabWeek 2019","series":"","short":"","website":"https://go.evvnt.com/356886-2?pid=4868","content":"We are pleased to invite you to RehabWeek 2019, which will take place from 24 - 28 June 2019 in Toronto, Canada. RehabWeek brings together six different conferences in the field of rehabilitation technology to foster cross-disciplinary communication and develop relationships with different key players. The six participating societies are: - International Consortium on Rehabilitation Robotics (ICORR) - International Industry Society in Advanced Rehabilitation Technology (IISART) - International Functional Electrical Stimulation Society (IFESS) - American Congress of Rehabilitation Medicine Conference (ACRM) - Rehabilitation Engineering and Assistive Technology Society of North America (RESNA) - International Society for Prosthetics and Orthotics (ISPO Canada) During this week you will have access to an outstanding international platform with presentations and discussions on research, development, standards, and applications in rehabilitation medicine and technology. Join us in advancing the field of rehabilitation technologies by exchanging ideas and sharing experiences with engineers, clinical researchers and clinicians from all around the world. We look forward to welcoming you to Toronto - the most culturally diverse city in the world and the perfect place to unite the most inspiring, innovative, and successful minds in rehabilitation technology. Kind regards, Dr Milos Popovic Chair of the RehabWeek Steering Committee URLs: Tickets https://go.evvnt.com/356886-0?pid=4868 Facebook https://go.evvnt.com/356886-3?pid=4868 Twitter https://go.evvnt.com/356886-4?pid=4868 Price: Visit website for details and savings: USD 0.0 Speakers: David Putrino, Deborah Backus, Mark Stephan, Claude Tardif, Katherine Kuchenbecker, Geoff Fernie, Milos Popovic Venue details: Metro Toronto Convention Centre,255 Front Street West, Toronto, M5V 2W6, Canada Time: 8:00 am - 8:00 pm","date_start":"2019-06-24","date_end":"2019-06-28","important_dates":{"abstract":"","full":"2019-06-23","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education, teaching"],"location":{"virtual":"","full":["Toronto","Canada"],"name":"","street":"","city":"Toronto","state":"","ZIP":"","country":"Canada"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}