{"name":"Supply Chain and Product Compliance Using RoHS, REACH, and Conflict Minerals","series":"","short":"","website":"https://www.complianceonline.com/supply-chain-and-product-compliance-using-rohs-reach-and-conflict-minerals-webinar-training-703871-prdw?channel=Brownwalker","content":"This training program will offer an in-depth look at three important product regulations focused on materials compliance and ethical sourcing, along with the tools and policies needed to implement them. Why Should You Attend: The European Union and the United States are leading the world in product regulations focused on environmental compliance and ethical sourcing. Compliance is mandatory in order to continue manufacturing, shipping, and selling products in Europe and the U.S. It is required that companies comply with the use laws and limits for each material, along with documenting the appropriate due diligence, and completing the mandatory government reporting requirements. This webinar will illustrate why, as the number of monitored substances continues to rise, it is important for companies to develop the programs, processes, and tools that will help prevent future enforcement actions. Areas Covered in the Webinar: Overview of three of the most important materials regulations, the processes, and the programs needed RoHS 1 and 2 Compliance REACH Compliance US Dodd-Frank Conflict Minerals Reporting Improving data collection by using Jig 101, IEC 62474, IPC 1752 Managing suppliers with procurement contracts Effectively using technology for tracking and managing compliance Who Will Benefit: This webinar will provide valuable assistance to all personnel in: Product design Supply chain compliance Responsible sourcing Supply chain risk management Environmental compliance Social compliance and auditing Corporate social responsibility","date_start":"2022-02-23","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}