{"name":"Developing a Risk-Based Audit Program","series":"","short":"","website":"https://www.complianceonline.com/developing-a-risk-based-audit-program-webinar-training-703566-prdw?channel=Brownwalker","content":"In this webinar attendees will gain an understanding of how to develop a practical tailored action plan for their own audit function. Whether you have been charged with establishing a risk audit framework for your organization, want to increase the effectiveness of the existing risk-based audit process or wish to benchmark against emerging best practice, this is the webinar for you. Why Should You Attend: Corporations are becoming more and more aware of the risks facing them in the expanded Environment of Business now facing them. Increasingly management is taking a risk management role and Internal Audit is being called to assist at corporate and strategic risk management levels. Those planning Internal Auditing department activities face the recurrent task of allocating expected resources to an apparently ever-expanding universe of demands. One means to focus limited resources is the use of appropriate risk analysis techniques. This webinar is designed to provide auditors and audit management with the abilities to develop a Risk-Based Audit Program draft. Areas Covered in the Webinar: Risk analysis and Internal Auditing The use of Risk-based auditing as an integrated approach Risk and materiality Audit risk prioritization Risk and materiality The structured risk approach Who Will Benefit: CEO/CFO Board Members Internal Audit Management Internal Auditors External Auditors","date_start":"2022-02-24","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}