{"name":"Statistical Elements of Implementing ICH Guidelines","series":"","short":"","website":"https://www.complianceonline.com/statistical-elements-implementing-ich-guidelines-seminar-training-80018SEM-prdsm?channel=Brownwalker","content":"Why Should You Attend: Most organizations have programs and procedures but they contain holes or fall short in the implementation of the tools and techniques used to apply proper statistical reasoning and analysis to ICH guidelines. Statistics can help you to better understand, implement, and track processes covered by the ICH guidelines? This 2-day seminar explores the unique challenges facing quality functions of pharmaceutical and biotechnology companies. Attendees will learn practical implementation solutions as well as best practice descriptions that will allow management to effectively assess, manage and mitigate risk of poorly designed studies. Participants will learn statistical methods related to ICH guidelines and will discover how regulatory agencies, such as the FDA expect organizations to meet these guidelines. This seminar will provide attendees with an understanding of the fourteen ICH Quality guidelines as relates to statistical guidance and analysis. The course will provide tools, techniques and insight that will allow participants to immediately begin implementation of the information learned within their organization/firm. Learning objectives: Upon completion of the course, you will be able to: Compare FDA requirements to ICH guidelines. Perform comparative analyses and regression analysis. Know the difference between confidence and tolerance intervals. Calculate the appropriate sample size. Calculate the probability of risk. Areas covered: Day 1: Review ICH Quality Guidelines (Q Series) Q1 Stability Testing Q2 Analytical Validation Q3A-3E Impurities Q4 Pharmacopoeias Q5A-5E Quality of Biotechnological Products Q6A-6B Specifications Q7 Good Manufacturing Practice Q8 Pharmaceutical Development Who will Benefit: Quality Managers Assay Development Scientists Quality Analysts Research Scientists Risk Managers","date_start":"2022-01-19","date_end":"2022-01-20","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}