{"name":"Green Urbanism – 3rd Edition","series":"","short":"","website":"https://www.ierek.com/events/green-urbanism-3rd-edition","content":"✪ Brief Introduction: The 3rd international academic conference on «Green Urbanism (GU)» this year (2019) is in association with Università degli Studi di Roma \"Tor Vergata\". The conference will be held in Rome, Italy at 11 – 13 December 2019\\. The conference aims to achieve sustainability and resilience of urban environments as those are the key challenges of our time. GU-2019 provides a unique opportunity for researchers to discuss and publish the latest advancements in various aspects of sustainability. The conference will include prominent keynote speakers from academia and practice to maximize opportunities for knowledge exchange. ✪ Conference Key Topics: 1\\. City Urban Form and Natural Resources 2\\. Urbanization of Rural Area: Energy, water and food security 3\\. Strengthening the Connection between City Center and its Gateways 4\\. Sustainable Public Transportation and Mobility Systems 5\\. Creative Environments: Sustainable Places of Living, Working and Recreation 6\\. Green Infrastructures and Social Services 7\\. Green Buildings: Designing Buildings with Nature and with Technologies 8\\. Energy-efficiency in the Built Environment 9\\. Waste Management, Pollution and Health Risks 10\\. Climate Responsive Architecture: Solar Architecture and Renewable Energies 11\\. Green Buildings and districts in passive designs: Daylight in Buildings and Nature Ventilation 12\\. Innovative and Eco-friendly Materials for the Building Envelope 13\\. Strategies for new cities proposals in developing countries 14\\. Towards Zero-waste city 15\\. Landscape, gardens, streetscapes and urban biodiversity 16\\. Water, Local food and short supply chains 17\\. Formulating the Principles of Green Urbanism 18\\. Urban governance, leadership and best practice in education, research and knowledge 19\\. Urban Sprawl 20\\. Smart Cities 21\\. Urban Environments 22\\. Resilient Urbanism ✪ Call for Papers: Call for papers is now open to be published in international journals by Springer and IEREK Press. Authors (researchers) can submit their abstracts through GU conference’s official webpage at ierek.com or send it as attached file to email to gu@ierek-scholar.org ✪ Benefits of Participation: - International publication of research papers - Oral presentations by authors - Unique presentations by keynote speakers - Tour visits to special locations in Rome, Italy - Accredited certificate - Hard & Soft copy of conference proceedings - Invitation letter - Different submission format (Full Paper – Short Paper – Poster Session) - Discussion panels - Double-Blinded revision process by featured scientific committee Much more to find by visiting the conference’s official webpage: https://bit.ly/2NO67Gp ✪ Contacts & More Info: Website: https://www.ierek.com/events/green-urbanism-3rd-edition/ Email us: gu@ierek-scholar.org Messenger: m.me/guconference Phone: +201093188470 | +20233037810","date_start":"2019-12-11","date_end":"2019-12-13","important_dates":{"abstract":"","full":"2019-10-10","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental","Sustainable Development and Engineering"],"location":{"virtual":"","full":["Rome","Italy"],"name":"","street":"","city":"Rome","state":"","ZIP":"","country":"Italy"},"organizers":["IEREK"],"societies":[],"indexes":[],"emails":["gu@ierek-scholar.org"]}