{"name":"Organic Process Research And Development Conference","series":"","short":"OPRD","website":"https://go.evvnt.com/616372-3?pid=4868","content":"The efficient conversion of a chemical process into a process for manufacture on tonnage scale has always been of importance in the chemical and pharmaceutical industries. However, in the current economic and regulatory climate, it has become increasingly vital and challenging to do so efficiently. At Organic Process Research And Development Conference, you will hear detailed presentations and case studies from top international chemists. Our hand-picked programme of speakers has been put together specifically for an industrial audience. They will discuss the latest issues relating to synthetic route design, development and optimisation in the pharmaceutical, fine chemical and allied fields. Unlike other conferences, practically all our speakers are experts from industry, which means the ideas and information you take home will be directly applicable to your own work. The smaller numbers at our conferences create a more intimate atmosphere. You will enjoy plenty of opportunities to meet and network with speakers and fellow attendees during the reception, sit-down lunches and extended coffee breaks in a relaxed and informal environment. Together, you can explore the different strategies and tactics evolving to meet today's challenges. URL: Tickets: https://go.evvnt.com/616372-0?pid=4868 Prices: Early Bird Fee: EUR 1499.0, Conference Fee: EUR 1799.0, Academic Fee: EUR 600.0 Speakers: Our programme includes 17 international speakers. Time: 9:00 am to 5:00 pm Venue Details: Hyperion Hotel Basel, 12 Messeplatz, Basel, 4058, Switzerland","date_start":"2020-09-21","date_end":"2020-09-23","important_dates":{"abstract":"","full":"2020-09-20","notification":"","final":""},"topics":["Medicine & Health","Public-Health","Healthcare"],"location":{"virtual":"","full":["Basel","Switzerland"],"name":"","street":"","city":"Basel","state":"","ZIP":"","country":"Switzerland"},"organizers":["Scientific Update Ltd"],"societies":[],"indexes":[],"emails":[]}