{"name":"4th International Conference on Multi-Disciplinary Research Studies and Education","series":"","short":"ICMDRSE 2021","website":"http://icmdrse.com","content":"One of the primary motives of the 4th International Conference on Multi-Disciplinary Research Studies and Education (ICMDRSE-2021) to be held in Kuala Lumpur, Malaysia, on the 29th - 30th June 2021 is to spur unique discoveries in terms of countering conventional challenges faced in everyday engineering activities and technologies. Technology is progressing at a very fast pace, which currently is weighing heavily on the earth's bounty of natural resources and causing serious damage to the environment. The price for this large-scale and mass expansion in all forms of daily life is being paid for in the form of climate change. Today, dangerous pollution levels and global environmental degradation endangers the very existence of life on our planet. Now, more than ever, there is an urgent need for professionals from all sectors of engineering and science to come together and work together to find sustainable solutions to sustain economic growth without harming the environment in any way whatsoever. It is unquestionably necessary to devise new strategies and improved technologies that are environmentally self-sustaining. Scientific discoveries and technological innovations to meet the demands of the waste management, energy sector, the manufacturing sector, industrial automation, transportation, and other sectors, must now focus on the ecological footprint. The conference will cover topics from diverse disciplines to bestow their innovative schemes for sustainable growth.","date_start":"2021-06-29","date_end":"2021-06-30","important_dates":{"abstract":"","full":"2021-04-30","notification":"","final":""},"topics":["Engineering & Technology","Electrical/ Electronic","Engineering Science & Technology"],"location":{"virtual":"","full":["Kuala Lumpur","Malaysia","Malaysia"],"name":"","street":"","city":"Kuala Lumpur","state":"Malaysia","ZIP":"","country":"Malaysia"},"organizers":["IFERP"],"societies":[],"indexes":[],"emails":[]}