{"name":"Balancing Work and Life in a Virtual World","series":"","short":"","website":"https://bit.ly/34W6it9","content":"Though there has been a recent trend toward employers offering remote working and telecommuting arrangements, being forced to work from home unexpectedly can be daunting and overwhelming. This webinar will give you the most proven tools and productivity techniques on how to juggle work and personal time effectively. You might even get so comfortable with it that you’ll want to continue working virtually after the crisis is over! Why Should You Attend Are you having trouble focusing? Working long hours at home and not know when to stop? Are family members home who usually aren’t in the house? Are you feeling isolated or disconnected from your work team? Not sure how to use virtual technology? Worried about being laid off? By attending this webinar, you will learn how you can mitigate the pitfalls of working from home. Discover how to set up your workspace effectively, how to best use your time, how to balance work and family time at home, proven self-care practices, how to manage your boss’s anxiety and expectations and how to use the features of remote technology such as ZOOM. After attending this webinar, you will feel more productive and comfortable working from home and be able to navigate more effectively in the coming months. Objectives of the Presentation Learn how to balance work and life while working remotely or managing a remote workforce to ensure future success and prevent burnout! Areas Covered in the Session » Potential pitfalls of working from home » Managing your workspace and work schedule » Negotiating with family members » How to use technology to bridge the \"visual\" gap » How to use remote work tools such as Zoom and Slack » Proven self-care techniques » Best practices for working remotely with your work team » What to \"measure\" to make sure your work is getting done » Managing your boss’s expectations and \"staying in the know\" » Benefits of working remotely » Should you continue to work from home when the crisis is over? Who Will Benefit » Anyone working from home or doing work remotely or virtually To Register (or) for more details please click on this below link: https://bit.ly/34W6it9 Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2020-12-21","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Human-Resources"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["AbideEdict"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}