{"name":"HR Investigations: Conducting Workplace Misconduct Interviews","series":"","short":"","website":"https://www.complianceonline.com/hr-investigations-conducting-workplace-misconduct-interviews-webinar-training-700418-prdw?channel=Brownwalker","content":"One of the most challenging tasks for any HR Professional or manager is investigating workplace misconduct. In this session participants will learn how to conduct such investigations & structure questions to get answers during the investigation process. Description In this initial session participants will learn how to structure and deliver questions to get answers. Why Should You Attend: One of the most challenging tasks for any HR Professional or manager is investigating workplace misconduct. Yet 60% of the Fortune 500 Companies will experience fraud, inventory loss, embezzlement, and a host of other employee conceived acts of workplace misconduct during the next year. Getting answers from employees during investigatory interviews is always difficult, but it is easier when you use proven interview theory and applications. In this initial session participants will learn how to structure and deliver questions to get answers. Areas Covered in the Webinar: How to structure employee misconduct interviews to get the answers you need Investigation Framework Construction Issue: Type of Misconduct Witness Webbing Investigation Grid Preparation for and the Characteristics of a Good Interview Facilitating Employee Communication Even When it is Against Their Interest Communication Inhibitors Communication Facilitators Introductory Questioning Strategies Who Will Benefit: This Webinar will be an invaluable resource to HR Professionals and Managers who find themselves in the position of questioning employees about a full range of employee misconduct issues. Employees who will benefit directly are: Senior HR Professionals who deal with Hostile Work Environment & Sexual Harassment complaints Staff HR Professionals who investigate workplace theft, inventory loss, vandalism, accidents, and financial schemes Small Business owners who wear multiple hats and must deal with employee misconduct issues Managers and Supervisors who deal with line employees on performance and conduct issues In-House Lawyers conducting workplace investigations for the Company Private Investigators Labor Consultants","date_start":"2021-10-13","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Human-Resources"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}