{"name":"Int'l Conference on Solar Photovoltaic Technology","series":"","short":"CSPT 2019","website":"http://www.deconf.org/conference/CSPT2019","content":"Int'l Conference on Solar Photovoltaic Technology (CSPT 2019) Conference Date: December 6-8, 2019 Conference Venue: Sanya, China Website: http://www.deconf.org/conference/CSPT2019/ Online Registration System: http://www.deconf.org/RegistrationSubmission/default.aspx?ConferenceID=1185 Email: workshop12@163.com Int'l Conference on Solar Photovoltaic Technology (CSPT 2019) will be held from December 6-8, 2019 in Sanya, China. This conference will cover issues on High efficiency photovoltaic cells, Photovoltaic systems, Photovoltaic technology, Solar Cell Materials and Structures, Solar energy and energy systems, etc. CSPT 2019 dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal，please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: workshop12@163.com Tel: +86 15172479625 QQ: 3025797047 WeChat: 3025797047 Attendance Methods 1.Submit full paper ( Regular Attendance+Paper Publication+Presentation ) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract ( Regular Attendance+Abstract+Presentation ) 3\\. Regular Attendance ( No Submission Required ) Conference Topics Absorber Materials Cadmium telluride photovoltaics Copper indium gallium selenide solar cell Crystalline silicon Solar Cells Flat-plate thin film photovoltaics Heterojunction Solar Cell High efficiency photovoltaic cells Homojunction Solar Cells Monocrystalline silicon Solar Cells Multi-junction solar cell Perovskite solar cell Photovoltaic concentrators Photovoltaic Energy Conversion Photovoltaic systems Photovoltaic technology Photovoltaics and electricity Polycrystalline silicon Solar Cells Renewable energy cost Silicon thin-film cells Solar Cell Device Solar Cell Materials and Structures Solar cells Solar Cells and Solar Energy Conversion Solar energy and energy systems Solar energy and integrated storage systems Solar field structure Solar heating systems Solar photochemical applications Solar photovoltaic technologies Solar power plants Solar power systems Solar thermal collectors Solar thermal power Surface-Barrier Solar Cells Thin-film solar cell","date_start":"2019-12-06","date_end":"2019-12-08","important_dates":{"abstract":"","full":"2019-11-06","notification":"","final":""},"topics":["Engineering & Technology","Renewable Energy/Nuclear"],"location":{"virtual":"","full":["Sanya","China"],"name":"","street":"","city":"Sanya","state":"","ZIP":"","country":"China"},"organizers":[""],"societies":[],"indexes":[],"emails":["workshop12@163.com"]}