{"name":"4th International Conference on Advanced Materials Research and Manufacturing Technologies","series":"","short":"AMRMT 2019","website":"http://www.amrmt.org","content":"Call for paper 2019 4th International Conference on Advanced Materials Research and Manufacturing Technologies (AMRMT 2019) August 08-11, 2019｜Oxford, UK http://www.amrmt.org/ 2019 4th International Conference on Advanced Materials Research and Manufacturing Technologies (AMRMT 2019) is organized by Hong Kong Society of Mechanical Engineers, sponsored by South China University of Technology and Swinburne University of Technology, contracted by St Anne’s College, Oxford.The conference will be hosted in Oxford, UK from Aug. 8-11, 2019! ●Publication and Indexing Options# 1: Author can submit full paper to publish paper in IOP Conference Series: Materials Science and Engineering(ISSN: 1757-899X),which will be indexed by Ei Compendex, CPCI and other academical databases. Options# 2: Author need to submit an abstract before July 20, 2019 firstly, then, submit full paper after the conference to publish in the special issues of following SCI indexed journals. 1)Journal of Materials and Manufacturing Processes: Online ISSN: 1532-2475 2)Journal of Surface Engineering: OnlineISSN: 1743-2944 3)International Journal of Smart and NanoMaterials Online ISSN: 1947-542X 4)Proceedings of the Institution of Mechanical Engineers, Part L: Journal of Materials: Design and Applications. #The Conference Proceeding of AMRMT 2018 was published in IOP Conference Series: Materials Science and Engineering (Volume 436) and indexed by Ei Compendex. ●AMRMT 2019 Speaker 1.Prof. Ruxu Du,South China University of Technology, China Fellow, Society of Manufacturing Engineers (SME),Fellow, America Society of Mechanical Engineers (ASME),Fellow, Hong Kong Institute of Engineers (HKIE). 2.Prof. Bob Tait, University of Cape Town, South Africa Prof. Bob Tait was Head of Department of the Mechanical Engineering Department, a registered Professional Engineer (Pr. Eng.), and a past national president of the South African Professional Institution: SAIMechE.Prof. Tait is a specialist in the field of fracture mechanics and fatigue. Title of Speech: Facets of controlled fracture in poly-crystalline diamond. 3.Prof. Kikuo Kishimoto, Tokyo Institute of Technology, Japan Professor Emeritus, Tokyo Institute of Technology, Fellow, National Institute for Education Policy Research, Honorary Chair Professor, National Taiwan University of Science and Technology. Title of Speech: Research in multi-material structures and interfacial mechanics in Japan; the past and future. 4.Prof. Alan Kin-Tak Lau,Swinburne University of Technology, Australia Professor Alan Kin-tak Lau was appointed Pro Vice-Chancellor (Research Performance and Development) in April 2016\\. He is also appointed as Independent Non-Executive Director of the King’s Flair International (Holdings) Limited and also elected as International Vice President of The Institution of Mechanical Engineers (IMechE). He is Fellow of European Academy of Sciences and European Academy of Sciences and Arts. 5.Prof. Jagannathan Sankar, North Carolina A&T State University, USA Director-NSF/ERC for Revolutionizing Metallic Biomaterials,White House Millennium Researcher,Director -Center for Advanced Materials and Smart Structures (CAMSS). Title of Speech: Mag (Mg) ical Metal - Revolutionizing Biodegradable Implant Technologies to Light-weighting Structures and Applications ●Topics of interest for submission include, but are not limited to: 3D scanning and printing technologies Advanced machining technologies Advanced manufacturing processes Advanced materials Biomaterials Composite materials and repairs Energy materials and composites Functional materials structural health monitoring sensors and actuators More topics can be found at: http://www.amrmt.org/CFP.html ●Paper Submission 1.You can choose to submit your paper directly to amrmt@smehk.org 2.You can submit your full paper through electronic submission system: https://cmt3.research.microsoft.com/AMRMT2019 ●Call for participants 1,Presenter:If you are interested in attending the conference and presenting your research to all the attendees, you are welcome to send the title and abstract of your speech to us through amrmt@smehk.org. 2,Listener:If you are interested in attending the conference to know other scholar's research achaivements and share with them your ideas, you are welcome to send the registration form to us through amrmt@smehk.org. 3,Reviewer:Experts in the area of Advanced Materials Research and Manufacturing Technologies are welcome to join the conference as reviewer. If you are interested in reviewing the papers, please send your latest CV to amrmt@smehk.org. ●Contact Us: If you have any question, please feel free to contact our conference secretary. Ms.Sophia Liu Tel:+852-30506862 Welcome you to contact us by Email to amrmt@smehk.org Wechat: HKSME15756362251 http://www.amrmt.org/","date_start":"2019-08-08","date_end":"2019-08-11","important_dates":{"abstract":"","full":"2019-07-10","notification":"","final":""},"topics":["Engineering & Technology","Material/Nanotechnology"],"location":{"virtual":"","full":["Oxford University","United Kingdom"],"name":"","street":"","city":"Oxford University","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Hong Kong Society of Mechanical Engineers"],"societies":[],"indexes":[],"emails":["amrmt@smehk.org"]}