{"name":"HIPAA Breach Evaluation and Reporting - What Qualifies as a Reportable Breach","series":"","short":"","website":"https://www.complianceonline.com/hipaa-breach-evaluation-reporting-webinar-training-705214-prdw?channel=Brownwalker","content":"There are several steps that must be taken to determine if an incident is a breach, and whether or not that breach is reportable. Determining whether to report or not is not necessarily straightforward, but there are guidelines to follow to help at every step of the way. If the evaluation of necessity to report is not done correctly, you may not make the right decisions about reporting and be subject to penalties for non-compliance upon an investigation of a breach by HHS. Penalties for non-compliance can up to millions of dollars in cases of willful negligence, so it is essential to evaluate incidents to see if they are reportable breaches, and act properly on the evaluation. Why Should You Attend: The HIPAA Breach Notification Rule has been in effect since 2010 and was significantly modified in 2013\\. We will discuss the origins of the rule and how it works, including interactions with other HIPAA rules and penalties for violations. Whenever there may be a privacy issue involving Protected Health Information, there may be a reportable breach under the HIPAA regulations. Not all privacy violations are reportable breaches, though, so it is essential to have a good process for evaluating incidents to see if they have resulted in a reportable breach. Any privacy rule violation that results in an acquisition, access, use, or disclosure of PHI in violation of the HIPAA Privacy Rule may be a breach, unless the incident is one of the defined exceptions from the definition. A breach is reportable unless the information was secured or destroyed in the incident, or unless a risk analysis shows that there is a low probability of compromise of the information, based on at least four factors defined in the rules. We will examine how to determine if a privacy violation is potentially a breach according to the definition, and then describe the subsequent steps in the evaluation, if it is determined that the definition has been met. We will discuss the exceptions to the breach definition for inadvertent internal uses, or when it can be determined that the information could not be retained in any way by the receiving party. Areas Covered in the Webinar: The definition of a Breach under HIPAA Evaluating the Privacy violation Reviewing the exceptions to the definition of a breach What is good enough encryption according to the rules Performing the Risk Analysis to determine the necessity to report Ransomware and Breaches – When to Report Avoiding Breaches The most common causes of breaches","date_start":"2021-12-01","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}