{"name":"Scopus-Indexed IEEE International Conference on Artificial Intelligence and Smart Systems","series":"","short":"ICAIS 2021","website":"http://icaise.in/2021","content":"Recent years have witnessed the evolution of Artificial Intelligence \\[AI\\] techniques like deep learning, machine learning, pattern recognition, Natural language processing \\[NLP\\], and computer vision and their revolutionary applications in the emerging smart city and industrial automation applications. In this scenario, AI provides smart and efficient tools for smart energy systems to perform smart electricity generation, emergency response, and delivery. The integration of renewable energy sources into the smart grid is made easier by using Artificial intelligence technologies. Meanwhile, Machine Learning the subset of Artificial intelligence provides some security and privacy assessment tools to the evolving smart energy grids. As Artificial Intelligence \\[AI\\] techniques are still remaining in the initial stage to revolutionize the way we generate, transmit and consume the energy in the smart city and industrial infrastructure. It is clearly known that the integration of AI in smart energy models will deliver a wide range of potential research opportunities to the smart energy management community. The main goal of the International Conference on Artificial intelligence and Smart Systems \\[ICAIS 2021\\] organized by JCT College of Engineering and Technology, Coimbatore, Tamilnadu, India on 25-27, March 2021 is to propose, share and exchange innovative Artificial Intelligence \\[AI\\] solutions to enhance the efficiency, stability, robustness, and security of smart energy systems.","date_start":"2021-03-25","date_end":"2021-03-27","important_dates":{"abstract":"","full":"2021-03-01","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Artificial intelligence"],"location":{"virtual":"","full":["Coimbatore","India"],"name":"","street":"","city":"Coimbatore","state":"","ZIP":"","country":"India"},"organizers":["JCT College of Engineering and Technology"],"societies":[],"indexes":[],"emails":[]}