{"name":"36th World Conference on Applied Science, Engineering & Technology","series":"","short":"","website":"https://wcaset.com/bangkok","content":"We would like to warmly welcome you to the 36th World Conference on Applied Science, Engineering, and Technology (WCASET 2021) organized by the Institute For Engineering Research and Publication (IFERP) which will be held in Bangkok, Thailand from 29th – 30th July 2021\\. WCASET is the leading academic and Industry gathering for presenting novel and fundamental advances in the field of Applied science, Engineering and Technology. As WCASET continues to increase in quality and prestige and will explore the new horizon of innovations from distinguished researchers, scientists, and eminent authors in academia and industry working for the advancements from (entire) world. WCASET brings together academicians, education researchers, students, and practitioners from many countries while creating a great opportunity for collaboration and networking among the universities and institutions for promoting research and developing technologies. WCASET aims to disseminate the latest research findings and advances on all aspects of Engineering & Technology, Management, Education & Technology and Applied Science. It also provides an interdisciplinary platform for researchers, practitioners and educators to present and discuss the most recent innovations and trends in the evolving world. To provide opportunities for discussion and information sharing platforms for researchers from various organizations, investors, and industrialists are regarding their findings, technology, policies and services. WCASET conference series features an extraordinary forum for researchers to explore their knowledge base in the evolving world","date_start":"2021-07-29","date_end":"2021-07-30","important_dates":{"abstract":"","full":"2021-06-20","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Bangkok","Thailand"],"name":"","street":"","city":"Bangkok","state":"","ZIP":"","country":"Thailand"},"organizers":["IFERP, Technoarete"],"societies":[],"indexes":[],"emails":[]}