{"name":"37th World Conference on Applied Science Engineering & Technology","series":"","short":"","website":"https://wcaset.com/indonesia","content":"Theme Of The Conference : \"Technological Developments & modern trends in Applied Science and Advanced Engineering\" 37th World Conference on Applied Science Engineering & Technology (37th - WCASET) is organized by IFERP on 18th & 19th August 2021 at Indonesia. WCASET Indonesia conference 2021 will explore the new horizon of innovations from distinguished researchers, scientists and eminent authors in academia and industry working for the advancements in Applied Science, Engineering and Technology from all over the world. 37th WCASET aims to bring together Academicians, Scientists, Research scholars and Students, to share and disseminate information on knowledge and scientific research works related to multidisciplinary topics and confers the practical challenges encountered and the solutions adopted. The conference will create a path to establish a research relation for the authors and listeners with opportunities for collaboration and networking among the universities and institutions for promoting research and developing technologies. WCASET aims to bring together leading academic scientists, researchers and research scholars exchange and share their experiences and research results on all aspects of Engineering & Technology , Management , Education & Technology and Applied Science. Convene the world’s experts to advance knowledge about innovative technologies and present new research findings and promote and enhance global scientific and community collaborations in synergy with other professional associations. Supplement core reading by engaging in a technical discussion.","date_start":"2021-08-18","date_end":"2021-08-19","important_dates":{"abstract":"","full":"2021-05-14","notification":"","final":""},"topics":["Education / Legal / Other","Education","Business Management"],"location":{"virtual":"","full":["jakarta","Indonesia"],"name":"","street":"","city":"jakarta","state":"","ZIP":"","country":"Indonesia"},"organizers":["Institute For Engineering Research and Publication"],"societies":[],"indexes":[],"emails":[]}