{"name":"Gender Research Workshop “The Female Gaze in Cinema”","series":"","short":"","website":"https://genderstudies.lcir.co.uk/gender-research-workshop-female-gaze","content":"Gender Research Workshop “The Female Gaze in Cinema” 11 July 2021 – London/Online 1pm-4pm (London Time) organised by London Centre for Interdisciplinary Research and Academic LAB Film has long been a male-dominated industry, but for decades female directors against all odds have made an indelible mark on cinema. Today there is growing recognition of the important contributions made by women to the world of moving image, with audiences calling for more opportunities to be given to female screenwriters, cinematographers, editors, producers, performers and directors in a bid to defeat gender inequality. In this session we will identify psychoanalytic themes contained in films directed by women, placing a special focus on the feminine experience portrayed in stories told by women. There will be an opportunity to collectively discuss the ways in which cinema can evolve in order to more authentically depict female desire, fears and subjectivity. The following films will be discussed (advance viewing is optional): The Souvenir (Joanna Hogg, 2019) Prevenge (Alice Lowe, 2016) The Headless Woman (Lucrecia Martel, 2008) The Party (Sally Potter, 2017) The Invitation (Karyn Kusama, 2015) Water Lilies (Céline Sciamma, 2007) Mary Wild is the creator of the PROJECTIONS lecture series at Freud Museum London, applying psychoanalysis to film interpretation. Her interests include cinematic representations of mental illness, doppelgängers and the unconscious in the genres of horror, science fiction and documentary. Mary also co-hosts the PROJECTIONS Podcast available on iTunes and Spotify. The workshop is designed for students, young scholars and independent researchers with a particular interest related to gender studies. It will allow them to deepen theoretical and methodological knowledge and critical thinking in gender studies. All the registered participants who will attend the workshop will receive certificates. In order to book a place, please register on http://registration.lcir.co.uk by 10 May 2021\\. Registration fee is 45 GBP Contact email address: workshops@lcir.co.uk","date_start":"2021-07-11","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Social Sciences","Gender/Sexuality","gender studies (and womens)"],"location":{"virtual":"","full":["Online Event","United Kingdom"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["workshops@lcir.co.uk"]}