{"name":"Memory: Embodiment and Corporeality Online Workshop","series":"","short":"","website":"https://memory.lcir.co.uk/memory-embodiment-and-corporeality","content":"Memory: Embodiment and Corporeality Online Workshop 17 October 2020 (Timing TBC) London Centre for Interdisciplinary Research and Academic LAB Costumes and performances highlight the body memory and how people utilise the space that religion and culture provides for them to maintain personal as well as their masquerader character. By exploring the costumed body we can take a closer look at the relationship between the body, memory and performance, placing emphasis on the corporeal – that centres on the phenomenological - direct experience and cultural experience (including our bias) of our memories and lived experience. In this session, we will take a closer look at how we as research/writers summarise, make associations and express our experiences into sentences that can either appeal to our reader’s multiple senses, inspire responses, and/or help them make sense of the world through our experiences. The workshop is designed for students, scholars and independent researchers with a particular interest related to body, culture, memory and embodiment. It will use a mixture of group discussion, Q&A, and critiques and will be facilitated by Dr R. de Matas - educator (FHEA), editor in chief at the Interdisciplinary Discourses, Education and Analysis Journal (IDEA), and editor and founder of Festival Culture, Research and Education (FCRE). All the registered participants who will attend the workshop will receive certificates. In order to book a place, please please fill in the Booking Form and send it to memory@lcir.co.uk by 15 September 2020\\. After you receive a confirmation of booking, please register onhttp://registration.lcir.co.uk. Registration fee: 45 GBP","date_start":"2020-10-17","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Social Sciences","Other","memory studies"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["London Centre for Interdisciplinary Research and Academic LAB"],"societies":[],"indexes":[],"emails":["memory@lcir.co.uk"]}