{"name":"4th MEMORY, MELANCHOLY AND NOSTALGIA - International Interdisciplinary Conference","series":"","short":"","website":"https://memorynostalgia.ug.edu.pl","content":"CFP: In our modern world, which some have argued to be disjointed while immersing itself ever deeper in crisis, the turning back towards “the olden days” and the ensuing nostalgia constitute a noticeable phenomenon, both individually (the memory of biography) and collectively (the memory of History). Another important – and seemingly also quite noticeable – phenomenon is the longing for something vague, indefinite or never existent. Hence, during our interdisciplinary conference we would like to concentrate on the phenomena of nostalgia and melancholy. We are interested in all expressions of longing for the past, from the reassuring and action-propelling ones to those which paralyze us, bringing despair and utter dejection. We want to describe the experience of nostalgia and melancholy in its multifarious manifestations: psychological, social, historical, cultural, philosophical, religious, economic, political, artistic, and many others. We will also devote considerable attention to how these phenomena appear and transform in artistic practices: literature, film, theatre, and visual arts. This is why we invite researchers representing various academic disciplines: anthropology, history, psychology, psychoanalysis, sociology, politics, philosophy, economics, law, literary studies, theatre studies, film studies, memory studies, migration studies, consciousness studies, dream studies, gender studies, postcolonial studies, medical sciences, psychiatry, cognitive sciences, design, project management and other. Different forms of presentations are encouraged, including case studies, theoretical investigations, problem-oriented arguments, and comparative analyses. We will be happy to hear from both experienced scholars and young academics at the start of their careers, as well as students. We also invite all persons interested in participating in the conference as listeners, without giving a presentation. We hope that due to its interdisciplinary nature, the conference will bring many interesting observations on and discussions about the role of memory, melancholy and nostalgia in the past and in the present-day world. Our repertoire of suggested topics includes but is not restricted to: I. Memory and Affects - unwanted memory - nostalgia or melancholy? - non-melancholic nostalgia - nostalgia and longing - the healing power of nostalgia - nostalgia as an illness - nostalgia and depression - nostalgia and psychoanalysis II. Common Experiences - nostalgic epochs - nostalgic nations - nostalgic generations - nostalgia and the myth of eternal return - nostalgia, melancholy and totalitarianisms - nostalgia and war - nostalgia and melancholy of the expelled - nostalgic patriotism - nostalgia and nationalism - nostalgia and gender - nostalgia and religion - nostalgia and language - nostalgia and melancholy in the postmodern world - nostalgia and post-memory III. Individual Experiences - return to childhood - nostalgia for something indefinite - nostalgia for the future - nostalgia for a traumatic experience - nostalgia, melancholy and old age - nostalgia, melancholy and death - nostalgia, melancholy and mourning - nostalgia, melancholy and love - nostalgia, melancholy and imagination - nostalgic phantasms - nostalgic dreams IV. The Arts - nostalgia and melancholy as a theme in literature, film, and theatre - nostalgic literature - nostalgic cinema - literature and the arts as a vehicle of memory - literature, theatre and film in search of lost time - nostalgic literary genres - melancholic artists V. Society - nostalgia and political movements - nostalgia, melancholy and memory places - nostalgia, melancholy and memorials - nostalgia, melancholy and incentives - nostalgia, melancholy and community development - nostalgia, melancholy and migration - nostalgia, melancholy and meaning-making - nostalgia, melancholy and drive to change - nostalgia and product development - nostalgia and melancholy in the work environment - nostalgia and melancholy in international development - nostalgia and melancholy in leadership - nostalgia and melancholy in policy Please submit abstracts (no longer than 300 words) of your proposed 20-minute presentations, together with a short biographical note, by 31 October 2019 both to: conferencenostalgia@gmail.com and nostalgiaoffice@tlen.pl","date_start":"2019-12-09","date_end":"2019-12-10","important_dates":{"abstract":"","full":"2019-10-31","notification":"","final":""},"topics":["Social Sciences","Psychology","interdisciplinary"],"location":{"virtual":"","full":["Gdansk","Poland"],"name":"","street":"","city":"Gdansk","state":"","ZIP":"","country":"Poland"},"organizers":["INMIND SUPPORT"],"societies":[],"indexes":[],"emails":["conferencenostalgia@gmail.com","nostalgiaoffice@tlen.pl"]}