{"name":"11th International Conference on Knowledge Management and Information Systems - KMIS 2019","series":"","short":"","website":"http://www.kmis.ic3k.org/ ","content":"Knowledge Management (KM) is a discipline concerned with the analysis and technical support of practices used in an organization to identify, create, represent, distribute and enable the adoption and leveraging of good practices embedded in collaborative settings and, in particular, in organizational processes. Effective knowledge management is an increasingly important source of competitive advantage, and a key to the success of contemporary organizations, bolstering the collective expertise of its employees and partners. There are several perspectives on KM, but all share the same core components, namely: People, Processes and Technology. Some take a techno-centric focus, in order to enhance knowledge integration and creation; some take an organizational focus, in order to optimize organization design and workflows; some take an ecological focus, where the important aspects are related to people interaction, knowledge and environmental factors as a complex adaptive system similar to a natural ecosystem. An information system (IS) is an organized system for the collection, organization, storage and communication of information. This is of paramount importance to manage organized activities in any kind of enterprise, often referred to as knowledge management (KM), i.e. a multidisciplinary approach to achieve organizational objectives by making the best use of knowledge to support operations, management and decision-making. KMIS aims at becoming a major meeting point for researchers and practitioners interested in the study and application of all perspectives of Knowledge Management and Information Systems. \n Conference Topics: \n Area 1: KMIS - International Conference on Knowledge Management and Information Systems \n \\- Best Practices & Communities of Practice \n \\- Information Security \n \\- Intelligent Information Systems \n \\- KM Strategies and Implementations \n \\- Knowledge Management Projects \n \\- Learning Organization & Organizational Learning \n \\- Requirements Engineering \n \\- Business Intelligence & CRM \n \\- Social Networks and the Psychological Dimension \n \\- Studies, Metrics & Benchmarks \n \\- Tools and Technology for Knowledge Management \n \\- Business Process Management \n \\- Communication, Collaboration and Information Sharing \n \\- Digital Libraries \n \\- eGovernment \n \\- eLearning \n \\- Enterprise Information Systems \n \\- Impact Measurement of Knowledge Management \n \\- Information Science and Information Systems \n \\- Information Technology and Information System Research \n \\- eCommerce Technology and Issues in Computer Information Systems \n \\- Computer Systems Enterprise Architecture, Enterprise Resource Planning \n \\- Ethical and Legal Issues of IT \n \\- Big Data and Analytics \n \\- Blockchain Technology and Applications \n \\- Enterprise Systems \n \\- Information Systems Security and Information Privacy Protection \n \\- Healthcare Information Systems \n \\- Management and Organisational Issues in Information Systems ","date_start":"2019-09-17","date_end":"2019-09-19","important_dates":{"abstract":"","full":"2019-07-12","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Vienna","Austria"],"name":"","street":"","city":"Vienna","state":"","ZIP":"","country":"Austria"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":[]}