{"name":"Basic Cleanroom Technology, Operation and Contamination Control in a Nutshell","series":"","short":"","website":"https://www.complianceonline.com/cleanroom-technology-operation-contamination-control-webinar-training-706142-prdw?channel=Brownwalker","content":"Attend this webinar to understand the Clean Room regulations, design, classification, sources and types of particles. Learn how to create a common ground between these varying regulations and requirements. It will discuss the types of micro-organisms, routine monitoring processes, and typical mitigation steps to effective contamination control. Why Should You Attend: This 90-minute accredited training will offer a basic understanding of the Clean Room regulations, design, classification, sources and types of particles. The different classifications and limits for Clean room particles as it applies to various regulatory bodies’ and requirements (US, EU and ISO) will be addressed. Special attention will be given to understanding how to create a common ground between these varying regulations and requirements will be discussed. The types of micro-organisms, routine monitoring processes, typical mitigation steps in ensuring an effective contamination control through monitoring, sanitization, cleaning, personnel training, gowning, and material, product and personnel flow during a clean room operation will be addressed. Learning Objectives: Discuss the basics, background and types of clean room classification. Described sources of clean room contamination, settling rates and contamination control process. List the various classifications/levels, regulations, and clean room applications based on classification. Describe clean room validation process and rationale for performing the validation process. Discuss the routine clean room monitoring processes and investigations associated with a clean room monitoring excursion. Areas Covered in the Webinar: Module#1 (Basics, Background and Clean room Classification) Summary of the Regulations Guiding Clean room Technology, Design and Verification Types of Clean room Classifications and Requirements EU Requirements and Classification USP Requirements and Classification ISO Requirements and Classification Bridging the Gap between the various Regulatory Bodies’ and Requirements Types and Sizes of Clean room Particles Typical Uses of Various Levels of Clean room Classifications Who Will Benefit: This webinar will provide a great resource to personnel involved within the following departments in the Pharmaceutical, Biotechnology, Diagnostics, Drugs, Cell Therapy, Biologics and Medical Device industries: Quality Control Manufacturing/Production Senior Management Regulatory Affairs Quality Assurance Compliance Design Engineers Facility, Maintenance and Engineering Test Contractors However, if you are already familiar with how to achieve an effective Clean room technology and contamination control, you may recommend this webinar to anyone in your company that may require additional knowledge about this subject.","date_start":"2022-02-08","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Life Sciences","Biotechnology/ Bioinformatics"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}