{"name":"How to Prioritize Your Collections","series":"","short":"","website":"https://bit.ly/2Yqh4UB","content":"Is your Credit Department unsure of which customers to contact and in what order to efficiently manage your AR asset? Are they careening from one crisis to the next? Does it seem to have a high staff level? An old Marketing maxim is that “half my advertising is wasted, but I don’t know which half”. Does this apply to your collection efforts? Learn: 1\\. The benefits of optimal Collection Prioritization 2\\. The principles and techniques of implementing an excellent Collection Prioritization methodology tailored to your firm's unique customers and capabilities. At its worst, collections can be a reactive process, focusing efforts on: (a) receivables in danger of becoming uncollectible (bad debt), (b) past due receivables which have triggered a \"hold order\" condition. Optimal Collection Prioritization enables your AR management effort to be proactive to minimize the occurrence of the two conditions cited above. It will address at-risk AR earlier in the process, thus minimizing its value. It will also resolve the vast majority of past due AR conditions that delay/hold orders, thereby ensuring a continuous supply of products and services to the majority of your customers. The result: happier customers, smoother order fulfillment and incrementally increased revenue. In addition, substantial increases in productivity can be achieved with optimal Collection Prioritization. World class AR management is defined as top 10 Percentage AR management performance and cost efficiency. Properly focused collection efforts increase effectiveness and efficiency. Why Should You Attend Collection prioritization guides the collection process by specifying in what order customers are contacted to secure payment of open receivables (i.e., AR). This applies to both B2B and B2C receivables. It focuses the scarce collection resources in your organization to minimize AR delinquency, risk of bad debt loss, and cost of AR management, while maximizing cash flow from AR. Objectives of Today’s Discussion: » To define how an effective collection prioritization methodology is developed » To recognize that every organization’s Collection Prioritization will be different. Key elements to be discussed are: Alignment with Your Organization’s Strategy » Go to Market » Trade Credit How to Develop the Right Collection Prioritization for Your Organization » Know your AR portfolio: dimensions, customer characteristics, etc. » Define Prioritization Parameters » Blending Multiple Priorities Benefits: Effectiveness and Efficiency An optimal Collection Prioritization Methodology must be carefully tailored to an individual company. No two companies will have the same Go to Market or Trade Credit strategies, the same product/service mix, or the exact same customer base. These differences must be incorporated into the Collection Prioritization strategy to achieve optimal results. Objectives of the Presentation » To define how an effective collection prioritization methodology is developed » To recognize that every organization’s Collection Prioritization will be different. Areas Covered in the Session Introduction Align with Your Organization’s Strategy » Go to Market » Trade Credit How to Develop the Right Collection Prioritization for Your Organization » Know your AR portfolio: dimensions, customer characteristics, etc. » Define Prioritization Parameters » Blending Multiple Priorities Benefits: Effectiveness and Efficiency » Case Studies and Conclusion » Questions Who Will Benefit » CFO’s » Controller » Treasurers » Customer Financial Services Managers » Credit Managers To Register (or) for more details please click on this below link: https://bit.ly/2Yqh4UB Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-02-23","date_end":"","important_dates":{"abstract":"","full":"2021-02-23","notification":"","final":""},"topics":["Business","Finance"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}