{"name":"Searching for Truth in Documentary Storytelling - Online Workshop","series":"","short":"","website":"https://life-history.lcir.co.uk/online-workshop","content":"The documentary film is a non-fictional motion picture that shapes and interprets factual material; the intent is to capture \"reality\" with a view to inform, educate, entertain, or maintain a historical record. Documentaries have contributed to the development of realism in movies; the style has been influential from the earliest days of filmmaking. Critic and theoretician Bill Nichols has characterised it as \"a practice, a cinematic tradition, and a mode of audience reception that remains without clear boundaries\". In this workshop, we will focus on the psychological angle in the documentary genre, examining films that deal with the tricky question of identity, the difficult search for truth, and the emergence of narrative, highlighting the discrepancies at each stage. The proposition is that in documentaries, just as in the psychoanalytic method, subjectivity is challenging to depict authentically, and depends on the willingness to relinquish strongly binding rules about the self and what we believe to be true. Films: The Imposter (2012) dir. Bart Layton The Wolfpack (2015) dir. Crystal Moselle Cobain: Montage of Heck (2015) dir. Brett Morgen Risk (2016) dir. Laura Poitras Stories We Tell (2012) dir. Sarah Polley David Lynch: The Art Life (2016) dirs. Jon Nguyen, Rick Barnes, Olivia Neergaard-Holm Mary Wild is the creator of the PROJECTIONS lecture series at Freud Museum London, applying psychoanalysis to film interpretation. Her interests include cinematic representations of mental illness, doppelgängers and the unconscious in the genres of horror, science fiction and documentary. Mary also co-hosts the Projections Podcast, and creates exclusive content on Patreon. All the registered participants who will attend the workshop will receive certificates. In order to book a place, please register on http://registration.lcir.co.uk. Contact email: life-history@lcir.co.uk","date_start":"2022-02-06","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Social Sciences","Other","Film & Cinema"],"location":{"virtual":"","full":["Online Event","United Kingdom"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research and Academic LAB"],"societies":[],"indexes":[],"emails":["life-history@lcir.co.uk"]}