{"name":"Time and Task Management Effectiveness: Working Smarter Every Day","series":"","short":"","website":"https://bit.ly/3bUWhiI","content":"Take control of your time...and get control of your entire work day! The speed of everything has changed. Are your effective time management skills up to the challenge? Do you put off more today than you can ever accomplish tomorrow...exhaust yourself by 4:00 p.m. with only a fraction of your work done...see yourself as a decision maker who never gets around to making decisions...dread the next business meeting—or worse, going back to your desk to see what voice mails and emails await you? If you’re doing more and enjoying it less, it’s time to get out of the time trap and back to productive management! This presentation gives you practical tips for effective time management and explains how to make time a manageable resource. Why Should You Attend » Are you concerned about how much time and productivity your people are wasting? » What about lost energy, efficiency and effectiveness, especially because people are overtasked and overburdened? » Would you like to gain an extra 30 minutes each day? » Would you like to improve your concentration and increase your efficiency? If you answered “Yes” to any of these questions, then come laugh, listen and learn as Chris DeVany leads us all through those important topics, key questions and answers we all need to be able to address effectively to improve our team members’ and team’s performance! Objectives of the Presentation By attending, you will understand how to even more effectively: » Achieve better results through more effective planning and clarifying objectives » Delegate effectively and free yourself for bigger tasks » Set group goals and priorities » Eliminate the time wasters using tips for effective time management » Handle interruptions and distractions » Say no to unreasonable demands » Redirect your efforts to the most important and valid tasks » Make sure there is time in the day for you » Learn time management strategies to improve concentration and increase your efficiency Areas Covered in the Session Self-Evaluation: How Do You Manage Your Time » Take the Time-Mastery Profile® to identify how you spend your time » Highlight your strengths and challenges with time » Identify time-wasters and learn how to avoid them using time management strategies » Learn the importance of time management skills Concentration and Focus » Learn effective time management skills that will help you complete your tasks at a faster rate » Discuss how to handle distractions and interruptions—both self- and other-imposed Planning to Succeed » Refine the planning process and goal-setting system using the SMART technique Decision Making and Prioritizing » Align your priorities with your goals for better decision making » Learn about “the window of opportunity” to determine the most appropriate course of action Getting Organized » Learn the principles of organization to eliminate clutter and maintain order and effective filing systems » Learn to manage your phone, e-mail and electronic files Establishing Boundaries to Create Balance » Learn when to say “yes” and when to say “no” » Say “yes” to yourself...by saying “no” to others » Create quiet zones to think, reflect and concentrate » Build a commitment to your own time-management plan—it’s up to you! Setting SMART Goals » SMART: Specific, Measurable, Achievable, Relevant, Timely » What are my roles? » What weekly goal will I set for each role? » TOPPS: Task, Objective, Product, Program, Schedule » OPICS: Output, Product, Input, Conditions, Standards » Setting milestones » Working the Plan Who Will Benefit » CEO » Senior Vice President » Vice President » Executive Director » Managing Director To Register (or) for more details please click on this below link: [https://bit.ly/3bUWhiI ](https://bit.ly/3bUWhiI) Email: support@concordeducations.com Tel: +1-989-341-8773","date_start":"2021-12-08","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Management / Leadership","Business Management & Leadership"],"location":{"virtual":"","full":["New Castle","United States"],"name":"","street":"","city":"New Castle","state":"","ZIP":"","country":"United States"},"organizers":["ConcordEducations"],"societies":[],"indexes":[],"emails":["support@concordeducations.com"]}