{"name":"CfP: Online conference ESPAnet 2021 - Stream: Citizen science and social innovation","series":"","short":"","website":"https://kuleuvencongres.be/espanet2021/call-for-abstracts","content":"We invite you to submit abstracts - Online conference ESPAnet 2021 Stream: \"Citizen science and social innovation: Opportunities for the Local Welfare Development\" Deadline: Apr 18, 2021 https://kuleuvencongres.be/espanet2021/call-for-abstracts https://kuleuvencongres.be/espanet2021/conference-streams-1#23 Stream: \"Citizen science and social innovation: Opportunities for the Local Welfare Development\" Social innovations are usually understood as new ideas, initiatives, or solutions that meet the challenges in social security, education, employment, culture, health, environment, housing, and economic development (Vinals & Rodriguez, 2013). On the one hand, many citizen science activities serve to achieve scientific as well as social and educational goals, opening an arena for introducing social innovations. On the other hand, social innovations are further developed, adapted, or altered after the involvement of scientist-supervised citizens (laypeople or volunteers) in research and with the use of the citizen science tools and methods. Such approaches are increasingly recognized as crucial for gathering data, resolving local social problems, and creating cooperation between citizens and professional scientists. However, there are also various barriers to citizen science and social innovation (e.g., management, data quality and protection, funding, recognition of citizens’ contributions, and inclusion of innovations in public policies). In this stream, we want to gather papers on both theoretical and empirical findings. Potential topics include, but are not limited to: - The development of sustainable innovations and engagement of citizens into co-production of social services delivered by public, private, non-governmental organizations, and non-formal entities - The potential of citizen science in the improvement of local welfare programs - The roles and skills of social entrepreneurs, public managers, citizen scientists, and researchers - Research methods related to citizen science and social innovation (e.g., collective intelligence, participatory and grassroots activities, hardware and software development) - Design, evaluation, communication, and dissemination of results of the citizen science and social innovation initiatives - Governance, management, and multilevel and multisectoral approaches to citizen science and social innovation - Strategies for transferability and scaling of social innovations and citizen science projects - Good practices of collaboration between scholars and citizens in cities and communities","date_start":"2021-08-31","date_end":"2021-09-03","important_dates":{"abstract":"","full":"2021-08-31","notification":"","final":""},"topics":["Social Sciences","Political-Science","Sociology, Social Sciences"],"location":{"virtual":"","full":["Online Event","Belgium"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Belgium"},"organizers":["ESPAnet"],"societies":[],"indexes":[],"emails":[]}