{"name":"International Conference on Gene Editing and CRISPR Technologies","series":"","short":"GECT 2020","website":"http://www.marchconf.org/conference/GECT2020","content":"International Conference on Gene Editing and CRISPR Technologies (GECT 2020) Conference Date: June 19-21, 2020 Conference Venue: Xi'an, China Website: http://www.marchconf.org/conference/GECT2020/ Online Registration System: http://www.marchconf.org/RegistrationSubmission/default.aspx?ConferenceID=1210 Email: paper\\_service@163.com International Conference on Gene Editing and CRISPR Technologies (GECT 2020) will be held from June 19-21, 2020 in Xi'an, China. This Conference will cover issues on Gene Editing and CRISPR Technologies. The aim for researchers, engineers, academicians as well as industrial professionals from all over the world to present their latest research results and advanced research methods. Invited Speakers: Prof. Xinyi Lu, Nankai University, China Prof. Tao Gong, Donghua University, China Prof. Kiyoshi NOKIHARA, HiPep Laboratories, Japan Prof. M. Michael Gromiha, Indian Institute of Technology (IIT) Madras, India If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal，please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: paper\\_service@163.com Tel: +86 15527426990 QQ: 3025797047 WeChat: 3025797047 Attendance Methods 1.Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Biomedicine Cas Genes and CRISPR Subtypes Clinical Application of Gene Editing CRISPR Biology CRISPR Systems and CRISPR Technologies CRISPR-Associated Systems Delivery and specificity of CRISPR-based tools Different Gene Delivery Systems Disease Models Effective Delivery for Genes in Vitro Gene Drive Gene Editing Technology and Gene Editing Efficiency Gene Editing-Based Safety and Ethics Gene Function Gene Knock In and Genomic Screening Gene Therapy Genetic Vaccines Genetics and Genomic Medicine Genome Editing and Genome Regulation Genome Engineering and DNA repair In Situ Gene Editing In Vitro Genetic Depletion In Vivo Gene Editing Locus Structure Molecular Epigenetics Nano-Therapy Off-Target Effects Optimizing Repair of CRISPR-Generated DNA Breaks Programmable Gene Expression Regulatory, Safety Aspects of Cell and Gene Therapy Repeated Sequences RNA Editing Technology RNA Guided Nuclease for Genome Modifications RNAi and Gene Therapy RNAi based Screening Technologies Single Base Editing Spacer Acquisition, Biogenesis, and Interference Targeted Gene Replacement Vectors for Gene Therapy Viral Gene Therapy","date_start":"2020-06-19","date_end":"2020-06-21","important_dates":{"abstract":"","full":"2020-05-19","notification":"","final":""},"topics":["Life Sciences","Biotechnology/ Bioinformatics"],"location":{"virtual":"","full":["Xi'an","China"],"name":"","street":"","city":"Xi'an","state":"","ZIP":"","country":"China"},"organizers":[""],"societies":[],"indexes":[],"emails":["_service@163.com"]}