{"name":"Scholars Webinar on Drug Delivery and Nanomedicine","series":"","short":"","website":"https://scholarsconferences.com/drugdelivery-nanomedicine-webinar/about-conference","content":"This webinar focuses on the design parameters, synthesis and clinical validation of new drug delivery vehicles, and is designed to bridge the gap between nanomedicine and drug delivery needs with a particular focus on gene editing therapeutics, RNA therapeutics, sustained release technologies and immune-engineering. Several new polymers, linkers, proteins, and nanoparticles for drug delivery will be presented, as well as recent clinical trial data generated from drug delivery companies that are pioneering the development of new experimental therapeutics. The field is rapidly evolving and it is having a significant clinical impact but there are still a number of challenges associated with accelerating the pace in transitioning into the clinic. Recent advances in chemistry, genetics and biochemistry have majorly impacted drug delivery and nanomedicine based therapeutics and this conference aims to make these new developments accessible to a broad audience. This webinar will discuss common compliance and adherence issues with a variety of drug delivery devices and potential methods for improving these issues. Drug Delivery and Nanomedicine Webinar serve as a platform for the association between experts in the areas of Pharmaceutics, Drug Delivery, Drug Discovery, Nanomedicine, Biotechnology, and nanotechnology around the world and sight in allocate some distinctive research and translational studies on various advances in the related fields. The Drug Delivery and Nanomedicine webinar attribute a wide range of innovative drug delivery technologies that could prospect develop the delivery of various types of drugs, including proteins, peptides, oligonucleotides, biologics, and small molecules. It is to interchange the knowledge on cutting-edge technologies, research and development, new therapeutics, and summons in the field of pharmaceutical sciences and drug delivery.","date_start":"2020-06-25","date_end":"","important_dates":{"abstract":"","full":"2020-04-10","notification":"","final":""},"topics":["Medicine & Health","Medical-Speciality"],"location":{"virtual":"","full":["Online Event","United Kingdom"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United Kingdom"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}