{"name":"Calculating the Z-Score \"Bankruptcy Predictor\" Model","series":"","short":"","website":"https://www.complianceonline.com/z-score-bankruptcy-predictor-model-calculation-webinar-training-705795-prdw?channel=Brownwalker","content":"This webinar will teach how to calculate the Z-score and “correctly” interpret it based on a straight-forward scale. Five-step “key ratio analysis ” plan (liquidity, activity, leverage, operating performance, and cash flow analysis) will be displayed and tied into the comprehensive calculation of the Z-score. The session will conclude with a review of using sophisticated software such as Moody’s Lending Cloud to calculate both the Z-score and key ratios. Why Should You Attend: What is the Z-score and how is it used to predict a company’s bankruptcy? Attend this proactive webinar and learn how to calculate the Z-score and “correctly” interpret it based on a straight-forward scale. Additionally, a five-step “key ratio analysis” plan (liquidity, activity, leverage, operating performance, and cash flow analysis) will be displayed and tied into the comprehensive calculation of the Z-score. The session will conclude with a review of using sophisticated software such as Moody’s software to calculate both the Z-score and key ratios. Areas Covered in the Webinar: Determine how to calculate and correctly interpret the Z-score in order to predict a company’s bankruptcy Methodology Sampling techniques and sample size Altman’s model (Z-score) Hypothesis Data Analysis and Findings Correlation Analysis Learn a five-step “key ratio analysis” plan and tie the plan into the Z-score calculation Learn the five-step key ratio analysis model. Explore in-depth cash flow analysis applications. Calculate the lendable real estate equity model. Understand industry comparisons and software applications. Review the Z-score bankruptcy prediction and sustainable growth models. Review the use of software to calculate both the Z-score and key ratios Who Will Benefit: Credit Managers Commercial loan officers CFOs CPAs Controllers Financial managers Auditors Practitioners who provide accounting, tax or consulting services to businesses","date_start":"2021-12-08","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Accounting"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}