{"name":"2nd Edition of World Congress on Infectious Diseases","series":"","short":"","website":"https://infectiouscongress.com","content":"Magnus Group extends a warm invitation to you to join its prestigious event “2nd Edition of World Congress on Infectious Diseases” which will be held in Rome, Italy during June 17-18, 2022\\. The conference will proceed with its unique theme “Stepping Stones in Infectious Disease Prevention, Control, and Cure.” Infectious Diseases conference's purpose is to examine past triumphs and lessons learned, as well as to look forward to new areas of action in the fight against infectious disease. Speakers will discuss diseases such as Coronavirus Disease (COVID-19), Neuro Infectious Diseases, Problems in Infectious Disease Practice, Viral Infectious Diseases, Fungal Infectious Diseases, Blood Infectious Diseases from many viewpoints, including surveillance, diagnosis, economic effect, and risk mitigation/minimization techniques. This three-day convention brings together key specialists from all over the globe to discuss the most recent developments that can have an impact on you and your patient. The focus will also be on prevention and protection. With a review of prevalent infectious disease along with prevention and detections, you can be sure of the most recent updates in the field. Infection control in private and public practice, as well as the most recent immunization issues and recommendations, round out the event. Simply put, this is a convention that you simply cannot afford to miss. Contact Email: infection@magnusscigroup.com Phone: 1 (702) 988 2320 Whatsapp: +1 (540) 709 1879 Dates: June 17-18, 2022 Venue: Rome, Italy Website: https://infectiouscongress.com/ Upcoming Infectious Disease Conferences: Infectious Disease Conferences 2022 | Infectious Disease Conference | Infectious Disease Conference 2022 | Infectious Disease Congress | Infectious Disease 2022 | Infectious Disease Congress 2022 | Congress | Medical conferences 2022 | International Infectious Disease Conference | Infectious Disease Infectious Disease Research Conferences | Infectious Disease Research Conferences 2022 | Infectious Disease science Conference Italy | Italy Infectious Disease Conferences | Infectious Disease Hybrid Conferences | Infectious Disease Online Conference | Infectious Disease Workshops | Infectious Disease symposiums | Infectious Disease Meetings | International Infectious Disease Meetings | World Infectious Disease Conferences | Infectious Disease Webinars | Top Infectious Disease Events","date_start":"2022-06-17","date_end":"2022-06-18","important_dates":{"abstract":"","full":"2022-06-06","notification":"","final":""},"topics":["Medicine & Health","Other"],"location":{"virtual":"","full":["Rome","Italy"],"name":"","street":"","city":"Rome","state":"","ZIP":"","country":"Italy"},"organizers":["Magnus Group"],"societies":[],"indexes":[],"emails":["infection@magnusscigroup.com"]}