{"name":"5th Edition of Global Conference on Pharmaceutics and Novel Drug Delivery Systems","series":"","short":"","website":"https://magnusconferences.com/pharmaceutical-sciences","content":"Building upon the success of our previous conferences on Pharmaceutical Sciences, we are delighted to announce our forthcoming “5th Edition of Global Conference on Pharmaceutics and Novel Drug Delivery Systems” Pharma 2022 scheduled during March 28-30, 2022 in Singapore with both onsite and virtual versions. The conference will proceed with its original theme “Footprints of Next Generation Drug Delivery on Pharma Industry.” The congress intention is to provide the latest and most up-to-date knowledge about pharmaceuticals. The purpose of this conference is to bring together healthcare professionals, pharmacists, biotechnologists, professors, and students to discuss how we can use digital tools to improve the health and pharma commercial model whist educating patients and bridging the gap between knowledge and information. This prestigious annual congress is a must-attend annual event for everyone interested in staying informed on industry innovation and growth. Leaders in the life sciences industry from across the world will address the most recent developments in areas such as drug discovery, clinical trials, and market access, as well as new business and healthcare frontiers. Contact Email: pharma@magnusmeetings.com Phone: 1 (702) 988 2320 Dates: March 28-30, 2022 Venue: Holiday Inn Singapore Atrium 317 Outram Road, 169075-Singapore Website: https://magnusconferences.com/pharmaceutical-sciences/ Upcoming Pharma Conferences: Pharma Conferences 2022 | Pharma Conference | Pharma Conference 2022 | Pharma Congress | Pharma 2022 | Pharmaceutics Conference | Pharmaceutical Conferences | Drug Delivery Conferences | Pharmaceutical Conferences 2022","date_start":"2022-03-28","date_end":"2022-03-30","important_dates":{"abstract":"","full":"2022-03-15","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal","Clinical pharmacology"],"location":{"virtual":"","full":["Online Event","Singapore"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Singapore"},"organizers":["Magnus Group"],"societies":[],"indexes":[],"emails":["pharma@magnusmeetings.com"]}