{"name":"World Summit on Materials Science and Nanotechnology","series":"","short":"","website":"https://researchlake.com/conferences/materials-science","content":"World Summit on Materials Science and Nanotechnology is scheduled to take place in Madrid, Spain on March 26-27, 2020\\. Materials Science 2020 aims to bring together all the Materials Scientists, Materials Engineers, Materials Researchers, Chemists, Professors, Directors & Co-Directors, Assistant Professors, Associate Professors, Emeritus Faculty, Lecturers, Research Scholars and Students from all over the world to share their knowledge. Materials Science 2020 provides a global platform to showcase and discuss recent innovations in the field of Materials Research and Nanotechnology. It also provides a great opportunity to network with peers, discover new products and services from vendors and sponsors and discover new solutions by interacting with peers physically. The theme of the conference is \"To discuss the latest advancements in Materials Research and Nanotechnology\". Research Lake is a platform where Internationally renowned researchers, highly respected professors, C-Level executives meet and connect to build up a research community and provide strategic direction to academicians and practitioners through themed conferences, scientific publications, management review, and trend analysis in the field of medicine and technology. Key Sessions Materials Research Computational Materials Science Emerging technologies in Materials Science Biomaterials and Nanomaterials Composite Materials Ceramics and Polymers Materials Synthesis and Processing Applications of Advanced Materials Semiconductors, Alloys, and Metallurgy Glass Science and Technologies Metallic and Organic Materials Advances in Graphene Research and 2D Materials Magnetic Materials Emerging Smart Materials Nanotechnology in Medicine Nanotechnology in Engineering Future of Nanotechnology Benefits and Applications of Nanotechnology Spin Electronics, Amphiphilic materials Superconductors and Advanced Engineering Polymers Biomedical devices and 3D Printing Catalysis Chemistry","date_start":"2020-03-26","date_end":"2020-03-27","important_dates":{"abstract":"","full":"2019-12-06","notification":"","final":""},"topics":["Engineering & Technology","Material/Nanotechnology","Materials science, engineering, nanotechnology"],"location":{"virtual":"","full":["Madrid","Spain"],"name":"","street":"","city":"Madrid","state":"","ZIP":"","country":"Spain"},"organizers":["Research Lake"],"societies":[],"indexes":[],"emails":[]}