{"name":"World Conference on Architecture and Civil Engineering","series":"","short":"","website":"https://www.steconf.org/conference/world-conference-on-architecture-and-civil-engineering","content":"World Conference on Architecture and Civil Engineering scheduled on March 11-13, 2022 at Berlin (Germany) is for the engineers, practitioners, scientists, researchers, scholars, and students from all around the world and it also includes the industry people to present ongoing research activities, and hence to foster research relations between Academia and industry. This Civil engineering conferences 2022 provides opportunities for the delegates to share new ideas and application experiences face to face, establish business or research relations and find global partners for future collaboration. Civil engineering conferences 2022 has brought together leading researchers, engineers and scientists in the domain of interest from around the world. All the participants have given all their supports to our conference, which are the biggest contributions to our conference’s success. It is worth noting that the series of conferences has been considered a valid scientific event in the scientific community. The increased number of paper submissions and participants in each conference is proof of this claim. All submissions are peer-reviewed; In addition, all the submitted full papers will be included in the conference proceedings and have publication opportunities in Various indexed international journals. Moreover, the organizing committee will offer the participants a city tour free of charge.","date_start":"2022-03-11","date_end":"2022-03-13","important_dates":{"abstract":"","full":"2022-02-18","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental","civil engineering"],"location":{"virtual":"","full":["Berlin","Germany"],"name":"","street":"","city":"Berlin","state":"","ZIP":"","country":"Germany"},"organizers":["STECONF"],"societies":[],"indexes":[],"emails":[]}