{"name":"Design for Safety","series":"","short":"","website":"https://www.complianceonline.com/design-for-safety-seminar-training-80632SEM-prdsm?channel=brownwalker","content":"Manufacturers of any product—from medical devices to automobiles—must create items that are, above all else, safe to use. Not only is this essential to long-term brand value and corporate success, but it’s also required by law. But while perfection is the goal, defects are bound to occur, especially in advanced products such as automobiles. When a safety defect does occur, auto manufacturers must initiate some form of recall to address the problem. Since 2013, the number of automotive recalls climbed to an average of 177 per year, up 86% from the prior experience around 1980\\. Product liability from negligence can present a substantial problem for organizations. They can result in liability of the manufacturer for deaths, injuries, fatalities, or property damage caused by its products. They can save millions of dollars by preventing recalls of their products proactively. The automotive component suppliers are also responsible for safety if they design the components and subsystems. The aerospace industry needs to improve also. A poll conducted by the Performance Review Institute (PRI) in January 2010 showed that 88% of respondents felt that their company could do a better job of measuring escapes. An escape is where defective product has been shipped to the customer prior to being identified as faulty, hence it has “escaped”. Aerospace escapes need to be taken very seriously. When they are not recognized, escapes can cause fatalities. Flawed parts have been fitted in commercial planes without anyone realizing or recognizing them as flawed parts. As a result, a number of airline crashes have occurred due to faulty fuel lines or hydraulic fittings. In another case, 20,000 parts processed improperly had to be recalled at a cost of $20,000,000\\. A good example of an escape is Boeing 737 Max. This seminar is for all the industries, all suppliers of components in any industry developing software, consumer products and services. Learning Objectives: -Ability to see potential safety concerns before the design is approved -Ability to see manufacturing safety before installing production equipment -Ability to speak up when a product cannot fail safely -Ability to completely eliminate accidents by design -Ability to eliminate manufacturing hazards by changing the product design -Ability to apply high safety principles to software design -Ability to use creativity in developing very low cost solutions -Ability to work as an efficient and effective team -Ability to convince management that return on investment in safety is at least 1000% Areas Covered: The topics of the seminar are from the most reputable organizations for safety. They are: -How to avoid writing vague, and incomplete specification -How to develop robust performance requirements to meet customer expectations for zero accidents -System safety concepts -New paradigms for avoiding liability -How to prevent scope creeps resulting in requirements volatility and design instability -Functional Hazard Analysis to prevent hazards -Functional process maps, activity diagrams, and sequence diagrams to prevent accidents -Preliminary hazard analysis -Subsystems hazard analysis -Interface hazard analysis -Operations & Support Hazard Analysis -Safety requirements for manufacturing, maintenance and repair -Human systems integration and accountability -Software safety analysis tools -How Subject Matter Experts work and brainstorm together for safety verification and validation -Management policy and accountability for product safety -This is a hands-on seminar. You can bring your company concerns and get solutions from your fellow attendees and the instructor who has 30 years of consulting experience worldwide. Who will Benefit: -Top management -Chief engineers in design and manufacturing -R&D staff -Design Engineers -Manufacturing managers and engineers -Safety staff -Quality Assurance staff -Marketing staff","date_start":"2020-07-28","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Engineering & Technology","Design"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}