{"name":"Internet, Education and Information Technology（IEIT 2021）","series":"","short":"","website":"http://www.icieit.org","content":"Conference Information: Website：http://www.icieit.org/ Conference Date: April 16-18, 2021 Venue：Suzhou, China Submission Deadline: Feb. 22, 2021 Indexing：SCI，EI Compendex，Scopus, CPCI，CNKI As a leading role in the global megatrend of scientific innovation, China has been creating a more and more open environment for scientific innovation, increasing the depth and breadth of academic cooperation, and building a community of innovation that benefits all. These endeavors have made new contribution to globalization and creating a community of shared future. To adapt to this changing world and China’s fast development in this new era, the International Conference on Internet, Education and Information Technology is to be held in April 16-18 2021\\. This conference takes “bringing together global wisdom in scientific innovation to promote high-quality development” as the theme and focuses on research fields including information technology, education, big data, and Internet. This conference aims to expand channels of international academic exchange in science and technology, build a sharing platform of academic resources, promote scientific innovation on the global scale, improve academic cooperation between China and the outside world. It also aims to encourage exchange of information on research frontiers in different fields, connect the most advanced academic resources in China and abroad, turn research results into industrial solutions, bring together talents, technologies and capital to boost development. We warmly invite you to participate in ISEMSS 2021 and look forward to seeing you in Chengdu, China. 1.Sponsor AEIC 2.CALL FOR PAPER The topics of interest for submission include, but not limited: Internet and Information Technology Computer Sciences and Internet Network Coding Cross-layer Optimization and Control Cyber-Physical Systems Network Interconnection Technology Switchboard and Router Network Based on Smart Antennas Smart Phone and Mobile Application Network Economics and Pricing Network Management Network Measurement and Analysis Cognitive, Cellular and Mobile Network Communication Architecture, Algorithm, Modeling, Assessment Information Technology and Information Systems Information Technology Applied in the Organization Automatic Control Engineering Artificial Intelligence Engineering application Other related topics Education Science Information-based Information Future Information Internet Teaching Internet Study Blended Learning Distance Education and Study Intelligent Learning Environment LTSA Education of the next generation Modernization of Education Management Educational Multimedia Education Technology System Innovative Teaching Technique Education Management Technology Education Software and Hardware Data Mining Applied in Education Information Technology Applied in the Education Management Other related topics 3.Publication \\* Submit to Conference Proceedings (EI) All papers, both invited and contributed, will be reviewed by two or three experts from the committees. After a careful reviewing process, all accepted papers of IEIT 2021 will be published in Conference Publishing Services (CPS)and will be submitted to EI Compendex, Scopus for indexing. EI Template Download: Template-IEEE.rar，No less than 4 pages \\*Submit to SCI journal Selected 10 papers will be recommended for publication in SCI journal. \\* Applied Ecology and Environmental Research（ISSN: 1589-1623, IF=0.689, 正刊） \\* Environmental Science and Pollution Research（ISSN: 0944-1344, IF=2.914, 专刊） \\* Materials（ISSN: 1996-1944, IF=2.972, 正刊） \\*All submissions must not be less than 10 pages in length，and papers should be submitted to SCI Submission System. Note: All submitted articles should report original, previously unpublished research results, experimental or theoretical. Articles submitted to the conference should meet these criteria and must not be under consideration for publication elsewhere. We firmly believe that ethical conduct is the most essential virtual of any academic. Hence any act of plagiarism is a totally unacceptable academic misconduct and cannot be tolerated. 4.Submission Methods 1.The submitted papers must not be under consideration elsewhere. 2.Please send the full paper(word+ pdf) to SUBMISSION SYSTEM 3.Please submit the full paper, if presentation and publication are both needed. 4.Please submit the abstract only, if you just want to make presentations. 5.Templates Downlow ：IEEE-Templates 6.Should you have any questions, or you need any materials in English, please contact us at contact@icieit.org 5.Registration For the publication on ISEMSS 2021 conference proceedings: Regular Registration (4 pages) 3200RMB/ per paper 500USD/per paper Manuscript numbers ≥ 3 2900RMB/ per paper 450SD/ per paper Extra Pages (Begin at Page 5) 300RMB/ per extra page 50 USD/ per extra page Attendees without Papers 1200 RMB/ per person 180 USD / per person Attendees without Papers (Groups）1000 RMB（≥ 3 people） 150 USD / per person（≥ 3 people） 6.Program April 16th 13:00-17:00 Registration April 17th 09:00-12:00 Speeches of Keynote Speakers 12:00-14:00 Lunch 14:00-17:30 Oral Presentations 18:00-19:30 Banquet April 18th 09:00-18:00 Academic Investigation 7.CONTACT US Conference Secretary: Lavender Lau E-mail: contact@icieit.org Tel: +86-13418097038 (Wechat) QQ: 918444372","date_start":"2021-04-16","date_end":"2021-04-18","important_dates":{"abstract":"","full":"2021-04-14","notification":"","final":""},"topics":["Education / Legal / Other","Education","educational technology"],"location":{"virtual":"","full":["Suzhou","China"],"name":"","street":"","city":"Suzhou","state":"","ZIP":"","country":"China"},"organizers":["AEIC(Academic Exchange Information Center)"],"societies":[],"indexes":[],"emails":["contact@icieit.org"]}