{"name":"The Emotionally Intelligent Manager: Using Your Heart as Well as Your Head to Manage Effectively","series":"","short":"","website":"https://bit.ly/2O3QUoz","content":"To manage effectively, you need to engage your emotional intelligence just as much as you engage yourself cerebrally. Using both our brain and our \"gut\" allows us to take all human factors into account. Why Should You Attend » What is emotional intelligence » What is YOUR emotional intelligence » A short 10 item questionnaire » Why it is important to know about emotional intelligence » Four Clusters of Emotional Intelligence » Techniques for utilizing your emotional intelligence to manage even more effectively » Would you like to learn more about your emotional intelligence » Would understanding techniques you can use every time to manage more effectively using your emotional intelligence interest you » How about receiving a list of sample questions you can use to manage more effectively using your emotional intelligence » Is it worth 90 minutes of your time to learn effective management techniques which can help you every day If you answered “yes” to any of these questions, then come laugh, listen and learn as Chris DeVany leads us all through those important topics, key questions and answers we all need to be able to address effectively to improve our team members’ and team’s performance! Areas Covered in the Session » What is emotional intelligence » What is YOUR emotional intelligence » A short 10 item questionnaire » Why it is important to know about emotional intelligence » Techniques for utilizing your emotional intelligence to manage even more effectively » Four Clusters of Emotional Intelligence Who Will Benefit » CEO » Senior Vice President » Vice President » Executive Director » Managing Director » Regional Vice President » Area Supervisor » Manager To Register (or) for more details please click on this below link: https://bit.ly/2O3QUoz Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-02-26","date_end":"","important_dates":{"abstract":"","full":"2021-02-26","notification":"","final":""},"topics":["Business","Management / Leadership"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}