{"name":"WiCOM, the 16th International Conference on Wireless Communications, Networking and Mobile Computing (WiCOM 2021)","series":"","short":"","website":"https://www.wicomconf.org/2021","content":"WiCOM, the 16th International Conference on Wireless Communications, Networking and Mobile Computing (WiCOM 2021) Website:https://www.wicomconf.org/2021/ Venue/Country: Xi'an, China About WiCOM 2021 WiCOM, the 16th International Conference on Wireless Communications, Networking and Mobile Computing (WiCOM 2021), is an annual conference in China since 2005\\. This conference was held in Wuhan, Shanghai, Dalian, Beijing, Chengdu, Guilin, Chongqing from 2005 to 2019\\. Each year there are 100 - 500 attendees from Asia, Europe, America, etc., and there have been quite a lot of well known experts giving plenary speeches. In 2021, WiCOM will be held in Xi'an, China from Oct. 22-24, 2021\\. You are invited to submit papers/abstracts in all areas of wireless communications, networking, mobile computing and applications. Publication and Presentation Publication: All the accepted papers will be published by a peer-reviewed open access journal that can ensure the widest dissemination of your published work, for more information, please contact us (seminarcfp@163.com). Index: CNKI and Google Scholar Note: 1\\. If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. 2\\. Please click Template for Manuscripts (below the Registration button at the top left corner) to download the Full Paper template and prepare your article according to it. The full length of one paper is suggested to be 8-10 pages (within the template format with all tables, figures and references). If your paper is over 10 pages, you will be kindly requested to pay for extra pages fees. 3\\. The simple Abstract submission should include the title, contents, keywords, authors names, affiliations and emails. The length is suggested to be controlled within 1 page and no more than 2 pages. 4\\. You will receive the review results within 3-5 working days after submission. If you do not get any notification within the time limit, please contact us as soon as possible. 5\\. You are welcome to submit papers in Chinese and please contact us for more details. Registration Fee Package A: Regular Attendance (No Submission Required) USD 400(RMB 2400) Package B: Regular Attendance+Abstract+Presentation USD 450(RMB 2700) Package C: Regular Attendance+Paper Publication+Presentation USD 600(RMB 3600) Contacts Email: seminarcfp@163.com (Seminar.Group@hotmail.com) Tel: +86 15527426990 (Monday to Friday) QQ: 1349406763 WeChat:3025797047 Twitter: conf\\_Committee Call for Papers Wireless Communications Space-Time, MIMO and Adaptive Antennas OFDM, CDMA and Spread Spectrum Modulation, Coding and Diversity Signal Processing for Wireless Communications B3G/4G Systems, WiMAX, WLAN and WPAN Channel Model and Characterization Multi-Hop and Cooperative Communications Interference Cancellation and MUD Radio Resource Management and Allocation Cognitive Radio and Software Defined Radio Satellite & Space Communications Multimedia Communications Multiple Access Techniques Optical Communications Network Technologies Wireless & Mobile Networking Wireless Sensor Networks Cognitive Radio Networks Ad Hoc, Sensor and Mesh Networking Next-Generation Networking and Internet Wireless Network Security and Privacy Networking and Information Security Network Protocol and Congestion Control QoS, Reliability & Performance Modeling Mobility, Location and Handoff Management Capacity, Throughput, Outage and Coverage Multimedia in Wireless Networks Optical Networks and Systems Services and Application Emerging Wireless/Mobile Applications Context and Location-Aware Wireless Services Wireless Telemedicine and E-Health Services Intelligent Transportation Systems RFID Technology and Application Cognitive Radio and Sensor-Based Applications Content Distribution in Wireless Home Environment Wireless Emergency and Security Systems Service Oriented Architectures, Service Portability SIP Based Services, Multimedia and Middleware Innovative User Interfaces for Multimedia Services Regulations, Standards and Spectrum Management Communications Software and Services Mobile Computing Systems","date_start":"2021-10-22","date_end":"2021-10-24","important_dates":{"abstract":"","full":"2021-09-20","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Networks, networking & communications"],"location":{"virtual":"","full":["Xian","China"],"name":"","street":"","city":"Xian","state":"","ZIP":"","country":"China"},"organizers":[""],"societies":[],"indexes":[],"emails":["seminarcfp@163.com","seminar.group@hotmail.com"]}