{"name":"hello@evvnt.com","series":"","short":"","website":"https://go.evvnt.com/1000483-0?pid=4868","content":"The summit will explore the most recent impacts of AI in Insurance including healthcare, automobiles, home, contents, travel and share insights on cutting-edge technical advancements in the Financial space including Conversational AI, Decision Making, Quantitative Trading, Personalised Banking, Fraud Detection, Risk Management, Enhanced Customer Experience and RPA (Robotic Process Automation). We will also look a where AI-based RegTech is being applied and what organizations need to be considering when implementing it to get maximum benefit. We will discover how AI is disrupting the regulatory landscape! The London AI Finance Summit is a unique opportunity to meet and hear from leading innovators, bringing together influential technologists, senior data scientists, founders, and academics altering the traditional insurance landscape with AI. The agenda includes a plethora of short and impactful presentations and panel discussions as well as fantastic networking opportunities to maximise the opportunity for meaningful connections to be made and knowledge shared at the summit. URLs: Tickets: https://go.evvnt.com/1000483-1?pid=4868 Website: https://go.evvnt.com/1000483-2?pid=4868 Website: https://go.evvnt.com/1000483-4?pid=4868 Website: https://go.evvnt.com/1000483-5?pid=4868 Website: https://go.evvnt.com/1000483-6?pid=4868 Date and Time: On Thu, Mar 17, 2022 ( 8:00 AM) - Fri, Mar 18, 2022 ( 6:00 PM) Prices: Individual Pass: GBP 895.00, Plus Pass: GBP 1295.00, Virtual Individual Pass: GBP 199.00, Virtual Plus Pass: GBP 599.00 Speakers: Joel Suss, Research Data Scientist, Bank of England , Hamaad Shah, Vice President, Columbia Threadneedle Investments , Vilmos Lorincz, Managing Director Data and AI Products, Lloyd's Banking, Alex Romanenko, AI and Data Strategy, Product Management, AIG, Susana Ponce Fremont, Head of Financial Data and Credit Risk, Tide , Leon Saunders Calvert, Head of Research and Portfolio Analytics, LSEG , Francois Mercier, Senior Data Scientist - VP, Citi , Adam McMurchie, Lead Cloud Data Engineer, NatWest , Hattie Smith, Lead Data Scientist, Aviva , Michael Natusch, Chief Science Officer, Prudential , Kate Schcheglova-Goldfinch, Senior Project Manager in FinTech, National Bank of Ukraine Venue details: etc.venues 155 Bishopsgate, 155 Bishopsgate, London, England, EC2M 4AF, United Kingdom","date_start":"2022-03-17","date_end":"2022-03-18","important_dates":{"abstract":"","full":"2022-03-16","notification":"","final":""},"topics":["Education / Legal / Other","Education","Engineering Science & Technology"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["RE•WORK"],"societies":[],"indexes":[],"emails":[]}