{"name":"2019 International Conference on Machine Learning and Intelligent Systems","series":"","short":"","website":"http://www.machinelearningconf.org","content":"\\[Scopus/Ei Compendex\\] 2019 International Conference on Machine Learning and Intelligent Systems (MLIS 2019) Website: http://www.machinelearningconf.org/ Time: November 19-22, 2019 Venue: National Dong Hwa University, Hualien, Taiwan \\*Introduction 2019 International Conference on Machine Learning and Intelligent Systems (MLIS 2019), supported by National Dong Hwa University (NDHU), is scheduled to be held in National Dong Hwa University (NDHU) in Taiwan during November 19-22, 2019\\. The event is aimed at providing a platform for knowledge exchange of the most recent scientific and technological advances and to strengthen the links in the scientific community. The plenary session of MLIS 2019 will include Keynote Speeches, Invited Speeches, Poster Presentations and Oral Presentations. \\*Brief Program: November 19th Registration November 20th Welcoming Speech, Keynote Speeches and Poster Presentation November 21st Invited Speeches and Oral Presentations November 22nd Group Tour Detail conference program will be updated a month before the beginning of the conference. \\*Call for Papers 1\\. Abstracts and unpublished full-length papers are welcome 2\\. Topics should be related to Machine Learning and Intelligent Systems 3\\. Accepted full papers will be published in the conference proceeding (indexed by Ei Compendex, Scopus, Inspec...) 4\\. All abstracts/papers should be submitted via MLIS Submission System: http://paper.academicconf.com/author/login.aspx?confname=mlis2019 \\*Topics Computational Intelligence, Data Mining, Deep Learning, Expert Systems, Human Computer Interaction, Image Processing, Natural Language Processing, Neural Networks, Pattern Recognition, Robots, Sentiment Analysis, Signal Processing, Video Processing \\*Contact MLIS2019 Organizing Committee E-mail: info@machinelearningconf.org","date_start":"2019-11-19","date_end":"2019-11-22","important_dates":{"abstract":"","full":"2019-09-27","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Biological Engineering & bioinformatics"],"location":{"virtual":"","full":["Online Event","Taiwan","Province Of China"],"name":"","street":"","city":"Online Event","state":"Taiwan","ZIP":"","country":"Province Of China"},"organizers":["National Dong Hwa University"],"societies":[],"indexes":[],"emails":["info@machinelearningconf.org"]}