{"name":"Global Summit on Public Health and Preventive Medicine","series":"","short":"GSPHPM2022","website":"https://www.thescientistt.com/public-health-preventive-medicine/2022","content":"It is a great pleasure to announce that The Scientistt will host the Global Summit on Public Health and Preventive Medicine (GSPHPM2022) will be held in Munich, Germany during May 26-28, 2022\\. GSPHPM2022 aims to bring together the renowned researchers, scientists and scholars to exchange ideas, to present sophisticated research works and to discuss hot topics in the field and share their experiences on all aspects of Public Health and Preventive Medicine. The GSPHPM2022 will be a 3 days event that means to gather the key players of the Public Health and Preventive Medicine community and related sectors. This event is launched with the aims to become an established event, attracting global participants, intent on sharing, exchanging and exploring new avenues of public health and preventive medicine-related scientific and commercial developments. A wide-ranging scientific program consisting of plenary lectures, keynote lectures, Invited lectures, parallel sessions, as well as poster sessions for young scientists covering all topics in public health and preventive medicine will be scheduled. This conference provides a wonderful opportunity for you to enhance your knowledge about the newest interdisciplinary approaches in public health and preventive medicine. Moreover, the conference offers a valuable platform to create new contacts in the field of public health and preventive medicine, by providing valuable networking time for you to meet great personnel in the field. We look forward to seeing you at GSPHPM2022 in Munich, Germany.","date_start":"2022-05-26","date_end":"2022-05-28","important_dates":{"abstract":"","full":"2022-03-28","notification":"","final":""},"topics":["Medicine & Health","Other","Public Health"],"location":{"virtual":"","full":["Munich","Germany"],"name":"","street":"","city":"Munich","state":"","ZIP":"","country":"Germany"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}