{"name":"SOP Writing, Training and Compliance in the Pharmaceutical Industry","series":"","short":"","website":"https://www.complianceonline.com/sop-writing-in-pharma-gmp-environment-seminar-training-80560SEM-prdsm?channel=Brownwalker","content":"Standard Operating Procedures (SOPs) are the basis for a large part of the day-to-day training that most pharmaceutical employees are required to perform. Still, it is not widely understood the extent of the commitments we make when we write an SOP or how the writing of the SOP can have a positive or negative impact on training or job performance. For example, there is an expectation that procedures describe the most critical processes for product manufacturing and will be followed consistently, with few if any deviations. In this course you will learn the keys to writing effective SOPs, the vital connection between the documentation and training spheres, and how to maximize this connection to improve the quality of both SOPs and training. To accomplish these goals, we will review regulatory agency expectations when an SOP is written, provide suggestions for uncovering the process in its entirety and describe it clearly and concisely, indicate how to break portions of the process(es) into logical chunks, and show how the SOP and the training program can work together harmoniously. Learning Objectives: To improve the writing of SOPs for more effective training and reduction of errors. To understand the regulatory implications of what is written in an SOP To learn the parameters of an effective SOP To distinguish a well-written SOP from a poorly written one Areas Covered : Regulatory requirements for SOPs Using process excellence tools to create a robust process and procedure What commitments you make when you put your process in writing Who will Benefit: Pharmaceutical industry, particularly those areas that develop SOPs for the manufacturing or quality monitoring of pharmaceutical products, as well as Information Technology (IT)","date_start":"2022-04-18","date_end":"2022-04-19","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}