{"name":"The Int'l Conference on Deep Learning and Computer Vision","series":"","short":"DLCV 2019","website":"http://www.janconf.org/conference/DLCV2019","content":"The Int'l Conference on Deep Learning and Computer Vision (DLCV 2019) Conference Date: December 13-15, 2019 Conference Venue: Bangkok, Thailand Website: http://www.janconf.org/conference/DLCV2019/ Online Registration System: http://www.janconf.org/RegistrationSubmission/default.aspx?ConferenceID=1201 Email: vickykongwy@126.com The Int'l Conference on Deep Learning and Computer Vision (DLCV 2019) will be held in Bangkok, Thailand during December 13-15, 2019\\. DLCV 2019 will be a valuable and important platform for inspiring Int’l and interdisciplinary exchange at the forefront of Deep Learning and Computer Vision. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal，please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: vickykongwy@126.com Tel:+86 150 7134 3477 QQ: 3025797047 WeChat: 3025797047 Attendance Methods 1\\. Submit full paper ( Regular Attendance+Paper Publication+Presentation ) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract ( Regular Attendance+Abstract+Presentation ) 3\\. Regular Attendance ( No Submission Required ) Call for Papers 3D Computer Vision 3D from Multiview and Sensors 3D from Single Images Action Recognition Adaptive Systems Biomedical image analysis Biometrics, face and gesture Computational photography, photometry Computer Vision Theory Data Mining for the Web Deep Learning Techniques Deep model-based and data-efficient reinforcement learning Efficient (Bayesian) inference for deep learning Generative models as regularization Hyper-parameter optimization Image and Video Synthesis Image/Video Processing Large-scale generative modelling Large-scale optimization Learning representations for reinforcement learning Low-level vision and Image Processing Machine Vision Model structure optimization Motion and Tracking Neurocomputing Recognition: detection, categorization, indexing and matching Robot Vision Segmentation, grouping and shape representation Semi-supervised learning Statistical learning Structured learning Temporal models with long-term dependencies Unsupervised/generative modeling","date_start":"2019-12-13","date_end":"2019-12-15","important_dates":{"abstract":"","full":"2019-11-13","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer vision"],"location":{"virtual":"","full":["Bangkok","Thailand","Thailand"],"name":"","street":"","city":"Bangkok","state":"Thailand","ZIP":"","country":"Thailand"},"organizers":[""],"societies":[],"indexes":[],"emails":["vickykongwy@126.com"]}