{"name":"Academic Writing Workshop: Reading Skills, Note-taking, Paraphrasing, Plagiarism","series":"","short":"","website":"https://academic-writing.lcir.co.uk/saturday15","content":"The workshop is designed for students, young scholars and independent researchers who would like to improve their academic writing skills in order to succeed in studies and in career. It is organised to provide maximum hands-on practice for participants. Each session will include explanations, examples, exercises, and texts to help the participants develop techniques for working productively at different stages of the scholarly writing process. The workshop will start at 10:30 and finish at 16:30, it will be divided into three sessions with breaks for tea, coffee and snacks. All the participants who will attend the workshop will receive certificates. Facilitator: Shailen Popat is a DPhil Researcher at the Oxford University Department of Education, a Senior Hulme Scholar at Brasenose College, and a Board Member of Management in Education Journal published by SAGE. Rather than reading in a linear fashion, this session will teach you to look first for key terms relating to your topic, read the beginnings and endings of chapters/articles, so that you are primed with a sense of the argument and structure of the material which should help you both to read more quickly and to engage more closely with the author’s main ideas and then how to tabulate in preparation for a literature review. Shailen will teach you to develop a more strategic approach to note-taking than simply writing down everything that looks important so you will be much more discriminating in the notes you make on a second, slower reading. The session will then train you to include full citation details for all your sources and to summarise the arguments in your own words as this helps you to understand them and avoid inadvertent plagiarism. In order to book a place, please register on https://registration.lcir.co.uk. Registration fee – 75 GBP Venue: Radcliffe Square (Lecture Room 7), University of Oxford, Brasenose College, Oxford OX1 4AJ For more information, please contact us on workshops@lcir.co.uk.","date_start":"2020-02-15","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Other"],"location":{"virtual":"","full":["Oxford University","United Kingdom"],"name":"","street":"","city":"Oxford University","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["workshops@lcir.co.uk"]}