{"name":"Essachesss - Journal for Communication Studies/Call for Papers 15(29)/ 2022/Information and Communication Technologies’ Role in the Preservation of Cultura","series":"","short":"","website":"https://www.essachess.com/index.php/jcs/announcement","content":"Call for Papers for volume 15, n° 1(29)/ 2022 ESSACHESS – Journal for Communication Studies www.essachess.com Information and Communication Technologies’ Role in the Preservation of Cultural Heritage Complete call available here: https://www.essachess.com/index.php/jcs/announcement/view/35 Special issue proposed within the framework of the LOCUS project. LOCUS is co-funded by FCT - Foundation for Science and Technology, through National Funds (PTDC/COM-CSS/29228/2017), and by the European Regional Development Fund, framed in the Operational Programme for Competitiveness and Internationalisation - COMPETE 2020, under the new partnership agreement PT2020 (POCI-01-0145-FEDER-029228). For more information, please see https://locusproject.pt Guest editors Ana MELRO, PhD, University of Aveiro, PORTUGAL e-mail: anamelro@ua.pt Lídia OLIVEIRA, Professor, DigiMedia, University of Aveiro, PORTUGAL e-mail: lidia@ua.pt Ana Carla AMARO, Professor, DigiMedia, University of Aveiro, PORTUGAL e-mail: aamaro@ua.pt This special edition is seeking contributions in English or French, either empirical or theoretical, considering the role, function and purpose of the information and communication technologies in contributing for the preservation of cultural heritage. In doing so, contributors are invited to consider (but not limited to) the following goals: 1) contribute to the reflection around cultural heritage; 2) contribute to the reflection on the interaction between communication systems and cultural heritage; 3) analyze the role of individuals in preserving cultural heritage; 4) understand how individuals, as guarantors of the communication systems development, relate to cultural heritage. Important Deadlines - May 30, 2021: submission of the proposal in the form of an extended abstract of maximum 2 pages. The proposal must include a list of recent references and 5 keywords. - June 20, 2021: acceptance of the proposal. - November 1st, 2021: full paper submission. - February 10, 2022: reviewer’s comments to be communicated to authors. - April 30, 2022: submission of paper with final revisions (after revisions). - July 2022: journal publication. Full papers should be between 6,000-8,000 words in length. Papers can be submitted in English or French. The abstracts should be in English and French (150-200 words) followed by 5 keywords. Please provide the full names, affiliations, and e-mail addresses of all authors, indicating the contact author. Papers, and any queries, should be sent to: essachess@gmail.com Authors of the accepted papers will be notified by e-mail.","date_start":"2021-05-30","date_end":"","important_dates":{"abstract":"","full":"2021-05-30","notification":"","final":""},"topics":["Social Sciences","Sociology"],"location":{"virtual":"","full":["montpellier","France"],"name":"","street":"","city":"montpellier","state":"","ZIP":"","country":"France"},"organizers":[""],"societies":[],"indexes":[],"emails":["anamelro@ua.pt","lidia@ua.pt","aamaro@ua.pt","essachess@gmail.com"]}