{"name":"The 2nd International Conference on Machine Learning and Intelligent Systems","series":"","short":"","website":"http://www.machinelearningconf.org","content":"\\*Introduction The 2nd International Conference on Machine Learning and Intelligent Systems (MLIS2020) will be held during October 25-28, 2020 in Seoul, Republic of Korea. The event is aimed at providing a platform for knowledge exchange of the most recent scientific and technological advances and to strengthen the links in the scientific community. The plenary session of MLIS2020 will include Keynote Speeches, Invited Speeches, Poster Presentations and Oral Presentations. \\*Brief Program: October 25 Registration October 26 Welcoming Speech, Keynote Speeches, Poster Presentations, Invited Speeches and Oral Presentations October 27 Invited Speeches, Oral Presentations and Welcome Banquet October 28 Field Visit Detail conference program will be updated a month before the beginning of the conference. \\*Call for Papers 1\\. Abstracts and unpublished full-length papers are welcome 2\\. Topics should be related to Machine Learning and Intelligent Systems 3\\. Accepted full papers will be published in the conference proceeding (indexed by Ei Compendex, Scopus, Inspec...) 4\\. All abstracts/papers should be submitted via MLIS Submission System: http://paper.academicconf.com/author/login.aspx?confname=mlis2020 \\*Topics Computational Intelligence, Data Mining, Deep Learning, Expert Systems, Human Computer Interaction, Image Processing, Natural Language Processing, Neural Networks, Pattern Recognition, Robots, Sentiment Analysis, Signal Processing, Video Processing \\*Contact MLIS2020 Organizing Committee E-mail: info@machinelearningconf.org","date_start":"2020-10-25","date_end":"2020-10-28","important_dates":{"abstract":"","full":"2020-08-20","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","data mining"],"location":{"virtual":"","full":["Seoul","","Korea (South)"],"name":"","street":"","city":"Seoul","state":"","ZIP":"","country":"Korea (South)"},"organizers":[""],"societies":[],"indexes":[],"emails":["info@machinelearningconf.org"]}