{"name":"Design Control for Medical Devices Including Verification/Validation","series":"","short":"","website":"https://www.complianceonline.com/design-control-medical-device-verification-validation-webinar-training-706619-prdw?channel=Brownwalker","content":"Overview of design control for medical devices with and emphasis on verification and validation of design inputs. Webinar will cover basic regulations regarding verification/validation of inputs, trace of inputs to verification/validation and techniques including statistics for proper verification/validation of design inputs. Why Should You Attend: In the development of medical device, incomplete understanding and implementation of design controls will lead to rejection of an application for approval by the FDA or rejection of a CE mark application. Incomplete, improper or missing verification and validation is a cause of many products not being approved for market. This seminar will give the participants the basics to be able to work through the concepts of design verification/validation and implement these concepts in their respective areas. Verification and validation of design inputs is a critical step in the development of medical devices. It is the objective evidence that the developer developed what they set out to develop and the final product meets its design goals and needs of the end user. Without proper verification/validation of inputs, it is not possible to prove to regulatory agencies that you have a product which is safe and effective and that it meets its design requirements. Areas Covered in the Webinar: Overview of design control flow and were verification and validation fit in Basic trace from inputs to verification and validation Methods of verification and validation of inputs including statistics Writing protocols and records Discrepancies and deviations Trace matrices form inputs to outputs Who Will Benefit: This webinar is appropriate to anyone working in design, development, marketing or support of regulated medical devices. People working in R&D, Quality Assurance, Validation, Regulatory Affairs, Marketing, Production and Product Support will benefit from this information.","date_start":"2022-02-24","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Medical-Speciality"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}