{"name":"5th Annual Genome Editing Congress","series":"","short":"","website":"https://bit.ly/2tHrM9q","content":"Over 600 senior-level delegates representing internationally renowned research & academic institutions, clinical research institutions and pharmaceutical companies. Over 20 case studies and presentations focused on the latest developments in gene editing techniques and case studies on the therapeutic applications of genome editing technologies. Including 2 Interactive Streams: • Genome Editing Techniques and Technologies • Therapeutic Applications of Genome Editing View Agenda: https://bit.ly/2s1kWe7 Co-located with the highly established 11th Annual Next Generation Sequencing & Clinical Diagnostics Congress, 7th Annual Single Cell Analysis Congress, 2nd Synthetic Biology Congress and the Digital PCR Congress. For more information contact b.copeman@oxfordglobal.co.uk. Go Social: Join our Genomics Networking Group on LinkedIn, follow us on Twitter @xgenseq & join the conversation at #GENSERIESUK19 2019 Live Webinar Applications of CRISPR/Cas9 in studying disease mechanisms Presented by Kristine Freude, Associate Professor & Director of BrainStem - Center for Excellence in Neuroscience, University of Copenhagen and Yonglun Luo, Group Leader, Aarhus University Tuesday October 1st, 2019 at 10:00am BST Register for Free: https://bit.ly/2JFbVA7 Benefits of Attending • An overview of the current available tools (repair, knockin, activation and repression of disease genes) • An assessment of the disease modeling tools compared to patient readouts • Exploration & Evaluation: How good are the model systems? What are we missing?","date_start":"2019-11-07","date_end":"2019-11-08","important_dates":{"abstract":"","full":"2019-10-15","notification":"","final":""},"topics":["Life Sciences","Biotechnology/ Bioinformatics"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":[""],"societies":[],"indexes":[],"emails":["b.copeman@oxfordglobal.co.uk"]}