{"name":"\"Faces of War\" International Conference","series":"","short":"","website":"https://warstudies.lcir.co.uk","content":"The twentieth century, violent and brutal, offers a wide spectrum of material that deserves further analysis. The Great War introduced the first aspects of modern warfare; the Second World War, even more devastating in its atrocities, advanced war further. The Cold War introduced modern society to new methods and technological advancements of warfare, beyond anything our species had seen. The thirtieth anniversary of the fall of the Berlin Wall and the collapse of Iron Curtain in 1989 altered the balance of global power yet again. Global terrorist attacks and the introduction of electronic warfare have shown us that despite the painful experiences of the past, our world still relies on war and violence to address many of its problems in an endless geopolitical game. Our conference wishes to explore the ways warfare has affected the political, cultural, social and economic realities in our quest to understand individual and national identity. We invite scholars from various fields including but not limited to philosophy, religion, theology, sociology, anthropology, history, literature, art, economics, geography, cultural and political studies to contribute to the discussion and explore topics within interdisciplinary war sudies. Conference presentations will be related, but not limited, to: Theorizing the war: types, roots, methods, strategies, theories The finances of war and financing a war Economic wars and geopolitics War and ethics and ethical wars Cultural wars and the culture of war War and religion and religious wars Terrorism and counterterrorism Experimenting in war (e.g. electronic warfare, weapons, medicine, communications, aviation) Politicizing wars and the politics of war Social and Cultural impacts of war War representation in literature, architecture and arts (e.g. music, painting, sculpture) Wartime fashion: impact and legacy Propaganda: now and then (social media, press, TV, posters) Top secret documents in public: value, use and interpretation War and the shaping of political and individual identities Oral history and the remembrance of war Trauma and psychological and psychiatric approaches (e.g. African Children Fighters, War veterans, women abuse) War and narcotics Cinematic representation of war (e.g. Vietnam, Iraq, Afghanistan) Civil Wars and their legacy (e.g. Africa, Europe and Latin America) The Wall between us: Case studies of divided countries (e.g. Germany, Ireland, Cyprus, Korea) Legacies and aftermath of wars (e.g. Afghanistan, Iraq, Japan, Israel, Cuba) Paper proposals should be sent by 1 December 2019 to: warstudies@lcir.co.uk. Please download Paper proposal form: https://warstudies.lcir.co.uk/ Registration fee – 100 GBP Provisional conference venue: Birkbeck, University of London, Malet Street, Bloomsbury, London, WC1E 7HX","date_start":"2020-03-21","date_end":"","important_dates":{"abstract":"","full":"2019-12-01","notification":"","final":""},"topics":["Arts & Humanities","Other","interdisciplinary"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["warstudies@lcir.co.uk"]}