{"name":"HICSS-54 Conference - ANALYTICS AND DECISION SUPPORT FOR GREEN IS AND SUSTAINABILITY APPLICATIONS MINITRACK","series":"","short":"","website":"http://hicss.hawaii.edu/tracks-and-minitracks","content":"The mini-track welcomes research articles and practitioner reports exploring technical and organizational issues pertaining to innovative ways for leveraging information systems and technologies for addressing sustainability issues and research that aim to mitigate the impact of economic development and information technologies on the environment. The minitrack encompasses Green IS, environmental informatics and analytics, sustainable computing, and Green IT. Theoretically founded papers that illustrate the application of analytics, artificial intelligence, deep learning, Internet of Things (IoT), cloud computing, information systems and decision technologies in environmental management for sustainability are particularly welcomed. Possible topics include, but are not limited to: • Agriculture 4.0 • Analytics and decision technologies • Artificial intelligence and deep learning • Environmental sustainability and decision making • Environmental knowledge acquisition and management • Environmental Management Information Systems (EMIS), and Environmental Decision Support Systems (EDSS) • Green IS • Green IT • Environmental cyberinfrastructure • Environmental communication • Energy informatics • Precision agriculture emphasizing sustainability applications • Smart agriculture, aquaculture and fisheries • Technologies for DSS development and environmental applications (e.g., Artificial intelligence, Geographic Information Systems (GIS), information visualization, computational intelligence, IoT, web services, cloud computing, artificial intelligence, agent-based computing, and multiple-criteria decision making) If you are seriously interested in submitting a manuscript for review please note the following important Dates: • April 15: Paper submission begins. • July 15 | 11:59 pm HST : Paper submission deadline • August 23 | 11:59 pm HST : Notification of Acceptance/Rejection • September 4: Deadline for authors to submit final manuscript for publication • September 22: Deadline for A-M authors to submit final manuscript for publication • October 1: Deadline for at least one author of each paper to register for the conference Author guidelines are available at: http://hicss.hawaii.edu/tracks-and-minitracks/authors/ If you are willing to be a reviewer please notify us as soon as possible and indicate the number of manuscripts (1 or 2) you would be willing to seriously review between Mid-August and Mid-September. The review process is all electronic and you will be sent information on how to perform reviews after we hear from you that you are willing to review. We hope that this minitrack stimulates the interests of researchers to this exciting and rich problem domain. We very much appreciate your assistance in spreading the word and soliciting papers for this minitrack. Please feel free to send the call for papers to whomever may be interested or let me know whom you recommend me to contact. Please contact me if you have questions and thank you very much for your support and consideration. Sincerely, Omar F. El-Gayar, Ph.D. Professor of Information Systems College of Business and Information Systems Dakota State University 820 N. Washington Avenue Madison, SD 57042 omar.el-gayar@dsu.edu","date_start":"2021-01-05","date_end":"2021-01-08","important_dates":{"abstract":"","full":"2020-07-15","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Kauai","Hawaii","United States"],"name":"","street":"","city":"Kauai","state":"Hawaii","ZIP":"","country":"United States"},"organizers":[""],"societies":[],"indexes":[],"emails":["omar.el-gayar@dsu.edu"]}