{"name":"International Conference:","series":"","short":"","website":"https://dreams.lcir.co.uk/?fbclid=IwAR3yJEaMVUwWc4AISlxXHXvsrMZeEhZpanChv7WsySiZYawMFpnYpQ0pT7A","content":"Dreams used to be the Surrealists' favourite terrain to explore, while their interpretation a modus operandi for investigating human psyche 'fossilized' by the pressures of an increasingly urbanized society, war trauma, while doing so against the background of nascent science of psychoanalysis. For this purpose they devised creative strategies like automatic writing, collage, or exquisite corpse to break away from internalized constraints. Nowadays, universes of the unconscious can be shared, tagged, broadcast, and communicated in every conceivable medium; some can even be subscribed to, as many come in templates (for those among us less imaginatively inclined to unleash the powers of imagination). It can be argued that surrealism, as the foremost mode of interrogating dream realities, served its purpose with flying colours. However, with new philosophical concepts of the 21st century (Object-Oriented Ontology, speculative realism, the anthropocene discourse), there has been a noticeable shift in terms of focus, away from a purely subjective, let alone anthropocentric agenda – held so dear by the Surrealists – towards what Timothy Morton named hyperobjects – conceptual entities that exceed the capabilities of human cognition. “There is no such thing as an “accurate” perception of a thing’s real qualities, because by their very nature real qualities are not translatable into something to which we can have access” – states Graham Harman. Just as much as surrealism sought to bring out dreaming lives' influence on everyday actions and habits, so does speculative realism convince us that this is pretty much a futile enterprise, and an overtly narcissistic at that. Given the influence of Object-Oriented Ontology on authors across various fields (literature, cinema, visual arts, music), in an age propelled by a networked mentality, we should be curious about the emergent role of dream narratives – have accounts of dreams and dream sequences in cinema and literature retain their former role, or do they point to some exteriority, a global(ized) unconscious of planetary proportions? What is the role of dreaming (as a narrative device, concept, aesthetic category, strata of experience – represented on canvas, in pixels, on a page) in filmic and literary fictions, in which hyperobjects abound? As the OOO postulates irreducible 'weirdness' whenever the gap between reality and its explicit manifestation is bridged (or is it 'breached'?), doesn't such speculating on reality render the entirety of our experience dreamlike? This conference is meant to encourage formulating similar questions, and trying to locate these post-surrealist accounts of dreaming life in contemporary fiction – literature, film, TV series, artworks, etc.. It might be that Breton's ruminations never did concern the additional, intuitive sphere of experiences layered over reality, but – as speculative realism postulates – a primordial magma from which all creation stems, both tangible and intangible. Paper proposals up to 250 words and a brief biographical note should be sent by 1 March 2021 to: dreams@lcir.co.uk. Please download Paper proposal form. Registration fee – 90 GBP","date_start":"2021-06-26","date_end":"2021-06-27","important_dates":{"abstract":"","full":"2021-04-30","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","interdisciplinary"],"location":{"virtual":"","full":["Online Event","United Kingdom"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["dreams@lcir.co.uk"]}