{"name":"Entrepreneurs Cruise 2019","series":"","short":"","website":"https://entrepreneurscruise.com","content":"Are you an Entrepreneur or Business Owner and need to get away and take a break? Ready to recharge, rejuvenate in new surroundings and be inspired by other like minds? Then, you can’t miss the 5th annual Entrepreneurs Cruise! The Entrepreneurs Cruise is a 7 night networking cruise for Entrepreneurs and Business Owners onboard the Royal Caribbean ‘Harmony of the Seas’ Cruise Ship, departing Orlando (Port Canaveral), Florida, sailing to CocoCay (Bahamas), Costa Maya (Mexico), Roatan (Honduras), Cozumel (Mexico) and back. With plenty of networking opportunities in a relaxed environment, it is the perfect place to build a professional network, find business partners, generate new ideas, and learn. Be inspired, motivated from the success stories and insights from others and learn from their wisdom what is working successfully in their businesses. In addition to networking opportunities, there are also optional full-day Marketing/Technology Events on the Days at Sea if you would like to get in some learning during the cruise. Conventional thought will be challenged, new ways of thinking will emerge, and you will leave with your head and notebook full of action items and ideas to lead your business to even greater success. Join the growing movement of entrepreneurs around the world who are choosing to grab life by the reins and pursue a life of passion and purpose by building their own dream business. Take advantage of our super saver registration rates and secure your cabin early and be sure to bring your partner/family along for a vacation. Hurry, this cruise will sell out weeks before we depart as it did last time. For more details visit https://entrepreneurscruise.com.","date_start":"2019-07-07","date_end":"2019-07-14","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Marketing/Social-Networking","digital marketing"],"location":{"virtual":"","full":["Cape Canaveral","United States"],"name":"","street":"","city":"Cape Canaveral","state":"","ZIP":"","country":"United States"},"organizers":["DIGIMARCON"],"societies":[],"indexes":[],"emails":[]}