{"name":"2019 ANPOR Annual Conference - Power of Public Opinion and Multicultural Communication toward Global Transformation","series":"","short":"","website":"https://www.anpor.net/chiangmai2019","content":"The ANPOR Annual Conference in 2019, Power of Public Opinion and Multicultural Communication toward Global Transformation will cover multidisciplinary topics related to the studies of public opinion research and media communication. ANPOR welcomes abstracts and panel proposals related to the conference theme, including but not restricted to the following topics: - Public Opinion Theory and Methods (i.e. Survey Methodology; Semantic Analysis; Data Collection) - Politics and Public Opinion Research (i.e. Government; International Relations, Politics and Regional Affairs; Polls and Elections) - Social and Economic and ecological Issues (i.e. Asian Study; Trade Promotion; Gender Communication; Education Development; Social Problems; Migration Movements) - Global transformation: transformation change across knowledge, social, economies, geo-political phenomenon, and global issues - Media and communication knowledge and research, journalism, marketing communication, and entertainment communication - Technology and diversity in journalism, politics, and marketing communication; transformations and communication trends in a globalised society - Roles of communication across social and cultural boundaries; challenges and solutions in cross cultural and intercultural communication - Multicultural, human rights, and civic freedom - Security landscape and politic-administrative development - Health communication (i.e. Daily Life Satisfaction; Aging Society; Health Literacy; Health Care) - Science, Environment and Risks Communication","date_start":"2019-11-06","date_end":"2019-11-09","important_dates":{"abstract":"","full":"2019-11-06","notification":"","final":""},"topics":["Social Sciences","Political-Science","political science"],"location":{"virtual":"","full":["Chiang Mai","Thailand"],"name":"","street":"","city":"Chiang Mai","state":"","ZIP":"","country":"Thailand"},"organizers":["Asian Network for Public Opinion Research"],"societies":[],"indexes":[],"emails":[]}