{"name":"1sy Psychological and Pastoral Care in the Pandemic Conference","series":"","short":"","website":"https://hedra.eu","content":"This conference brings together academics, psychologists, psychiatrists and counsellors, priests, chaplains and pastors from all global faiths, media analysts and commentators, and healthcare educators and practitioners from a wide variety of fields, for a collaborative, multidisciplinary exploration of the ways in which the pandemic has impacted global ways of working and governance. We welcome papers on spirituality in healing and health, grieving and loss, in the time of the pandemic. We welcome papers from all faiths and traditions. Abstracts are reviewed. Themes and issues for the conference include, but are not limited to: Stream A: Psychological counselling What is mental health, in a time of pandemic? How do we help people deal with distress, trauma, sleep disorders, anxiety, depression, addiction, PTSD and suicide, among other problems? What are the immediate, and the longer-term social and individual consequences of the pandemic, social distancing and isolation. How has the pandemic impacted first responders, crisis hotline workers, people who are grieving, vulnerable youth and children at risk, caregivers, medical practitioners and other healthcare workers, and psychological caregivers themselves? How does it map issues and problems of identity and diversity? What will the longer-term consequences of the pandemic be, and how can we prepare to address these mental health issues? Stream B: Pastoral care How can practitioners and communities of faith respond to the mental health issues arising from the pandemic such as addiction, trauma, and family problems including marriage breakdown? How can they provide support for vulnerable youth and children at risk, the elderly, and those who have lost a loved one? How can they support people through the process of grieving? What have the impacts been on offenders and former offenders? To what degree can personal and social resilience be encouraged, in the aftermath of the pandemic? How should communities care for the carers who have borne significant overwork and emotional strain and may experience compassion fatigue, including pastors, counsellors, teachers, and their staff? Stream C: Representing the pandemic The pandemic has been represented continually in print, tv, film and online media, for months. What have the impacts been, on concepts of care? How has it changed advertising and marketing, concepts of narrative and drama in film and television, how we represent illness and care, and how we create and share conspiracy theories? How have questions of identity been intertwined in this? How has community gone online, how have policy makers enabled and/or constrained the media and how do these changes impact the care given to real people? As pandemic personnel become influencers and social media stars, many governments have limited freedom of expression. In a world of managed press conferences, how has this crisis shaped the construction of characters, frames, and stories? In the world after the pandemic, what will the impacts be on our expectations for care? Stream D: Data analytics and the pandemic In order to find out how the pandemic is impacting those providing and those representing care, we are soliciting papers from academics, researchers, psychologists, people working in pastoral care, and media analysts involved with healthcare. These papers ask use structured interviews, and evaluate the data with content analysis software. Conference participants interested in cooperating with this project will publish papers in a journal special issue with HEDRA advisory board members. If you are interested in this, please contact us at hedra.eu@gmail.com. The conference welcomes abstracts from academics and researchers, psychologists, counsellors, priests, chaplains, media analysts and others.","date_start":"2021-05-08","date_end":"2021-05-09","important_dates":{"abstract":"","full":"2021-04-09","notification":"","final":""},"topics":["Social Sciences","Psychology","mental health"],"location":{"virtual":"","full":["Online Event","Austria"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Austria"},"organizers":["HEDRA Research Associates"],"societies":[],"indexes":[],"emails":["hedra.eu@gmail.com"]}