{"name":"8th International Conference on Photonics, Optics and Laser Technology - PHOTOPTICS 2020","series":"","short":"","website":"http://www.photoptics.org","content":"Optics has a long and distinct tradition among physical sciences. Ever-present throughout human history, optical systems and phenomena have been subject of interest in all cultures and epochs, from the ancient times of geometrical optics, across the works of Alhazen, Kepler, Descartes, Newton, Huygens, Young, Fresnel, Poisson and many others, to the electromagnetic theory synthesis of Maxwell, culminating in the quantum mechanics revolution of the first half of the 20th century which has come to pave the way for modern laser and photonics technologies. Optical systems are ubiquitous in modern society, with an ever-increasing number of applications covering medical sciences (vision technologies, surgical instrumentation, medical imaging), spatial exploration (telescopes, lenses, spectrometers), telecommunications (fiber optics), information processing (quantum computing), industry (from cutting, welding to precision metrology) and military/weaponry technology, to name but a few examples. Furthermore, laser and optical technology are in general absolutely essential to performing applied research in areas such as chemistry and biology, providing fundamental analysis tools. The success of optical systems and technologies in high-end scientific research has also found its way into everyday consumer products such as printers, displays, discs, cameras and eyeglasses, not to forget that optical fiber is crucial to telecommunications in general and internet in particular. This 8th edition of PHOTOPTICS will feature three different tracks on Optics, Photonics and Lasers, covering both theoretical and practical aspects. Researchers, engineers and practitioners interested in any of these fields are welcome to join us in Valletta, Malta and present their work on new methods or technologies, advanced prototypes, systems, tools and techniques, as well as general survey papers indicating future directions. Accepted papers, presented at the conference by one of the authors, will be published on the Proceedings of PHOTOPTICS, with an ISBN. Acceptance will be based on quality, relevance and originality. Both full research and work-in-progress reports are welcome. There will be both oral and poster sessions. Companies interested in presenting their products or methodologies or even researchers interested in holding a tutorial, workshop or special session are invited to contact the conference secretariat or visit the conference website. \n \n Conference Topics: \n Area 1: Lasers \n \\- Biomedical and Therapeutic Laser Applications \n \\- Fiber Lasers and Applications \n \\- High Intensity Lasers and High Field Phenomena \n \\- Laser Spectroscopy and Microscopy \n \\- Plasma Technologies \n \\- Quantum Electronics and Laser Science \n \\- Quantum Information and Measurement \n \\- Semiconductor Lasers and LEDs \n Area 2: Optics \n \\- Adaptive Optics \n \\- Applied Industrial Optics \n \\- Biomedical Optics \n \\- Computational Optical Sensing and Imaging \n \\- Fiber Optics Technology \n \\- Light-Matter Interaction \n \\- Optical Communications and Networking \n \\- Optical Instrumentation \n \\- Optical Materials and Devices \n \\- Optics in Astronomy and Astrophysics \n \\- Spectroscopy, Imaging and Metrology \n \n Area 3: Photonics \n \\- Fiber Optics Devices \n \\- Microwave Photonics \n \\- Molecular Photophysics and Spectroscopy \n \\- Microphotonics, Nanophotonics and Optical Manipulation \n \\- Nonlinear Optics and Photonics \n \\- Organic and Bio-Photonics \n \\- Photodetectors, Sensors and Imaging \n \\- Photonic and Optoelectronic Materials and Devices \n \\- Photonics for Energy and Green Photonics \n \\- Plasmonic Structures and Quantum Dots \n \\- Ultrafast Phenomena, Attosecond Science and Technology ","date_start":"2020-02-27","date_end":"2020-02-29","important_dates":{"abstract":"","full":"2019-10-04","notification":"","final":""},"topics":["Engineering & Technology","Other","Photonics, Photochemistry"],"location":{"virtual":"","full":["Valletta","Malta"],"name":"","street":"","city":"Valletta","state":"","ZIP":"","country":"Malta"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":[]}