{"name":"2021 International conference on Future Environment Pollution and Prevention","series":"","short":"ICFEPP 2021","website":"www.ic-fepp.org","content":"2021 International conference on Future Environment Pollution and Prevention (ICFEPP 2021) will be held in Jing De Zhen, China, Sept 28-30, 2021! It brings together leading academic scientists, researchers and research scholars to exchange and share their experiences and research results on all aspects of future environment pollution and prevention (ICFEPP 2021). Prof. Hong Yu from College of Enviromental Science and Engineering, Beijing Forestry University, China will be our conference chair and keynote speaker. Prof. Dr. Kokyo Oh from Saitama Center for Environmental Science, Japan will also give keynote speach. All the registered and presented papers will be published in the following journals: 1\\. E3S Web of Conferences, which will be submitted to EI Compendex, Scopus, SciTech Premium Collection (ProQuest), and other databases for review and indexing; 2\\. The high quality papers with great extension will be recommended to publish in Global Journal of Environmental Science and Management (GJESM) (ISSN: 2383-3572), it will be indexed in Web of Science (ESCI), Scopus (with CiteScore = 2.9), Engineering Village - GEOBASE, Scimago Journal With rank Q2, Rank (Q2), EBSCO, ProQuest, Cabi, Chemical Abstracts, Google Scholar and many more databases which can be traced from the title website. 3\\. Processes EISSN 2227-9717 Impact Factor: 2.753 (2019) It will be indexed within Scopus, SCIE (Web of Science), CAPlus / SciFinder, Inspec, and many other databases. Submission Deadline Before July 20, 2021 Notification of Acceptance On Aug 05, 2021 Registration Deadline Before Aug 20, 2021 Conference Dates On Aug 29-30, 2021 Paper submission: 1.Conference Submission System: https://cmt3.research.microsoft.com/ICFEPP2021 2.Mail: icfepp@isaeri.org Conference Secretary: Ms. Alice Li Tell: +852-30756685 Mail: icfepp@isaeri.org Conference website: www.ic-fepp.org","date_start":"2021-09-28","date_end":"2021-09-30","important_dates":{"abstract":"","full":"2021-08-20","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental"],"location":{"virtual":"","full":["Jing De Zhen","China"],"name":"","street":"","city":"Jing De Zhen","state":"","ZIP":"","country":"China"},"organizers":["Innovative Science and Engineering Research Institute (ISERI)."],"societies":[],"indexes":[],"emails":["icfepp@isaeri.org"]}