{"name":"Designing and Sustaining New and Existing Product Stability Testing Program","series":"","short":"","website":"https://www.complianceonline.com/fda-drug-stability-testing-program-seminar-training-80320SEM-prdsm?channel=Brownwalker","content":"This Virtual Seminar will provide a great resource to Pharmaceutical, Biotechnology, Diagnostics, Cell Therapy, Drugs, Biologics, OTC, Radio-pharmaceutical, Pharmacies and Medical Device Industries in understanding the effective way to establish a new or modified product stability testing program. This program is an important part of a product's regulatory filing requirements as well as the determination of the shelf life or expiration date of the product. This is an important part of every business final bottom line or indirectly relationship to their supply and warehouse chain (how long the product can be stored before it can be discarded). Understanding how to design and implement an effective stability testing program following the regulatory guidelines will allow the product to be manufactured, tested, released, adequately stored and effectively tested for stability and ultimately used through its actual end point based on the product's potency. This will eliminate potential loss of product and business income by manufacturers of product (i.e. when a potent product is inadvertently discarded due to a poorly designed stability testing program) which ends up impacting the products' regulatory filing status or a product's Regulatory Filing/Application. The focus of this seminar will create a detailed process that will guide the attendees in the right direction in the planning of a new or existing product's stability testing plan, program, protocol, handing and utilizing the data, setting the shelf life as well as the applicable regulatory requirements. Learning Objectives: This Virtual Seminar will help the attendee gain a better understanding of the requirements of the FDA’s Drug Stability Guidelines that is stipulated for new, existing and modified drug products that have an existing or new IND or NDA submission. This Virtual Seminar will also benefit people within the Pharmaceutical, Biotechnology or Medical Device industries that are currently have a stability testing program but do not know how to maximize the use of their data for extending their product’s expiration dating. Who will Benefit: The Virtual Seminar will benefit people within the pharmaceutical, biotechnology or medical device industries that currently have a stability testing program but are not savvy about maximizing the use of their data for extending their product’s expiration dating. The employees who will benefit most include: Quality Control Analyst and Management Senior Management Manufacturing Associates and Management Shipping and Distribution Personnel Stability Testing Department Personnel and Management Regulatory Affairs Quality Assurance Analyst and Management Process Design Personnel and Management Drug Packaging Personnel and Management","date_start":"2021-10-06","date_end":"2021-10-07","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}