{"name":"14th International Conference on Bio-inspired Systems and Signal Processing - BIOSIGNALS 2021","series":"","short":"","website":"http://www.biosignals.biostec.org","content":"14th International Conference on Bio-inspired Systems and Signal Processing - BIOSIGNALS website: http://www.biosignals.biostec.org February 11 - 13, 2021 Vienna, Austria In Cooperation with: AAAI, ISCB, LFTY, SSBE, DGBMT and SFGBM. Proceedings will be submitted for indexation by: SCOPUS, Google Scholar, DBLP, Semantic Scholar, Microsoft Academic, EI and Conference Proceedings Citation Index. IMPORTANT DATES: Regular Paper Submission: September 14, 2020 Authors Notification (regular papers): November 12, 2020 Final Regular Paper Submission and Registration: November 26, 2020 Position Paper Submission: October 29, 2020 Authors Notification (position papers): December 4, 2020 Final Regular Paper Submission and Registration: December 18, 2020 Scope: The purpose of the International Conference on Bio-inspired Systems and Signal Processing is to bring together researchers and practitioners from multiple areas of expertise, including biology, medicine, and engineering and as well as computer and data science, interested in studying and using models and techniques inspired from or applied to biological systems. A diversity of signal types can be found in this area, including video, audio, electrophysiological signals, medical imaging, and other biological sources of information. The analysis and use of these signals is a multidisciplinary area including signal processing, pattern recognition and artificial intelligence techniques, amongst others. BIOSIGNALS encourages authors to submit papers to one of the main topics indicated below, describing original work, including methods, techniques, advanced prototypes, applications, systems, tools or survey papers, reporting research results and/or indicating future directions. Accepted papers will be presented at the conference by one of the authors and published in the proceedings. Acceptance will be based on quality, relevance and originality. There will be both oral and poster sessions. The proceedings will be indexed by several major international indexers. Special sessions are also welcome. Please contact the secretariat for further information on how to propose a special session. Conference Topics: Area 1: BIOSIGNALS - Multimodal Speech & Audio Processing - Medical Signal Acquisition, Analysis and Processing - Monitoring and Telemetry - Motion Control - Neural Networks for Biosignal Data - Pattern Recognition & Machine Learning for Biosignal Data - Physiological Processes and Biosignal Modeling, Non-Linear Dynamics - Frequency Analysis & Wavelet Transform - Wearable Sensors and Systems - Biometrics - Cardiovascular Signals - Real-Time Systems & Biosignal-Based User Interfaces - Detection and Identification - Electromagnetic Fields in Biology and Medicine - Evolutionary Systems - Processing and Analysis of Image and Video Data - Medical Image Acquisition, Processing, Analysis, and Detection BIOSIGNALS KEYNOTE LECTURE Athanasios Tsanas, University of Edinburgh, United Kingdom Thomas Ostermann, Universität Witten/Herdecke, Germany Mireya Fernández Chimeno, Universitat Politècnica de Catalunya, Spain BIOSIGNALS CONFERENCE CO-CHAIRS: Ana Fred, Instituto de Telecomunicações and University of Lisbon, Portugal Hugo Gamboa , New University of Lisbon, Portugal BIOSIGNALS PROGRAM CHAIR: Bethany Bracken, Charles River Analytics Inc., United States PROGRAM COMMITTEE http://www.biosignals.biostec.org/ProgramCommittee.aspx BIOSIGNALS Secretariat Address: Avenida de S. Francisco Xavier, Lote 7 Cv. C Tel: +351 265 520 185 Fax: +351 265 520 186 Web: http://www.biosignals.biostec.org e-mail: biosignals.secretariat@insticc.org","date_start":"2021-02-11","date_end":"2021-02-13","important_dates":{"abstract":"","full":"2021-02-11","notification":"","final":""},"topics":["Life Sciences","Biotechnology/ Bioinformatics"],"location":{"virtual":"","full":["Vienna","Austria"],"name":"","street":"","city":"Vienna","state":"","ZIP":"","country":"Austria"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["biosignals.secretariat@insticc.org"]}