{"name":"International Conference on Foreign Language Education and Linguistics","series":"","short":"FLEL 2020","website":"https://www.sepconf.org/conference/FLEL2020","content":"International Conference on Foreign Language Education and Linguistics (FLEL 2020) Conference Date: September 18-20, 2020 Conference Venue: Xi'an, China Website: https://www.sepconf.org/conference/FLEL2020/ Online Registration System: http://www.sepconf.org/RegistrationSubmission/default.aspx?ConferenceID=1327 Email: workshop9@126.com International Conference on Foreign Language Education and Linguistics (FLEL 2020) will be held from September 18 to 20, 2020 in Xi'an, China. This Conference will cover issues on Foreign Language Education and Linguistics and other related topics. It dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods in related fields. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal, please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: workshop9@126.com Tel: +86 15527752170 QQ: 1349406763 WeChat: 3025797047 Twitter: conf\\_Committee Attendance Methods 1.Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Applied linguistics Computer assisted Language Learning Conversational analysis Cultural studies Curriculum Development and Syllabus Design Deep Language Processing Dialogue systems Discourse analysis Discourse Analysis and Critical Discourse Analysis English for specific purposes Fluent Teacher Interactions Foreign Language Teaching and Learning Functional grammar General Linguistics Globalization Studies and world English's Information and Computer Technology in TEFL Innovation in language Teaching and learning Intercultural Education Intercultural studies Language acquisition and learning Language Planning, Literature, Syntax and Semantics Language Testing and Assessment Linguistic Literacy studies Literature Pragmatics Pronunciation modeling Psycholinguistics Second Language Semantics Sociolinguistics Speech processing Speech quality and intelligibility tests Stylistics, Language and Culture, Cognition, and Pragmatics Bilingual and Multilingual Education Teaching English as a Foreign/ Second Language TESOL / TESL / TEFL Text understanding systems Text/corpus linguistics Translation Studies Word sense disambiguation","date_start":"2020-09-18","date_end":"2020-09-20","important_dates":{"abstract":"","full":"2020-08-18","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","Linguistics"],"location":{"virtual":"","full":["Xi'an","China"],"name":"","street":"","city":"Xi'an","state":"","ZIP":"","country":"China"},"organizers":["Academic Communications"],"societies":[],"indexes":[],"emails":["workshop9@126.com"]}