{"name":"Virtual Educa World Congress","series":"","short":"","website":"http://go.evvnt.com/601488-0?pid=4868","content":"Virtual Educa provides a global setting for Governments, Institutions and Corporate sector to see, learn and connect during the World Congress and links 2030 Agenda to an exponential vision of human capital development, in view of the challenges posed by the Fourth Industrial Revolution. Virtual Educa World Congress is the world meeting place for innovation in education and integrates: - XXII edition of the Annual International Symposium - XI edition of the Multilateral Forum 'Planet 2030' - X edition of the Exhibition 'Models and technologies 4.0' INTERNATIONAL SYMPOSIUM Scientific forum Academic program Workshops MULTILATERAL FORUM 'PLANET 2030' Virtual Educa Multilateral Forums has been a yearly meeting space - gathering international organizations (UN, T20, WORLD BANK, OECD, IDB, ...), government agencies high representatives, members of the Latin American and Caribbean Parliament (PARLATINO), corporate CEOs and directors, foundations, etc. - to analyze innovation in education policies and practices. EXHIBITION 'MODELS AND TECHNOLOGIES 4.0' Associated with the symposium, annually takes place the International Expo \"Education, Innovation and ICT\", with the participation of the corporate sector, international pavilions, Virtual Educa partners, as well as the Popup school and the 2030 Classroom, based on impact technologies, as a part of the interactive space. URLs: Tickets: https://go.evvnt.com/601488-2?pid=4868 Facebook: https://go.evvnt.com/601488-4?pid=4868 Twitter: https://go.evvnt.com/601488-5?pid=4868 Sponsor: https://go.evvnt.com/601488-6?pid=4868 Inquiries: https://go.evvnt.com/601488-7?pid=4868 Price: General Admission: EUR 15.00 Time: 09:00 - 18:00","date_start":"2020-11-23","date_end":"2020-11-25","important_dates":{"abstract":"","full":"2020-11-22","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","Portugal"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Portugal"},"organizers":["Kenes Group"],"societies":[],"indexes":[],"emails":[]}