{"name":"2021 World Congress in Computer Science, Computer Engineering, & Applied Computing (CSCE'21)","series":"","short":"","website":"https://www.american-cse.org/csce2021","content":"**CALL FOR PAPERS** **Paper Submission Deadline:** March 31, 2021 The 2021 World Congress in Computer Science, Computer Engineering, and Applied Computing (CSCE'21) July 26-29, 2021, Luxor (MGM), Las Vegas, USA https://www.american-cse.org/csce2021/ PAPER SUBMISSION PORTAL: https://american-cse.org/ **PUBLISHER:** All accepted papers will be published by Springer Nature INDEXATION: Springer Science Indexations: Online Springer Link (link.springer.com/), Scopus (www.info.scopus.com), SCI Compendex, EI Compendex (www.ei.org), EMBASE, Web of Science, Inspec, ACM digital library, Google Scholar, EBSCO, and others. **INTRODUCTION:** In order to leverage synergy between various CS & CE fields, the program committees of a number of premier conferences have their 2021 events held at one venue (same location and dates). Thus, this year, The Congress is composed of a number of tracks (joint- conferences, sessions, workshops, poster and panel discussions); all will be held simultaneously, same location and dates: July 26-29, 2021\\. For the complete list of joint conferences, refer to https://www.american-cse.org/csce2021/conferences This year's Congress will be a hybrid event that combines a \"live\" in-person event with a \"virtual\" online component. We anticipate having between 1,000 and 2,000 participants in the Congress. The congress includes 20 major tracks, composed of: 122 technical, research, and panel sessions as well as a number of keynote lectures. Last year, the Congress had attracted speakers, authors and participants affiliated with over 158 different universities (including many from the top 50 ranked institutions), major IT corporations (including: Microsoft, Google, Apple, SAP, Facebook, Oracle, Amazon, Yahoo, Samsung, IBM, Ebay, GE, Siemens, Philips, Ericsson, BAE Systems, Hitachi, NTT, Twitter, Uber Technologies, ...), major corporations (including: Exxon Mobil, Johnson & Johnson, JPMorgan Chase, PetroChina, GlaxoSmithKline, HSBC, Airbus, Boeing, Hyundai, Goldman Sachs, Deutsche Bank, ...), government research agencies (NSF, NIH, DoE, US Air Force, NSA National Security Agency, Central Intelligence Agency, ...), US national laboratories (including, NASA National Aeronautics and Space Administration, ANL Argonne National Lab, Sandia National Lab, ORNL Oak Ridge National Lab, Lawrence Berkeley National Lab, Lawrence Livermore National Lab, Los Alamos National Lab, Pacific Northwest National Lab, ...), and a number of Venture Capitalists as well as distinguished speakers discussing Intellectual Property issues. Last year, 54% of attendees were from academia, 25% from industry; 20% from government and funding agencies; and 1% unknown. About half of the attendees were from outside USA; from 69 nations. See the web link below for a small subset of publications based on papers accepted in the CSCE proceedings: many of these books and journal special issues have already received the top 25% downloads in their respective fields and/or identified as \"Highly Accessed\" by publishers and/or science citation index trackers. https://www.american-cse.org/csce2021/special\\_issues https://www.american-cse.org/csce2021/publisher https://www.springer.com/series/11769?detailsPage=titles **KEYNOTE LECTURES AND TUTORIALS:** There will be between 10 and 15 Keynote lectures and Invited Talks; speakers include world-renowned scientists and educators. Featured Keynote Speakers in recent years have included: - Prof. David A. Patterson (pioneer, architecture, UC Berkeley) - Prof. Ian Foster (known as Father of Grid Computing; U. of Chicago & ANL) - Prof. John Koza (known as Father of Genetic Programming; Stanford U.) - Prof. Barry Vercoe (Founding member of MIT Media Lab, MIT) - Dr. K. Eric Drexler (known as Father of Nanotechnology) - Dr. Jose L. Munoz (NSF Program Director and CTO of NSF Office of Cyber-infrastructure) - Prof. Michael J. Flynn (Stanford U.; known for Flynn's taxonomy) - Dr. Firouz Naderi (former Head of NASA Mars Exploration Program; former Administrator and/or Director of Jet Propulsion Lab, CalTech/NASA; NASA's JPL Solar System Exploration - Prof. Ruzena Bajcsy (pioneer, VR, UC Berkeley) - Prof. Viktor K. Prasanna (pioneer, U. of Southern California) - Prof. David Lorge Parnas (pioneer of software engineering) - Prof. Eugene H. Spafford (Executive Director, CERIAS and Professor, Purdue University) - Prof. Haym Hirsh (Dean, Cornell University & former NSF admin) - Prof. Alfred Inselberg (Tel Aviv U, Israel; Senior Fellow, San Diego Supercomputing Center; Inventor of the multidimensional system of Parallel Coordinates and author of textbook) - Prof. H. J. Siegel (Abell Endowed Chair Distinguished Professor of ECE and Professor of CS; Director, CSU Information Science and Technology Center (ISTeC), Colorado State University, Colorado, USA) - Prof. Amit Sheth (LexisNexis Eminent Scholar; Founder/Executive Director, Ohio Center of Excellence in Knowledge-enabled Computing (Kno.e.sis)) - Prof. John H. Holland (known as Father of Genetic Algorithms; U. of Michigan) - Prof. Lotfi A. Zadeh (Father of Fuzzy Logic, UC Berkeley) - Dr. Leonid I. Perlovsky (Harvard University and CEO LP Information Tech) - Dr. James A. Crowder (Chief Engineer, Raytheon Intelligence) - Prof. Diego Galar (Director & Pro-Vice-Chancellor, Lulea University of Technology, Sweden) - and over 200 other distinguished speakers. The Congress is among the top five largest annual gathering of researchers in computer science, computer engineering, data science, artificial intelligence, STEM, and applied computing. We anticipate to have attendees from about 75 countries and territories. To get a feeling about the conferences' atmosphere, see some delegates photos available at (over 2,000 photos): https://photos.ucmss.com/ **LIST OF JOINT-CONFERENCES:** In order to leverage synergy between various CS & CE fields, the program committee of the following conferences have their 2021 events held at one venue (same location and dates). o. ACC'21: 5th International Conference on Applied Cognitive Computing o. BIOCOMP'21: 22nd International Conference on Bioinformatics & Computational Biology o. BIOENG'21: 7th International Conference on Biomedical Engineering & Sciences o. CSC'21: 19th International Conference on Scientific Computing o. EEE'21: 20th International Conference on e-Learning, e-Business, Enterprise Information Systems, & e-Government o. ESCS'21: 19th International Conference on Embedded Systems, Cyber-physical Systems, & Applications o. FCS'21: 17th International Conference on Foundations of Computer Science o. FECS'21: 17th International Conference on Frontiers in Education: Computer Science & Computer Engineering (includes, STEM, ABET, ...) o. GCC'21: 17th International Conference on Grid, Cloud, & Cluster Computing o. HIMS'21: 7th International Conference on Health Informatics & Medical Systems o. ICAI'21: 23rd International Conference on Artificial Intelligence o. ICDATA'21: 17th International Conference on Data Science o. ICOMP'21: 22nd International Conference on Internet Computing & IoT o. ICWN'21: 20th International Conference on Wireless Networks o. IKE'21: 20th International Conference on Information & Knowledge Engineering o. IPCV'21: 25th International Conference on Image Processing, Computer Vision, & Pattern Recognition o. MSV'21: 18th International Conference on Modeling, Simulation & Visualization Methods o. PDPTA'21: 27th International Conference on Parallel & Distributed Processing Techniques & Applications o. SAM'21: 20th International Conference on Security & Management o. SERP'21: 19th International Conference on Software Engineering Research & Practice All conferences listed above will be held simultaneously; i.e., same location and dates (July 26-29, 2021, USA.) **SUBMISSION OF PAPERS:** https://american-cse.org/ All accepted papers will be published by Publisher: Springer Nature - Book Series: Transactions on Computational Science & Computational Intelligence https://www.springer.com/series/11769 Indexation: Subject to Springer science indexation which includes: online Springer Link (link.springer.com/), Scopus (www.info.scopus.com), SCI Compendex, EI Compendex (www.ei.org), EMBASE, Web of Science, Inspec, ACM digital library, Google Scholar, EBSCO, and others. Prospective authors are invited to submit their papers by uploading them to the evaluation web site at: https://american-cse.org/ Submissions must be uploaded by the due date (see IMPORTANT DATES) and must be in either MS doc or pdf formats (maximum of 10 pages for Regular Research Papers; maximum of 6 pages for Short Research Papers; and maximum of 3 pages for Extended Abstract/Poster Papers - the number of pages includes all figures, tables, and references). ALL REASONABLE TYPESETTING FORMATS ARE ACCEPTABLE (many authors use Springer's one-column style format for their submissions or IEEE style format: later, the authors of accepted papers will be asked to follow a particular typesetting format to prepare their final papers for publication). Papers must not have been previously published or currently submitted for publication elsewhere. The first page of the paper should include the followings: - Title of the paper - Name, affiliation, postal address, and email address of each author (identify the name of the Contact Author) - Abstract (between 100 and 120 words) - A maximum of 5 topical keywords that would best represent the work described in the paper - Write the type of the submission as \"Regular Research Paper\", \"Short Research Paper\", or \"Extended Abstract/Poster Paper\". - The actual text of the paper can start from the first page (space permitting). Submissions are to be uploaded to the submission/evaluation web site portal at https://american-cse.org/ Type of Submissions/Papers: - Full/Regular Research Papers (maximum of 10 pages): Regular Research Papers should provide detail original research contributions. They must report new research results that represent a contribution to the field; sufficient details and support for the results and conclusions should also be provided. The work presented in regular papers are expected to be at a stage of maturity that with some additional work can be published as journal papers. - Short Research Papers (maximum of 6 pages): Short Research Papers report on ongoing research projects. They should provide overall research methodologies with some results. The work presented in short papers are expected to be at a stage of maturity that with some additional work can be published as regular papers. - Extended Abstract/Poster Papers (maximum of 3 pages): Poster papers report on ongoing research projects that are still in their infancy (i.e., at very early stages). Such papers tend to provide research methodologies without yet concrete results. Each paper will be peer-reviewed by two experts in the field for originality, significance, clarity, impact, and soundness. In cases of contradictory recommendations, a member of the conference program committee would be charged to make the final decision (accept/reject); often, this would involve seeking help from additional referees. Papers whose authors include a member of the conference program committee will be evaluated using the double-blinded review process. (Essay/philosophical papers will not be refereed but may be considered for discussion/panels). PROPOSAL FOR ORGANIZING WORKSHOPS/SESSIONS: Each conference ( https://www.american-cse.org/csce2021/session\\_proposals ) is composed of a number of tracks. A track can be a session, a workshop, or a symposium. A session will have at least 6 papers; a workshop at least 12 papers; and a symposium at least 18 papers. Track chairs will be responsible for all aspects of their tracks, including: soliciting papers, reviewing, selecting, ... The names of track chairs will appear as Track Editors in the conference proceedings and they will be presented achievement awards at appropriate professional levels during the Award Ceremony on site at the congress. Track chairs who attract a sufficient number of solid papers can propose to edit books with a major publisher based on the extended versions of the papers accepted in their tracks (the congress will facilitate and help such track chairs to get the publisher's approval: such as Springer, Elsevier, ...). Proposals to organize tracks (sessions, workshops, or symposiums) should include the following information: name and address (+ email) of proposer, his/her biography, title of track, a 100-word description of the topic of the track, the name of the conference the track is submitted for consideration (i.e., ACC, BIOCOMP, ...), and a short description on how the track will be advertised (in most cases, track proposers solicit papers from colleagues and researchers whose work is known to the track proposer). E-mail your track proposal to cs@american-cse.org . We would like to receive the track proposals as soon as possible (see IMPORTANT DATES). **CAREER, JOB, CAREER, JOB, & EDUCATION FAIR: EDUCATION FAIR:** https://www.american-cse.org/csce2021/career\\_fair The CSCE 2021 Congress plans to host a one-day Career, Job, & Education Fair on July 27, 2021\\. This annual strategic event provides the congress attendees and participants with opportunities to connect with employers and educators and learn more about career options. Corporations and Universities can also exhibit their products, services, and degree programs during the event. Interested parties should contact cs@american-cse.org . **IMPORTANT DATES:** As Soon As Possible: Track/Session/Workshop/Symposium Proposals March 31, 2021: Submission of papers: https://american-cse.org/ - Full/Regular Research Papers (maximum of 10 pages) - Short Research Papers (maximum of 6 pages) - Abstract/Poster Papers (maximum of 3 pages) April 11, 2021: Notification of acceptance (+/- two days) May 10, 2021: Final papers + Copyright + Registration July 26-29, 2021: The 2021 World Congress in Computer Science, Computer Engineering, and Applied Computing (CSCE'21: USA); Including all affiliated federated/joint conferences https://www.american-cse.org/csce2021/ **CONTACT:** Questions and inquiries should be sent to: CSCE'21 Conference Secretariat: cs@american-cse.org","date_start":"2021-07-26","date_end":"2021-07-29","important_dates":{"abstract":"","full":"2021-03-31","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer science"],"location":{"virtual":"","full":["Las Vegas","United States"],"name":"","street":"","city":"Las Vegas","state":"","ZIP":"","country":"United States"},"organizers":["American Council on Science and Education"],"societies":[],"indexes":[],"emails":["cs@american-cse.org"]}