{"name":"The 5th Int'l Conference on Petrochemical, Energy Conservation and Emissions Reduction","series":"","short":"PECER 2021","website":"https://www.deconf.org/conference/PECER2021","content":"The 5th Int'l Conference on Petrochemical, Energy Conservation and Emissions Reduction (PECER 2021) Conference Date: December 4-6, 2021 Conference Venue: Sanya, China Website: https://www.deconf.org/conference/PECER2021/ Online Registration: https://www.deconf.org/RegistrationSubmission/default.aspx?ConferenceID=1419 Email Registration: workshop12@163.com The 5th Int'l Conference on Petrochemical, Energy Conservation and Emissions Reduction (PECER 2021) will be held during December 4-6, 2021 in Sanya, China. This Conference will cover issues on Petroleum and Petrochemical Engineering, Geomechanics and Rock Physics, Energy Conservation and Emissions Reduction, Energy planning studies, Energy saving and emissions reduction in industries, etc. It dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: All the accepted papers will be published by a peer-reviewed open access journal that can ensure the widest dissemination of your published work, for more information, please contact us (workshop12@163.com) Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: workshop12@163.com Tel: +86 18672346485 QQ: 1349406763 WeChat: 3025797047 Twitter: conf\\_Committee Attendance Methods 1\\. Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Petrochemical Petroleum and Petrochemical Engineering Fossil Technologies Geomechanics and Rock Physics Geology and Geochemistry Reservoir Characterization Reservoir Fluids Reservoir Geophysics Oil & Gas Exploration Energy Management and Environmental Issues Well Testing Offshore Technology Hydrocarbons Recovery Mechanisms Oil & Gas Production Enhanced Oil Recovery Oil & Gas Processing, Storage and Transportation Pipelines & Tankers LNG Transportation Petroleum Safety Operations International and National Transportation Downstream Technologies Petrochemical Processes Plant Performance and Optimization Chemicals Production Refining Technologies and Plant Inspection Petrochemical Technologies and Products Chemical Industry Technologiesand Products Chemical Industry Safety Operations Renewable Energy Sources and Technology Energy Management Systems Well Drilling Biomass Energy and Geothermal Resources Energy Infrastructure Environmental Impacts of Oil & Gas Industry Oil Recovery and Waste Control and Management Investing in Gas and Oil sector Economics of Oil & Gas Sector Oil & Gas Management Energy Conservation and Emissions Reduction Energy planning studies Energy saving and emissions reduction in industries Energy intensive industries Sustainable transportation and transport integration Energy investment feasibility Cost reduction and less emission Traffic and transportation Petroleum & Natural Gas Engineering Combustion and gasification Combined Heat and Power Systems Hydrogen energy production, storage and transmission Air pollution and its effects on ecosystems Environmental management Environmental risk Analysis Climate and global change Design and nature Economic and efficient energy systems Environmental management Environmental impact from the use of energy Architectural issues Energy resources and Environment Environmental and ecological policies Global change, climate and biodiversity Environmental Education and Impact on society, the economy and employment Indoor Air Quality in Offices and Houses International strategy for energy, development and environment Landscape and forestation issues Education on Socio-economic aspects of energy Forestation Land use and management","date_start":"2021-12-04","date_end":"2021-12-06","important_dates":{"abstract":"","full":"2021-11-01","notification":"","final":""},"topics":["Engineering & Technology","Renewable Energy/Nuclear","Energy Conservation"],"location":{"virtual":"","full":["Sanya","China"],"name":"","street":"","city":"Sanya","state":"","ZIP":"","country":"China"},"organizers":[""],"societies":[],"indexes":[],"emails":["workshop12@163.com"]}