{"name":"Universal Hygienic Design for FSMA Compliance-Equipment","series":"","short":"","website":"https://www.complianceonline.com/universal-hygienic-design-fsma-compliance-equipment-webinar-training-706790-prdw?channel=Brownwalker","content":"Hygienic Design in food processing is a given, however FDA’s #483 violations continue to reflect organizations clearly lack the necessary requirements to maintain safe environments for food production. This course will outline the basics food facilities should have in place and how to ensure program meets FDA’s expectations. Why Should You Attend: This webinar will detail the essentials in Hygienic Design, Universal Principles and expectations by FDA/regulators to mitigate risks for pathogens, pests and allergens in food production. Priorities will be outlined in accordance with FSMA requirements focused on equipment essentials and transport/storage Supplychain steps. HARPC, the Food Safety Plan risk review will be tabled to help plant teams understand focus on minimizing food safety hazards. Tools will be introduced to help participants implement program. Anyone involved in the production or holding of food products needs to understand the impact on sanitary design requirements. Consumers, customers and regulatory agencies all have a vested interest in the safety or one’s food items. A recall or illness liability can be devasting to an organization’s business, a robust hygienic design program minimizes these potential risks. Areas Covered in the Webinar: Importance of Hygienic Design FDA HARPC (Hazard Analysis and Risk-Based Preventive Controls) FDA Audit Insights (#483’s) Universal Hygienic Design Principles AMI 10 Principles of Hygienic Design Hygienic Design Review Risk Assessment & Checklists Lessons Learned Success Takeaways Q&A Who Will Benefit: Quality Control/Assurance and Food Safety professionals, supervisors, leads, managers Operations managers/supervisors/engineers Regulatory professional R & D or Product Developers professionals Corporate quality managers Operations personnel Senior management Plant management personnel, PCQI’s Third parties developing HACCP plans Auditors and those with food safety inspection roles","date_start":"2022-03-23","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}