{"name":"10th International Conference on Operations Research and Enterprise Systems - ICORES 2021","series":"","short":"","website":"http://www.icores.org","content":"10th International Conference on Operations Research and Enterprise Systems ICORES website: http://www.icores.org February 4 - 6, 2021 Vienna, Austria Proceedings will be submitted for indexation by: SCOPUS, Google Scholar, DBLP, Semantic Scholar, Microsoft Academic, EI and Conference Proceedings Citation Index. IMPORTANT DATES: Regular Paper Submission: September 14, 2020 Authors Notification (regular papers): November 12, 2020 Final Regular Paper Submission and Registration: November 26, 2020 Position Paper Submission: October 29, 2020 Authors Notification (position papers): December 4, 2020 Final Regular Paper Submission and Registration: December 18, 2020 Scope: The purpose of the International Conference on Operations Research and Enterprise Systems (ICORES) is to bring together researchers, engineers, faculty, and practitioners interested in both theoretical advances and practical applications in the field of operations research. Two simultaneous tracks will be held, covering on one side domain independent methodologies and technologies and on the other side practical work developed in specific application areas. ICORES focuses on real world challenges; therefore authors should highlight the benefits of Operations Research Methodologies and Technologies for industry and services, either in general or for particular applications. Ideas on how to solve specific business problems as well as larger enterprise challenges, using operations research methodologies and technologies, will arise from the conference. Papers describing advanced prototypes, systems, case studies, tools and techniques and general survey papers indicating future directions are also encouraged. Papers describing original work are invited in any of the areas listed below. Accepted papers, presented at the conference by one of the authors, will be published in the Proceedings of ICORES. Acceptance will be based on quality, relevance and originality. Both full research reports and work-in-progress reports are welcome. There will be both formal oral presentations and informal poster sessions. Special sessions focused on case-studies and commercial presentations, as well as tutorials for technical/scientific topics and practical applications are also envisaged: companies interested in presenting their products/methodologies or researchers interested in offering a tutorial are invited to contact the conference secretariat. Conference Topics: Area 1: Methodologies and Technologies - Inventory Theory - Linear Programming - Management Sciences - Network Optimization - Optimization - Predictive Analytics - Queuing Theory - Simulation - Stochastic Optimization - Stochastic Processes - Data Mining and Business Analytics - Decision Analysis - Design, Analysis, and Innovation for Enterprise Systems - Dynamic Programming - Forecasting - Game Theory - Industrial Engineering - Information Systems Area 2: Applications - Automation of Operations - OR in Education - OR in Emergency Management - OR in Health - OR in National Defense/International Security - OR in Telecommunications - OR in Transportation - Project Management - Resource Allocation - Risk Management - Routing - Decision Support Systems - Scheduling - Supply Chain Management - Systems of Systems/Teams and Socio-Technical Systems - Energy and Environment - Engines for Innovation - Globalization and Productivity - Logistics - Maintenance - New Applications of OR - Optimization in Finance ICORES KEYNOTE LECTURE Elena Rovenskaya, International Institute for Applied Systems Analysis (IIASA), Austria David Saranchak, Concurrent Technologies Corporation (CTC), United States ICORES CONFERENCE CHAIR: Marc Demange, RMIT University, School of Science - Mathematical Sciences, Australia ICORES PROGRAM CO-CHAIRS: Greg H. Parlier, NCSU, United States Federico Liberatore, Cardiff University, United Kingdom PROGRAM COMMITTEE http://www.icores.org/ProgramCommittee.aspx ICORES Secretariat Address: Avenida de S. Francisco Xavier, Lote 7 Cv. C Tel: +351 265 520 185 Fax: +351 265 520 186 Web: http://www.icores.org e-mail: icores.secretariat@insticc.org","date_start":"2021-02-04","date_end":"2021-02-06","important_dates":{"abstract":"","full":"2020-09-14","notification":"","final":""},"topics":["Engineering & Technology","Other"],"location":{"virtual":"","full":["Vienna","Austria"],"name":"","street":"","city":"Vienna","state":"","ZIP":"","country":"Austria"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["icores.secretariat@insticc.org"]}