{"name":"Int'l Conference on Solid State Chemistry and Inorganic Synthesis","series":"","short":"SSCIS 2021","website":"https://www.confjuly.org/conference/SSCIS2021","content":"Important NOTE: Due to COVID-19 epidemic situation all over the world, most countries still maintain a strict policy of no-gathering, no-entering and leaving the country, and 14-days quarantine. We have to postpone the conference till July 16-18, 2021 in Kunming, China. Int'l Conference on Solid State Chemistry and Inorganic Synthesis (SSCIS 2021) Conference Date: July 16-18, 2021 Conference Venue: Kunming, China Website: https://www.confjuly.org/conference/SSCIS2021/ Online Registration System: http://www.confjuly.org/RegistrationSubmission/default.aspx?ConferenceID=1361 Email: intelconf@163.com Int'l Conference on Solid State Chemistry and Inorganic Synthesis (SSCIS 2021) will be held from July 16-18, 2021 in Kunming, China. The conference will cover issues on Solid state chemistry, Bonding in solids, Crystal chemistry, Synthesis of new compounds, Materials chemistry, Solid-state inorganic materials, Solid state reactions, Atomic and electronic structure of solids, etc. It dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods in related fields. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal，please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: intelconf@163.com Tel: +86 132 6470 2250 QQ: 1349406763, 3025797047 WeChat: 3025797047 Attendance Methods 1.Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Solid state chemistry Bonding in solids Crystal chemistry Synthesis of new compounds Materials chemistry Solid-state inorganic materials Solid state reactions Advances in solid state materials synthesis, new solids and compounds Atomic and electronic structure of solids Photonic and optical properties of solids Electrochemistry Physical chemistry of solids Advanced glasses, ceramics and polymeric materials and nano materials Microporous/mesoporous materials Chalcogenide, oxide, hydride materials 2d materials, surfaces, interfaces, hybrid- and nanostructured solids Functional materials Materials and processes of data storage Materials for renewable energy production and storage","date_start":"2021-07-16","date_end":"2021-07-18","important_dates":{"abstract":"","full":"2021-06-16","notification":"","final":""},"topics":["Engineering & Technology","Chemical"],"location":{"virtual":"","full":["Kunming","China"],"name":"","street":"","city":"Kunming","state":"","ZIP":"","country":"China"},"organizers":[""],"societies":[],"indexes":[],"emails":["intelconf@163.com"]}