{"name":"The 7th Quantitative Economics Conference","series":"","short":"QEC 2019","website":"http://www.marchconf.org/conference/QEC2019","content":"The 7th Quantitative Economics Conference (QEC 2019) Conference：March 23 - 25, 2019 Venue：Xi'an, China Website：http://www.marchconf.org/conference/QEC2019/ Online Registration Entrance：http://www.marchconf.org/RegistrationSubmission/default.aspx?ConferenceID=1083 The 7th Quantitative Economics Conference (QEC 2019) will be held from March 23 to 25, 2019 in Xi'an, China. This Conference will cover issues on Quantitative Economics. The aim of QEC 2019 is to provide a stage for researchers, engineers, academicians as well as industrial professionals from all over the world to present their latest research results and advanced research methods. Attendance Methods 1\\. Submit full paper. All the accepted papers will be published by a peer-reviewed open access journal \"Open Journal of Social Sciences\". 2\\. You are welcome to submit abstract for oral presentation or poster presentation. 3\\. You're also welcome to attend our conference (without submitting full paper or abstract) Contact Us Email: Rolinrolin@126.com Tel: +86 - 15527426990 QQ: 3025797047 The conference is soliciting state-of-the-art research papers in the following areas of interest: Econometrics Econometrics Theory and Method Applied Econometrics Microeconomics Mathematical Economics Game Theory Empirical Industrial Organization Macroeconomics Economic Growth and Development Empirical Macroeconomics Finance Financial Engineering Empirical Finance Venue Xi'an, is the capital of Shaanxi province, located in central-northwest China, records the great changes of the country just like a living history book. Called Chang'an (meaning the eternal city) in ancient times, it is one of the birthplaces of the ancient Chinese civilization in the Yellow River Basin area. As the eastern terminal of the Silk Road and the site of the famous Terracotta Warriors of the Qin Dynasty, the city has won a reputation all over the world. More than 3,000 years of history including over 1,100 years as the capital city of ancient dynasties, have endowed the city with an amazing historical heritage. Visitors marvel at the numerous historical sites and cultural relics in and around the city.","date_start":"2019-03-23","date_end":"2019-03-25","important_dates":{"abstract":"","full":"2019-03-13","notification":"","final":""},"topics":["Business","Economics"],"location":{"virtual":"","full":["Xi'an","China"],"name":"","street":"","city":"Xi'an","state":"","ZIP":"","country":"China"},"organizers":["Engineering Information Institute"],"societies":[],"indexes":[],"emails":["rolinrolin@126.com"]}