{"name":"Implementing Operations Risk Management within an ERM Framework","series":"","short":"","website":"https://www.complianceonline.com/implementing-operations-risk-management-within-an-erm-framework-webinar-training-703728-prdw?channel=brownwalker","content":"Sound management of operational risk is an integral part of strong governance, risk and compliance (GRC) and enterprise risk management. In this session, the instructor will define operational risk and explain how to identify, quantify, manage, and control it. He will discuss why all employees must be cognizant of these risks in their day to day jobs and how an organization can better manage and control these risks that have resulted in the failure of several high profile firms and significant losses and unwanted press at others. The course will also review and discuss the building blocks and key players in implementing an effective ORM program that is integrated into the enterprise risk management framework. Banks, investment firms, insurance companies and other financial institutions need to have a robust and effective operational risk management strategy, which is well integrated into the ERM framework. They also must understand the regulatory and risk mitigation needs of the current environment in order to protect consumer assets as well as their own operations from various operational risks. The financial services industry must raise the bar on operational risk management given the evolving market environment and the increased internal and external pressure for financial services institutions to be operationally sound and meet compliance requirements. Attending this training course will enable participants to understand how operational risks can be better managed and what strategies actually do work in the wake of ineffective management systems coming to light given recent events in the marketplace. This operational risk webinar is tailored to equip you with an in-depth knowledge and understanding of today’s operational risk challenges and effective strategies to deal with them.","date_start":"2020-11-18","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Management / Leadership","Business risk management"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}