{"name":"Researching Medical Education, RME 2021 Conference - Agility and Flexibility in Research","series":"","short":"","website":"https://www.asme.org.uk/events/rme2021","content":"Researching Medical Education is a one-day conference for all those interested in medical and clinical education research. The conference is designed and run by the Association for the Study of Medical Education’s Education Research Committee. This year's theme of agility and flexibility reflects important characteristics of successful clinical education research at any time, not just during a global pandemic. The process of research rarely goes completely to plan and can be influenced by factors beyond the researcher's control. RME 2021 presents an opportunity to share and discuss research approaches that allow for adaptation and to consider the practical and ethical implications of maintaining flexibility in research. Keynotes and interactive workshops will include discussion of the benefits and challenges of online research and how education research understanding can be applied in flexible ways. The RME conference will be of interest to career researchers, teachers of medical / clinical education research and those studying award bearing courses in medical and healthcare education. This includes those undertaking intercalated degrees, masters level courses and those undertaking doctoral level qualifications. Most of all it creates opportunities for rich and lively conversations and learning about educational research and scholarship. In line with the conference theme, we are offering a choice of attendance options. You can choose to attend the conference either in-person at Friends House, London (173-177 Euston Rd, NW1 2BJ), or online at your home or home institution. The in-person format will be familiar to those who have attended RME before, with a range of interactive workshops to suit clinical education researchers at all levels of experience, from beginners to experienced academics. The online programme is designed to particularly support attendees who are getting started in clinical education research and to meet the needs of both UK and international audiences.","date_start":"2021-11-18","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Medical-Speciality","medicine & medical science"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Association for the Study of Medical Education (ASME)"],"societies":[],"indexes":[],"emails":[]}