{"name":"Complete 1099, TIN Matching, B-Notice, FATCA and Nonresident Alien 1042-S Compliance Update","series":"","short":"","website":"https://www.complianceonline.com/form-1099-and-1042-s-irs-guidelines-fatca-best-practices-seminar-training-80238SEM-prdsm?channel=brownwalker","content":"For years the IRS has struggled with independent contractors and tax collection. In assessing opportunities to close the tax gap (taxes due but not reported or paid), one of the greatest opportunities comes from expanding information reporting on taxpayers by payers – the 1099\\. Collecting the tax due from NRAs working in the US is a Tier 1 audit issue. This tax burden is minimized when companies making payments to NRAs for dependent and independent personal services properly withhold on these payments. This time consuming reporting obligation can be streamlined in a number of ways. The IRS has placed the burden on businesses, non-profits and not-for-profits as well as all levels of government to report information about taxable payments they make to their account holders, vendors and customers. In order to more accurately match our information reporting to taxpayer’s tax returns they have introduced an ‘e-services’ portal to help us ensure the names and tax identification numbers provided to us by our payees match their records (TIN Matching System). When used properly, this system can reduce the risk of Warning Letters (CP-2100s/B-Notices) and penalty notices (972-CGs) from the IRS. Every year the IRS sends out millions of CP2100 Notices identifying incorrect names/TINS on 1099s. These letters have a very short deadline for responding.","date_start":"2020-09-03","date_end":"2020-09-04","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Finance","Banking finance fintech and regulations financial"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}