{"name":"The 12th Asia-Pacific Power and Energy Engineering Conference","series":"","short":"APPEEC 2021","website":"https://www.appeecevent.org/2021","content":"Important NOTE: Due to COVID-19 epidemic situation all over the world, most countries still maintain a strict policy of no-gathering, no-entering and leaving the country, and 14-days quarantine. We have to postpone the conference till April 17-19, 2021 in Xi'an, China. Please visit the official website to get more details: http://www.appeecevent.org/2021/ The 12th Asia-Pacific Power and Energy Engineering Conference(APPEEC 2021) Conference Date: April 17-19, 2021 Conference Venue: Xi'an, China Website: https://www.appeecevent.org/2021/ Online Registration System: http://www.appeecevent.org/RegistrationSubmission/default.aspx?ConferenceID=1378 Email: sub\\_peec@126.com The 12th Asia-Pacific Power and Energy Engineering Conference (APPEEC 2021) will be held from April 17-19, 2021 in Xi'an, China. APPEEC is an annual regular conference since 2009 and has been successfully held in Wuhan (2009 & 2011), Chengdu (2010 & 2017), Shanghai (2012 & 2014), Beijing (2013 & 2015), Suzhou (2016), Guilin (2018) and Xiamen (2019), China. You are invited to submit papers in all areas of Advanced Power Generation Technologies, Smart Grids and Intelligent Energy Systems, Electronic Power Transmission and Distribution and etc. Invited Speakers Prof. Tao Lin, Wuhan University, China Prof. Zhenghui Pan, National University of Singapore, Singapore Prof. Wen Huang, Hefei University of Technology, China Prof. Ahmed Kadhim Hussein, University of Babylon, Iraq Dr. Duleepa J Thrimawithana, University of Auckland, New Zealand If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: All the accepted papers will be published by a peer-reviewed open access journal that can ensure the widest dissemination of your published work, for more information, please contact us (sub\\_peec@126.com). Index: CNKI and Google Scholar Note: 1\\. If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. 2\\. Please download the Full Paper template and prepare your article according to it. The full length of one paper is suggested to be 8-10 pages (within the template format with all tables, figures and references). If your paper is over 10 pages, you will be kindly requested to pay for extra pages fees. 3\\. The simple Abstract submission should include the title, contents, keywords, authors names, affiliations and emails. The length is suggested to be controlled within 1 page and no more than 2 pages. 4\\. You will receive the review results within 3-5 working days after submission. If you do not get any notification within the time limit, please contact us as soon as possible. 5\\. You are welcome to submit papers in Chinese and please contact us for more details. Contact Us Email: sub\\_peec@126.com Tel: +86 13264702250 QQ: 87123853 WeChat: 3025797047 Attendance Methods 1.Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Advanced Power Generation Technologies Bio-energy Technologies, Process and Utilization Combined cycle power plants Combined heat and power Electric and Hybrid Vehicles Electrical Machines & Drives Electricity networks and electricity-generating technologies Energy Conversion Fuel Cell Technology Gas turbine–based power generation Geothermal and Tidal Wave Energy Grid-connected photovoltaic system Hybrid energy systems Hydropower and intermittent renewable generation Marine power generation technologies Ocean thermal energy conversion Photovoltaic for Solar Power Applications Photovoltaic hybrid system Plasma Technology Power system energy storage technologies Renewable energy and distributed generation Safe Nuclear Energy Generation and Utilization Thermal Power Technologies and Applications Tidal power plant design Traditional coal-fired power generation technology Waste Products as Fuel Wind Power Generation and Utilization Electronic Power Transmission and Distribution Advanced Distribution and SCADA Technologies Asynchronous generation and interconnect DC transmission and distribution Electromagnetic Compatibility in Power Systems Electromagnetic Transient in High Voltage Power Systems Electronic power transformers and switchgear Flexible electronic transmission Grid codes, polices and standards Grid protection, fault management and isolation Grid reliability, resiliency and security Harmonics and power quality High Voltage Engineering & Technology HVDC and Flexible AC Transmission System (FACTS) Insulation Condition Monitoring in Power Systems Over-voltage, Lightning Protection and Grounding Plasma Physics and the Pulsed Power Technology Power system stability, control, and frequency regulation Structured microgrids and standalone power systems Ultra High Voltage (UHV) Technologies Smart Grids and Intelligent Energy Systems Agent-based Simulation of Grid Environments and Markets Application of Wide Area Measurement System (WAMS) Automated Negotiation for Grid Resource Allocation Control Strategies for Modern Power System Stability Economic Models of Energy Efficiency Energy conservation Energy Monitoring Engineering of Grid Markets and Grid Architectures Integrated Substation Automation Technologies Integration of (distributed) stochastic energy generation Load Modeling, Estimation and Forecast Modeling and Simulation of Large Power Systems Modeling of complex energy systems Modeling of Grid Environments Online Monitoring and Fault Diagnosis System Optimization Techniques for Efficient Energy Consumption Power System Analysis and Optimization Power System Monitoring and Mitigation Technologies Power System Planning and Operation Resource Allocation in Grid Scenarios Using Agent-based Approaches","date_start":"2021-04-17","date_end":"2021-04-19","important_dates":{"abstract":"","full":"2021-03-17","notification":"","final":""},"topics":["Engineering & Technology","Renewable Energy/Nuclear","Power electronics & control"],"location":{"virtual":"","full":["Xi'an","China"],"name":"","street":"","city":"Xi'an","state":"","ZIP":"","country":"China"},"organizers":["Academic Communications"],"societies":[],"indexes":[],"emails":["_peec@126.com"]}