{"name":"The Place of Memory and Memory of Place","series":"","short":"","website":"http://memory.lcir.co.uk","content":"Memory is a major theme in contemporary life, a key to personal, social and cultural identity. Scholars have studied the concept from different perspectives and within different disciplines: philosophy, sociology, anthropology, geography, architecture, urban design, and the interdisciplinary “place studies”. According to Pierre Nora, places of memory or lieux de mémoire refer to those places where “memory crystallizes and secretes itself”; the places where the exhausted capital of collective memory condenses and is expressed. To be considered as such, these sites must be definable in the three senses of the word: material, symbolical and functional, all in different degrees but always present. What makes them a memory site is the interplay of memory and history, the interaction of both factors, which allows their reciprocal over-determination. “The Place of Memory and the Memory of Place” International Conference aims to spark new conversations across the field of memory and place studies. Papers are invited on topics related, but not limited, to: monuments and sites of trauma childhood homes city space and sightseeing burial places (graves, cementaries, necropoleis) ruins and forgotten places heterotopias and heterochronies toponymy and topoanalysis cartography and mapmaking The conference will bring together scholars from different fields including philosophy, psychology, sociology, anthropology, history, literature, linguistics, architecture, geography and others. Paper proposals up to 250 words should be sent by 1 February 2020 to: memory@lcir.co.uk. Download paper proposal form. Standard registration fee – 220 GBP Student registration fee – 180 GBP","date_start":"2020-06-20","date_end":"2020-06-21","important_dates":{"abstract":"","full":"2020-02-01","notification":"","final":""},"topics":["Life Sciences","Neuroscience"],"location":{"virtual":"","full":["Cambridge","United Kingdom"],"name":"","street":"","city":"Cambridge","state":"","ZIP":"","country":"United Kingdom"},"organizers":["LCIR"],"societies":[],"indexes":[],"emails":["memory@lcir.co.uk"]}