{"name":"International Conference on Innovations in Information Technology (IIT’20)","series":"","short":"","website":"https://conferences.uaeu.ac.ae/iit20/en/index.shtml","content":"IEEE 14th International Conference on Innovations in Information Technology Nov 17 – 18, 2020\\. UAE The safety and well-being of the conference participants is our priority. We are monitoring the current Covid-19 situation and as it stands, we do not know how this will evolve moving forward. In the event of travel and gathering restrictions remaining in place, IIT’20 will be held as a virtual conference. Call For Papers The International Conference on Innovations in Information Technology (IIT’20), https://conferences.uaeu.ac.ae/iit20/en/index.shtml , is a premier forum to present and discuss technology advances and research in the field of Information Technology. IIT’20 is the 14th in a series that started back in 2004\\. IIT’20 is technically co-sponsored by IEEE. The last 11 cycles of the conference were also technically co-sponsored by IEEE, and the proceedings are indexed in IEEE Xplore. IIT’20 aims to bring together leading educators, innovators and entrepreneurs in IT from around the world. The latest advances in computer science, security and privacy, data science, AI and the internet of things will be explored in the specialized tracks of the IIT’20 conference. Proposals for special sessions are also invited to complement the conference tracks, offering an opportunity for extended form of presentation or interaction than the regular conference program presentations. We look forward to your involvement and participation in this event. CONFERENCE TRACKS Internet of Things Track ­ IoT Architectures, and Protocols ­ IoT Services, Applications, and Systems ­ IoT Addressing and Identification Techniques ­ 5G Networks, Network Slicing, and Service Orchestration ­ PC-5, M2M Communication and IoT ­ Localization, precision, and mobility ­ Network Virtualization, Software Defined Networks, and Autonomous Network Management ­ Unmanned-Aerial-Vehicles (UAV) Platforms, Swarms and Networking. ­ Autonomous vehicle networking ­ Inter-play of IoT Platforms AI and Data Science Track ­ Big data Models and Algorithms ­ Big data Infrastructures ­ Deep Learning Algorithms ­ AI Applications and Systems ­ Multidisciplinary AI ­ Autonomic computing ­ AI and machine learning for Big Data ­ Big Data Processing on the Cloud ­ Predictive Analytics ­ Cognitive Computing ­ Data Quality and Privacy ­ Data Integration and fusion ­ Data Summarisation and Visualisation ­ Web search and Information Retrieval Security and Privacy Track ­ Applications Security ­ Network & Distributed Systems Security ­ Security and privacy for Big Data & the Cloud ­ Cryptography and Blockchain ­ Digital Forensics ­ Trust Management ­ Information Security Management & Risk Assessment ­ Cyber-Physical Systems Security ­ Internet of Things (IoT) security ­ Hardware Security SUBMISSION IIT’20 solicits original manuscripts to the tracks listed above, including but not limited to the above mentioned topics. Submitted papers should not have been previously published and should not be currently under review at any other conference or journal. Each submitted manuscript (six pages maximum including figures and references) will be peer reviewed, and acceptance will be based on quality, relevance, and originality. Submission will be through the EDAS conference management system http://edas.info. Submission guidelines are available on the conference website https://conferences.uaeu.ac.ae/iit20/en/index.shtml. IMPORTANT DATES Paper submission for all tracks August 15, 2020 Notification of Paper Acceptance October 1, 2020 Final camera-ready paper October 15, 2020 Conference Days November 17 – 18, 2020","date_start":"2020-11-17","date_end":"2020-11-18","important_dates":{"abstract":"","full":"2020-08-15","notification":"","final":""},"topics":["Business","Information-Technology","Information technology systems (IT)"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["United Arab Emirates University"],"societies":[],"indexes":[],"emails":[]}