{"name":"Major CGMP Issues - US FDA Concerns in 2022","series":"","short":"","website":"https://www.complianceonline.com/major-cgmp-issues-in-2022-webinar-training-702185-prdw?channel=Brownwalker","content":"This webinar will evaluate the chief areas of FDA CGMP and EU compliance inspections to see actual and anticipated changes in emphasis, and how to better prepare with a company's proactive internal inspection / audit program. Why Should You Attend: A review of recent US FDA Inspectional Observations / FDA Form 483 Observations, as well as FDA statements and actions, indicate the major areas of regulatory concern. The past is no indicator of present or future concerns. The Agency uses publicized high-profile cases to drive compliance in the regulated industries. Certain CGMP areas, e.g., CAPA, are receiving increased scrutiny. \"Risk-based\" (patient risk) is another. Failure to correct problems leads to Warning Letters or more severe regulatory actions. Requirement for \"better science\" must be evident in compliance. \"Business as usual\" is never acceptable, but do some of a company’s documents reflect that outdated thinking. Also changes from the EU, MDD to MDR, ISO 13485:2016 ... confusion over what is \"Risk\". Don't be caught off guard by these major shifts in emphasis. Refine internal audits and get your company prepared to address the FDA's most recent requirements both in the US and outside. Areas Covered in the Webinar: Recent industry trends, bad and good The FDA’s Strategic Priorities Major foreseeable problem areas for 2022 onward - The \"Heavy Hitters\" A company gap analysis Correcting problem-prone areas Avoid complacency from past “good” audits The Most Frequent / Serious 483’s – 483’s that generate Warning Letters The risk-based phased approach – what does that mean Prove “State of Control” Who Will Benefit: Senior Management Regulatory Affairs Quality Assurance Production R&D and Engineering","date_start":"2022-05-31","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}