{"name":"Lifecycle Management of Analytical Methods and Procedures according to new USP and ICH Guidelines","series":"","short":"","website":"https://www.complianceonline.com/analytical-methods-procedures-lifecycle-management-fda-usp-seminar-training-80616SEM-prdsm?channel=Brownwalker","content":"Results of analytical methods are used as the basis for important decisions during development and manufacturing of pharmaceutical products. All regulatory agencies expect the regulated industry to have procedures in place to ensure suitable levels of reliability, accuracy and precision of such methods. The procedures should cover lifecycle phases from design, development, validation to on-going routine use. Managing analytical methods and procedures according to the lifecycle approach has been recommended in recent FDA guidance documents and stimuli articles published by the USP. For example, the recent FDA guidance “Analytical Procedures and Methods Validation for Drugs and Biologics” contains a section on Lifecycle Management of Analytical Procedures. This 2-day workshop will explain the background to the new Analytical Procedure Lifecycle guidelines and give attendees the knowledge needed to implement recommended approaches. Interactive exercises will be included in the workshop. Learning Objectives: Learn about the regulatory background and recommendations for managing the lifecycle of analytical methods and procedures Understand current and future industry trends: the concept of lifecycle management of analytical methods, recent ICH guidance (ICH Q12), proposed USP General Chapter <1220> (Analytical Procedure Lifecycle) and Quality by Design (QbD) principles for method development and validation Learn how to plan, execute and document design, development and validation of methods developed in-house Understand the principles of lifecycle management for compendial procedures and for managing method transfer Be able to develop a strategy for analytical procedure lifecycle management Understand risk management strategies throughout the procedure lifecycle Understand the concept of measurement uncertainty Be able to justify and document decisions about type and extend of revalidation after method changes Who will Benefit: QA managers and personnel Quality control scientists Method development scientists Analytical chemists Validation specialists Laboratory managers and supervisors Regulatory affairs professionals Training departments Documentation departments Consultants","date_start":"2021-06-17","date_end":"2021-06-18","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}