{"name":"International Conference On Phosphorus, Boron and Silicon – PBSi 2019","series":"","short":"","website":"https://premc.org/conferences/pbsi-phosphorus-boron-silicon","content":"From chemistry to catalysis, materials, biology, and medicine, from theory to application, the main target of this conference is to gather Researchers and Experts in Phosphorus, Boron and Silicon community in order to provide all participants with the latest progress and inputs recorded in each field. Topics Recycling, green chemistry, environment impact & sustainability Fabrication processes and applications in the industry Materials science: polymers, thin films, nanopowders, ceramics, crystals, composites etc. Smart Inorganic Polymers Computational and theoretical chemistry Bioinorganic chemistry and application in medicine Energy, conversion & storage Catalysis processes & applications Optical, electrical and magnetic properties Advanced synthesis and characterization Reactions of coordination compounds General aspects of inorganic chemistry Chairman: Dr. Maurizio Peruzzini, Italian National Research Council, Italy Confirmed Speakers: Prof. Sylviane Sabo-Etienne, CNRS, Univ TOULOUSE, Fance Prof. Muriel Hissler, C.N.R.S., UNIV RENNES 1, France Prof. Aziz M. Muzafarov, Science Park, Netherlands Prof. Francesc Teixidor, Institut de Ciència de Materials de Barcelona, Spain Prof. Paul G Pringle, Science Park, Netherlands Dr. Anna Tampieri, Consiglio Nazionale delle Ricerche, Italy Prof. Guy Bertrand, University of California San Diego, USA Early bird submission - June 5, 2019 Early bird registration - July 5, 2019 Regular submission - September 18, 2019 Regular registration - October 18, 2019 Conference - December 2-4, 2019","date_start":"2019-12-02","date_end":"2019-12-04","important_dates":{"abstract":"","full":"2019-09-18","notification":"","final":""},"topics":["Physical Science & Math","Chemistry"],"location":{"virtual":"","full":["Rome","Italy"],"name":"","street":"","city":"Rome","state":"","ZIP":"","country":"Italy"},"organizers":["PremC"],"societies":[],"indexes":[],"emails":[]}