{"name":"ITU Kaleidosope 2020: Industry-driven digital transformation","series":"","short":"","website":"https://www.itu.int/en/ITU-T/academia/kaleidoscope/2020/Pages/default.aspx","content":"\\[Deadline Extended\\] -Kaleidoscope 2020 – Industry-driven digital transformation is the twelfth in a series of peer-reviewed academic conferences organized by ITU to bring together a wide range of views from universities, industry, and research institutions. The aim of the Kaleidoscope conferences is to identify emerging advancements in information and communication technologies (ICTs) and, in particular, areas in need of international standards to aid the healthy development of the Information Society. Theme The Fourth Industrial Revolution has data analytics at its core, and relies on innovations in fields such as robotics, cyber-physical systems, digital twins, virtual simulation, augmented reality, edge computing, artificial intelligence and blockchain – innovations all contributing to digital transformation of industrial processes. In particular, the manufacturing sector has been an early adopter of new technologies capitalizing on connectivity and intelligence, but these technologies introduce endless possibilities – the automotive, energy, retail and healthcare industries are all moving in this direction. Objective Kaleidoscope 2020 calls for original academic papers sharing insight into ongoing projects and research relevant to digital transformation. It targets specialists in the fields of ICT and socio-economic development, including researchers, academics, students, engineers, policymakers, regulators, innovators, and futurists. Date and venue 7-11 December 2020 ONLINE Submission of papers Prospective authors are invited to submit full, original papers. The submission should be within eight pages, including a summary and references, using the template available on the conference’s website. All papers will go through a double-blind peer-review process. Submission must be made electronically; see http://itu.int/go/K-2020 for more details on online submission (EDAS). Paper proposals will be evaluated based on content, originality, clarity, relevance to the conference’s theme and, in particular, significance to future standards.","date_start":"2020-12-07","date_end":"2020-12-11","important_dates":{"abstract":"","full":"2020-06-29","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Blockchain technology"],"location":{"virtual":"","full":["Online Event","Switzerland"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Switzerland"},"organizers":["Technically co-sponsored by IEEE; IEEE ComSoc and supported by IEEE TEMS"],"societies":[],"indexes":[],"emails":[]}