{"name":"2022 3rd International Symposium on Automation, Information and Computing","series":"","short":"ISAIC 2022","website":"https://www.isaic-conf.com/ ","content":"2022 3rd International Symposium on Automation, Information and Computing (ISAIC 2022) Time: December 9-11, 2022 Venue: Beijing Jiaotong University, Beijing, China (Virtual) Conference website: https://www.isaic-conf.com/ First round of submission deadline: June 30, 2022 Last round of submission deadline: October 15, 2022 Indexing: Scopus, EI compendex, CPCI Organized by Beijing Jiaotong University, 2022 3rd International Symposium on Automation, Information and Computing (ISAIC 2022) will be held online during December 9-11, 2022\\. ISAIC is a flagship annual international conference on computational intelligence, promoting all aspects of theory, algorithm design, applications and related emerging techniques. As a tradition, the ISAIC 2022 will co-locate a large number of topics within or related to computational intelligence, thereby providing a unique platform for promoting cross-fertilization and collaboration. ISAIC 2022 will be featured by keynote speeches, invited speeches, oral presentations and poster sessions. First Round Submission Deadline: June 30, 2022 Final Submission Deadline for Full Paper/Abstract: October 15, 2022 Early Registration Deadline: November 1, 2021 Highlights 1\\. Conference proceedings will be indexed by Scopus, Engineering Compendex (EI), Inspec, CPCI, and etc; 2\\. Select papers will be recommended for publication in SCI/ISI journals with impact factors; 3\\. Winner of best presentation will be awarded with a free registration for the next conference; 4\\. Online video presentation or publication only without physical attendance is also welcome. For more details, please contact the organizing committee. Email: isaic@confiswee.com Tel: +86 18271477133 WeChat: 18271477133 Website：https://www.isaic-conf.com/","date_start":"2022-12-09","date_end":"2022-12-11","important_dates":{"abstract":"","full":"2022-10-15","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Information Science"],"location":{"virtual":"","full":["Online Event","China"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"China"},"organizers":["Beijing Jiaotong University"],"societies":[],"indexes":[],"emails":["isaic@confiswee.com"]}