{"name":"2019 International Conference in the Future of Education in London - March","series":"","short":"","website":"https://go.evvnt.com/346418-0?pid=4868","content":"The aim of ICFE is to provide an opportunity for academicians and professionals from various educational fields with cross-disciplinary interests to bridge the knowledge gap, promote research esteem and the evolution of pedagogy. The ICFE-2019 invites research papers that encompass conceptual analysis, design implementation and performance evaluation. All papers submitted for possible presentation at ICFE and for publication in the proceedings are subjected to a double-blind, peer review process. ICFE-2019 is being organized by The Grid Media, UK. The Grid Media Ltd produces thought leadership digital and video content as well as curated and engaging conferences, roadshows, forums, seminars and workshops for businesses across industry sectors. Our events help organisations and professionals connect to share information that encourage knowledge acquisition, keeping abreast of market intel and global best practices whilst encouraging maximum networking and business development. One regular registration can cover a paper within 8 pages, including all figures, tables, and references. One regular registration with one or more additional papers has only one proceeding book or journal. Student fee is ONLY applicable for currently registered students. We are currently not receiving registration fee payment via bank wire. All payments are made using Western Union Money Transfer and Money Gram. Registration fee Author 400 GBP Authors (Students) 350 GBP Authors (Full Event) 550 GBP Presentation Only 350 GBP Attendees 385 GBP One-Day Tour & Dinner 100 GBP Additional Article (s) 100 GBP Authors' registration includes: Technical Sessions Coffee break and lunch on all days of the conference Conference bag and/or conference accessories Conference document (proceeding/journal on book) Reception Listeners' registration includes: Technical Sessions Coffee break and lunch on all days of the conference Conference bag and/or conference accessories Reception Time: 08:30 - 17:00 Tickets: https://go.evvnt.com/346418-2?pid=4868 Price: Author: £400.0, Authors (Students): £350.0, Authors (Full Event): £350.0, Presentation Only: £350.0, Attendees: £385.0, One-Day Tour & Dinner: £100.0, Additional Article(s): £100.0 Speakers: Dr. Bao Sheng (Aiden) Loe","date_start":"2019-03-27","date_end":"2019-03-29","important_dates":{"abstract":"","full":"2019-02-15","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Hallam Conference Centre","44 Hallam St","Marylebone","Lond","United Kingdom"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":["The Grid Media Ltd"],"societies":[],"indexes":[],"emails":[]}