{"name":"Quality and GMP Compliance for Virtual Companies (Pharmaceutical and Biologics Industries)","series":"","short":"","website":"https://www.complianceonline.com/fda-ema-inspection-gmp-gcp-qa-for-virtual-companies-seminar-training-80445SEM-prdsm?channel=Med%20Tech%20Directory","content":"Today, many companies operate on an outsourcing model. This is very common for companies who are evolving from being mainly development-focused to a point where they are entering latter stages of Phase 2 or Phase 3 clinical trials, and plan to have a product ready for market approval in the coming months. Most such companies are small, and may not have deep expertise in QA and GMP compliance, relying on their partners to cover those areas. Companies who outsource the majority of operations through the use of Contract Manufacturing Organizations (CMOs), Contract Research Organizations (CROs) and Contract Laboratories, however, remain responsible for the quality and compliance status of the products they send to the clinic or to the marketplace. In this two day workshop conference you will learn the requirements and expectations of major health care regulators that are applicable to \"virtual\" companies. You will learn how to diagnose your company's needs based on which GMP and GCP-governed operations you retain and which you outsource; what the current expectations and best industry practices are for selecting, qualifying and monitoring your contractors to ensure they are meeting your requirements; and how to build a quality system framework that is not excessive for your current needs, but has the structure and integration to \"grow with you\" as the scope your operations change in the coming months and years. You will also learn best practices for managing a regulatory inspection, with emphasis on FDA, EMA and Health Canada, but applicable to most other major agencies as well. Learning Objectives: Participants in this seminar will: Understand the GMP and GCP requirements all virtual companies must meet regardless of the extent of their outsourcing operations Understand how to select, qualify and monitor CMOs, CROs and Contract Laboratories Learn the elements to include in a quality agreement (also known as a technical agreement) Learn how to determine which GMP or GCP requirements apply to you, depending on the things you do internally and those you outsource Understand your obligations under the law for products you release to the clinic or the marketplace Appreciate the importance of maintaining data integrity Learn how to effectively manage a health regulatory inspection: Inspection logistics Who will Benefit: This course is designed for those charged with managing Quality Assurance and Regulatory Affairs for companies in the development or commercial phase of growth who either release investigational drugs to clinical trial sites or send commercial products to the market, but rely to a great extent on the use of Contract Manufacturers and/or Contract Laboratories. The following personnel will benefit from the course: Senior quality managers in manufacturing QA/GMP or clinical quality areas Quality professionals Regulatory professionals Clinical Operations Compliance professionals Quality auditors – GMP and GCP Document control specialists","date_start":"2021-03-29","date_end":"2021-03-30","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}