{"name":"2nd Edition of Advanced Chemistry on Materials Research and Recycling","series":"","short":"","website":"https://pagesconferences.com/2019/advanced-chemistry-conference","content":"According to National Ministry of Urban Wellbeing, Housing and Local Government of Malaysia statistics, it was revealed that only 5% of waste is being recycled of 30,000 tons of waste they produce every day and the remaining is left to be dumped. In a span of 10 years from 2003 -2013, the generation of municipal solid waste is increased by 91 percent in Malaysia. With the increasing population and consumption rates in Malaysia, the rate of waste disposal is also getting intensified. European Enhanced Landfill Mining Consortium estimated at least 500,000 landfill sites in Europe alone. It is just a 5 lines fact about Malaysian and European Landfills. The facts will dismay if we magnify issue in a global aspect. Though we have recycling option, but it is not working effectively. PAGES LLC joins the fight against Landfills to find a solution for the multiplying solid waste materials by offering a platform to share your research and reviews on recycling. On this note, PAGES LLC inviting all the nature lovers to join us in the 2nd Edition of Advanced Chemistry on Materials Research and Recycling in Kuala Lumpur, Malaysia during September 26-27, 2019 with the aim, “Recycle the present to save the future”. The first edition of chemistry focused on all aspects of chemistry, here we are very keen to work on every aspect of problems in environment regards to help for a safe and healthy future. We have sessions designed that will allow you to share your research on different types of Materials Research and their recycling. Being inspired by the quotation of Albert Einstein “We cannot solve our problems with the same thinking we used when we created them”, PAGES LLC is interested to work actively with recycling boards and societies to improvise the recycling procedures and to proclaim the importance of recycling and the need to recycle and the business that is happening on recycling work. Our sessions cover all topics from Materials Research to Recycling not just limited to Recoverable and Recyclable Catalysts Green Chemistry Recycling of Composite Materials Chemical Recycling BioMOFs: Metal–Organic Frameworks Polymer Degradation and Plastic Recycling Recycling of Municipal Solid Waste Fluorine Chemistry Electronic Waste Recycling Construction Materials and Recycling Solid Waste Management Techniques Mining, Quarrying and Recycling Landfills and Environmental Hazards Nanotechnology in Recycling Recyclates & its Quality Recycling Business Recycling industry is evergreen market and it generated $236 billion gross annual revenue and saved $3 billion municipal budgets towards landfill disposal fees in 2014\\. If you have any ideas of recycling the solid waste materials, hold this opportunity to put forth your views on an international platform to change the recycling methodologies. Let it be a very minute idea, but it will contribute to save our Mother Earth for future generations…","date_start":"2019-09-26","date_end":"2019-09-27","important_dates":{"abstract":"","full":"2019-08-20","notification":"","final":""},"topics":["Physical Science & Math","Chemistry","Recycling"],"location":{"virtual":"","full":["Kuala Lumpur","Malaysia"],"name":"","street":"","city":"Kuala Lumpur","state":"","ZIP":"","country":"Malaysia"},"organizers":["https://pagesconferences.com/"],"societies":[],"indexes":[],"emails":[]}