{"name":"Gender Research Workshop “The Female Gaze in Cinema”","series":"","short":"","website":"https://genderstudies.lcir.co.uk/gender-research-workshop-24-october-2020","content":"Gender Research Workshop “The Female Gaze in Cinema” 24 October 2020 – Online (Time TBC) organised by London Centre for Interdisciplinary Research and Academic LAB Film has long been a male-dominated industry, but for decades female directors against all odds have made an indelible mark on cinema. Today there is growing recognition of the important contributions made by women to the world of moving image, with audiences calling for more opportunities to be given to female screenwriters, cinematographers, editors, producers, performers and directors in a bid to defeat gender inequality. In this session we will identify psychoanalytic themes contained in films directed by women, exploring cinematic representations of the death drive, sexuality and mental illness. We will place a special focus on the feminine experience portrayed in stories told by women, and collectively discuss the ways in which cinema can evolve in order to more authentically depict female desire, fears and subjectivity. The following films will be discussed (advance viewing is optional): The Love Witch (Anna Biller, 2016) Daisies (Věra Chytilová, 1966) Fish Tank (Andrea Arnold, 2009) Berlin Syndrome (Cate Shortland, 2017) Cleo from 5 to 7 (Agnès Varda, 1962) Sherrybaby (2006) Laurie Collyer Mary Wild is the creator of the PROJECTIONS lecture series at Freud Museum London, applying psychoanalysis to film interpretation. Her interests include cinematic representations of mental illness, doppelgängers and the unconscious in the genres of horror, science fiction and documentary. Mary also co-hosts the PROJECTIONS Podcast available on iTunes and Spotify. The workshop is designed for students, young scholars and independent researchers with a particular interest related to gender studies. It will allow them to deepen theoretical and methodological knowledge and critical thinking in gender studies. All the registered participants who will attend the workshop will receive certificates. In order to book a place, please fill in the Booking Form and send it to workshops@lcir.co.uk by 20 September 2020\\. After you receive a confirmation of booking, please register on http://registration.lcir.co.uk. Registration fee is 45 GBP","date_start":"2020-10-24","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Social Sciences","Gender/Sexuality","gender studies (and womens)"],"location":{"virtual":"","full":["Online Event","United Kingdom"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research and Academic LAB"],"societies":[],"indexes":[],"emails":["workshops@lcir.co.uk"]}