{"name":"Salary History Bans: The New Pay Equity Frontier","series":"","short":"","website":"https://www.complianceonline.com/salary-history-bans-laws-webinar-training-705866-prdw?channel=Brownwalker","content":"This HR compliance webinar will discuss salary history laws and the steps employers should take to remain compliant during hiring process. Attendees will learn prohibitions mentioned under Salary Ban Laws and how to avoid discrimination in pay equity. Why Should You Attend: It’s the job interview question candidates love to dodge: What’s your current, or most recent, salary? A low figure could limit a candidate’s starting pay. A high number might make the candidate too expensive. Now, several states and cities are banning the question as part of efforts to ensure pay equity for women and minorities, but some companies say the new laws represent yet another intrusion into their businesses. It is often customary for employers to ask for salary history and use that information to set wages in a new position. But when we take a closer look, how is prior pay related to a worker’s ability to perform a new job? Shouldn’t employees be compensated for what their skills are worth to the new company and not be based on a different job from their past? A worker’s salary history follows her from job to job. Low pay at an early job can affect salary at a later one, because hiring managers often base their offer on previous pay. Even candidates who negotiate and advocate strongly for themselves at the salary phase can wind up with a lower offer than someone who happened to earn more at an earlier position. Who Will Benefit: Senior Leadership Human Resources Directors, Managers & Representatives Operations Professionals Compliance Professionals Recruiting Professionals Managers & Supervisors Employees","date_start":"2022-03-16","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Human-Resources"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}