{"name":"Strategies To Prevent Manufacture And Distribution Of Substandard Medications","series":"","short":"","website":"https://www.complianceonline.com/substandard-medications-manufacturing-prevention-webinar-training-706104-prdw?channel=Brownwalker","content":"Substandard medications, like counterfeit drugs, present a real and increasing danger both to patients and companies. In this webinar, learn how to take a proactive approach to stay ahead of these problems. Why Should You Attend: If a legitimate product is not manufactured according to quality standards or becomes degraded as it travels through its supply chain, it can be ineffective at best or deadly at worst. Examples of potential dangers that can occur include temperature excursions, inappropriate use, and unsafe ingredients inadvertently added to the product.In terms of effect, substandard pharmaceutical product is a worldwide issue on a par with counterfeiting. The following examples illustrate how the origins of such cases can vary but lead to similar deadly results. In the case of tainted cough syrup that caused at least 400 deaths in Panama in 2006, an inactive ingredient was the culprit when diethylene glycol, a poisonous substance used in antifreeze, was sourced by a Chinese manufacturer. In another instance, heparin sourced from China and used in a product made by Baxter Laboratories led to 149 deaths in the U.S. in 2007 and 2008\\. While there was no deliberate malicious intent, there was a neglect of quality that led to the tragic result. These and other events have raised questions about the quality of active ingredients sourced from many countries and used in products manufactured and marketed in the U.S. Areas Covered in the Webinar: The problem Poisons Temperature excursions Risks to patients Risks to companies Solutions Maintain a robust quality system Supplier quality Product testing Monitoring temperature Join industry and governmental efforts to improve product quality worldwide Current initiatives Benefits to Pharma companies Who Will Benefit: Pharmaceutical industry, particularly those employees in the Supply Chain, including: Quality Assurance, Packaging and Labeling, Manufacturing, and Warehousing and Distribution.","date_start":"2021-12-06","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}