{"name":"Migraine Trust Virtual Symposium | 3-9 October 2020 | Free Registration","series":"","short":"","website":"https://go.evvnt.com/626462-0?pid=4868","content":"We are disappointed not to be able to meet face-to-face in London this year, however, we are delighted to announce that content from the scientific programme will be brought to you virtually on 3-9 October 2020\\. The free Migraine Trust Virtual Symposium will include access to presentations from leading neurologists, allow delegates to share research with colleagues via abstract sessions, obtain CPD accreditation and the opportunity to hear from industry partners via the virtual exhibition space and symposia programme. The Migraine Trust Virtual Symposium will include the following components: - Live scientific programme sessions with interactive panel discussions - The MacDonald-Critchley Lecture - The Migraine Trust Lecture - 7 days of live sessions covering the latest topics and updates - The opportunity to network with colleagues and stay connected - On demand sessions: all content will be available after the live sessions - Industry symposia programme - Exhibition space to explore and connect with industry professionals - Learn from others' research via the virtual portal MTIS believes that it is important to share work during this time and to ensure that the event is inclusive for everyone with the interest to learn and engage with the community, the event will be free to register and attend. First held in 1976, MTIS is the world's longest established headache conference. We have always striven to place clinicians and scientists interested in headache together at a meeting run by our most important stakeholder: headache patients, particularly with migraine, and those who care for them. Price: Virtual Congress Access: GBP 0.0 Time: 10:00 - 17:00","date_start":"2020-10-03","date_end":"2020-10-09","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Public-Health"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["The Migraine Trust Virtual Symposium c/o MCI UK Ltd"],"societies":[],"indexes":[],"emails":[]}