{"name":"5th International Conference on Quantum and Particle Physics","series":"","short":"","website":"http://quantumphysics.alliedacademies.com","content":"The 5th International Conference on Quantum Physics and Particle Physics a two-day gathering of prominent physicists, researchers, students and experts in the industry of quantum technology on October 21-22, 2019 at Zurich, Switzerland. Over the past 4 years, our Physics conferences attendees have enjoyed a sound technical program with a world of opportunities to explore the future. At this quantum physics conference let us celebrate what we, as a professional community, have achieved. In addition, the future vision of this meetings is to create even greater value to all corners of the globe. With keynotes, oral and poster presentations, to delegates and exhibitors from national and international, this quantum physics conference will be filled with the greatest minds to share your thoughts and exchange ideas on how to chart your journey forward to reach new heights. The highlights of the conference are Quantum Mechanics, Quantum Field Theory (QFT), Particle Physics, Nuclear Physics, Cosmology and Astroparticle Physics, Colliders and Particle Accelerators, Plasma Physics, AMO Physics, Quantum Topology, Quantum Spintronics, Quantum Technology, Quantum Computing, Quantum Optics and Quantum Information, Quantum Cryptography, Quantum Sensing, Quantum Metrology, Quantum Imaging, Quantum Materials, Quantum Electronics. Target Audience: We are providing a stage for physicists, theoretical physicists, mathematical physicists, quantum physicists, experimental physicists, quantum engineers, nuclear physicists, particle physicists, research scientists, CEOs, Directors, students, young researchers, lecturers, exhibitors, industrial delegates and technicians. For complete information visit our conference website: http://quantumphysics.alliedacademies.com/ Organizer Details: Sharon Park Program Manager | Quantum Physics 2019 47 Churchfield Road, London W36AY, UK Tel: +44 203 769 1755 E-mail: Quantumconference@outlook.com","date_start":"2019-10-21","date_end":"2019-10-22","important_dates":{"abstract":"","full":"2019-09-20","notification":"","final":""},"topics":["Education / Legal / Other","Other"],"location":{"virtual":"","full":["zurich","Switzerland"],"name":"","street":"","city":"zurich","state":"","ZIP":"","country":"Switzerland"},"organizers":["Allied Academies"],"societies":[],"indexes":[],"emails":["quantumconference@outlook.com"]}