{"name":"International Online Conference on Digital Humanities","series":"","short":"","website":"http://digital.humanities.lcir.co.uk/?fbclid=IwAR0F-HLmqnDCF-n6Zru26yD_rNWT0DJ31vV7vKC9t3tuwtIXBypl95bzwog","content":"With the epidemic shaking the world and the research/teaching/learning being moved online, the field of Digital Humanities has received an unprecedented attention of scholars and professionals. It has become vital to explore its theories, methods and practices and to clarify its multiple possibilities and challenges. | This conference will look at the interaction of humanities and digital technologies and the use of humanities related digital resources in various fields. It will analyse the ways digital humanities transformed and keep transforming academic environment, local communities and global conversations and the innovative ways of sharing knowledge and teaching it introduced. | We invite proposals from various disciplines including IT, media and communication, design, history, political sciences, philosophy, sociology, anthropology, literature, linguistics, psychology, etc. | Papers are invited on topics related, but not limited, to: practicing digital humanities, teaching digital humanities, digital collections, data and research processes, digital humanities across class, race and gender, digital humanities as activism and artistic practice, digital humanities and cyberculture. | Paper proposals up to 250 words and a brief biographical note should be sent by 10 August 2020 to: digital.humanities@lcir.co.uk. Please download Paper Proposal Form. Registration fee – 90 GBP The conference will be held online. Papers presented at the conference will be published in a post-conference volume with an ISBN number.","date_start":"2020-10-24","date_end":"2020-10-25","important_dates":{"abstract":"","full":"2020-08-10","notification":"","final":""},"topics":["Arts & Humanities","Other","interdisciplinary"],"location":{"virtual":"","full":[""],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":["London Centre for Interdisciplinary Research and Academic LAB"],"societies":[],"indexes":[],"emails":["digital.humanities@lcir.co.uk"]}