{"name":"First Analysis Mathematica International Conference / 12-17 August, 2019","series":"","short":"","website":"https://go.evvnt.com/412956-0?pid=4868","content":"This event is to promote the 45-year-old journal Analysis Mathematica and provides a good opportunity for professors and young researchers, current or future authors of Analysis Mathematica to present their results and to foster possible collaborations. URLs: Tickets: https://go.evvnt.com/412956-2?pid=4868 Booking: https://go.evvnt.com/412956-3?pid=4868 Brochure: https://go.evvnt.com/412956-4?pid=4868 Prices: Early bird: EUR 350.0 Standard: EUR 390.0 Speakers: Imre Bárány - London University College, Sergei Chobanyan - Georgian Technical University, Tamás Erdélyi - Texas A&M University, Hans G. Feichtinger - University of Vienna, Polina Glazyrina - Ural Federal University, Alexander Goncharov - Bilkent University, Karlheinz Gröchenig - University of Vienna, Bernhard Haak - Université Bordeaux 1, Gergely Harcos - Alfréd Rényi Institute of Mathematics, Valerii Ivanov - Tula State University, Philippe Jaming - Université Bordeaux 1, Sergey Konyagin - Steklov Mathematical Institute, Risto Korhonen - University of Eastern Finland, Dávid Kunszenti-Kovács - Eötvös Loránd University, Miklós Laczkovich - Eötvös Loránd University, Alexey Lukashov - Moscow Institute of Physics and Technology, Rainer Nagel - University of Tübingen, Gergő Nemes - Alfréd Rényi Institute of Mathematics, János Pintz - Alfréd Rényi Institute of Mathematics, Imre Ruzsa - Alfréd Rényi Institute of Mathematics, Vladimir Stepanov - Steklov Mathematical Institute, Sergey Tikhonov - Catalan Institution for Research and Advanced Studies, Alexander Tyulenev - Steklov Mathematical Institute, Oleg Vinogradov - Sankt-Petersburg State University, Brett Wick - Washington University - St. Louis Time: 9:00 am to 5:00 pm","date_start":"2019-08-12","date_end":"2019-08-17","important_dates":{"abstract":"","full":"2019-08-11","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Budapest","Hungary"],"name":"","street":"","city":"Budapest","state":"","ZIP":"","country":"Hungary"},"organizers":["Conference coordinator"],"societies":[],"indexes":[],"emails":[]}