{"name":"8th International Conference on Materials Science and Nanotechnology","series":"","short":"","website":"https://materialsscience.pulsusconference.com","content":"Materials Science 2020 is delighted to welcome all the participants around the globe to participate in the “8th International Conference on Materials Science and Nanotechnology”, a global two days event that is set to happen between 21st and 22nd of September 2020 in London, United Kingdom. Due to the enormous response to Materials science 2019, the current edition of materials science conference Materials science 2020 will act as a common ground for all the professionals and researchers to gather and have a great time and updating their knowledge at the same time. The materials science conference will revolve around the theme “Trends and prospects of materials science and nanotechnology”. Some of the major topics that are to be discussed on materials science conference includes Polymer Science and its Trends Energy harvesting materials Nanoscience and Nanotechnology Metallurgy Nanomedicine and Nanosensors Soft Materials and Crystal Engineering The conference also focuses on helping the research scholars to know about the recent advancements that are made in the field of Materials Science and its ability to have a much greater impact on the future. Introduction of Nanotechnology on Materials Science provides the researchers with more number of opportunities to develop a novel product. The Materials Science and Nanotechnological prospects are not known clearly and the conference focuses on updating just that.","date_start":"2020-09-21","date_end":"2020-09-22","important_dates":{"abstract":"","full":"2020-08-17","notification":"","final":""},"topics":["Engineering & Technology","Material/Nanotechnology","Nanomaterials"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}