{"name":"Personal and Business Tax Returns Analysis - 1040 Federal Tax Returns, K-1 Forms and Tax Code Updates","series":"","short":"","website":"https://www.complianceonline.com/personal-and-business-tax-returns-analysis-1040-tax-returns-k1-forms-tax-code-update-webinar-training-705011-prdw?channel=Brownwalker","content":"This personal and business tax returns analysis training program will focus on key areas such as 1040 federal tax returns, K-1 forms, and tax code updates and how they affect bank’s clients. It will also discuss the structure of a C corporation, S corporation, and Partnership (including LLC) tax return. Why Should You Attend: Attend this proactive webinar and gain an understanding of the often complex and confusing topic of TAXES! Bank personnel are required to obtain and properly interpret tax returns for both commercial and consumer lending purposes. The first part of this webinar will concentrate on personal tax return analysis while the second part will focus on the analysis of various business tax returns Learning Objectives: The objectives of the first part of the webinar consist of the following: Review the basic structure of the personal 1040 federal tax return (including the various schedules and K-1 forms), Use analysis techniques to prepare a personal cash flow from information gleaned from the 1040 and the related schedules, Discuss recent changes in the tax code including the “Tax Cuts and Jobs Act” (TCJA), the CARES Act, and proposed tax legislation and how they affect the bank’s individual borrowers/guarantors, and Describe how the 1040 tax return can be used to market the bank’s products and services. Who Will Benefit: Commercial Lenders Credit Analysts Loan Documentation Specialists Relationship Managers Branch Managers Private Bankers Business Development Officers Bank Directors Compliance Managers and Officers Risk Managers and Officers Controllers Presidents/Vice Presidents Managers/Supervisors Sales Representatives Marketing Personnel","date_start":"2022-05-17","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}