{"name":"Addressing Non-Conformances using Root Cause Analysis","series":"","short":"RCA","website":"https://www.complianceonline.com/root-cause-analysis-rca-in-laboratory-and-addressing-non-conformance-webinar-training-704861-prdw?channel=Brownwalker","content":"In this webinar you will learn how to determine the Root Cause origin of a problem. You will learn a specific set of steps, with associated tools, to find the primary cause of the problem, so that you can prevent occurrences. Why Should You Attend: RCA assumes that systems and events are interrelated. An action in one area triggers an action in another, and another, and so on. By tracing back these actions, you can discover where the issue started and how it grew into the problem you're now facing. Root Cause Analysis (RCA) is a popular and often-used technique that helps people answer the question of why the problem occurred in the first place. If you only fix the symptoms – what you see on the surface – the problem will almost certainly happen again, which will lead you to fix it, again, and again, and again. If, instead, you look deeper to figure out why the non-conformance is occurring, you can fix the underlying systems and processes that caused it. Root Cause Analysis (RCA) is a popular and often-used technique that helps people answer the question of why the non-conformance occurred in the first place. Learning Objectives: Learn to determine the Root Cause origin of a problem. You will learn a specific set of steps, with associated tools, to find the primary cause of the problem, so that you can: Determine what happened Determine why it happened Figure out what to do to reduce the likelihood that it will happen again Areas Covered in the Webinar: Defining the Problem Examining the Data Identifying Possible Causal Factors Identifying the Root Cause(s) Taking Corrective Action Verifying the effectiveness of the corrective action Who Will Benefit: This webinar will provide valuable assistance to: Microbiologists QA managers Laboratory managers Laboratory supervisors QC practitioners","date_start":"2022-02-15","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}