{"name":"Optoelectronics conference -2020","series":"","short":"","website":"https://www.olcinternational.com/semiconductors-2020","content":"Global semiconductors and optoelectronics markets are expected to reach a market value of US$ 53.0 billion by 2024 with a compound annual growth rate of 7.3 percent. Semiconductors and optoelectronic devices have gained increasing attention for the past few years given their use on the Internet and other optical communication devices. Research in this field helps in understanding the design and operation of semiconductors, optoelectronic materials, and nanostructured materials. To strengthen emerging experimental and theoretical research activities in these fields, OLC International is organizing the International Conference and Exhibition on Semiconductors, Optoelectronics and Nanostructures, scheduled to be held during May 18-19, 2020 in Athens, Greece. The theme of the conference is \"Provoking the Development in Semiconductors, Optoelectronics & Nanostructures\" which rightly focuses on new and important findings in these fields. The event aims to facilitate the dissemination of interdisciplinary research results in inter-related and converging fields of semiconductors, nanoelectronics, and optoelectronics and encourages the participants to submit their work to gain valuable insights from established leaders in their field. Covering some of the broadly defined research areas in these fields, this conference is dedicated to bringing together a significant number of diverse scholarly events to be presented within the conference program. The event is an ideal platform for scientists, researchers, research students, academicians and industry professionals in semiconductors, optoelectronics nanostructures studies to exchange and share their experiences and research results on different aspects of these fields. Scholarly discussions, keynote lectures, plenary talks and video and poster presentations which run across the span of the conference will be of exceptional value for all the participants. The conference solicits contributions of abstracts, papers, and e-posters that address the topic and theme of the conference. We hope this conference will make a valuable contribution to your career and business goals while you enjoy your stay and explore the historical and beautiful city of Athens. We look forward to welcoming you to Semiconductors-2020 in Athens.","date_start":"2020-05-18","date_end":"2020-05-19","important_dates":{"abstract":"","full":"2020-05-18","notification":"","final":""},"topics":["Education / Legal / Other","Education","Optics and Laser Science"],"location":{"virtual":"","full":["athens","Greece"],"name":"","street":"","city":"athens","state":"","ZIP":"","country":"Greece"},"organizers":["OLC International"],"societies":[],"indexes":[],"emails":[]}