{"name":"Process Validation Guidance Requirements","series":"","short":"","website":"https://www.complianceonline.com/fda-eu-annex15-ich-process-validation-qualification-cgmp-ppq-seminar-training-80375SEM-prdsm?channel=Brownwalker","content":"The Process Validation Guidelines (January 2011) and the EU Annex 15: Qualification and Validation (October 2015) outline the general principles and approaches the two regulatory bodies consider appropriate elements of process validation for the manufacture of human and animal drugs and biological products, including Active Pharmaceutical Ingredients (APIs). These guidances align Process Validation activities with a product lifecycle concept and with existing FDA and EU guidances, including the FDA/International Conference on Harmonization (ICH), Guidance for Industry, Q8 (R2) Pharmaceutical Development, Q9 Quality Risk Management, and Q10 Pharmaceutical Quality System. The lifecycle concept, new to these Guidances, link product and process development, qualification of the commercial manufacturing process, and maintenance of the process in a state of control during routine commercial production. These guidances also support process improvement and innovation through sound science and risk management. The new Process Validation Guideline/Practice incorporate elements of Process Validation as early as the Research and Development phase, and continues onward through Technology Transfer, into the Phase 1 IND Clinical Trial manufacturing phase, and ultimately into Phase 2 and 3, and then commercial manufacturing. Learning Objectives: Why these FDA Guidance/EU Guidelines for Industry - Process Validation is so important to the pharmaceutical and biotechnology industry. What FDA segments are included and excluded within the \"NEW\" Process Validation. Where does the Process Validation commence. What are the Three Stages and Where They Apply within the NEW Process Validation. How Stage 1 integrates with Phase 1\\. The Validation approaches that are included within this Guidance document. The Statutory and Regulatory Requirements for Process Validation. An Introduction to Phase 1 Guidance for Industry and Its Application within the \"NEW\" Process Validation. The Phase 1 Investigational Drug Requirements -- What is and What is NOT Required. General Considerations for Process Validation - Stage 2 Process Qualification. Who Will Benefit: Those who will benefit from this ON-LINE seminar include Product Development Project Management Regulatory Compliance Quality Assurance Quality Control","date_start":"2021-12-02","date_end":"2021-12-03","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Information-Technology"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}