{"name":"Int'l Conference on Environment and Clean Energy","series":"","short":"ICECE 2021","website":"http://www.novevents.org/conference/ICECE2021","content":"International Conference on Environment and Clean Energy (ICECE 2021) Conference Date: November 26-28, 2021 Conference Venue: Xiamen, China Website: https://www.novevents.org/conference/ICECE2021/ Online Registration System: http://www.novevents.org/RegistrationSubmission/default.aspx?ConferenceID=1402 Email: rolin\\_zhang@163.com International Conference on Environment and Clean Energy (ICECE 2021) will be held during November 26-28, 2021 in Xiamen, China. This Conference will cover issues on Alternative Energy Technologies and applications,Architectural Environment & Equipment Engineering,Bioenergy, Biofuels and Biomass Conversion and other related fields. It dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal，please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: rolin\\_zhang@163.com Tel: +86 13264702250 QQ: 1349406763, 3025797047 WeChat: 3025797047 Twitter: conf\\_Committee Attendance Methods 1.Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Alternative Energy Technologies and applications Architectural Environment & Equipment Engineering Bioenergy, Biofuels and Biomass Conversion Carbon Sequestration Clean Coal and Fossil Fuels Clean Energy Systems and Technologies Clean Production Process Energy-Saving Technology Environmental Materials Environmental Planning and Assessment Environmental Analysis and Monitoring Environmental Engineering Gasification Geothermal Energy Green Energy Systems Green Power Production and Cogeneration Hydrogen and Fuel Cell Technologies Hydrogen Energy and Hydropower Low Carbon Technologies Materials and Nanotechnology for Energy Systems Mini Hydro Power New Energy Applications Nuclear Energy Technologies and Applications Nuclear Hydrogen Production Novel Energy Conversion Studies Noise and Vibration Control Ocean Energy Photovoltaic Systems and Photocatalysis Renewable Energy Resources Solar Cells Energy and Solar Thermal Energy Solar Energy Engineering Sustainable Energy Technologies Thermodynamic and Energy Optimization Tidal Energy and Wave Energy Turbines and Generators Waste-to-energy Waste Disposal and Recycling Wind Energy Systems","date_start":"2021-11-26","date_end":"2021-11-28","important_dates":{"abstract":"","full":"2021-11-26","notification":"","final":""},"topics":["Physical Science & Math","Ocean/Water"],"location":{"virtual":"","full":["Xiamen","China"],"name":"","street":"","city":"Xiamen","state":"","ZIP":"","country":"China"},"organizers":["Academic Communications"],"societies":[],"indexes":[],"emails":["_zhang@163.com"]}