{"name":"2019 International Conference on Quality of Life","series":"","short":"","website":"http://as4qol.org/icqol/2019","content":"The International Conference on Quality of Life returns to it roots in 2019, convening this September 28-29th in Kyoto, Japan. As global environmental, social, and other challenges to quality of life continue to grow more serious, the need for renewed enthusiasm and novel approaches becomes more urgent; consequently, researchers worldwide who are earnestly looking for insight and solutions are creating participating in more venues to come together and share their findings. We hope you can engage in this process by joining us for this year's ICQoL conference. We look forward to hearing a variety of stimulating and thought provoking presentations generating lively discussions about new, old, and diverse perspectives on Quality of Life. One of the significant benefits of attending a multidisciplinary conference is that it allows participants to develop new connections and find new synergies. Past topics have covered a range of topics in Education, Psychology, Healthcare, Social Sciences, among others. The comfortable and relaxed setting provides a unique forum for developing genuine understanding and insight that transcends disciplinary, national, and other barriers. Please check below for more details on how to participate. Call for Abstracts/Papers Researchers, practitioners, representatives, artists, consultants, scholars, and others active in EHPSS or other quality of life (QoL) related topics are cordially invited to submit abstracts for oral presentations for ICQol-2019\\. The types of presentations sought should be in the following categories: • Education • Health Care • Psychology • Social Sciences These may include (but are not limited to): experimental accounts, case and group studies, research work, reports, and works of art & craft, works-in-progress, and workshops. Full information about topics to be covered, and submission requirements, and conference checklist can be found on our Presentations and Abstracts page. Academic Society for Quality of Life About Academic Society for Quality of Life The AS4QoL was launched in 2014 to promote, exchange, and share academic activities, knowledge, and various aspects of the quality-of-life (QoL) via research interaction, publication, and meetings. AS4QoL publishes the Journal of AS4QoL (JAS4QoL) with all themes and topics related to QoL (About Our Journal). The AS4QoL aspires to organize yearly meetings at various international sites with one meeting held at its base, Kyoto at intervals of 3 calendar years. Subscribing to the Journal of the Academic Society for Quality of Life automatically enrolls the subscriber as a member of the Academic Society for the Quality of Life (AS4QoL). Contact Info: For more information see our website or email icqol.secretary@gmail.com Contact Email: icqol.secretary@gmail.com URL: http://as4qol.org/icqol/2019/","date_start":"2019-09-28","date_end":"2019-09-29","important_dates":{"abstract":"","full":"2019-09-20","notification":"","final":""},"topics":["Social Sciences","Other","Health and Environment"],"location":{"virtual":"","full":["Kyoto","Japan"],"name":"","street":"","city":"Kyoto","state":"","ZIP":"","country":"Japan"},"organizers":["as4qol"],"societies":[],"indexes":[],"emails":["icqol.secretary@gmail.com"]}