{"name":"US FDA Medical Device QSR, 21 CFR 820 and Quality Management System","series":"","short":"","website":"https://www.complianceonline.com/us-fda-medical-device-qsr-21-cfr-820-and-quality-management-system-webinar-training-705794-prdw?channel=Brownwalker","content":"Learn the basic overview of the original medical device Quality Management System -- The US FDA’s CGMP, Quality System Regulation (QSR) under 21 CFR 820\\. Implementation, training requirements and content, and annual internal audit / inspection expectations. The FDA’s four key areas of compliance under QSIT. Why Should You Attend: In the U. S., the Quality System (QS) Regulation (21 CFR Part 820) governs the manufacturing of medical devices, the device CGMPs. What is the importance, and purpose, and the framework of basic requirements for design and manufacture of medical devices, as well as a summary of the key requirements, the 15 subparts, terms, and the underlying purpose for the requirements under the Device CGMPs? How is a company’s quality management system “established / implemented and maintained under this Quality Management System (QMS)? Major discussion points: Regulatory requirements that apply to the methods, facilities and controls used for device design and development, production, installation, documentation, and servicing. Also: the Quality Management System, Management Responsibility, Managing Resources, Planning, Design and Development / Control, Change Control, Purchasing, Production, and Monitoring, Analysis, and Improvement. Areas Covered in the Webinar: What are US FDA expectations for a compliant device QSR? How can a company develop and maintain a dual QMS. Basic Systems / SOPs. QSIT (FDA’s Quality System Inspection Technique) Brief discussion of ISO 14971 (Device Risk Management) and IEC 62366-1 (Use Engineering / Human Factors) and where they fit. Current areas of FDA concern. Other US FDA device requirements. Maintaining compliance under increasing regulatory expectations. Similarities /differences to ISO 13485 and the MDR. Who Will Benefit: R&D Engineers Software developers QA / RA Marketing Manufacturing Operations Staff Middle Management Senior Management","date_start":"2022-03-01","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}