{"name":"ICOPEC 2020 - XI. International Conference of Political Economy:","series":"","short":"","website":"www.icopec.org","content":"11th International Conference of Political Economy (ICOPEC 2020) scheduled to be held on 24th – 26th June 2020 at Marmara University in Istanbul. The main theme of ICOPEC 2020 has been identified as “Global Inequalities”. The conference aims to identify the main drivers behind the widespread increase of inequalities and how they can be reversed to achieve a level playing field. Apart from its main theme, ICOPEC 2020 invites and welcomes all contributions that enrich the perspectives of Political Economy and expand the ground for better policy analyses and making. For indicative presentation topics see: http://www.icopec.org/call-for-papers/ ICOPEC 2020 organized by Marmara University, Panteion University, Westminster University, VUZF University, Georgian Technical University, Kinnaird College for Women, University of Belgrade, Ostrava Technical University, Pontifical Catholic University, Batman University, Greek Political Economy Association, Piedmont Institute for Social and Economic Research, and IJOPEC Publishing. The conference languages are English and Turkish. The paper abstracts must be between 150 and 250 words. Regular Registration deadline for abstract submission is 10th March 2020\\. You will receive notification of approval by 15th March 2020\\. Deadline for Regular Registration Fee Payment is 20th March 2020 and deadline for Full Paper Submission for Proceedings (Not Obligatory) is 15th April 2020\\. All accepted abstracts and full papers will be published before the conference in the proceeding. After the conference, the revised papers that satisfy at least two referees will be published as edited international book chapters in English by IJOPEC Publication with ISBN in October 2020\\. BEST PAPER AWARD 3 Best Paper Awards (Certificate of Best paper) will be given to submitted full paper authors (oral & virtual presentations) by the scientific committee for the disciplines of Political Economy, Public Administration, Public Finance, Labour Economics, International Relations, Economics, Politics, Sociology, Anthropology, Philosophy, Gender, and Sustainability. The deadline for Best Paper Award application is June 15, 2020\\. VIRTUAL PRESENTATION ICOPEC 2020 encourages active participation in the conference. Nevertheless, those who are unable to attend can participate in the conference through a virtual presentation. IMPORTANT DAYS Dates of the Conference: 24th June – 26th 2020 Abstract Submission Deadline (for Early Bird Registration): 20th February 2020 Abstract Submission Deadline (for Regular Registration): 10th March 2020 Notification of Approval (for Early Bird Registration): 24th February 2020 Notification of Approval (for Regular Registration): 15th March 2020 Early Bird Registration Fee Payment Deadline: 28th February 2020 Regular Registration Fee Payment Deadline: 20th March 2020 Full Paper Submission for Proceedings Deadline: 15th April 2020","date_start":"2020-06-24","date_end":"2020-06-26","important_dates":{"abstract":"","full":"2020-06-24","notification":"","final":""},"topics":["Business","Economics","Sociology, Social Sciences"],"location":{"virtual":"","full":["Istanbul","Turkey"],"name":"","street":"","city":"Istanbul","state":"","ZIP":"","country":"Turkey"},"organizers":["Marmara University"],"societies":[],"indexes":[],"emails":[]}