{"name":"Statistical Elements of Post Market Clinical Follow-up","series":"","short":"PMCF","website":"https://www.complianceonline.com/statistical-elements-pmcf-seminar-training-80660SEM-prdsm?channel=Brownwalker","content":"The EU MDR 2017/745 includes new standards for CE marking of devices in the EU, one of the new standards is for the development and execution of a Post Marketing Clinical Follow-up plan. (PMCF). PMCF is a continuous process that updates the clinical evaluation and shall be addressed in the manufacturer’s post market surveillance plan. When conducting PMCF, the manufacturer should proactively collect and evaluate clinical data from the use in or on humans of a device which bears the CE marking and is placed on the market with the aim of confirming the safety and performance throughout the expected lifetime of the device, of ensuring the continued acceptability of identified risks and of detecting emerging risks on the basis of factual evidence. PMCF shall be performed pursuant to a documented method laid down in a PMCF plan. The focus of this seminar is to provide the statistical understanding and information needed to design and report a post-market clinical follow-up (PMCF) study. Making use of The MDCG 2020-1 Post market clinical follow-up (PMCF) Plan Template A guide for manufacturers and notified bodies (April, 2020), participants will learn how to develop a PMCF plan and conduct data collection and interpretation for the PCMF clinical evaluation report. Who will Benefit: Investigators Physicians Clinical Investigators Clinical Research Statisticians Clinical Research Coordinators Clinical Research Associates/Assistants Clinical Project Managers/Leaders Study Managers Data scientists Data managers Data processors Statisticians Regulatory Professionals who use statistical concepts/terminology in reporting Professionals in pharmaceutical, medical device, clinical and biotechnology research who work with data collection and management Medical Writers and others who need to interpret statistical reports","date_start":"2020-12-02","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Engineering & Technology","Chemical"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}