{"name":"Recordkeeping and Documentation in a GLP Laboratory (US FDA, US EPA and OSHA Focus)","series":"","short":"","website":"https://www.complianceonline.com/recordkeeping-and-documentation-in-glp-laboratory-iso-17025-seminar-training-80510SEM-prdsm?channel=Brownwalker","content":"GLP requires many types of documents. The seminar covers both the general issues and many specifics that laboratories can receive a non-compliance on. These range from data recording to validation issues to training records to archiving of documents. An auditor can find numerous common errors and many, many others that are specific to a particular laboratory. This seminar will go through many of the compliance areas and point out some of both of these types. For those implementing GLP or striving to maintain certification, this course should point out many areas to examine that would lessen an unsatisfactory audit. Most of the focus on a laboratory’s compliance with Good Laboratory Practice (GLP) or with the analogous ISO 17025 is on items such as the Standard Operating Procedures (SOPs), training, quality assurance testing, and the statistical assessment of performance and compliance. These, however, are not all that an auditor may delve into. These might the bulk of an audit, yet a laboratory may still fail an audit while doing well on all of these areas. Since laboratories focus on these, other areas might be ignored – the more mundane and simple areas, such as recordkeeping and archiving, basic laboratory operations, and safety. Learning Objectives: Upon completing this course, participants should: Know the variety of common documentation within a compliant laboratory. Understand the requirements for entering information into logbooks and also to know some of the ways that are not compliant. Understand the importance of logbooks for: chemicals, instruments, calibration, maintenance and repair, calibrations, training and competence. Know the information suitable in each type. Understand the requirements for recordkeeping and archiving. Who will Benefit: This course is aimed at those working in laboratories that must comply with Good Laboratory Practice or ISO 17025, especially those whose results are to be reported to the US Food and Drug Administration (FDA), the US Environmental Protection Agency (EPA), and the US Occupational Safety and Health Administration (OSHA). The various roles: Managers and supervisors of the laboratory Quality officers and internal auditors Scientists and research associates","date_start":"2021-11-08","date_end":"2021-11-09","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Medical-Speciality"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}