{"name":"2021 IEEE International Symposium on Personal, Indoor and Mobile Radio Communications","series":"","short":"","website":"https://pimrc2021.ieee-pimrc.org","content":"The 2021 IEEE International Symposium on Personal, Indoor and Mobile Radio Communications (IEEE PIMRC 2021) brings together global experts to the esteemed scientific and technical forum dedicated to diverse facets of wireless communications! In 2021, IEEE PIMRC returns to the vibrant capital city of Helsinki in Finland where it has been organized twice before – in 1997 and 2006\\. For this edition, our 6G Flagship program team at the University of Oulu brings a fresh 6G flavor. The event covers fundamental theory as well as experimental networks, services, applications and business. With the continuing uncertainty due to COVID-19, we are currently planning IEEE PIMRC 2021 as a hybrid event from the start. We hope to be able to interact with a large number of speakers and attendees onsite at our venue “Finlandia Hall”. At the same time, we are fully committed to creating a rewarding and memorable virtual conference experience for those who will not be able to travel to Finland in September. Our hybrid event model allows a variety of engaging sessions from plenaries, panels and workshops to regular and special sessions introducing the latest research results. As we are now ready to receive proposals for various sessions, including tutorials, we are eager to discover your bold new research openings and topics that lead to voluminous discussions both onsite and online. Call for Papers https://pimrc2021.ieee-pimrc.org/authors/ You are invited to submit full papers to Track 1: Fundamental Theory and Physical Layer EDAS submission link: https://edas.info/newPaper.php?c=27876&track=104335 Track 2: RF Technologies, Antennas and Propagation EDAS submission link: https://edas.info/newPaper.php?c=27876&track=104342 Track 3: MAC and Cross-Layer Design EDAS submission link: https://edas.info/newPaper.php?c=27876&track=104343 Track 4: Mobile and Wireless Networks EDAS submission link: https://edas.info/newPaper.php?c=27876&track=104344 Track 5: Experimental Networks, Services, Applications and Business EDAS submission link: https://edas.info/newPaper.php?c=27876&track=104345 Call for Workshops You are invited to propose workshops according to https://pimrc2021.ieee-pimrc.org/authors/pimrc-2021-workshop-guidelines/ Call for Tutorials You are invited to propose tutorials according to https://pimrc2021.ieee-pimrc.org/authors/pimrc-2021-tutorials-guidelines/ Call for Panels You are invited to propose panels according to https://pimrc2021.ieee-pimrc.org/authors/pimrc-2021-panels-guidelines/ Call for Special Sessions You are invited to propose special sessions according to https://pimrc2021.ieee-pimrc.org/authors/pimrc-2021-special-session-guidelines/ Important Dates Full Paper Submission: 19 March 2021 Notification of Acceptance: 1 June 2021 Final Manuscript: 15 June 2021 Workshop Proposals: 5 March 2021 Workshop Paper Submission: 14 May 2021 Tutorial Proposals: 19 March 2021 Panel Proposals: 23 April 2021 Special Session Proposals: 15 February 2021 With these thoughts, we hope to receive your inputs for a high-quality program! Together, we can make IEEE PIMRC 2021 a valuable discussion forum for us all! Matti Latva-aho General Chair University of Oulu, Finland Markku Juntti Technical Program Chair University of Oulu, Finland","date_start":"2021-09-13","date_end":"2021-09-16","important_dates":{"abstract":"","full":"2021-03-05","notification":"","final":""},"topics":["Engineering & Technology","Electrical/ Electronic","Electronics and Communication"],"location":{"virtual":"","full":["Online Event","Finland"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Finland"},"organizers":["IEEE Communications Society"],"societies":[],"indexes":[],"emails":[]}