{"name":"NEW FDA Proposed FSMA Rule on Food Traceability","series":"","short":"","website":"https://bit.ly/2SITYbY","content":"This 60-minute webinar will cover the proposed FDA traceability requirements and techniques useful in the event of quality deviation investigations and potential FDA Recalls. A variety of technologies at various price levels that are used for tracking and recall will also be covered to set the food industry stage for a more solid entry into artificial intelligence and the Internet of Things (IOT) A integrated food safety system model that uses traceability, food safety and recall data will be presented to demonstrate how computer technology can be used to reduce the time to recall products and reduce the impact to human health. The model is based on the FDA FSMA concept for risk reduction and uses predictive modeling to point investigators in the right direction in the minimum time. We will discuss this mega-trend setter that has been creeping up for the past several years. At the end of this webinar, the speaker will handle your specific questions related to the topic. Why Should You Attend You cannot afford to miss this topic: It is disruptive. The rules are in the “proposal” state meaning you can provide input prior to final rule (law) publication. This is a game-changer that shows where the FDA is going with regard to a more comprehensive electronic style of supply chain traceability system positioned to more comprehensively bring massive amounts of food safety data into a more future-looking integrated food safety system. This session will cover the proposed rules including the purpose, who is covered, who is exempt, recordkeeping requirements, core rule components, key data elements (KDEs), costs and public health benefits, records to be kept, and, most importantly, a Fook Traceability List covering the produce, fruit, and fish. Areas Covered in the Session » Proposed FDA Traceability Rules » Industry capabilities to respond to the rules » Blockchain » Artificial Intelligence (AI) » Self-reporting, Trade and Consumer and Classes of Recalls » Product and Process Vicarious Liability » Traceability standards, controls and practices » Overlooked transportation issues » ISO 22005 traceability standards » Current trends and common issues. » Lot Identification at the case, pallet and container levels » Recall Classifications Who Will Benefit » Key Company Management: Presidents, Vice Presidents, Directors of the food industry » Food Safety Specialists » Traceability Personnel » Logistics Personnel » Internal Food Safety Team Members » Warehouse receiving and shipping team members and process Operators » Quality Assurance Management » Purchasing Agents » Recall Team Members » Auditors who review facility quality assurance and food safety programs » Customers who want to understand best practices that they should require of their suppliers » Executives for processing, transportation, retail and restaurant operations To Register (or) for more details please click on this below link: https://bit.ly/2SITYbY Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-06-25","date_end":"","important_dates":{"abstract":"","full":"2021-06-25","notification":"","final":""},"topics":["Life Sciences","Food-Science / Forestry"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}