{"name":"Auditing and Compliance - International Trade Finance","series":"","short":"","website":"https://www.complianceonline.com/auditing-compliance-international-trade-finance-seminar-training-80664SEM-prdsm?channel=Brownwalker","content":"This course is an advanced primer for banking, compliance and audit professionals. In this course, we will address compliance issues, and the unintended consequences contributing to market gaps in trade finance, as well as providing information aimed at preventing criminals from using the financial system and your organization for their own purposes. Over the years, shortcomings have been identified in the international trade finance examination process that, when resolved, contribute to closing market gaps, promote a shared understanding of the financial crime risks of international trade, while strengthening the fight against crime. This course aims to address these shortcomings by providing a guideline to an effective audit and/or examination process (by auditors, compliance officers, risk managers, and regulators) as it relates to international trade finance. The course is based on extensive risk management and international trade finance experience and working with bank regulators and commercial banks. Learning Outcomes: After attending this 1-day course, you will be able to Identify the key compliance processes in international trade finance. Recognize the critical stages of the international trade finance audit process. Be able to set up the audit of international trade finance. Recognize the critical issues that must be addressed to ensure that your international trade finance audit is effective. Identify the vital issues involved in compliance when dealing with international trade finance. Teaching Method: This highly interactive course is comprised of a combination of prepared tuition, presentations, case studies, multidirectional discussions, and comprehensive exercises. Most importantly, it will offer participants, opportunities to plan such work within small working groups, providing practice in the application of the techniques and tools generating active participation. Who will Benefit: The course will be of value to professionals in the following areas: External & Internal Auditors Compliance Officers Commercial bankers from front/middle/back offices Commercial bankers dealing with the Forex market International division bankers Trade finance supervisors and managers Risk managers and risk management officers Trading company, multinational corporate & treasury staff","date_start":"2021-12-09","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Management / Leadership"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}