{"name":"Community-engaged University","series":"","short":"","website":"https://sea-eu.org/service-learning","content":"The international professional and scientific Service-Learning Conference Community-engaged University is an event organized by the European University of the Seas (SEA-EU) alliance. The objective of the SEA-EU Service Learning (SL) conference is to bring together policymakers, teachers, researchers, students, and practitioners from various aspects of Service Learning with the idea to increase the number and the quality of Service Learning activities in the SEA-EU universities. Service Learning will be presented as a tool that can be used in the process of creating an engaged university. This call is open to all kinds of contributors willing to support the idea of creating an engaged university. This invitation goes to all the people willing to support this idea with any kind of contributions to support this action. Possible formats for the conference proceedings can be: posters, articles, practice reports, discussion papers, storytelling, SL course material... (there are no restrictions). All submitted papers according to the proposed form will be published in the online conference proceedings. Selected papers will be considered for publication in the WoS journal Journal Interdisciplinary Description of Complex Systems – INDECS. CONFERENCE TOPICS ● Engaged university – HEI's perspective ● The role of NGOs in the development of an engaged university ● Impacts of community-engaged university ● The role of Service-Learning in students' career development ● Introducing Service Learning in academic curricula, challenges, and benefits ● International Service Learning ● Digital Service Learning","date_start":"2022-05-20","date_end":"","important_dates":{"abstract":"","full":"2022-03-10","notification":"","final":""},"topics":["Education / Legal / Other","Education","Sociology, Social Sciences"],"location":{"virtual":"","full":["Split","Croatia"],"name":"","street":"","city":"Split","state":"","ZIP":"","country":"Croatia"},"organizers":["University of Split"],"societies":[],"indexes":[],"emails":[]}