{"name":"Code of Conduct-The Behaviors of Doing Business","series":"","short":"","website":"https://bit.ly/3pXH1He","content":"Workplaces are made up of diverse groups of people with diverse motivations, backgrounds, and ethics. When such groups are brought together, sometimes there are opportunities for ethical, moral, financial, or even legal, boundaries to be crossed. Sometimes those boundaries are crossed with disastrous results. A workplace code of conduct is a tool that can be used to prevent such digressions by providing a framework for employees to follow what is expected of them and how to conduct themselves in various situations. Why Should You Attend » To distinguish ways to clarify an organization’s mission, values and principles, linking them with standards of professional conduct » To determine how to use written codes of conduct as benchmarks against which individual and organizational performance can be measured Objectives of the Presentation » Identify what a code of conduct is and why a business should have one » Identify what goes into a code of conduct » Discuss how to implement a code of conduct in the workplace Areas Covered in the Session » What is a code of conduct? » Why is a code of conduct important? » What to leave in, what to leave out Who Will Benefit » Owners of Businesses » Supervisors » All line managers » Supervisors » Training Officers » Human Resources Professionals » Learning & Development Officers To Register (or) for more details please click on this below link: https://bit.ly/3pXH1He Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-02-25","date_end":"","important_dates":{"abstract":"","full":"2021-02-25","notification":"","final":""},"topics":["Business","Human-Resources"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}