{"name":"How to Survive a DEA Inspection Series: For DEA Registered Analytical Labs and Research Facilities","series":"","short":"","website":"https://www.complianceonline.com/how-to-survive-a-dea-inspection-series-for-dea-registered-analytical-labs-and-research-facilities-webinar-training-704617-prdw?channel=Brownwalker","content":"The training program will cover DEA record-keeping requirements and effective security that a DEA registrant must comply with when handling controlled substances. It covers elements of what occurs during an unannounced inspection and the auditing methods. Why Should You Attend: It is important to understand stringent DEA regulations required of a research lab. This training session will give attendees a better insight into steps to take to maintain required record-keeping and effective security in order to prevent illicit use or diversion of any controlled substance. The presentation will provide effective record-keeping for purchasing and dispensing of controlled substances for testing or research purposes. Inventory, dispensing, usage and disposal records are part of the accountability process in order to comply with stringent DEA regulations. The presentation is tailored for senior and mid-level management, scientists, chemists and other key employees responsible for required record-keeping, effective security and due diligence policies in order to comply with DEA regulations. Areas Covered in the Webinar: Role of DEA – Familiarize the participant with the authority given to DEA when enforcing federal laws and regulations pertaining to controlled substances. Civil Actions – Briefly describes the civil actions and fines imposed by the U.S Attorney’s office on a DEA registered research lab for failures to comply with DEA record-keeping and security regulations. Administrative Actions – Provides an insight into the administrative actions that results from violations of stringent DEA regulations imposed on a research lab facility. DEA Computation Chart – Understanding how the audit process performed by DEA is important in order for the registrant to know what is expected from employees. Record-Keeping Requirements – Covers records required by DEA during any unannounced inspection. Records include: inventory, order forms, invoices, dispensing, usage and disposal in testing, thefts and losses, power of attorney, and drug destructions. Security Requirements – Covers stringent security requirements in order to prevent the diversion of any controlled substance. Sending Documents to DEA – Learn the methodology and requirements for mailing documents to the local DEA office. Who Will Benefit: Senior and mid-level managers Scientists Chemists registered with DEA as a research facility in a facility doing research with controlled substances Research lab facility and researchers registered with DEA to handle Schedules I through V controlled substance for testing and research","date_start":"2021-11-17","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}