{"name":"Global Regulations for Equipment Qualification and Validation of Processes in the Pharma Manufacturing","series":"","short":"","website":"https://www.complianceonline.com/equipment-qualification-dq-iq-oq-pq-process-validation-vmp-seminar-training-80295SEM-prdsm?channel=Brownwalker","content":"The various regulatory agencies have expectations that pharmaceutical manufacturers will demonstrate control over their manufacturing equipment. The FDA's findings of deficiencies concerning equipment validation indicate the agencies expect definitive evidence that the equipment qualification and validation schedules of a facility will satisfactorily control their manufacturing processes. Examples of FDA form 483 findings for equipment qualification and validation indicate deficiencies in many of these studies. The cost of non-compliance is therefore more than that of compliance. Are you in compliance with the FDA regulations for equipment qualification and validation in your manufacturing facility? In this two day workshop conference you will learn the different global agencies expectations of equipment qualification along with the development of a sound process validation program in order to develop and implement bulletproof solutions that are accepted, effective, and efficient. Through case study analysis we will examine best practices to provide thoughts and ideas to develop or improve the performance of your current system. Additionally, case studies will explore how your management practices of your equipment qualification/ validation and process validation programs can help or hurt your legal liability and the legal issues that arise from nonconformance with regulators and Auditors. Learning Objectives: Upon completing this course participants should: Understand what the global expectations are for equipment qualification and validation. Understand the documents required for equipment qualification and process validation and how to manage documents appropriately. Understand and know how to write and maintain a Validation Master Plan. Write and execute sound protocols for equipment qualification (IQ, OQ, PQ) and process validation. Qualify already existing systems and requalification Be able to collect data, conduct tests, and obtain all necessary documents. Understand the different types of validation. Understand Performance Validation. Know the guidelines on validating analytical methods and processes. Who will Benefit: This course is designed for people tasked with developing, maintaining and/or improving equipment qualification programs for manufacturing facilities. This includes individuals that have Quality Management Systems responsibilities for making general improvements in their organization's performance specifically related to equipment and processes. Following personnel will benefit from the course: Senior quality managers Quality professionals Regulatory professionals Compliance professionals Production supervisors Validation engineers Manufacturing engineers Production engineers Design engineers Process owners","date_start":"2021-09-29","date_end":"2021-09-30","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}