{"name":"2nd Annual Pharma AI & IoT 2019","series":"","short":"","website":"https://www.virtueinsight.com/pharma/2nd-Annual-Pharma-AI--IoT-2019","content":"2nd Annual Pharma AI & IoT 2019 Integrating AI, IoT, Cloud & Big Data Analytics in Pharma & Healthcare 10th & 11th July 2019, London, UK Our 2nd Annual Pharma AI & IoT 2019 will provide insight into the current state of play in the EU & US and stimulate debate, in a multi-stakeholder setting, on the vital role of techonologyy impact in the sustainability of pharma and healthcare systems. Beyond a comprehensive outlook of key European market access policies, our speakers will outline the key recent developments in technology impact in pharma and healthcare in the EU and other international jurisdictions. By attending this conference, you will gain a comprehensive outlook on the key issues surrounding latest technologies that are being analysed towards the pharma and healthcare. This event will provide an important platform for stakeholders to discuss and share best practices in furthering technology development in pharma and healthcare KAY SPEAKERS: • HANS ULRICH BURGER, Senior Director Of Biostatistics, Roche • AIDAN COOPER, Innovation Technologist | Innovation Lab, Astrazeneca • ANDREW BRYANT, Principal Engineer / Principal Fellow, Novartis • DAVIDE BOTTALICO, Digital Healthcare & Innovation Director, Takeda Pharmaceuticals • EDDIE GUZDAR, Medical Head - Neuroscience, Sanofi Genzyme • MICHEL GIRAULT, Head Of Multi-Channel Marketing, Vifor Pharma • LENA GRANOVSKY, Director, Analytics And Big Data, Teva Pharmaceuticals • DAVID WHEWELL, Director Of Architecture And Software Innovation, Merck Group • EVA Mclellan, Director, Oncology Pipeline (GPS/RE), Roche • EMMANUEL PHAM, Vice President Biometry, Ipsen • PETER RUTHERFORD, Global Medical Lead - Orphan Renal Diseases, Vifor Pharma • LEILA PIRHAJI, Founder & CEO, Revivemed (USA) • KRISHNA BULUSU, Senior Scientist, Oncology Bioinformatics, Astrazeneca • ABRAHAM JOSEPH, Founder & Editorial Director, IOT Insights • GABOR PURMAN, Senior Account Director Patient Services & Medical Education, Nexgen Healthcare • KETAN PATEL, Industry Consultant Life Sciences, Teradata KEY THEMES: • Market overview and analysis - Shaping the future of AI in Pharma • ML in Pharma and Medicine - A potential future in which synchronicity of data, analysis, and innovation are an everyday reality • AI - Challenges and opportunities • AI for Precision Medicine • Use of AI in early clinical development and drug discovery • Applications of Machine Learning in Pharma and Medicine • AI - Challenges exist, but opportunities beckon • Why and how human behaviour should / could be changed by technology? • Cyber Security is Critical in an Age of IoT and Healthcare Hacks • Preparing for the Implications of “Brexit” in the Pharmaceutical Industry • Impact of Digital Transformation in healthcare & pharma industry • Big data to big impact: AI-driven patient health optimisation • Big data - Why does drug manufacturers need your health records? • How AI technology can accelerate, cheapen and De-Risk R&D • How IoT is transforming the Pharmaceutical Industry? • IoT in Pharmaceutical manufacturing and supply chains • Big Data Analytics – A Revolution in Drug Discovery and Pharma R&D • Pharma to open up big data for clinical trials, analytics • Clinical Trials innovations with big data and advanced analytics era • Differences that Internet of Things (IoT) Can Make to Healthcare • How IoT is poised to transform the world of pharma • Developing regulatory framework in advanced and developing markets – for Today & Tomorrow • Moving beyond 5 years – What will the technology landscape look like? • Be part of a major networking opportunity WHO SHOULD ATTEND: CIOs, CEOs, CDOs, Vice Presidents, Presidents, Heads, Directors, Team Leaders, Evangelists and Senior Scientists from the following areas: Pharmaceuticals, Biotech, Artificial Intelligence, Data Science, Machine Learning, IoT, Cloud, Advanced Analytics, Innovation, Big Data, Deep Learning, Bioinformatics, Regulatory Compliance, New Product Development, Process Science, Portfolio Management, Research & Development, Business Development, Business Operations, Scientific Affairs, Commercial Affairs, Marketing CONFERENCE SPONSORSHIP: E-mail – kavitha@virtueinsight.co.in Or Tel: +44 2036120886 Sponsor, Exhibition Stall (Booth) and a paid Speaker Slots are also available We also have some sponsorship opportunities available for the event, which gives you an opportunity to sponsor/speak/exhibit, and create brand awareness. In addition, the networking opportunities in focused and relevant industry gathering provide the personal contact necessary for business development efforts. CONFERENCE REGISTRATION PROCESS: In order to Register please let us know your interests through Email: kavitha@virtueinsight.co.in or Tel: +44 2036120886 • Introductory Offer - 3 delegate places for the price of 2 - A huge saving Offer - (Limited seats left) • Super Early Discount (Valid Till 6th May2019): (£700 + VAT per delegate) • Early Discount (7th May 2019 - 10th June 2019): (£900 + VAT per delegate) • Standard Registration (11th June 2019 Onwards): (£1100 + VAT per delegate) Get more from the event, enjoy and make the best out of our dedicated networking drinks time, meet the leading international vendors showcasing the products of tomorrow in the co-located exhibition. Expand your knowledge of the latest business models and strategies in the high-level conference. Whether you are on the branded or generic side, you cannot afford to miss this opportunity to benchmark your tactics and strategies against the industry leaders who will be the first to traverse the pathway.","date_start":"2019-07-10","date_end":"2019-07-11","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Information-Technology","Biological Engineering & bioinformatics"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":[""],"societies":[],"indexes":[],"emails":["kavitha@virtueinsight.co.in"]}