{"name":"The 13th International Symposium on Photonics and Optoelectronics","series":"","short":"SOPO 2021","website":"https://www.soposymposium.org/2021","content":"The 13th International Symposium on Photonics and Optoelectronics (SOPO 2021) Conference Date: October 29-31, 2021 Conference Venue: Guilin, China Website: https://www.soposymposium.org/2021/ Online Registration System: http://www.soposymposium.org/RegistrationSubmission/default.aspx?ConferenceID=1379 Email: sopo\\_service@126.com The 13th International Symposium on Photonics and Optoelectronics (SOPO 2021) will be held from October 29-31, 2021 in Guilin, China. SOPO 2021 is co-organized by by Wuhan University, Beijing University of Posts and Telecommunications, IPOC State Key Lab, and other institutions. SOPO is an annual conference in China since 2009\\. It was held in Wuhan, Chengdu, Shanghai, Suzhou, Xi'an, Beijing, Guilin, Sanya and Kunming from 2009 to 2019\\. Each year there are 100 - 200 attendees from Asia, Europe, America, etc., and there have been quite a lot of well known experts giving plenary speeches. In 2021, SOPO will be held from October 29-31 in Guilin, China. It dedicates to facilitating the global development of Photonics and Optoelectronics and exploring ways in which the latest research results can be shared. Invited Speakers Prof. Zefeng Wang, National University of Defense Technology (NUDT), China Prof. Elfed Lewis, University of Limerick Ireland, Republic of Ireland Prof. Mohamad Hafiz Mamat, Universiti Teknologi MARA (UiTM), Malaysia Prof. Oliver H. Heckl, the University of Vienna, Germany Prof. Jin Li, Northeastern University, China Prof. Xiaotian Li, Changchun Institute of Optics, Fine Mechanics and Physics, Chinese Academy of Sciences, China Prof. Yang Yue, Nankai University, China Prof. François Sanchez, Laboratory of Photonics of Angers, the University of Angers, France Prof. Erol SANCAKTAR, The University of Akron, Akron, USA Prof. Shengjun Zhou, Wuhan University, China Prof. Hairun Guo, Shanghai University, China Prof. Youxin (Linda) Mao, National Research Council Canada, Canada Prof. A. Afroozeh, University of Larestan, Iran Prof. Jingsong Li, Anhui University, China Prof. Jovana Petrovic, Technische Universität Berlin, Germany/Vinca Institute of Nuclear Sciences, University of Belgrade, Serbia Prof. Harith Ahmad, University Malaya, Malaysia Dr. Zhaoyang Zhang, Xi’an Jiaotong University, China Prof. Xuewen Shu, Wuhan National Laboratory for Optoelectronics (WNLO), Huazhong University of Science and Technology, China Publication and Presentation Publication: All the accepted papers will be published by a peer-reviewed open access journal that can ensure the widest dissemination of your published work. Index: CNKI and Google Scholar Note: 1\\. If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. 2\\. Please download the Full Paper template and prepare your article according to it. The full length of one paper is suggested to be 8-10 pages (within the template format with all tables, figures and references). If your paper is over 10 pages, you will be kindly requested to pay for extra pages fees. 3\\. The simple Abstract submission should include the title, contents, keywords, authors names, affiliations and emails. The length is suggested to be controlled within 1 page and no more than 2 pages. 4\\. You will receive the review results within 3-5 working days after submission. If you do not get any notification within the time limit, please contact us as soon as possible. 5\\. You are welcome to submit papers in Chinese and please contact us for more details. Contact Us Contact Person: Rolin (Ms) Email: sopo\\_service@126.com Tel: +86 150 7134 3477 (Monday-Friday) QQ: 88431022 WeChat: 3025797047 Attendance Methods 1.Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by \"Optics and Photonics Journal\"(ISSN: 2160-8881), a peer-reviewed open access journal that can ensure the widest dissemination of your published work. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Laser Technology and Applications Laser Physics and Nonlinear Optics Gas Lasers and Applications Solid State Lasers: Technology and Devices Semiconductor Lasers, Tunable and Multi-wavelength Lasers Laser Materials, Fabrication and Characterization Laser Material Processing Tera-hertz Sources & Detection Tera-Hertz Propagation Image Processing Image Acquisition, Reconstruction, Restoration and Fusion Image Transformations: Wavelet Theory, Space Theory, Geometrical Transforms and Restoration Image Analysis: Motion Estimation, Segmentation, Object Tracking and Pattern Recognition Visualization: 3D Visualization, Holography and Display Systems Image Information Management: Coding, Cryptography, Watermarking, Storage and Retrieval, Resolution Enhancement Medical Imaging, Surveillance, Security, Remote Sensing and Multimedia Systems or Devices for Optical and Digital Image Processing Optical Communications Optical Fiber Communication Free-space Optical Communication Optical Communication Networks Optical Transport Network Coding and Signal Processing Modulating Retro-reflector Intensity Modulation Optical Wireless Optical Carrier Optoelectronic Devices and Integration Optical Sensors and Applications Fiber-optic Sensor and Networks White LED and Related Technologies High Performance Semiconductor Optical Amplifiers Advanced Optoelectronics Device Fabrication Technologies Nonlinear Optical Devices and All-optical Signal Processing Electro-optic Modulators and Related Advanced Modulation Format Technologies Advanced Radio-over-fiber Devices and Related Technologies Intelligent Optoelectronic Devices and Optical Switching Grating-based Devices and Related Technologies Nano Technologies and Their Application in Optoelectronics Devices Slow and Fast Light Devices and Related Technologies Free-space Communications Related Devices and Technologies New Optoelectronic Device Materials and Processing Silicon Photonics Medical and Biological Applications Biomedical Optics Laser Medical Diagnostics and Therapeutics Optical Coherence Tomography Advanced Biological Microscopy Photochemistry and Photobiology Laser Tissue Interactions and Laser Surgery Minimally Invasive Optical Diagnostics Photo-acoustic Techniques Optics in Biotechnology Optical-system Engineering for Medicine","date_start":"2021-10-29","date_end":"2021-10-31","important_dates":{"abstract":"","full":"2021-09-29","notification":"","final":""},"topics":["Physical Science & Math","Physics","Photonics, Photochemistry"],"location":{"virtual":"","full":["Guilin","China"],"name":"","street":"","city":"Guilin","state":"","ZIP":"","country":"China"},"organizers":["Academic Communications"],"societies":[],"indexes":[],"emails":["_service@126.com"]}