{"name":"Lone Worker Safety Compliance","series":"","short":"","website":"https://www.complianceonline.com/lone-worker-safety-webinar-training-706399-prdw?channel=Brownwalker","content":"Did you know that every employer, regardless of industry, has the potential of an employee working alone? Regardless if the employee is working alone for an entire shift, partial or a very small percentage, providing safety for that employee is essential for meeting regulatory compliance. Why Should You Attend: You should attend this webinar to learn how to identify and categorize potential regulatory, environmental and social risk, the types of training need that are associated with lone worker safety and how to verify the effectiveness of that training. Do you know that employees working alone are one of the highest risk jobs in the U.S. and that all industries have this hazard? Have you identified hazards associated with employees working alone or potentially having to work alone at your work site? Were you aware that there are federal and state worker safety legislation that applies to this high-risk job category? If you answered \"no\" to any of these questions and you have employees working alone or have a potential of working alone, you will want to gain a better understanding of this informative topic. This information will provide valuable insight on the types of risks associated with workers working alone. Tips, techniques and trade secrets on how to develop, implement and verify worker safety for employees working alone will be provided. Examples of lessons learned (best practices) and what not to do will be explained in this material to help you kick start your plan implementation immediately. Don't miss this jam packed educational material and get ready to get busy on improving personal safety for those employees who are, or potentially can be, placed into such a situation of working alone. Areas Covered in the Webinar: Identify Potential Risk Regulatory Environmental Social Training Type of Lone Worker Safety Training Lone Worker Safety Training Topics How to Verify and Show Effectiveness of Training Who Will Benefit: Supervisors, Managers, and Leaders of businesses/government agencies of all kinds. HR Professionals Training Professionals Safety Managers Vice President Managing Director Occupational Nurse Project Managers Directors","date_start":"2021-12-09","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Human-Resources"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}