{"name":"Nanophotonics and Micro/Nano Optics International Conference 2019","series":"","short":"","website":"https://premc.org/conferences/nanop-nanophotonics-micro-nano-optics","content":"NANOP 2019: Functional Nanophotonics After tremendous endeavors, Nanophotonics has already departed from its infancy and stepped into an exciting era, where research ideas and theoretical concepts are being vigorously transferred into functional devices and real-life applications. The fourth edition of the NANOP conference identifies the successful development of Functional Nanophotonics over the last decades as well as outlines upcoming research directions and topics, offering a vibrant platform for scientists to discuss, share, and fantasize. Topics Photonic & plasmonic nanomaterials Optics and transport on 2D materials Nonlinear nano-optics Quantum dots and colour centres Strong light-matter interactions at the nanoscale Metamaterials and metasurfaces Enhanced spectroscopy Nano-Optomechanics Quantum nano-optics Nanoscale photothermal effects Optical sensing from solid state to bio-medicine Advanced imaging for photonic materials Topological photonics Bottom-up approach enabled nanophotonics Non-reciprocal nano-optics Chairwoman: Prof. Laura Na Liu, University of Heidelberg, Germany Confirmed speakers: Prof. Albert Polman, AMOLF Institute, Netherlands Prof. Din Ping Tsai, National Taiwan University, Taiwan Prof. Anatoly Zayats, King’s College London, UK Prof. Andrea Alu, The University of Texas at Austin, USA Prof. Jörg Wrachtrup, University of Stuttgart, Germany Prof. Frank Koppens, ICFO, Spain Prof. Peter Nordlander, Rice University, USA Dr. Kerstin Göpfrich, Max Planck Institute for Medical Research, Germany Prof. Stefan Maier, LMU, Germany Prof. Tim Liedl, LMU, Germany ACS Photonics Lectureship Winner Early bird submission – March 19, 2019 Early bird registration – April 19, 2019 Regular submission – June 19, 2019 Regular registration – July 19, 2019 Conference: September 4-6, 2019","date_start":"2019-09-04","date_end":"2019-09-06","important_dates":{"abstract":"","full":"2019-06-19","notification":"","final":""},"topics":["Engineering & Technology","Material/Nanotechnology","Nanotechnology"],"location":{"virtual":"","full":["Munich","Germany"],"name":"","street":"","city":"Munich","state":"","ZIP":"","country":"Germany"},"organizers":["PremC"],"societies":[],"indexes":[],"emails":[]}