{"name":"The 4th Int'l Symposium on Quantum Computation and Communication (SQCC_D 2021)","series":"","short":"","website":"https://www.seminarjan.org/conference/SQCC_D2021","content":"The 4th Int'l Symposium on Quantum Computation and Communication (SQCC\\_D 2021) Conference Date: December 24-26, 2021 Conference Venue: Sanya, China Website: https://www.seminarjan.org/conference/SQCC\\_D2021/ Online Registration: https://www.seminarjan.org/RegistrationSubmission/default.aspx?ConferenceID=1442 Email Registration: conf\\_contact@163.com The 4th Int'l Symposium on Quantum Computation and Communication (SQCC\\_D 2021) will be held in Sanya, China on December 24-26, 2021\\. SQCC\\_D 2021 will cover issues on Photonic quantum systems, Quantum algorithms and complexity, Quantum circuits, Quantum communication, Quantum computing, Quantum Information Theory etc. It dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: All the accepted papers will be published by a peer-reviewed open access journal that can ensure the widest dissemination of your published work, for more information, please contact us (conf\\_contact@163.com) Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: conf\\_contact@163.com (editor.rolinzhang@gmail.com) Tel: +86 15527426990 QQ: 1349406763 WeChat: 3025797047 Twitter: conf\\_Committee Attendance Methods 1\\. Submit Full Paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit Abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics: Carbon nanotubes and graphene Cavity polaritons Entanglement and error-correction Entanglement and non-locality Entanglement swapping, relays and quantum repeaters Fault tolerant quantum error correction Fiber based systems Free space systems Fundamentals of Quantum Theory Integrated quantum photonics Multimode entanglement Multi-party quantum communication New applications and protocols Nondeterministic communication complexity Open quantum systems and entanglement Photonic quantum systems Quantum algorithms and complexity Quantum bits, gates and registers Quantum circuits Quantum communication Quantum computing Quantum continuous variables Quantum cryptography Quantum dots Quantum fourier transform and applicationsPhysical realizations Quantum hall systems Quantum information processing devices and systems Quantum Information Theory Quantum interfaces and memory Quantum interferometry Quantum key distribution Quantum memories Quantum nonlinear optics Quantum optics and quantum photonics Quantum silicon photonics Quantum teleportation Quantum well cavity-polaritons Science motivations and technology priorities Secure communication based on quantum key distribution","date_start":"2021-12-24","date_end":"2021-12-26","important_dates":{"abstract":"","full":"2021-12-24","notification":"","final":""},"topics":["Physical Science & Math","Mathematics","Quantum Computation"],"location":{"virtual":"","full":["Sanya","China"],"name":"","street":"","city":"Sanya","state":"","ZIP":"","country":"China"},"organizers":[""],"societies":[],"indexes":[],"emails":["_contact@163.com","editor.rolinzhang@gmail.com"]}