{"name":"The Equal Employment Opportunity Commission: Mission, Claim Filing, EE & ER Responsibilities","series":"","short":"","website":"https://www.complianceonline.com/eeoc-mission-claim,filing-ee-er-responsibilites-webinar-training-706797-prdw?channel=Brownwalker","content":"Given that every complaint has the potential to become a lawsuit, employers should investigate every case in a manner in which it can be presented to a court of law, if necessary. As potentially disruptive as investigations can be, they must be prompt, thorough and effective to ensure all parties’ protection. Why Should You Attend: Organizations have legal and moral responsibilities to support diversity in their workplaces and to ensure compliance with all equal employment opportunity rules and regulations. Unfortunately, workplaces have not always been welcoming to women and minorities, and many people have faced prejudicial behavior when seeking employment or while on the job. While laws like the Civil Rights Act of 1964 have improved the working lives of many, there are still serious issues that require attention and action. Human Resource professionals are especially important for creating hospitable and inclusive work environments. Policies that discriminate against protected classes of individuals, either explicitly or accidentally, are illegal. Thus, even unintentionally discriminatory practices that disparately impact those that are vulnerable to prejudicial treatment must be prevented. Investigating an employee’s claim of discrimination or harassment requires immediate action on the part of employers to satisfy the recommendations of the Equal Employment Opportunity Commission (EEOC). The EEOC strongly recommends that employers swiftly investigate and resolve employees’ complaints of workplace harassment and discrimination. If an employee lodges a complaint against a colleague or the employer itself, an investigation is a required step since courts have ruled that failure to investigate on the part of an employer is akin to discrimination. Areas Covered in the Webinar: Functions of the EEOC Federal legislation requiring equal treatment of employees Title VII of the Civil Rights Act of 1964: Original protected classes and currently-acknowledged protected classes; further amended in 2020 Disparate treatment v. disparate impact Different forms of Harassment & applicable court cases Quid-Pro-Quo harassment and Hostile Work Environment Best Practices for avoiding claims of sexual harassment Process of filing a charge with the EEOC Common reasons employees state for not filing a claim Charges of retaliation and discrimination Formal complaints and the investigative process What employers can expect once a charge is filed Read more Who Will Benefit: Senior Leadership Managers & Supervisors Project Team Leaders Human Resources Professionals","date_start":"2022-02-10","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Human-Resources"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}