{"name":"DesAIgn: The Impact of Artificial Intelligence (AI) on Contemporary Design","series":"","short":"","website":"https://design.hit.ac.il/desaign","content":"The field of artificial intelligence (AI) is gradually penetrating the various design disciplines and enabling machines to perform tasks that were previously the exclusive domain of human designers. Recently developed AI-based applications can generate designs at a speed and variety that humans cannot accomplish. They can create synthetic images, design furniture, sketch architectural plans, invent fonts, and develop marketing campaigns. In addition, AI systems are capable of tackling complex problem-solving challenges, making behavioral predictions, and connecting between variables from different areas. Implemented at both the design and fabrication stages, they address the two key components of design: the aesthetic and the functional. The DesAIgn conference, dedicated to exploring the implications of the use of artificial intelligence in design, is co-organized by the Master's program of the Faculty of Design at the Holon Institute of Technology (HIT) in Israel, and the Ladislav Sutnar Faculty of Design and Art at the University of West Bohemia in the Czech Republic. The international conference will host scholars and designers from France, the Netherlands, Serbia, the UK, the United States, Japan, the Czech Republic, and Israel. It seeks to examine both the potential and challenges associated with the assimilation of artificial intelligence platforms into the field of design, as well as the broad theoretical, aesthetic, and practical implications of this kind of integration. Issues under discussion will include: Changes in the role of the designer and the concept of creativity in an era when machines become autonomous; Political and sociological implications of the use of artificial intelligence algorithms; Infrastructures that facilitate working with AI systems; and more.","date_start":"2021-05-25","date_end":"","important_dates":{"abstract":"","full":"2021-03-25","notification":"","final":""},"topics":["Arts & Humanities","Visual Arts","Artificial intelligence"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["University of West Bohemia, Holon Institute of Technology"],"societies":[],"indexes":[],"emails":[]}