{"name":"How To Survive an Emotionally Toxic Workplace","series":"","short":"","website":"https://bit.ly/2OwgbYM","content":"Too often we find ourselves overwhelmed and frustrated ... and not know where to turn or what to do. We find ourselves replaying an incident - or the whole day - on our way home from work. Then more replays when we get home - we're stressed and exhausted. We want to be able to get our work done, have good relationships with our co-workers and be able to go home and relax. This webinar will show you how to protect yourself from the painfully obvious toxicity, how to identify the very subtle toxicity in its infancy and how to build resilience at work. You'll learn key tips, tools and techniques to respond to almost any situation. It’s about going from overwhelmed and feeling helpless to empowerment. Why Should You Attend Workplaces can be cauldrons of emotions … which can lead to the environment becoming toxic. Emotions are natural human responses to events. We're encoded to tolerate a certain amount of emotional stress - after a point, the emotional stress becomes toxic - lengthy exposure to elevated stress is very unhealthy. On an individual level, it can cause physical symptoms, memory challenges, inability to concentrate, along with feelings of frustration and overwhelm. At the group or organizational level, overly emotional workplaces have higher turnover, more absenteeism, challenging relationships and lower productivity. Generally, the emotional tone (culture) of any given organization flows from the top down. It can be difficult to make sustained changes at the organizational level using a bottom up approach. At the team level, however, changes can be made and sustained by the team members. Whether external change is possible or not, individuals can protect themselves by understanding what's happening, building emotional resilience in the workplace, and developing skills, techniques and strategies that will make them, and the workplace, healthier. This webinar will help: » Anyone who has ever felt frustrated by the irrationality and unproductivity of the emotions of other people. » Anyone who has ever felt exhausted having to deal with these emotions. » Anyone who has ever wanted to avoid a person or meeting because they knew it would be unproductive and they’d leave emotionally exhausted. » Anyone who has replayed a situation after the fact trying to figure out “what happened” or “what I could have done differently”. » Anyone who has ever reacted emotionally to a situation and after regretted their own response. Objectives of the Presentation » A 3-step process to de-escalate emotional situations » The art of Emotional Aikido - what is emotional resilience and how to protect yourself when confronted with strong emotions » The 7 irrational thinking patterns that set the stage for destructive emotions » A simple-to-use 5-step model for immediately letting go when things does terribly awry – you won’t have to carry those events around in your head » What drives emotional reactions – the triune brain explained » Why people react emotionally, even when it doesn’t seem rational, or in their best interests » 5 ways to boost your resilience at work Areas Covered in the Session Are you feeling Frustrated? Exhausted? – trying to deal with all the emotions that swirl around in your workplace. Feeling like you just don’t know what to do? Sometimes it’s the same person you have to deal with day in and day out – you feel overwhelmed and just want to avoid them, but you can’t – you have a job to do – things to get done. Sometimes you’re blindsided – suddenly, out of the blue someone is angry at you or accusing you – everything was going fine – then BOOM – they became unhinged – often you don’t even know why – you’re thinking “where did that come from”? You dread going into some meetings/situations knowing emotions will be flying around. You hope it won’t happen this time, but it does, one person is using emotional blackmail, another’s playing the martyr, someone else is being a persecutor. You just want to “get away”. Somehow you survive the workday, then on the way home you replay one or more of those situations over and over, regretting you didn’t do something different, while feeling hopeless that things will never change. Imagine if you didn’t have to feel this way – you have the confidence and skills to deal with those emotional situations, to diffuse the situation and get everyone back on track … with grace and ease. You will leave this webinar with a clear understanding of what drives these emotional outbursts and how to deal with toxic people constructively and productively. You will know how to build resilience at work and how to use the Art of Emotional Aikido – you’ll be able to protect yourself from even the harshest attacks. You will be able to leave “work at work” and enjoy your personal time without having to replay the events of the day. Think about it: » How much more work you’ll get done? » How much more energy you’ll have at the end of the day? » How much more you’ll enjoy your job and going to work? Who Will Benefit » HR Professionals » People Managers » Leaders » Directors » Managers » Supervisors » Business Owners » Business Consultants » Department Managers » Senior Leaders » Staff at all levels » Anyone who interacts with other people To Register (or) for more details please click on this below link: https://bit.ly/2OwgbYM Email: support@abideedict.com Toll Free No:1-844-511-8858 Tel: +1-913-871-1466","date_start":"2021-03-02","date_end":"","important_dates":{"abstract":"","full":"2021-03-02","notification":"","final":""},"topics":["Business","Management / Leadership"],"location":{"virtual":"","full":["Leawood","United States"],"name":"","street":"","city":"Leawood","state":"","ZIP":"","country":"United States"},"organizers":["www.abideedict.com/"],"societies":[],"indexes":[],"emails":["support@abideedict.com"]}