{"name":"“Over the Horizon: Comparative Perspectives on Literature” International Conference","series":"","short":"","website":"https://comparativeliterature.lcir.co.uk","content":"“Over the Horizon: Comparative Perspectives on Literature” International Conference Selected papers will be published in a post-conference volume with an ISBN. As Sarah Lawall stated in her essay, the world-literature perspective is not one, but multiple. By looking at literature comparatively, we can enrich our understanding of the historical and cultural context of the literary works, to look over the horizon of our own tradition and to see how cultures interact. The conference will consider the theory and the practice of comparative literature and will discuss the transformations and travels of literary genres and texts across time and space. It will explore the connections of literature with history, philosophy, politics, and literary theory, and study the intersections of literature with other cultural forms such as film, visual arts, music and media. Topics may include, but are not limited to: World literatures Postcolonial literature History of literature Multilingualism in literature Translations, adaptations, screenings Literature and politics Literature and philosophy Literature and psychoanalysis Literature and music Literature and art Literature and sciences Literature and gender Children's literature Travel literature Intertextuality and hypertextuality Reception and transmission Teaching literature Paper proposals up to 250 words and a brief biographical note should be sent to: comparative.literature@lcir.co.uk. Please download the paper proposal form on our website: https://comparativeliterature.lcir.co.uk","date_start":"2022-06-04","date_end":"2022-06-05","important_dates":{"abstract":"","full":"2022-04-30","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","Language and Literature"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["comparative.literature@lcir.co.uk"]}