{"name":"On Poverty and Its Eradication","series":"","short":"","website":"https://www.frontiersin.org/research-topics/27921","content":"In collaboration with the Open Access journals of Frontiers (www.frontiersin.org) we are bringing together a selected group of international experts to contribute to an article collection: \"On Poverty and Its Eradication\" Submission Deadlines: 28 February 2022 - Abstract 30 April 2022 - Manuscript Visit the collection homepage for the full description of the project: https://www.frontiersin.org/research-topics/27921/ Participating Journals - manuscripts can be submitted to this Research Topic via the following journals: - Frontiers in Sociology: Migration and Society (2020 CiteScore 1.2) - Frontiers in Sociology: Work, Employment and Organizations (2020 CiteScore 1.2) - Frontiers in Sociology: Sociological Theory (2020 CiteScore 1.2) - Frontiers in Human Dynamics: Migration and Society - Frontiers in Political Science: Methods and Measurement - Frontiers in Public Health: Public Health Policy (2020 Impact Factor: 3.709; 2020 CiteScore: 2.7) About this Research Topic: Today the world observes the International Day for the Eradication of Poverty, first commemorated in Paris in 1987 and subsequently receiving official designation by the United Nations. It is a day for renewing commitment to the human project – to enable universal human development, making it possible for all humans to achieve their highest potential – and to reflect on poverty, how it thwarts human development and how it might disappear. The challenge is not new, but it achieves new urgency as we start to emerge from the Covid-19 pandemic and realize that the damage it caused, to well-being and human development, was deeply intensified by poverty. Frontiers in Sociology is proud to take this opportunity to launch a Research Topic on poverty, aiming for accelerated growth of knowledge about poverty, its causes and consequences, its links to crises and disasters, its connections to inequality and fairness, the direction and speed of its trajectory in different contexts, and strategies for reducing it and their assessment. This Research Topic invites contributions on any aspect of poverty, undertaken from any approach – theoretical and empirical, basic and applied, micro and macro, quantitative and qualitative – currently and across history, and at any scale, from a single small society to multiple countries. For context, contributions on the classics of poverty and poverty relief are welcomed, not only the well-known foundational reasonings, estimates, and legislative debates but also neglected gems such as John Chrysostom’s fourth century estimate that ten percent of the great city of Antioch lived in poverty (and another ten percent in wealth) and the sixteenth century De Subventione Pauperum, written by Juan Luis Vives for the Senate of Bruges. The new knowledge will be a catalyst for new policy discussions and initiatives, leading hopefully to greater possibilities for universal human development and for fair and inclusive societies. Special themes and topics might include, but are not limited to: - Definition and measurement of poverty - Absolute and relative poverty - Global timeline of the classics of poverty and poverty relief - Global timeline of poverty in imaginative literature - Global timeline of estimates of poverty - Causes, effects, and forms of poverty, in the contemporary world and historically - Interactions between poverty and situations of crisis and disasters (environmental disasters/pandemics/conflicts and war zones) - Links between poverty and inequality - Job market's role in battling poverty - Links between poverty and fairness - Lived experience of poverty, inequality, and unfairness - The “other” poverty – voluntary poverty in religious orders and as a way of life - Policies and government programs to eradicate poverty and implement solutions worldwide - Public health policies on health inequalities, health in the poverty reduction strategies, and health promotion Keywords: poverty, poverty relief, poverty and inequalities, poverty and fairness Co-Editors: - Guillermina Jasso, New York University, United States - Andrzej Klimczuk, SGH Warsaw School of Economics, Poland - M.D.R. Evans, University of Nevada, United States - Jonathan Kelley, University of Nevada, United States As a contributing author, you will benefit from: - High visibility with a freely downloadable e-book - Rigorous, transparent and fast peer review - Advanced impact metrics SUBMISSION: Papers should be submitted through this link, using the \"Submit your manuscript\" button: https://www.frontiersin.org/research-topics/27921/ and must follow paper templates available here: https://www.frontiersin.org/about/author-guidelines#Templates Publishing solutions: - Manuscripts will be peer reviewed, and if accepted for publication, are subject to publishing fees, which vary depending on the article type (https://www.frontiersin.org/about/publishing-fees). A discount or waiver can be applied for and all applications are considered (https://frontiers.qualtrics.com/jfe/form/SV\\_51IljifwFBXUzY1). - We collaborate with many leading universities making the Open Access publishing process even more accessible for authors. Click here (https://www.frontiersin.org/about/institutional-membership) to see whether your institution is collaborating with us.","date_start":"2022-04-30","date_end":"","important_dates":{"abstract":"","full":"2022-04-30","notification":"","final":""},"topics":["Social Sciences","Sociology","equity and social justice"],"location":{"virtual":"","full":["Online Event","Switzerland"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Switzerland"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}