{"name":"CREATIVITY AND PERSONAL DEVELOPMENT – Modalities of social and educational integration","series":"","short":"","website":"http://creativity-today.simplesite.com","content":"OBJECTIVES: 1\\. Creativity is a complex concept that requires a continuous redefinition and interpretation, considering its manifestation areas: individual, educational and social. It is necessary to realize some theoretical delimitations between creativity, innovation, invention and discovery. 2\\. Approaching the process of creativity from different theoretical perspectives: psychoanalysis, behaviorism, humanist theory, etc. Defining the role of creativity in the development and optimization of the personality, its role in the educational process and at the social level. 3\\. Analysis of the stages which constitutes the complex process of creativity (germination, insight, elaboration and valorisation of the created products). 4\\. Description of creative manifestations that take place at the society level (cultural, artistic manifestations, art therapy, inventions and innovations, etc.) and of education (intervention through art in school, different creative activities). 5\\. Presentation of the factors that stimulate creativity but also those that block the creative intention. Proposing some projects to implement creativity as an objective in the educational process. Involvement of the school in the development of creative skills through unique artistic activities. 6\\. Sustaining of a new perspective on the modern personality, defined and formed by creativity, enthusiastic and free spirit, capable of continuous adaptation to new situations, to a constantly changing society. We invite to participate teachers and researchers, psychologists, psychotherapists, and students interested in this topic. The papers will be published in a collective volume with academic recognition, which will be indexed later in international databases. We offer nominal Diploma of participation. DEADLINES 10 April, 2020 - for sending title and abstract in English (up to 250 words and 3-5 keywords): 28 April, 2020 - acceptance of papers. 30 April, 2020 - for sending full papers (8 to 10 pages, font Times New Roman - 12, format A4, fully justified, margins Normal. Bibliography: author, year, title, editor.) We ask participants to comply with the deadlines for submitting materials. All documents will be sent electronically to the following e-mail: acadconference@yahoo.ro or marinela.rusu@ices.acadiasi.ro The papers will meet the proposed theme and must not have been previously published. Each author can participate with a maximum of two papers. CONTACT: Romanian Academy, Iasi Branch - Institute of Economic and Social Research, \"Gh. Zane\", Str. T. Codrescu, nr. 2, cod 700481\\. Ph.D. researcher, pr. grd. II, Marinela Rusu Mobile: 004 0749252992 e-mail: acadconference@yahoo.ro marinela.rusu@ices.acadiasi.ro","date_start":"2020-05-22","date_end":"2020-05-23","important_dates":{"abstract":"","full":"2020-04-30","notification":"","final":""},"topics":["Social Sciences","Psychology","educational leadership"],"location":{"virtual":"","full":["IASI","Romania"],"name":"","street":"","city":"IASI","state":"","ZIP":"","country":"Romania"},"organizers":["Romanian Academy"],"societies":[],"indexes":[],"emails":["acadconference@yahoo.ro","marinela.rusu@ices.acadiasi.ro"]}