{"name":"BSH 2021 Virtual ASM | 25 - 28 April 2021","series":"","short":"","website":"https://go.evvnt.com/740925-2?pid=4868","content":"The BSH Annual Scientific Meeting is the largest annual haematology event in the UK and we are now reaching a wider global audience virtually. More than 1,400 delegates from over 50 countries joined us online for BSH 2020 Virtual and we are looking forward to the BSH 2021 Virtual ASM. Complete your registration now to take advantage of this fantastic opportunity to update your knowledge with a programme put together by experts. The programme features clinical practice, the latest research in haematology, and BSH guidelines. There are also specialist sessions for nurses and trainees and a chance to network with international experts. Most sessions will be available on demand until April 2022, so you will be able to watch them at a time that suits you. Grants, discounted rates for BSH members and free registration for low- and middle-income country residents are available. The ASM is accredited by the Royal College of Pathologists and CPD points will be awarded based on the time spent viewing and interacting with the live programme content. The programme also allows for you to self-accredit any sessions watched, which will be viewable on demand for all registered participants until April 2022\\. Registration for delegates include: - Access to state-of-the-art presentations covering a full range of topics in haematology - Engage and meet with other participants - join roundtable discussion and Meet the Expert sessions - Live Q&A session - a great opportunity to ask your questions to the speakers - Abstracts on the latest research - both Oral and Poster abstracts are accepted for the meeting - Industry-led sessions - hear about the work our industry partners are doing in the haematology community - Virtual exhibition area - opportunity to engage with sponsors and other membership organisations - On demand access through to April 2022 - allowing you to learn at your own pace - CPD Accreditation - based on the time of attendance Tickets https://go.evvnt.com/740925-0?pid=4868 Prices: ​BSH Member Rate - Standard GBP 60.00 ​BSH Member Rate - Concessionary GBP 49.00 Non Member Rate - Standard GBP 95.00 LMIC GBP 0.00 Time: On Sunday April 25, 2021 at 9:00 am (ends Wednesday April 28, 2021 at 5:00 pm)","date_start":"2021-04-25","date_end":"2021-04-28","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Public-Health"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["BSH 2021 Virtual ASM c/o MCI UK"],"societies":[],"indexes":[],"emails":[]}