{"name":"Crypto Valley Blockchain Conference 2019","series":"","short":"","website":"https://www.cryptovalleyconference.com/economics-finance-call-for-papers","content":"CALL for PAPERS Economic and Financial Track - Crypto Valley Conference Zug, 25th June 2019 The “Economic and Financial Track” of the 2019 Crypto Valley Conference will bring together scholars, regulators and practitioners interested in exploring opportunities and risks of emerging blockchain-based systems and distributed Ledger technologies. The aim is to merge the gap between academics, technologists, policy makers and regulators engaged in the new field of distributed and peer-to-peer systems, by providing a unique cross-sectoral perspective which allows to exhaustively address questions of practical importance from an economic, financial and business perspective. Submissions should focus on (but are not limited to) the following topics: ECONOMICS Monetary aspects of P2P systems Stable coins and digital fiat Incentive mechanisms in emerging blockchain networks Individual and group decision-making Principles of the decentralised crypto-economy Implications of blockchain for income inequality DLTs, transaction costs and externalities FINANCE Market stability and systemic risk of distributed systems Financial inclusion Regulation of distributed systems Fraud detection and financial crime prevention Tokenisation of assets, pricing and new derivatives The future of ICOs/STOs: opportunities and threats Blockchain and accounting systems Decentralised hedge funds Price discovery and deep liquidity on distributed exchanges BUSINESS Blockchain and new business models Decentralised Autonomous Organisations Metcalfe’s law applied to digital asset ecosystems Corporate governance under the blockchain paradigm Creative destruction in the digital era Authors wishing to contribute a paper to the conference should do it via the submission system using the following link: https://ecosubmit19.cryptovalleyconference.com/ Full papers must be submitted in PDF format. The deadline for submission is midnight GMT, 15th April, 2019\\. Accepted papers will be considered for a publication into Frontiers in Blockchain journal – Financial Blockchain; the editorial guidelines must thus follow the standard requested by the journal (please refer to the following link: https://www.frontiersin.org/journals/blockchain#author-guidelines) Submitted papers will be blindly reviewed by the Crypto Valley Scientific Committee for the Economic and Financial Track. Any mention of the author's names or affiliations should be removed from the submitted paper. Corresponding authors will be notified of acceptance by 31st May, 2019\\. For any questions regarding the call for papers and the submission, please write to the following address: ecosubmit@cryptovalleyconference.com","date_start":"2019-06-24","date_end":"2019-06-26","important_dates":{"abstract":"","full":"2019-04-15","notification":"","final":""},"topics":["Business","Economics","cryptoassets, cryptocurrencies, blockchain"],"location":{"virtual":"","full":["Zug","Switzerland"],"name":"","street":"","city":"Zug","state":"","ZIP":"","country":"Switzerland"},"organizers":["University of Lucerne"],"societies":[],"indexes":[],"emails":["ecosubmit@cryptovalleyconference.com"]}