{"name":"ACH Exception Processes Workshop","series":"","short":"","website":"https://www.complianceonline.com/ach-exceptions-workshop-seminar-training-80653SEM-prdsm?channel=Brownwalker","content":"Intensive training with interactive scenarios throughout the session to help bring the learning home. Learn how to apply best practices to remain in compliance with the Nacha Operating Rules. Have you struggled with the question – “When do I use a Stop Pay form and when do I need a Written Statement of Unauthorized Debit (WSUD)?” This is YOUR session! The trainer in this session will provide examples of when to use which form and why plus tying this information back to what the NACHA Operating Rules state to ensure you are in compliance each time you help your account holder with their request. With the newly adopted Rules change for 2020 with “unauthorized returns” what Return Reason code do I use and why? Return Reason Code R10 or R11 and what is the difference when using these to return Entries as unauthorized? Key points illustrated during this virtual workshop will assist your customer service and front-line staff as well as your operations staff. Covered during this session, the trainer will: Define the Rules surrounding Stop Payments Identify the difference in the Rules between a consumer and non-consumer Stop Payment List tips that will help customer service and frontline staff to ensure they are asking the right questions of the account holder Outline what an unauthorized transaction is and when to use a Written Statement of Unauthorized Debit (WSUD) Identify the differences between using Return Reason Code R10 vs. R11 and what that means to the RDFI when returning Identify training tips for the ODFI to identify the differences between R10 and R11 for Return Entries to the Originator when handling these types of Returns Review timeframes for Stop Payments and Unauthorized Payments Why Should You Attend: This 1-Day workshop is “virtual” and WILL include examples and scenarios to practice the rules and help demonstrate how to apply best practices to remain in compliance with the Nacha Operating Rules. Customer service and operations staff struggle each day with the question from their customer – “What does my account holder want me to do…Stop this payment, return it, or they may be saying they revoked the transaction, or even disputing an unauthorized transaction -- what are the next steps?” What form do I need, what do I need to look for to be sure of what I’m doing when assisting my account holder with these delicate situations. Several scenarios will be provided throughout the virtual workshop to help identify what questions to ask the account holder, what forms to used (based on responses) and next steps to take when returning the Entry. This session will help answer those struggles and concerns to help the front-line and operations staff determine when to use what form, and what the timeframe is to be able to Stop a Payment vs. outright returning an Entry as unauthorized, vs. authorization revoked. These two topics continue to be the number one issues in the exception processing of ACH transactions on a daily basis. In addition, the issue with “Do I use R10 or R11 as the Unauthroized Return Reason Code and why will also be discussed in detail. Who will Benefit: Financial Institution professionals (new/current operations staff) Banking Operations managers and staff Compliance and Risk professionals Treasury Management professionals Aspiring and current AAP’s (Accredited ACH Professionals) Banking Managers/ Supervisors Audit and Compliance Personnel / Risk Managers. Payroll Processors Company / Business Owners (Originators) Third-Party Service Providers and Third-Party Senders Auditors with financial institutions","date_start":"2021-06-08","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}