{"name":"Analytical Method Validation, Verification and Transfer","series":"","short":"","website":"https://www.complianceonline.com/pharma-analytical-method-validation-seminar-training-80595SEM-prdsm?channel=Brownwalker","content":"Reliable analytical results are necessary to make informed decision about the quality and safety of the products in the pharmaceutical industry. In addition, such analytical data are required for regulatory submissions in support of the drug product registrations. Therefore, meaningful experimental designs including system suitability parameters must be planned for the intended use of the procedure. In this course, general guideline for the determination of the analytical characteristics for different types of validation procedures is highlighted for the analysis of both the drug substance and drug product. The factors to consider for verification of the compendial procedures will also be discussed. In addition, different approaches for the transfer of analytical procedure from one lab (transferring) to other lab(s) (receiving) under different circumstances will be covered. Other related topics for obtaining reliable data will also be discussed. These topics include analytical instrument qualification as well as how to set, handle and monitor specifications. Due to global nature of pharmaceutical industry, other quality topics on both regulatory (ICH) and compendial (USP) harmonization are also covered. These topics are valuable for scientists directly or indirectly involved with the drug development, analysis. stability studies or regulatory/compendial submissions. Learning Objectives: Drug Approval Process and Regulatory Requirements (private standards) Pharmacopeias and Compendial Approval Process (public standards) Compendial Harmonization Process Chromatography System Suitability Requirements Allowed Adjustments of Chromatographic System Parameters Analytical Instrument Qualifications including DQ, IQ, OQ, PQ Analytical Method Validation Analytical Method Verification Analytical Method Transfer Learning Objectives: Drug Approval Process and Regulatory Requirements (private standards) Pharmacopeias and Compendial Approval Process (public standards) Compendial Harmonization Process Chromatography System Suitability Requirements Allowed Adjustments of Chromatographic System Parameters Analytical Instrument Qualifications including DQ, IQ, OQ, PQ Analytical Method Validation Analytical Method Verification Analytical Method Transfer","date_start":"2021-12-08","date_end":"2021-12-09","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}