{"name":"Accounts Payable Best Practices","series":"","short":"","website":"https://www.complianceonline.com/accounts-payable-best-practices-seminar-training-80540SEM-prdsm?channel=Brownwalker","content":"Given the current business environment, mounting regulatory pressures, and the increased visibility and importance of the accounts payable function, best practices are something with which every professional needs to be conversant. While it has always been good business practice to monitor and manage supplier risks, the stakes have increased in recent years. Now, more than ever, failing to meet regulatory requirements and expectations can mean potentially significant penalties and remediation costs, as well as serious organizational reputational exposures. Integrated into this process is the accounting for, and internal controls over, the Accounts Payable process. Areas Covered: Best Practices Overview Verifying Supplier Taxpayer Identification Number (TIN)s EPayments and Accounting for them Controlling the Master Vendor File Access Best Practices in detecting AP Fraud How to conduct the effective AP fraud management Red Flag and indicators of AP fraud and how to prevent it Internal Controls and Other Fraud Prevention Measures Vendor/billing fraud schemes Fraudulent AP financial reporting Evolving Fraud Opportunities and Best Control Practices Ensuring Regulatory Compliance Who will Benefit: Accounts payable manager Accounts payable director Accounts payable supervisor Accounting manager Controller Assistant controller Accounts payable associate Accountant Accounting manager Disbursements manager","date_start":"2021-11-08","date_end":"2021-11-09","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Mental-Health"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}