{"name":"INFUS 2020 : International Conference on Intelligent and Fuzzy Systems","series":"","short":"","website":"http://infus.itu.edu.tr","content":"Welcome to INFUS 2020 ​​where you will find everything that you expect from a conference ​ INFUS is an acronym for Intelligent and Fuzzy Systems. It is a well-established international research forum to advance the foundations and applications of intelligent and fuzzy systems, computational intelligence, and soft computing for applied research in general and for complex engineering and decision support systems. The principal mission of INFUS is bridging the gap between fuzzy & intelligence systems and real complex systems via joint research between universities and international research institutions, encouraging interdisciplinary research and bringing multidiscipline researchers together. INFUS 2020 proceedings will be published as a book by Springer under “Advances in Intelligent Systems and Computing Series” and will be indexed in Scopus. Moreover, special issues of indexed journals will be devoted to a strictly refereed selection of extended papers presented at INFUS 2020\\. The journals with publication potential include: International Journal of Computational Intelligence Systems (SCI-E), Journal of Multiple-Valued Logic and Soft Computing (SCI-E), Recent Patents on Engineering (Scopus, EI/Compendex, EBSCO), International Journal of Intelligent Computing and Cybernetics (E-SCI), International Journal of Risk Analysis and Crisis Response (DOAJ). We are happy to announce our invited speakers Prof. Krassimir Atanassov, Prof. Vicenc Torra, and Prof. Janusz Kacprzyk. INFUS 2020 proceedings will be published as a book by the Springer and it will be indexed in Scopus. Special issues of several SCI indexed journals will be devoted to a peer refereed selection of extended papers. INFUS 2020 is the second conference on intelligence and fuzzy systems conference series. The conference will be held in Izmir, “the pearl of Agean\".","date_start":"2020-07-21","date_end":"2020-07-23","important_dates":{"abstract":"","full":"2020-01-17","notification":"","final":""},"topics":["Engineering & Technology","Mechanical/Industrial","Fuzzy Logic, Math & Computing"],"location":{"virtual":"","full":["Izmir","Turkey"],"name":"","street":"","city":"Izmir","state":"","ZIP":"","country":"Turkey"},"organizers":["Istanbul Technical University"],"societies":[],"indexes":[],"emails":[]}