{"name":"7th Annual International Conference on Architecture and Civil Engineering- Indexed By Scopus","series":"","short":"","website":"http://ace-conference.org","content":"Advances in Architecture, Civil Engineering and Environmental Engineering are the order of the day with the rapid industrialization and urbanization driven by the advances in technologies are seen in developed and developing nations. Innovative design and construction practices are challenging tasks to the architects and engineers to meet the ever-growing demands of communities, cities, societies and nations. Additionally, in recent years, sustainability concept has become the common interest of numerous disciplines as the Concept of Green Architecture, also known as “sustainable architecture” or “green building,” is gaining momentum. As the architects across the globe strive to minimise the number of resources consumed in the building’s construction, use and operation, as well as curtailing the harm done to the environment through the emission, pollution and waste of its components, the Environment Sciences is another discipline fuelling the success of Sustainable Architecture. The Architecture and Civil Engineering (ACE) Conference 2019 is a premiere Academic Research Conference for the presentation of new advances and research results in the fields of Architecture Civil Engineering and Environmental Engineering. The conference will bring together leading researchers, architects, engineers and scientists in this domain of interest from around the world.","date_start":"2019-05-27","date_end":"2019-05-28","important_dates":{"abstract":"","full":"2019-03-15","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental","Architecture & Civil Engineering"],"location":{"virtual":"","full":["Singapore","Singapore"],"name":"","street":"","city":"Singapore","state":"","ZIP":"","country":"Singapore"},"organizers":["Global Science & Technology Forum"],"societies":[],"indexes":[],"emails":[]}