{"name":"2nd International Conference on Education","series":"","short":"EDU2021","website":"https://coming.gr/edu2021-call-for-papers/ ","content":"The Communication Institute of Greece (COMinG), invites you to attend its 2nd International Conference on Education (EDU2021) that will take place 8-12 August 2021, in Athens, Greece, both F2F and Remotely endorsed by Kaplan University, Singapore, Beijing Normal University, China & Zhejiang University, China Call for Participation: https://coming.gr/edu2021-call-for-papers/ Submissions deadline for ALL formats proposals: Tuesday 16 March 2021 Submission of Full Papers: 29 June 2021 (except otherwise mentioned on the Acceptance Letter) The conference: 8-12 August 2021 After the organization of seven (7) successful Annual International Conferences (look at Previous Conferences of COMinG), the 2nd International Conference on Education (EDU2021), aims to provide an opportunity for Academics, Professionals and Industry Experts from various fields, with cross-disciplinary interests, to discuss the future directives and innovations in Education. Our main priority is your health security and seeing what has happened around the world with COVID-19 we should not take risks, no matter how much we would like to physically meet. This is why registrants will be able to upgrade to in-person attendance if circumstances allow — or to shift from attending in-person to joining virtually if new restrictions keep them home. Submissions deadline for ALL formats proposals: Tuesday 16 March 2021 This year presenters can either propose a paper presentation, a poster, a round table discussion, a workshop, etc. Please find here all the different formats you can propose at EDU2021\\. For paper presentations, please submit your abstract by email to registration@coming.gr , in a .doc file using the Abstract\\_template. Decisions are reached within 2 weeks after the abstract submission. The deadline to register and to submit full papers will be specified in your acceptance letter. Please take a look at the conference Provisional Conference Program Publication Possibilities All accepted papers will be published in the conference proceedings online with ISBN (abstract book of the conference proceedings). Selected papers, after the peer review process, will have the possibility to be published in one of the following journals: \\*Journal of Education, Innovation and Communication (JEICOM) \\*Journal of Applied Learning & Teaching (JALT) \\*Cambridge Scholars \\*Strategy and Development Review \\*Journal of Media Critiques \\[JMC\\] Conference scientific committee: \\*Dr Margarita Kefalaki, President and Founder, COMinG. \\*Dr Fotini Diamantidaki, Vice President of Research and Academic Affairs, COMinG & Lecturer in Education, UCL Institute of Education, University of London, UK. \\*Dr Sophie Karanicolas, Vice President of Learning Innovations and International Relations, COMinG & Associate Professor, University of Adelaide, Australia. \\*Dr Jurgen Rudolph, Vice President of international research development and relations, COMinG & Head of Research & Academic Partner Liaison, Kaplan Higher Education, Singapore & Editor, JALT Journal, Singapore. \\*Dr Chen Wang, Vice Dean /Professor, Faculty of Education, Beijing Normal University, Beijing, China. \\*Dr Kan Yue, Vice Dean & Professor, Zhejiang University, China. \\*Dr Robert J. Bonk, Vice President for Written Communication and Convenor of COMinG Special Interest Writing Groups & Emeritus Professor of Professional Writing, School of Human Service Professions, Widener University, Chester, USA. \\*Ailson J. De Moraes, Vice President of Business and Public Affairs, COMinG & Senior Lecturer, Royal Holloway School of Management, University of London, Egham, Surrey, UK. \\*Paraskevi Kontoleon, Lecturer, University of South Australia, Australia. \\*Dr Michael Sutton, Game-Based Learning Author, Educator, Innovator, & Facilitator, Researcher, Edupreneur, USA \\*Dr Matt Glowatz, Assistant Professor, University College Dublin, Ireland. \\*Dr Nikleia Eteokleous, Assistant Professor in Educational Technology, School of Education and Social Sciences & Head of the Distance Learning Committee Coordinator of M.Ed. in Curriculum Development and Instruction, Co-founder Robotics Academy, Cyprus. \\*Dr Max Caruso, Western Co-Principal, Yew Wah International Education School of Zhejiang Tongxiang, China. \\*Dr Yuan Ying Caruso, Chinese Co-Principal YWIES Shanghai, China. For any additional information please visit https://coming.gr/edu2021-call-for-papers/ or/and send us an email at info@coming.gr","date_start":"2021-08-08","date_end":"2021-08-12","important_dates":{"abstract":"","full":"2021-03-16","notification":"","final":""},"topics":["Education / Legal / Other","Education","higher education"],"location":{"virtual":"","full":["Athens","Greece"],"name":"","street":"","city":"Athens","state":"","ZIP":"","country":"Greece"},"organizers":["Communication Institute of Greece"],"societies":[],"indexes":[],"emails":["registration@coming.gr","info@coming.gr"]}