{"name":"2019 Bangkok ISEANS International Symposium on Engineering and Natural Science","series":"","short":"","website":"http://www.iseans.org","content":"The Fourth Industrial Revolution life has already had an overwhelming impact on our daily lives. The most widely discussed topic is the Artificial Intelligence. Artificial Intelligence has the capability of self-learning and analyzing big data and make serious judgement without emotional interact. Our lifestyle and choices we make are quietly influenced by the applications of Artificial Intelligence. For example, the movie you want to watch, the restaurant you are going to, the food you want to buy, etc. When everything in your life is no longer entirely up to you, we are closely integrated with another “Artificial World”. As every industry, every class down to every individual is involved in this generation of 4IR and the world of Artificial Intelligence, in view of the advent of this new type of life, HEF, which will be held from November 19-21, 2019 in Bangkok, Thailand, is bringing the world's scholars, professionals, academics and more who are interested in the field of the Fourth Industrial Revolution and AI together in the field across engineering, natural sciences and social sciences to share ideas and experience, and discuss various subjects and developments. Call for Papers! Both full paper and abstract are welcomed to submit. Topics are listed but not restricted to the followings: Special Session: Cross-Disciplinary Applications of Artificial Intelligence Biological Engineering Chemical Engineering Civil Engineering Computer Engineering and Technology Electrical and Electronic Engineering Engineering Management Environmental Engineering Information Engineering and Technology Material Science and Technology Mechanical Engineering and Technology","date_start":"2019-11-17","date_end":"2019-11-19","important_dates":{"abstract":"","full":"2019-07-25","notification":"","final":""},"topics":["Engineering & Technology","Other","Biological Engineering & bioinformatics"],"location":{"virtual":"","full":["Bangkok","Thailand","Thailand"],"name":"","street":"","city":"Bangkok","state":"Thailand","ZIP":"","country":"Thailand"},"organizers":["ARA"],"societies":[],"indexes":[],"emails":[]}