{"name":"2021 4th International Conference on Computer Information Science and Artificial Intelligence","series":"","short":"CISAI 2021","website":"http://www.iccisai.org","content":"2021 4th International Conference on Computer Information Science and Artificial Intelligence（CISAI 2021）aim to present the latest research and results of scientists related to computer science and artificial intelligence topics. This conference provides opportunities for the different areas delegates to exchange new ideas and application experiences face to face, to establish business or research relations and to find global partners for future collaboration. The conference is hosted by AEIC Academic Exchange Information Center, Kunming University Of Science And Technology, Chongqing University, Chongqing University of Technology, organized by School of Artificial Intelligence, Liangjiang, Chongqing, Chongqing Engineering Research Centre for Computer Vision Intelligence Technology; co-organized by Zhejiang University, Huazhong University of Science and Technology, Sichuan University, Tianjin University, Harbin Institute of Technology, South China University of Technology, University of Electronic Science and Technology of China, Nanjing University of Science And Technology, Nanjing University of Aeronautics and Astronautics, Beijing University of Technology, Wuhan University of Science and Technology, Qingdao University of Science and Technology, North China Electric Power University, Lanzhou University of Technology, Donghua University.","date_start":"2021-09-17","date_end":"","important_dates":{"abstract":"","full":"2021-09-03","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Artificial intelligence"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["Chongqing University, Chongqing University of Technology, Kunming University of Science and Technol"],"societies":[],"indexes":[],"emails":[]}