{"name":"Social Media Strategies Summit Higher Education","series":"","short":"","website":"https://go.evvnt.com/844239-0?pid=4868","content":"Join us this October 18-21, 2021 for the Social Media Strategies Summit Higher Education virtual conference! Now in its 7th year, SMSsummit Higher Ed continues to be the #1 social media marketing conference for higher education marketers. We're launching a virtual conference edition to help higher education marketers with social media marketing challenges in the current climate. Don't miss your opportunity to share experiences and learn from your higher ed colleagues from around the globe - virtually! 6 REASONS HIGHER ED MARKETERS CONTINUE TO CHOOSE #SMSSUMMIT YEAR AFTER YEAR - Learn the nuts and bolts of a successful social media strategy to position your institution for success - whether you're in recruitment, admissions, student experience, or alumni relations. - Assess and audit your current social media initiatives through real-life feedback, discussions, and peer-to-peer learning around top social platform best practices and emerging trends. - Revitalize your strategy framework as brand practitioners walk you step-by-step through successful case studies to help you identify new and creative ideas. - Cultivate your arsenal of tools, resources, and connections to champion a social media transformation back at your college or university. You'll leave feeling refreshed, inspired, and reinvigorated. - Experience a unique online gathering of senior-level, cross-industry marketers. We're the only event where attendees benefit from focused higher education sessions, along with access to consumer brand case studies. - Accelerate your career and your role within your company by learning to streamline your processes and improving your existing skills set. Tickets: https://go.evvnt.com/844239-1?pid=4868 Time: 08:30 to 13:00 Prices: General Admission - Earliest Bird (Discount Expires August 19th): USD 399.00, General Admission - Early Bird (Discount Expires September 16th): USD 499.00, General Admission - Last Chance (Discount Expires October 17th): USD 599.00, General Admission - At the Door (Begins October 18th): USD 699.00 Speakers: Webb Lewis, Victoria Mendoza, Kirsten Clark, Hillary Smith, Josef Bookert, Sydney Jones-Wright, Leah Mallett, Caitlyn Richtman, Brandy Kift, Josh McDaniel, Robert Bochnak, Jennie Moore Marshall, Stephanie Swindle Thomas, Krista Berend, Jon Hinderliter, Maria DeCabooter, Chantell Cosner, Celia Ffrench, Bob Musinski, Michael Benning, Katie Falcone, Chandel Charles, Codi Dantu-Johnson, Jamila Walker, RJ Thompson, MFA, Elizabeth R. Hornsby, Ph.D., Steve App, Tomika DePriest, Ryan Lytle, Brandi Briggs Venue details: Virtual","date_start":"2021-10-18","date_end":"2021-10-21","important_dates":{"abstract":"","full":"2021-10-17","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["San Diego","United States"],"name":"","street":"","city":"San Diego","state":"","ZIP":"","country":"United States"},"organizers":["GSMI"],"societies":[],"indexes":[],"emails":[]}