{"name":"Basic, Easy-to-Follow Pivot Tables Including an Introduction to Dashboards","series":"","short":"","website":"https://www.complianceonline.com/basic-easy-to-follow-pivot-tables-introduction-to-dashboard-design-pivot-chart-slicers-webinar-training-705044-prdw?channel=Brownwalker","content":"This Excel training program will guide users in employing Pivot Table filters to analyze data, designing a Pivot Chart from a Pivot Table, developing Slicers for User Interactive Filters, and more. It will also take attendees through the first steps in dashboard design using Pivot Tables. Why Should You Attend: In this webinar, attendees will discover the convenience of using the features within Excel Pivot Tables, Pivot Charts and Pivot Slicers effectively. Learn to use this versatile Excel tool easily and manage data more effectively and discover how to use Excel Pivot Table with this easy-to-follow Excel webinar. Learning Objectives: Understand the relationship between data field headers and the Pivot Table pane Transform data into a Pivot Table Instantly transform (Pivot) rows and columns Use Pivot Table filters to analyze your data Design a Pivot Chart from your Pivot Table Develop Slicers for User Interactive Filters Understand the first steps of dashboard design using Pivot Tables Areas Covered in the Webinar: Set up your data and create a Pivot Table in less than 5 minutes Understand how to activate the Pivot Table and use the Pivot Field for instant versatility Place key business metrics in an interactive Pivot Table for improved, instant analysis Expand and collapse levels of data for focused results Create Slicers and Pivot Charts Instantly interchange rows and columns of information for added clarity and analysis Instantly organize, subtotal, sort and analyze numeric data; alphabetize as necessary Summarize your data by categories and subcategories Creating custom pivot charts to illustrate your data Create slicers to allow any user to automatically manipulate your data Who Will Benefit: Managers Supervisors Financial professionals CPAs Budget directors Financial analysts Administrative assistants Sales professionals Marketers Anyone who uses Microsoft Excel","date_start":"2021-10-05","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}