{"name":"Narrative Studies Winter School","series":"","short":"","website":"https://life-history.lcir.co.uk/narrative-studies-winter-school","content":"The winter school will cover the key concepts and ideas of narrative theory and will offer an opportunity of creative engagement in storytelling and narrative interpretation. While lectures will provide theoretical overview and critical perspectives on the nature of narrative and its various structures, elements and uses, the workshops will be based around discussion of fictional and non-fictional texts, films and other media. They will include academic and creative writing sessions and will largely focus on memory and subjectivity, (oral) history and (auto)biographical practices. We are looking forward to applications from students, researchers and professionals with a particular interest related to narrative studies. The course will allow them to deepen theoretical and methodological knowledge in narrative theory and analysis as well as develop practical skills in storytelling. Participants will be encouraged to make a short presentation exploring a topic related to narrative studies and/or present a piece of creative work. A Certificate of Completion will be provided by the end of the course. In order to book a place, please fill in the booking form available on our website: https://life-history.lcir.co.uk/narrative-studies-winter-school, and send it to life-history@lcir.co.uk. When you receive a confirmation of booking, please register on https://registration.lcir.co.uk.","date_start":"2022-02-01","date_end":"2022-02-06","important_dates":{"abstract":"","full":"2021-12-20","notification":"","final":""},"topics":["Arts & Humanities","Other","literature"],"location":{"virtual":"","full":["Online Event","United Kingdom"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research and Academic LAB"],"societies":[],"indexes":[],"emails":["life-history@lcir.co.uk"]}