{"name":"16th International Conference on Computer Graphics Theory and Applications - GRAPP 2021","series":"","short":"","website":"http://www.grapp.visigrapp.org","content":"16th International Conference on Computer Graphics Theory and Applications - GRAPP 2021 website: http://www.grapp.visigrapp.org February 8 - 10, 2021 Vienna, Austria In Cooperation with: EUROGRAPHICS, GPCG, VRVis and AFIG. Proceedings will be submitted for indexation by: SCOPUS, Google Scholar, DBLP, Semantic Scholar, Microsoft Academic, EI and Conference Proceedings Citation Index. IMPORTANT DATES: Regular Paper Submission: September 14, 2020 Authors Notification (regular papers): November 12, 2020 Final Regular Paper Submission and Registration: November 26, 2020 Position Paper Submission: October 29, 2020 Authors Notification (position papers): December 4, 2020 Final Regular Paper Submission and Registration: December 18, 2020 Scope: The International Conference on Computer Graphics Theory and Applications aims at becoming a major point of contact between researchers, engineers and practitioners in Computer Graphics. The conference will be structured along four main tracks, covering different aspects related to Computer Graphics, from Modelling to Rendering, including Animation, Interactive Environments and Social Agents in Computer Graphics. We welcome papers describing original work in any of the areas listed below. Papers describing advanced prototypes, systems, tools and techniques as well as general survey papers indicating future directions are also encouraged. Paper acceptance will be based on quality, relevance to the conference themes and originality. The conference program will include both oral and poster presentations. Special sessions, dedicated to case-studies and commercial presentations, as well as technical tutorials, dedicated to technical/scientific topics, are also envisaged. Conference Topics: Area 1: Geometry and Modeling - Procedural and Multiresolution Modeling - Image-Based Modeling - Solid and Heterogeneous Modeling - Geometric Computing - Surface Modeling - Physics-Based Modeling - Fundamental Methods and Algorithms - Model Validation - Texture Models, Analysis, and Synthesis - CAGD/CAD/CAM Systems - Quad-Dominant Remeshing - Hexahedral Meshing - 3D Model Repair and Scene Reconstruction - Architectural Geometry - Processing Frameworks and Data Structures - Modeling and Algorithms - Scene and Object Modeling - Modeling of Natural Scenes and Phenomena Area 2: Rendering - Real-Time Rendering - Shadows, Translucency and Visibility - High-Performance Computing and Parallel Rendering - Computational Photography - Systems and Software Architectures for Rendering - Volume Rendering - Rendering Algorithms - Image-Based Rendering - Lighting and Appearance - Non-Photorealistic Rendering, Painting-like Rendering, Drawing - Rendering Hardware - Point-Based Rendering Area 3: Animation and Simulation - Real-Time Clothing and Virtual Fashion - Animation from Motion Capture - Real-Time Character Animation - Plausible Motion Simulation - Animation of Particle Systems - Human Figure Animation - Crowd Simulation - Physics-Based Animation - Image-Based Animation - Modeling and Simulation for Education and Training - Scalable Fluid Simulation - Simulation of Elastic Rods, Shells, and Solids - Dynamic Simulation of Physical Behaviour - Animation Algorithms and Techniques - Real-Time Visual Simulation - Special Effects - Facial Animation - Animation Systems Area 4: Interactive Environments - Procedural and Interactive Artworks - Graphical Interfaces - Virtual Humans and Artificial Life - Interactive 3D Graphics and Immersive Systems for Servers, Desktop and Thin Clients - Interactive 3D Graphics for Mobile Devices like Smart Phones, PDAs and UMPCs - Sketch-Based Interfaces - Virtual Reality Tools and Languages - Integration and Interoperation between 3D Documents and Web/Multimedia Technologies, including the Semantic Web - eLearning Applications and Computer Graphics - Games for Education and Training - Human Performance and Usability of Virtual Environments - Augmented, Mixed and Virtual Environments - Virtual Tours - Hardware Technologies for Augmented, Mixed and Virtual Environments - Collaborative Augmented, Mixed and Virtual Environments - Distributed Augmented, Mixed and Virtual Reality - Real-Time Graphics - Advanced User Interfaces - Mobile Interfaces GRAPP KEYNOTE LECTURE Federico Tombari, Google and Technical University of Munich (TUM), Germany Dieter Schmalstieg, Graz University of Technology, Austria GRAPP CONFERENCE CO-CHAIRS: Jose Braz, Escola Superior de Tecnologia de Setúbal, Portugal Kadi Bouatouch, IRISA, University of Rennes 1, France GRAPP PROGRAM CO-CHAIRS: A. Augusto Sousa, FEUP/INESC TEC, Portugal Vlastimil Havran, Czech Technical University in Prague, Faculty of Electrical Engineering, Czech Republic PROGRAM COMMITTEE http://www.grapp.visigrapp.org/ProgramCommittee.aspx GRAPP Secretariat Address: Avenida de S. Francisco Xavier, Lote 7 Cv. C Tel: +351 265 520 185 Fax: +351 265 520 186 Web: http://www.grapp.visigrapp.org e-mail: grapp.secretariat@insticc.org","date_start":"2021-02-08","date_end":"2021-02-10","important_dates":{"abstract":"","full":"2020-09-14","notification":"","final":""},"topics":["Engineering & Technology","Design"],"location":{"virtual":"","full":["Vienna","Austria"],"name":"","street":"","city":"Vienna","state":"","ZIP":"","country":"Austria"},"organizers":["INSTICC"],"societies":[],"indexes":[],"emails":["grapp.secretariat@insticc.org"]}