{"name":"The 4th International Conference on Polymer Chemistry","series":"","short":"ICPC 2021","website":"https://www.confjuly.org/conference/ICPC2021","content":"The 4th International Conference on Polymer Chemistry (ICPC 2021) Conference Date: July 16-18, 2021 Conference Venue: Kunming, China Website: https://www.confjuly.org/conference/ICPC2021/ Online Registration System: http://www.confjuly.org/RegistrationSubmission/default.aspx?ConferenceID=1358 Email: intelconf@163.com The 4th International Conference on Polymer Chemistry (ICPC 2021) will be held from July 16-18, 2021 in Kunming, China. This Conference will cover issues on Polymer Chemistry. ICPC 2021 is sponsored by Engineering Information Institute, Open Access Library, Scientific Research Publishing, and 1000thinktank. It dedicates to creating a stage for exchanging the latest research results and sharing the advanced research methods. If you wish to serve the conference as an invited speaker, please send email to us with your CV. We'll contact with you asap. Publication and Presentation Publication: Open Access Journal，please contact us for detailed information Index: CNKI and Google Scholar Note: If you want to present your research results but do NOT wish to publish a paper, you may simply submit an Abstract to our Registration System. Contact Us Email: intelconf@163.com Tel: +86 132 6470 2250 QQ: 1349406763, 3025797047 WeChat: 3025797047 Attendance Methods 1.Submit full paper (Regular Attendance+Paper Publication+Presentation) You are welcome to submit full paper, all the accepted papers will be published by Open access journal. 2\\. Submit abstract (Regular Attendance+Abstract+Presentation) 3\\. Regular Attendance (No Submission Required) Conference Topics Theory, Calculation and Modeling of Polymers Polymer Physical Chemistry Compounds Synthesis and Properties of Macromolecules/Polymers Polymerization Kinetics and Mechanisms Crystallization and Self-Assembly Dynamics of Polymer Melts Structure and Characterization of Polymers Interfacial, Surface and Nano-Confinement Effects Chemical Modifications of Natural and Synthetic Polymers Macromolecular Architecture and Supramacromolecules Polymer Solutions, Gels and Complex Fluids Biomacromolecules / Biocolloids / Biopolymers Bio-Related and Medical Polymers Magnetic and Ferroelectric Polymers Electroactive Polymers and Polymeric Actuators Physics and Applications of Block Copolymers Optically Active Polymers Polymer Matrix Composites Polymeric Nanomaterials and Nanostructured Polymers Shape Memory Polymers Functional and Advanced Polymers Complex/Multi-Phase/Multi-Component Polymer Systems Ionomers / Polyelectrolytes / Hydrogels Polymer Electrochemistry Polymer Electronics Application of Polymers Other related issues","date_start":"2021-07-16","date_end":"2021-07-18","important_dates":{"abstract":"","full":"2021-06-16","notification":"","final":""},"topics":["Physical Science & Math","Chemistry"],"location":{"virtual":"","full":["Kunming","China"],"name":"","street":"","city":"Kunming","state":"","ZIP":"","country":"China"},"organizers":["Academic Communications"],"societies":[],"indexes":[],"emails":["intelconf@163.com"]}