{"name":"Quality Control Laboratory Compliance - cGMPs and GLPs","series":"","short":"","website":"https://www.complianceonline.com/quality-control-laboratory-compliance-cgmps-and-glps-seminar-training-80085SEM-prdsm?channel=Brownwalker","content":"FDA inspection and oversight of quality control (QC) laboratories are essential elements of the agency’s evaluation of the compliance status of regulated companies representing multiple industries - pharmaceuticals, biologics, medical devices, as well as foods and cosmetics - as well as the contract QC laboratories which service these industries. Lack of compliance can result in severe regulatory actions, criminal liability, fines, and the inability to obtain product approvals. This course will examine the fundamental requirements for all QC laboratories subject to FDA inspection, recent trends from FDA inspection reports and enforcement actions. In addition, this course will include a list of relevant regulations and guidelines and demonstrate how quality control and quality assurance personnel can monitor industry practices to stay “current” with FDA requirements (cGMPs and GLPs). Learning Objectives: Key goals of the conference will include learning: The basics of FDA law and regulations governing QC laboratories responsible for testing research materials, components of FDA-regulated products, and finished FDA-regulated products (pharmaceuticals, biologics, medical devices, cosmetics, and foods). Laboratory organization, personnel qualification and training requirements. Documentation and record-keeping requirements, including e-records and data integrity. Sample integrity requirements. Management and control of stability (shelf-life) studies. Analytical methods verification and validation. Management and control of laboratory instruments. Management and control of laboratory supplies. Proper conduct of laboratory investigations. Who will Benefit: Senior directors, managers, supervisors and those who have responsibility for ensuring that QC laboratory operations and practices comply with current good manufacturing practices and good laboratory practices. Quality Assurance Quality Control Research & Development","date_start":"2022-02-09","date_end":"2022-02-10","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Compliance Online"],"societies":[],"indexes":[],"emails":[]}