{"name":"Media and Information Literacy Seminar 2022: Nurturing Trust for Media and Information Literacy","series":"","short":"","website":"https://mil.ut.ac.ir","content":"The UNESCO Chair on Cyberspace and Culture and University of Tehran are organizing the 2022 Media and Information Literacy Seminar with the main theme of “Nurturing Trust for Media and Information Literacy” on Monday, 24 October 2022, which coincides with the World Development Information Day and United Nations Day. The Fifth Media and Information Literacy (MIL) Seminar commemorates the Global Media and Information Literacy Week 2022 (24 – 31 Oct) that highlights the twelfth Media and Information Literacy and Intercultural Dialogue Conference and the seventh Youth Agenda Forum. The annual Global MIL Week, initiated in 2012, is led by UNESCO in cooperation with the UNESCO MIL Alliance, the UNESCO-UNAOC MIL and Intercultural Dialogue (MILID) University Network, United Nations Alliance of Civilizations (UNAOC), and other partners. This week-long event offers an opportunity for all stakeholders to assess their progress towards “Media and Information Literacy for All”, and unites diverse actors committed to promoting MIL as a way to foster social inclusion and intercultural dialogue. In line with the 12th International Media and Information Literacy and Intercultural Dialogue Conference, and the 6th Global MIL Week Youth Agenda Forum, 2021 MIL Seminar at University of Tehran aims to address the concept of incorporating MIL for the public good, and focus on how the global community can use Global MIL Week to build MIL as key to a vision of information as a public good and towards achieving Sustainable Development Goals (SDGs). Amidst the rise of Information and Communications Technologies (ICT) that provides new solutions to development challenges and SDGs, MIL is an essential tool for people’s development. Through MIL individuals can mitigate the problems of potentially harmful content and reinforce rights to information and freedom of expression within the current complex of information ecosystem, and it can empower individuals to develop themselves and their societies through enhanced capacities in communication and information. We hope to provide an engaging forum for the participants, and uphold the vision that MIL contributes to the public good, and progress towards the objectives of open and pluralistic information systems, promoting sustainable development, inclusion, equality, intercultural dialogue, and safeguarding democracy. We welcome submissions of scholarly abstracts for oral presentation on all MIL-related topics, particularly the following: • Disinformation, propaganda, and MIL • MIL role in preventing the use of social media to polarize society • MIL, elections, good governance • MIL in time of crisis (e.g. pandemics) and war (e.g. Palestine, Yemen, Syria, Afghanistan) • The role of social media in promoting peace and access to information • The use of media, information and technology to advance MIL development among people • MIL and social justice • MIL policies and practices • Teacher training; how to educate the educators? • Youth: Formal/informal education, and peer education • Information literacy, libraries, the public sphere • MIL in theoretical contexts • Youth and the news • MIL and freedom of expression: Hate speech, dialogue, and engagement • MIL role in privacy and protection of personal data (General Data Protection Regulation) • MIL Futures: Innovation, best practices, challenges, the next step, where are we heading? • Innovation, tools, state of the art technology such as artificial intelligence (AI) and MIL Timeline: The deadline for submitting the abstracts is 22 September. Abstract preparation: The unstructured abstracts can be submitted in either English or Persian in about 300 (min 300, max 500) words. 1\\. Title Concise and informative. Avoid abbreviations and formulae where possible. 2\\. Author names and affiliations Please clearly indicate the given name(s) and family name(s) of each author and check that all names are accurately spelled. Present the authors' affiliation below the names. (in this format: Name, Department/Center/Faculty/College, Institution, City, Country) Indicate all affiliations with a lower-case superscript letter immediately after the author's name and in front of the appropriate address. You may include your ORCID, and list a secondary affiliation. 3\\. Corresponding author & presenter If your paper has multiple authors, clearly indicate who will handle correspondence at all stages of refereeing, and who will present the paper at the Seminar. Their email should be provided listed. 4\\. Keywords Provide four to six keywords representing the main content, and try to avoid general and plural terms and multiple concepts. 5\\. Biographies A brief biography of the author(s) in about 25-30 words (min 20, max 40). Submission: All abstracts should be submitted on the Seminar’s website (https://mil.ut.ac.ir/ ) or in MS Word files to salehinejad\\[at\\]ut.ac.ir with “MIL Seminar 2022” in the subject line by 22 Sep 2022\\. This seminar does not charge any submission or registration fees. Presentations and proceedings: The presentation language can be in either English or Persian. The authors are encouraged to submit a Commentary (1500-4000 words) for consideration for publication in in Journal of Cyberspace Studies (https://jcss.ut.ac.ir/) Contact: You may direct any queries regarding this event to Alireza Salehi-Nejad (salehinejad\\[at\\]ut.ac.ir) with “MIL Seminar 2022” in the subject line.","date_start":"2022-10-24","date_end":"","important_dates":{"abstract":"","full":"2022-09-22","notification":"","final":""},"topics":["Social Sciences","Other","social communication & mass media"],"location":{"virtual":"","full":["Tehran","Iran"],"name":"","street":"","city":"Tehran","state":"","ZIP":"","country":"Iran"},"organizers":["UNESCO Chair on Cyberspace and Culture and University of Tehran"],"societies":[],"indexes":[],"emails":[]}