{"name":"Pharmacovigilance World 2023","series":"","short":"","website":"https://corvusglobalevents.com/conference/pharmacovigilance-world-2023","content":"The Pharmacovigilance World 2023 conference will provide a platform for the participants to discuss, share and stay updated with present state of affairs in Pharmacovigilance and Drug safety, and how it contributes to the public health. It will also allow all its participants to interact with the experts, discuss the various developments, challenges faced and innovations in the field. Our Pharmacovigilance conferences are known for bringing the world-class leaders together to connect, learn and network. The conference will bring-forth the participants and the representatives from various fields of pharmacovigilance and drug safety under a common umbrella, and will provide them an opportunity to network with various industry professionals including pharmaceuticals, biologics, devices, CROs and PV service providers. With the augmented incidence of diseases, and the non-medical use of prescription drugs, the incidence of drug abuse has increased enormously in the recent years, which is apparent with the excess documentation of adversities and drug toxicities. In this context, the drug safety and pharmacovigilance has emerged as a dynamic clinical and scientific discipline to provide adequate information and ensure health safety by the joint interaction of doctors and patients in choosing appropriate treatment methods and drugs. However, evidence suggests though avoidable, the adverse drug reactions (ADRs) to medicines continue to be the bigger life risk. In England, ADR was responsible for up to 6% of hospital admissions, carrying a mortality of 2% and costing the NHS £466 million per annum (€654 million, US$ 602 million) in 2004\\. In some countries, ADR is ranked among the top 10 leading causes of mortality. The concept of drug safety and pharmacovigilance has evolved considerably and is highly necessary to keep the severity of ADR under check. In order to prevent or to reduce harm to patients and improve public health, it is vital to develop and practice mechanisms for evaluating and monitoring the safety of medicines in clinical use. Pharmacovigilance briefs the potential implications of such trends on the evolution of science. However, these days it is confronting issues to develop a better health care system in this global pitch. Some of the major challenges include globalization, web-based sales and information, broader safety concerns, public health versus pharmaceutical industry economic growth, monitoring of established products, developing and emerging countries, attitudes and perceptions to benefit and harm, outcomes and impact, etc. Key Highlights: Pharmacovigilance and globalization Pharmacovigilance in a pandemic world Women and child health care medicines and pharmacovigilance Patient-centric approaches in PV Pharmacovigilance legislation and regulations Harmonization and pharmacovigilance Advanced therapeutic techniques and pharmacovigilance Pharmacovigilance and data management and eudravigilance Post-marketing surveillance in pharmacovigilance PV regulations and challenges Benefit-risk management strategies Risk management and minimization Risk Evaluation and Mitigation Adverse drug reactions reporting Signal detection and post authorization safety Good Pharmacovigilance Practices Innovative approaches to drug safety Strategies to improve PV Real World Evidence in PV Big data and AI in pharmacovigilance Pharmacovigilance Workflows with AI & Automation Other emerging technologies in PV Who should attend the conference? Attendees includes Chief Data Officer, VPs, GMs, Directors, Heads and Managers of Pharmacovigilance Safety & Risk management Drug safety PV Compliance Safety Surveillance Medical Affairs Regulatory Affairs Inspection and Audit Pharmacoepidemiology Post-market studies Medical product safety assessment Drug Research & Development Clinical Pharmacology Medical information Contract outsourcing service providers Health outcomes Sales and Marketing Post-market studies Medical product safety assessment Drug Research & Development Clinical Pharmacology Medical information Contract outsourcing service providers Health outcomes Sales and Marketing","date_start":"2023-11-01","date_end":"2023-11-02","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Mental-Health"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}