{"name":"2nd World Congress on Environmental Toxicology and Health Sciences","series":"","short":"","website":"https://www.lexismeeting.com/environmentaltoxicology","content":"2nd World Congress on Environmental Toxicology and Health Sciences scheduled to be held during August 25-26, 2022 at Chicago, Canada. This Environmental Toxicology 2022 Conference includes a wide range of Keynote presentations, Oral talks, Poster presentations, Symposia, Workshops, Exhibitions and Career development programs. The conference invites speakers and delegates from Leading Universities, Environmental Science Researchers, Environmental Toxicology and Health Science associations, Environmental Science Scientists, Environmental Science Devices, Researchers, Environmental Health Science professionals, students, business delegates and Young researchers across the globe providing a better podium, interconnecting the latest research, technological developments in the area. Participating at Environmental Toxicology 2022 International conference will be an excellent opportunity to meet eminent personalities in the fields of Environmental Toxicology and Health science and learn about the latest technological advancements. For more details visit: https://www.lexismeeting.com/environmentaltoxicology Environmental Toxicology 2022 Highlights includes: • Certification will be provided. • Speaker Profile page will be created. • Abstract will be published in our International Journal with unique DOI. • Eminent Speakers from 50 Countries • Live Streaming of the conference to the world • Nominations for Best Poster Award • Keynote sessions by world's most eminent Environmental Science researchers • Top Organizations Representation • Thought provoking Symposia and Workshops","date_start":"2022-08-25","date_end":"","important_dates":{"abstract":"","full":"2022-08-25","notification":"","final":""},"topics":["Life Sciences","Other"],"location":{"virtual":"","full":["Chicago","United States"],"name":"","street":"","city":"Chicago","state":"","ZIP":"","country":"United States"},"organizers":["LEXISCONFERENCES- Ties in Science | Technology | Healthcare"],"societies":[],"indexes":[],"emails":[]}