{"name":"MACHINE LEARNING AND APPLICATIONS: AN INTERNATIONAL JOURNAL","series":"","short":"MLAIJ","website":"https://airccse.org/journal/mlaij/index.html","content":"MACHINE LEARNING AND APPLICATIONS: AN INTERNATIONAL JOURNAL (MLAIJ) ISSN : 2394 – 0840 https://airccse.org/journal/mlaij/index.html Scope: Machine Learning and Applications: An International Journal (MLAIJ) is a quarterly open access peer-reviewed journal that publishes articles which contribute new results in all areas of the machine learning. The journal is devoted to the publication of high quality papers on theoretical and practical aspects of machine learning and applications.The goal of this journal is to bring together researchers and practitioners from academia and industry to focus on machine learning advancements, and establishing new collaborations in these areas. Original research papers, state-of-the-art reviews are invited for publication in all areas of machine learning. Authors are solicited to contribute to the journal by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in the areas of machine learning. Topics of interest: • Machine Learning Algorithms • Learning in knowledge-intensive systems • Learning Methods and analysis • Supervised Machine Learning • Unsupervised Machine Learning • Deep Learning • Neural Networks • Reinforcement Learning • Predictive Learning • Learning Problems • Computer Vision • Bayesian Network • Data Mining Paper submission Authors are invited to submit papers for this journal through Email: mlaijjournal@airccse.org or mlaij@aircconline.com or through Submission System. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this Journal. For paper format download the template in this page Important dates: • Submission Deadline : October 08,2022 • Authors Notification : November 01,2022 • Registration & Camera-Ready Paper Due : November 16,2022 Contact us: Here's where you can reach us : mlaijjournal@yahoo.com or mlaijjournal@airccse.org or mlaij@aircconline.com","date_start":"2022-12-28","date_end":"2022-12-29","important_dates":{"abstract":"","full":"2022-10-01","notification":"","final":""},"topics":["Engineering & Technology","Design","Machine Vision"],"location":{"virtual":"","full":["Online Event","India"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"India"},"organizers":["MLAIJ"],"societies":[],"indexes":[],"emails":["mlaijjournal@airccse.org","mlaij@aircconline.com","mlaijjournal@yahoo.com"]}