{"name":"45th ESPEN Congress 2023","series":"","short":"","website":"https://go.evvnt.com/1679368-0?pid=4868","content":"On behalf of the French-Speaking Society for Clinical Nutrition and Metabolism (SFNCM), we would like to invite you to the 45th ESPEN Congress 2023 which will be held for the fourth time in France and for the first time in Lyon. We would like to welcome all ESPEN delegates to the magnificent city of Lyon. Lyon is the second French city and is ideally located at the crossroads of Europe. You will enjoy discovering the city centre, the suroundings and the parks of this town as well as its two rivers (the Rhone and the Saone). Lyon is listed in the UNESCO World Heritage Register thanks to its Roman ruins and Renaissance buildings. Lyon is a major city for mixing culture and art with many museums and festivals. Lyon is also the city of gastronomy and is famous all over the world for the art of fine dining. Chef Paul Bocuse was one of the world-famous chefs who put Lyon on the culinary map. In Lyon, you can discover twenty one Michelin starred restaurants, but also the famous \"Bouchon Lyonnais\" which are very popular restaurants that must be tested and whose food must be tasted. Next to the Convention Center, the city park 'Parc de la Tête d'Or' and the Rhône River will offer you the possibility to take a walk or a run after Congress sessions. Thanks to all ESPEN Committee members, we are happy to offer you an attractive programme with new advances in the fields of Clinical Nutrition and Metabolism but without forgetting education to improve our practice. Live healthY with Optimal Nutrition was our guiding thread to create this programme. We are convinced that the ESPEN 2023 programme offers a great opportunity for physicians, dietitians, pharmacists, nutritionists, scientists, nurses, and everyone involved in the field of nutrition and metabolism to meet and discuss cutting-edge science in an informal atmosphere, stimulate new collaborations and consolidate existing close partnerships. URL: Tickets: https://go.evvnt.com/1679368-2?pid=4868 Time: 9:00 am - 12:00 pm Venue details: Palais des congrès de Lyon, 50 Quai Charles de Gaulle, Lyon, Auvergne-Rhône-Alpes, 69006, France Prices: Virtual ESPEN Member (From 4 May 2023): EUR 424.00, ESPEN Member (From 4 May 2023): EUR 530.00, Virtual Non Member (From 4 May 2023): EUR 495.00, Nurse - ESPEN Member (From 4 May 2023): EUR 375.00, Virtual Nurse - ESPEN Member (From 4 May 2023): EUR 295.00, Nurse - Non Member (From 4 May 2023): EUR 455.00, Virtual Nurse - Non Member (From 4 May 2023): EUR 345.00, Dietitian - ESPEN Member (From 4 May 2023): EUR 375.00, Virtual Dietitian - ESPEN Member (From 4 May 2023): EUR 295.00, Dietitian - Non Member (From 4 May 2023): EUR 455.00, Virtual Dietitian - Non Member (From 4 May 2023): EUR 345.00, Student (From 4 May 2023): EUR 355.00, Virtual Student (From 4 May 2023): EUR 220.00","date_start":"2023-09-11","date_end":"2023-09-14","important_dates":{"abstract":"","full":"2023-09-10","notification":"","final":""},"topics":["Education / Legal / Other","Education","clinicalnutrition"],"location":{"virtual":"","full":["Lyon","France"],"name":"","street":"","city":"Lyon","state":"","ZIP":"","country":"France"},"organizers":["MCI"],"societies":[],"indexes":[],"emails":[]}