{"name":"International Journal of Next-Generation Networks","series":"","short":"IJNGN","website":"https://airccse.org/journal/ijngn/ijngn.html","content":"International Journal of Next-Generation Networks (IJNGN) ISSN: 0975-7023(Online); 0975-7252(Print) https://airccse.org/journal/ijngn/ijngn.html Scope & Topics The International Journal of Next - Generation Network (IJNGN) transports all information and services such as voice, data and media by encapsulating these into packets. Limitations of Internet era can be overcome by Next-generation network protocols and their advanced features and technologies. Research and development on Next-Generation Network (NGNs) have been carried out over the last few years. The International Journal of Next- Generation Network (IJNGN) is an open access peer-reviewed journal that focuses on architectural changes in telecommunication core and access networks. The Journal aims to present the latest developments and technical solutions in the areas of NGN system, multimedia services, and its related deployment, performance, security and mobility. The goal of this journal is to bring together researchers and practitioners from academia and industry to focus on advanced NGN concepts and establish new collaborations in these areas. Authors are solicited to contribute to this journal by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in the field of next Generation Network. Topics of interest include, but are not limited to, the following Next Generation Communications System • Network Convergence Issue, Architecture, Applications and 4G Wireless Technologies • Long Term Evaluation (LTE) • Performance Evaluation of NGN Networks • Experimental and Simulated Testbeds • Mobility Across Networks • Vehicular Communications • P2P Architectures for NGN • Universal Mobile Telecommunications System (UMTS) NGN Activities • M-Health over NGN • Testbed Design and Deployments • Social Networking, and Location-based Services for NGN • Web 2.0 and NGN • Case Studies of NGN Services • Application development frameworks and tools • Service Creation, Delivery, and Management • NGN Security deployment, Observation • User Data Privacy in NGN IP Multimedia Subsystem (IMS) • Architectures & Deployment for IMS • IMS Core Services • IMS Mobility • IMS Integration with other network and Services • IMS Security Multimedia Communications • Quadruple Play • Multicast & Broadcast over NGN • IPTV • Mobile TV • Cross-layer Optimization for Multimedia Service Support Paper submission Authors are invited to submit papers for this journal through Email: ijngn@aircconline.com or through Submission System. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this Journal. For paper format download the template in this page Important Dates • Submission Deadline : September 03, 2022 • Notification : September 25, 2022 • Final Manuscript Due : September 28, 2022 • Publication Date : Determined by the Editor-in-Chief Contact Us Here's where you can reach us: ijngn@yahoo.com or ijngn@aircconline.com Paper Submission link: https://coneco2009.com/submissions/imagination/home.html","date_start":"2022-09-28","date_end":"2022-09-30","important_dates":{"abstract":"","full":"2022-09-03","notification":"","final":""},"topics":["Social Sciences","Linguistics"],"location":{"virtual":"","full":["Chennai","Tamil Nadu","India"],"name":"","street":"","city":"Chennai","state":"Tamil Nadu","ZIP":"","country":"India"},"organizers":["ijngn@aircconline.com"],"societies":[],"indexes":[],"emails":["ijngn@aircconline.com","ijngn@yahoo.com"]}