{"name":"2023 8th International Conference on Mathematics and Artificial Intelligence","series":"","short":"ICMAI 2023","website":"http://www.icmai.org","content":"Publication: The ISBN number assigned to ICMAI 2023 is 978-1-4503-9998-2 Submitted paper will be peer reviewed by conference committees, and accepted papers will be included into ICMAI 2023 Conference Proceedings, which will be published in the International Conference Proceedings Series and will be archived in the Online Digital Library, and indexed by Ei Compendex and Scopus and submitted to be reviewed by Thomson Reuters Conference Proceedings Citation Index (ISI Web of Science) More details about publication history, please visit: http://www.icmai.org/history.html \\*Journal Recommendation Mathematics (www.mdpi.com/journal/mathematics) (ISSN 2227-7390) is a peer-reviewed open access journal which provides an advanced forum for studies related to mathematics, and is published semimonthly online by MDPI . Indexed in the Science Citation Indexed Expanded - SCIE (Web of Science)and Scopus. / Impact Factor of 2.592 (2021 JCR), ranking 21/332 (Q1 and top 10%) and CiteScore of 2.9, ranking 53/391 (Q1) Axioms (ISSN 2075-1680) is an international, peer-reviewed, open access journal of mathematics, mathematical logic and mathematical physics, published monthly online by MDPI (https://www.mdpi.com/journal/axioms). It is indexed in SCIE (Web of Science) and Scopus. Impact Factor: 1.824 (2021, Q2 in MATHEMATICS, APPLIED) / CiteScore 2.60 (Q1 in Algebra and Number Theory) IJSSC - International Journal of Space-Based and Situated Computing Special Issue on AI-based Situated Services for Smart Cities","date_start":"2023-04-07","date_end":"2023-04-09","important_dates":{"abstract":"","full":"2023-02-25","notification":"","final":""},"topics":["Physical Science & Math","Mathematics","mathematics"],"location":{"virtual":"","full":["Chongqing","China"],"name":"","street":"","city":"Chongqing","state":"","ZIP":"","country":"China"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}