{"name":"2022 3rd International Conference on Big Data and Social Sciences","series":"","short":"ICBDSS2022","website":"http://www.icbdss.org","content":"The 3rd International Conference on Big Data and Social Sciences (ICBDSS 2022) will be held on August 19 - 21, 2022, in Hulunbuir, China. With the support of experts and professors, the ICBDSS 2022 conference successfully held its first conference last year. In order to allow more scholars to have the opportunity to participate in the conference to share and exchange experience. This conference mainly focused on \"big data\", \"social science\" and other research fields to discuss. At present, my country has entered the era of \"big data cloud migration\", that is, the era of big data, the Internet of things, cloud computing and mobile Internet. The market demand for big data talents is also increasing day by day. The purpose of the conference is to provide a way for experts, scholars, engineering technicians, and technical R&D personnel engaged in big data and social science research to share scientific research results and cutting-edge technologies, understand academic development trends, broaden research ideas, strengthen academic research and discussion, and promote the academic achievement industry Platform for chemical cooperation. The conference sincerely invites experts, scholars from domestic and foreign universities, scientific research institutions, business people and other relevant personnel to participate in the conference. We warmly invite you to participate in ICBDSS 2022 and look forward to seeing you in Hulunbuir, China!","date_start":"2022-08-19","date_end":"2022-08-21","important_dates":{"abstract":"","full":"2022-08-19","notification":"","final":""},"topics":["Social Sciences","Political-Science","Sociology, Social Sciences"],"location":{"virtual":"","full":["Hulunbuir","China"],"name":"","street":"","city":"Hulunbuir","state":"","ZIP":"","country":"China"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}