{"name":"NEW TECHNOLOGIES, MIGRATION AND THE FUTURE OF WORK","series":"","short":"","website":"https://glocalismjournal.org/cfp-2022-3-new-technologies-migration-and-the-future-of-work","content":"GLOCALISM JOURNAL OF CULTURE, POLITICS AND INNOVATION ISSN 2283-7949 CALL FOR PAPERS “Glocalism”, a peer-reviewed, open-access and cross-disciplinary journal, is currently accepting manuscripts for publication. We wel-come studies in any field, with or without comparative approach, that address both practical effects and theoretical import. All papers should be sent to: glocalismjournal@gmail.com and to the guest editor: hillmann@tu-berlin.de Articles can be in any language and length chosen by the author (abstract and keywords in English). Expressions of interest: June 30, 2022\\. Deadline: September 30, 2022\\. This issue (2022, 3) is scheduled to appear at end of November 2022\\. Website: https://glocalismjournal.org/ Direction Committee: Arjun Appadurai (New York University); Daniele Archibugi Birkbeck, University of London); Seyla Benhabib (Yale University); Sabino Cassese (Scuola Normale Superiore); Manuel Castells (Universitat Oberta de Catalunya); Fred Dallmayr (Uni-versity of Notre Dame); Anthony Giddens (London School of Economics and Political Science); Sheila Jasanoff (Harvard Universi-ty); Hans Köchler (University of Innsbruck); Alberto Martinelli (Università degli Studi di Milano); Anthony McGrew (La Trobe Uni-versity, Melbourne); Alberto Quadrio Curzio (Università Cattolica del Sacro Cuore); Roland Robertson (University of Pittsburgh and University of Aberdeen); Saskia Sassen (Columbia University); Amartya Sen (Harvard University); Gayatri Chakravorty Spivak (Colum-bia University); Alain Touraine (École des Hautes Études en Sciences Sociales). the topic of this issue NEW TECHNOLOGIES, MIGRATION AND THE FUTURE OF WORK edited by Felicitas Hillmann (Networking Unit Paradigm Shift, Technische Universität Berlin) There is no doubt that technological change is transforming labour markets worldwide and thereby altering migration patterns. New technologies may create new jobs and foster substantial change in work requirements – they enhance glocal forms of work. An increasing differentiation between movable (vs. non-movable) jobs already has had significant consequences on mobility patterns, as well as the emergence of transnational labour markets. However, technological progress also induces job loss in some segments of the labour market. This, in turn, can cause people to move elsewhere. A lack of technological progress in some countries may also make out-migration attractive. Furthermore, entangled legal infrastructure(s) of technological change, labour markets and mobility are in-creasingly relevant – at present we see a predominance of “trial-and-error” approaches by the various actors engaged. Legal infra-structures can simultaneously encourage and discourage employers to engage migrants with more stable contracts. Technological change especially affects labour markets and social policies regarding the way we “do” work. In different societies, cultures, and world regions, (new) technologies shape routines and work processes to different degrees and in different ways. This has implications for the value and applicability of migrants’ qualifications and skills and, in turn, for their social integration into firms and societies. Even though we see somewhat of a gap arising between the producers and the consumers of new technologies, our knowledge of the potentials and risks of such new technologies tends to be dominated by the technology-producing community. Already today, research often depends on data that is gathered for marketing purposes rather than for scientific research. By now, the spectrum of our knowledge of the consequences of digitalization and new technologies in mobile labour and migrants’ lives is rather limited, as is our understanding of matching tools or algorithms for selected segments of the labour market. Research of the impacts of digitaliza-tion on work and migration is at the starting block – and with this special issue we invite papers that focus especially on three dimen-sions of change that go along with digitalisation and with the implementation of new technologies, especially concerning migrant work. First, we concentrate on the way algorithms, matching tools and websites allow for better allocation of refugees into local la-bour markets and into social security systems. Next, we are interested in how the use of online platforms alters the organisation of work for migrants in sectors that are highly dependent on migrant work, and in which the nature of the work does not allow for au-tomatization (e.g. nursing and delivery services). Third, we invite papers that explore how new technologies impact traditional knowledge systems or transform the organisation of work for highly mobile workers (e.g. digital nomads, fishermen). The editorial will place in centre stage the salient features of this field of knowledge and embed the presented articles into an analytical framework.","date_start":"2022-09-30","date_end":"","important_dates":{"abstract":"","full":"2022-09-30","notification":"","final":""},"topics":["Social Sciences","Sociology","Sociology, Social Sciences"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["Glocalism. Journal of Culture, Politics and Innovation"],"societies":[],"indexes":[],"emails":["glocalismjournal@gmail.com","hillmann@tu-berlin.de"]}