{"name":"ICN Congress 2023","series":"","short":"","website":"https://go.evvnt.com/1257740-0?pid=4868","content":"The International Council of Nurses and the Canadian Nurses Association are delighted to invite you to attend the ICN Congress, 1-5 July 2023 in Montreal, Canada! With the theme “Nurses together: a force for global health”, the ICN 2023 Congress will bring together the powerful force of the 28 million nurses worldwide! For four days, we will unite to learn, share and network in order to build a better future for the nursing workforce and our healthcare systems! As the world’s largest international nursing event, the ICN Congress has proved itself as the global platform to gather and empower the global nursing community. Following the success of the 2021 virtual Congress, this face-to-face event will unite nurses from around the world with renewed strength and energy to make a difference. We will look at how we can build on the lessons learned from the pandemic, from protecting nurses rights, ensuring decent working conditions, optimizing nurses’ scope of practice, and fair pay, to driving nursing leadership, respect for the profession, and a greater impact on health policies at all levels. The event will also highlight the importance of unity, solidarity, collaboration and influence as we come together as a force for global health! We look forward to seeing you in Montreal! Facebook https://go.evvnt.com/1257740-2?pid=4868 LinkedIn https://go.evvnt.com/1257740-3?pid=4868 Twitter https://go.evvnt.com/1257740-4?pid=4868 YouTube https://go.evvnt.com/1257740-5?pid=4868 Brochure https://go.evvnt.com/1257740-6?pid=4868 Price: General Admission: CAD 0.00 Category: Conferences | Science, Health & Medicine | Medical Research Dates and Time: Starts: Sat, Jul 1, 2023 ( 9:00 AM) and Ends: Wed, Jul 5, 2023 ( 5:00 PM) Venue details: 59 Rue Saint-Antoine O 9e etage, 59 Rue Saint-Antoine Ouest, Montréal, Québec, H2Z 1G9, Canada","date_start":"2023-07-01","date_end":"2023-07-05","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Medical-Speciality","globalhealth"],"location":{"virtual":"","full":["Montréal","Canada"],"name":"","street":"","city":"Montréal","state":"","ZIP":"","country":"Canada"},"organizers":["Kenes Group on behalf of the International Continence Society"],"societies":[],"indexes":[],"emails":[]}