{"name":"7th International Conference on Recent advances in Physics","series":"","short":"PHY 2023","website":"https://phy2023.org","content":"7th International Conference on Recent advances in Physics (PHY 2023) May 13 \\~ 14, 2023, Virtual conference https://phy2023.org/ Scope 7th International Conference on Recent advances in Physics (PHY 2023) will provide an excellent international forum for sharing knowledge and results in theory, methodology and applications impacts and challenges of Physics. The conference documents practical and theoretical results which make a fundamental contribution for the development of Physics. The aim of the conference is to provide a platform to the researchers and practitioners from both academia as well as industry to meet and share cutting-edge development in the field. Original research papers, state-of-the-art reviews are invited for publication in all areas of Physics, but are not limited to. Authors are solicited to contribute to the conference by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in the areas of Physics. Topics of interest • Advanced Functional Materials • Applied & Fiber Optics • Atomic and Molecular Experiments • Condensed Matter Physics • Elementary Particle Physics Theory and Experiment • Magnetics • Nano-Photonics, Nano-fabrication & Analysis • Nuclear Physics Theory and Experiment • Optics • Physics of Complex Systems & • Biophysics • Plasma Physics • Quantum Physics • Spectroscopy • Theoretical High Energy Physics Paper Submission Authors are invited to submit papers through the conference Submission System by February 18, 2023\\. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by International Journal of Recent advances in Physics (IJRAP) (Confirmed). Selected papers from PHY 2023, after further revisions, will be published in the special issue of the following journal. • International Journal of Recent advances in Physics (IJRAP) Important Dates • Submission Deadline : February 18, 2023 • Authors Notification : April 15, 2023 • Registration & camera - Ready Paper Due : April 22, 2023 Contact Here's where you can reach us: phy@phy2023.org (or) phyconference@yahoo.com Submission link: https://phy2023.org/submission/index.php","date_start":"2023-05-13","date_end":"2023-05-14","important_dates":{"abstract":"","full":"2023-02-18","notification":"","final":""},"topics":["Physical Science & Math","Physics","Optics and Laser Science"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["PHY 2023"],"societies":[],"indexes":[],"emails":["phy@phy2023.org","phyconference@yahoo.com"]}