{"name":"12th Diabetes Complications Conference & Grand Rounds","series":"","short":"","website":"https://www.nadidiabetes.com.my","content":"“DIABETES COMPLICATIONS” CONFERENCE & GRAND ROUNDS Prevalence of diabetes mellitus, especially of type 2, is on the increase. This rise is most marked in developing countries, Malaysia included. The increasing number of people with diabetes is compounded by the added burden of chronic complications of the disease which remain an important cause of morbidity and premature mortality for those affected, and a huge challenge to healthcare providers. To help address these issues, the National Diabetes Institute (NADI) of Malaysia, organises “Diabetes Asia Conference (DAC)” annually since its inception in 2002 as a Continuing Professional Development (CPD) Initiative on diabetes and related diseases. The “Diabetes Complications” Conference & Grand Rounds (DCOM) was first introduced in 2009 to provide specific focus on diabetic complications. Conference & Grand Rounds The Continuing Professional Development (CPD) Series as “Diabetes Complications” Conference & Grand Rounds aims to help in the prevention and effective management of diabetic complications especially in relation to diabetic foot, cardiovascular disease, retinopathy and nephropathy. The emphasis is on recent advances and practical aspects in the prevention and effective management of diabetic complications. Participants are expected to be able to: -appreciate recent advances and practical aspects of diabetes care, especially in relation to prevention, early diagnosis and optimal management of diabetic complications. -apply knowledge gained during the “Diabetes Complications” Conference & Grand Rounds to further improve care for persons with diabetes in the community.","date_start":"2023-05-26","date_end":"2023-05-27","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal","Diabetes and endocrinology"],"location":{"virtual":"","full":["Kuala Lumpur","Malaysia"],"name":"","street":"","city":"Kuala Lumpur","state":"","ZIP":"","country":"Malaysia"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}