{"name":"International Conference \"Migrating World: Interdisciplinary Approaches to Migration and Integration\"","series":"","short":"","website":"https://integration.lcir.co.uk","content":"Migration has been a constant feature of human history – “homo migrans” have existed ever since “homo sapiens”. Recently the themes of migration and integration have been especially topical in Europe and in other parts of the world due to massive and ever-growing movement of population. These spreading in-flows of immigrants have a strong impact on the social, economic and political climate of host countries, which are often highly challenged by the growing numbers and, therefore, have to review their immigration and integration policies to adjust to the contemporary processes of globalization. Integration is becoming more and more important at the time when migration is steadily growing and diversifying and is undergoing profound changes. Integration and its diverse components have therefore become a central aspect that must be analysed, supported and facilitated in contemporary societies because only successful integration builds communities that are stronger economically and more inclusive socially and culturally. It is important to analyse all these processes of our migrating world applying various interdisciplinary approaches in order to better understand the current trends in international migration, to discuss and assess different aspects and changes in the fields of migration, integration and cultural diversity. The international interdisciplinary conference \"Migrating World: Interdisciplinary Approaches to Migration and Integration\" aims to bring together scholars from around the world to exchange and share their ideas and research findings in all relevant aspects of migration and integration. It will provide an effective interdisciplinary platform for researchers, practitioners and educators to present and discuss the most recent innovations, trends as well as practical challenges encountered and solutions adopted in the fields of migration, integration and cultural diversity. Topics of interest include, but are not limited to: Asylum policy and treatment of refugees Asylum seekers, refugees, migrants – understanding immigration systems Border services and management Comparative migration policies Migration and migration history The importance of the linguistic integration of immigrants Citizenship and immigration Social, cultural, economic integration of immigrants and refugees Illegal migration and security threats Family dynamics and inequalities in migration Migration and human rights Human trafficking and exploitation Identity of immigrants Labour market integration; adaptation strategies of immigrants; retention of ethnic and older national identities Migration and multiculturalism Migration and social change: international and European perspectives Policing ethnicity: between the rhetoric of inclusion and the practices and policies of exclusion Political asylum and refugee status Policy discussions that enhance the understanding of immigration, settlement and integration and that contribute to policy development Promoting social imagination at the global level: a discussion about migration and intercultural integration Sociology of migration: differences, inequalities and sociological imagination (Successful) migrant integration: whose responsibility is it? Cultural diversity and diversity management The inequalities referring to the right to mobility in the context of globalization Migration in Media and Arts Migration in literature We invite proposals from various disciplines including political science, sociology, economics, history, law, philosophy, anthropology, public administration, demography, social geography, literature, linguistics, etc. Paper proposals up to 250 words and a brief biographical note should be sent to: integration@lcir.co.uk","date_start":"2024-01-27","date_end":"2024-01-28","important_dates":{"abstract":"","full":"2023-11-05","notification":"","final":""},"topics":["Social Sciences","Sociology"],"location":{"virtual":"","full":["Online Event","United Kingdom"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["integration@lcir.co.uk"]}