{"name":"47th World Small Animal Veterinary Association Congress and XVIII FIAVAC Congress","series":"","short":"","website":"http://go.evvnt.com/1226303-0?pid=4868","content":"Dear colleagues from all over the world, Welcome to the 47th World Small Animal Veterinary Association Congress, which will take place from 29-31 October 2022, in Lima, Peru. Let's meet in the \"City of the Kings\", a privileged place with a culture that is born from a mixture of other cultures where you can visit many tourist places such as cathedrals, squares, and museums that are witnesses of a majestic past and enjoy a gastronomy that seduces the world. Peru is preparing to make you feel safe, cared for, and protected. We have learned ever since the start of the pandemic, to turn distance into art, applying the utmost care for details because we know that all the effort is worth it. We have learned to build bridges to feel closer by joining our paths no matter how far we are so that you can take a break and enjoy one of the largest Veterinary Medicine Congresses in the world, which will bring together the best professionals from many veterinary specialities from around the globe, an event that you cannot miss! Get ready to visit this ancient, ancestral, cultural and touristic land where you can enjoy the immensity of the Pacific Ocean, the majesty of the mountains to the exuberant Amazon jungle. Enjoy a rich mix of cultures and visit scenarios such as the deepest canyons on earth, the largest river in the world, ancient cultures, and the oldest civilization in America; Macchu Picchu and other wonders that amaze all its visitors. For the local Organizing Committee, it will be a pleasure to receive you and to form bonds of friendship that will last forever! Early Bird Registration Deadline: 6 October 2022 URLs: Tickets: https://go.evvnt.com/1226303-1?pid=4868 Facebook: https://go.evvnt.com/1226303-3?pid=4868 Twitter: https://go.evvnt.com/1226303-4?pid=4868 Instagram: https://go.evvnt.com/1226303-5?pid=4868 Price: Registration savings and special rates available: wsava2022.com: USD 10.00 Speakers: Dr. Felisbina Queiroga, Dr. Jose Salazar Guevara, Dr. Ellen van Nierop, Dr. Paulo Steagall, Dr. Luca Guardabassi, Dr. Cecilia Villaverde, Dr. Natalia Ignatenko Date and Time: 29th October 2022 at 8:00 am to 31st October 2022 at 7:00 pm Venue details: Lima Convention Center, 206 Avenida de la Arqueología, San Borja, Provincia de Lima, 15021, Peru","date_start":"2022-10-29","date_end":"2022-10-31","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Veterinary"],"location":{"virtual":"","full":["San Borja","Peru"],"name":"","street":"","city":"San Borja","state":"","ZIP":"","country":"Peru"},"organizers":["Kenes Group on behalf of WSAVA"],"societies":[],"indexes":[],"emails":[]}