{"name":"Pharma Supply Chain & Security World 2023 “Supply-Chain, Anti-Counterfeiting, Drug Serialization and Packaging & Labeling” Conference","series":"","short":"","website":"http://www.corvusglobalevents.com/pharma-supply-chain-security-world-2023/products","content":"The Annual Pharma Supply Chain & Security World Summit is back in London for the 5th time, and this time with more focus on optimizing your supply chain challenges to ensure an agile, responsive, streamlined and secured supply chain. The pharmaceutical supply chains are facing a significant challenge in the form of counterfeit drugs that are entering the supply chain from various points at different levels. Pharmaceutical companies that adopt an effective serialisation program have end-to-end visibility and traceability for all of their packaging, labelling, and distribution. This enables them to rapidly identify and quarantine counterfeit products. This helps to protect patients, consumers worldwide, brand equity, reputations and the company's revenue stream by ensuring compliance with regulatory requirements for serialisation of medicines in emerging markets. The rise of the digital supply chain has been accompanied by an ever-increasing number of regulations that have accelerated its development and adoption. Years ago, the pharmaceutical supply chain regulated only manufacturing and distribution. However, with a rise in economic impact of counterfeit drugs on society, there have been attempts to improve serialisation processes even further. In spite of past obstacles, innovations like IoT, AI and ML (and Blockchain) have led us into an exciting era of digitization within our industry. Data-driven algorithms and analytics will transform the pharmaceutical supply chain, helping it become more intuitive. With AI's predictive power combined with ML capabilities to analyse data in a speedy fashion, pharma companies can use this information towards making smarter decisions that lead to greater success throughout all stages of their operations. Combining AI with other advanced technologies, such as blockchain, can create a system that is immutable and transparent. This will also allow for the security of products to be improved in the long run by shielding from counterfeit drugs or substandard medicines. Corvus Global Events invites you to Pharma Supply Chain & Security World 2023 - Supply-Chain, Anti-Counterfeiting, Drug Serialization and Packaging & Labeling conference, which will have Pharma industry experts sharing various challenges faced, new strategies, case studies and use of innovative ideas, the conference will also offer opportunities to encourage partnerships and collaborations. In this conference you’ll not only discover innovative technologies, transformation strategies and collaboration methods, but how best to implement them to optimise your supply chain processes and strategies for drug anti-counterfeiting. It gives us a great pleasure to welcoming you to the Pharma Supply Chain & Security World 2023\\. Key Highlights: · Streamlining your supply chain · End to End supply chain visibility · Designing an optimal supply chain network · Strategies for drug anti-counterfeiting in global supply chain and improving security through an interlinked supply chain strategy · Developing a sustainable Serialization strategy · Integration of track & trace solutions in production and supply chain · Smart Packaging, Labelling and Artwork · Warehouse & Logistics · Serialization Data and Analytics driven approach to increase supply chain agility · Adoption of Blockchain in pharma supply chain · Intelligent Automation enabling Industry 4.0 · The need to understand and adopt new technologies like IoT, Analytics, Machine Learning and Artificial Intelligence · Effective Authentication Technologies · Best selection of tamper-evident features · Brand Protection & Securing supply chain integrity · Global enterprise level solutions for anti-counterfeiting · Tackling pharmaceutical crime - initiatives at multinational, EU and national level · IP and regulatory enforcement · Synchrony of the Pharma Industry and professional bodies against counterfeiting · Understanding and meeting the needs of DSCSA, EU FMD and other global regulations · Strategies for public awareness and patient protection · Best practices to protect your brand · The role of the Internet in aiding the counterfeiters – How to overcome the situation? · How Pharma Industry and professional bodies are fighting against counterfeiting · Developing a RMP for your supply chain to protect your Brand, Product and Patient Safety · Case study: How companies are structuring their counterfeiting efforts and departments? Who should attend the conference? Attendees include GMs, VPs, Directors, Heads and Managers of: · Pharmaceutical manufacturers and distributors · Supply Chain management companies · Serialization, Track and Trace solution providers · Packaging & labelling · Authentication technology suppliers · Operations/Portfolio management · Production process · Quality/Compliance Management · Manufacturing Automation · Digital Innovation (Block Chain, AI, ML) · Data Analytics · Contract manufacturing organisation (CMO) · Contract packaging organisation (CPO) · Brand protection, enforcement, security, integrity and management companies · Healthcare research organizations · Transportation & Logistics . Cold Chain · Pharmaceutical industry professional associations · Anti-counterfeiting organizations · IT service providers · Cloud & Big Data · Intellectual Property, investigators and Trademark council · Drug regulatory agencies and customs · Pharmacists","date_start":"2023-03-28","date_end":"2023-03-29","important_dates":{"abstract":"","full":"2023-03-28","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal","Anticounterfeiting"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}