{"name":"4th International conference on AI, Machine Learning in Communications and Networks","series":"","short":"AIMLNET 2024","website":"https://csty2024.org/aimlnet/index","content":"4th International conference on AI, Machine Learning in Communications and Networks (AIMLNET 2024) July 20 \\~ 21, 2024, Toronto, Canada https://csty2024.org/aimlnet/index Scope 4th International conference on AI, Machine Learning in Communications and Networks (AIMLNET 2024) will provide an excellent international forum for sharing knowledge and results in theory, methodology and applications of Artificial Intelligence, Machine Learning impacts on Communications and Networks. The Conference looks for significant contributions to all major fields of the Artificial Intelligence, Machine Learning and networks in theoretical and practical aspects. The aim of the Conference is to provide a platform to the researchers and practitioners from both academia as well as industry to meet and share cutting-edge development in the field. Authors are solicited to contribute to the Conference by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in the following areas, but are not limited to. Topics of interest include, but are not limited to, the following AI, Machine Learning algorithm & Cognitive Radio Networks AI, Machine Learning and Cyber Security AI, Machine learning for Transport Layer Congestion Control AI, Machine learning techniques for networks and data mining AI, Machine Learning and Intelligent Communications AI, Machine learning for IoT, Smart cities and Vehicular Networks AI, Machine learning in Network Automation Resource and Network Optimization using AI, ML AI, Machine learning in network theory and methodologies AI, Machine learning in Network analytics AI, Machine learning in Network applications AI, Machine Learning on Information and Signal Processing AI, ML based Measurement & Performance Analysis AI, ML for virtualization and SDN AI, ML in Wireless, Mobile and Satellite Communications AI, ML trends & Developments in Computer Networks Paper Submission Authors are invited to submit papers through the conference Submission System by April 20, 2024\\. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by Computer Science Conference Proceedings (H index 39) in Computer Science & Information Technology (CS & IT) series (Confirmed). Selected papers from AIMLNET 2024, after further revisions, will be published in the special issue of the following journals. International Journal of Computer Networks & Communications (IJCNC)– Scopus, ERA, WJCI Indexed International Journal of Network Security & Its Applications (IJNSA)– ERA, WJCI Indexed International Journal of Ubiquitous Computing (IJU) International Journal of Artificial Intelligence & Applications (IJAIA) International Journal of Mobile Network Communications & Telematics (IJMNCT) Important Dates Submission Deadline : April 20, 2024 Authors Notification : May 30, 2024 Final Manuscript Due : June 07, 2024 Contact Us Here's where you can reach us : aimlnet@csty2024.org or aimlnet@yahoo.com Submission Link : https://csty2024.org/submission/index.php","date_start":"2024-07-20","date_end":"2024-07-21","important_dates":{"abstract":"","full":"2024-04-20","notification":"","final":""},"topics":["Arts & Humanities","Other"],"location":{"virtual":"","full":["Toronto","Canada"],"name":"","street":"","city":"Toronto","state":"","ZIP":"","country":"Canada"},"organizers":["AIMLNET 2024"],"societies":[],"indexes":[],"emails":["aimlnet@csty2024.org","aimlnet@yahoo.com"]}