{"name":"2nd Annual Pharma Innovation Tech Congress 2022","series":"","short":"","website":"https://virtueinsight.com/event/pharma-tech-india","content":"2nd Annual Pharma Innovation Tech Congress 2022 “AI, IoT, Blockchain, Big Data & Digitalisation for Pharma” 09 November 2022, Hotel Kohinoor Continental, Mumbai, India Join our new break-out sessions to deep dive into industry-specific Pharma Innovation Tech and explore real use cases and lessons learned by our customers. DELEGATE REGISTRATION: Please contact me on KAVITHA at Email: kavitha@virtueinsight.co.in or Call: +91 9361957193 / +91 44 24762472 • Early Bird Price (Vailid until 31st Aug 2022) - INR 5,000 + GST(18%) per delegate • Early Bird Price (Vailid until 26th Sep 2022) - INR 8,000 + GST(18%) per delegate • Standard Price (Vailid from 27th Sep 2022)- INR 12,000 + GST(18%) per delegate • Conference Sponsor, Exhibition Stall & Paid Speaker Slot - Please email your interest and queries to kavitha@virtueinsight.co.in KEY SPEKAERS: • SOURABH AGRAWAL, Sr. Vice President, Lupin • SANJAY NANDAVADEKAR, Director IT, Cipla • DEBASHISH ROY, Director - Digital Excellence & Strategic Initiatives, Pfizer • PROTYUSH BORGOHAIN, Director - Global Digital Delivery Center, Abbott • KAVITA LAMROR, Director, Real World Investigator, Digital Function, Sanofi • SAKSHI SHRIVASTAVA DESAI, Associate Director International Pharmacovigilance Strategy Realization, Johnson & Johnson • RUPALI KRISHNA, Head Digital OmniChannel - Digital Transformation, Dr. Reddy's Laboratories • VISHVAJIT M KARANDIKAR, Business Unit (BU) Head -Parenteral Nutrition, Fresenius Kabi • RAJESH PEDNEKAR, Head - Supply Chain, Operations and Strategy, Healthcare SF • SUTIRTHA CHAKRABORTY, Regional Head - Global Data Science and Analytics, Abbott • VISHWAS SOVANI, Founder Director, Pharmawisdom • MOHIT AGARWAL, Head of Emerging Markets – SFE, Sun Pharma • PRITI THAKOR, General Medical Affairs Manager, Johnson & Johnson • CHETAN SHENDE, Head Manufacturing Excellence, Cipla • ROHIT CHUGH, Head- Digital transformation for Supply chain, Sun Pharma • KAMLESH PATEL, Head -Medical affairs and Health Tech, Lupin • GOPINATH MADHU, Senior Client Partner, Digital & Technology, Pfizer • VAIBHAV AGARWAL, Head-Digital, Wockhardt • ASHUTOSH INAMDAR, Senior General Manager - Strategy Cell, Lupin • SEERA DILEEP RAJU, Senior Manager - ML & AI, MSD • SIDDHESH ZARE, IT Projects & Program Management, Sanofi Plus more joining soon KEY THEMES DISCUSSED: • How do new technologies unlock benefits in drug discovery? • Improving insights & analysis for strategy and development in drug discovery • How AI helps to achieve accuracy in medicine? • IoMT (Internet of Medical Things) – Framework • IoT-based applications in medical devices – What are the recent developments? • Speedup the research with help of big data – will help to reduce the cost? • Fighting against counterfeiting medicines– Better usage of blockchain • Current ways to improve drug development, clinical trials and monitoring through ML • Patient interaction and care - How digital transformation helps? • Addressing main challenges in implementing digitization in pharma • How is AI steadily transforming the pharma industry? • AI in manufacturing – what are the risks to be in mind & benefits in the hand? • Transforming Lab to SmartLab – How does digitalization make it easier? • How do you see the future of smart labs in the next 5 years? • Highlighted usage of RWE and RWD in pandemic and post-pandemic period • Potential advantages of RWE in clinical studies and regulatory decision making • Identifying disease and diagnosis in the beginning stage – How does real world data help? • Be part of a major networking opportunity WHO SHOULD ATTEND AND WHO YOU’LL MEET: CIOs, CEOs, CDOs, Vice Presidents, Presidents, Heads, Directors and Team Leaders from the following areas: Pharmaceuticals, Biotech, Artificial Intelligence, Data Science, Blockchain, Machine Learning, IoT, Advanced Analytics, Innovation, Big Data, Deep Learning, BDM. Business Operations, Scientific Affairs, Commercial Affairs, Research & Development Get more from the event, with a broader scope bringing the whole communications value chain together. Enjoy and make the best out of our dedicated networking time, meet the leading international vendors showcasing the products of tomorrow in the co-located exhibition. Expand your knowledge of the latest business models and strategies in the high-level conference.","date_start":"2022-11-09","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal","Drug development & safety"],"location":{"virtual":"","full":["mumbai","India"],"name":"","street":"","city":"mumbai","state":"","ZIP":"","country":"India"},"organizers":[""],"societies":[],"indexes":[],"emails":["kavitha@virtueinsight.co.in"]}