{"name":"International Conference on Linear Algebra and its Applications","series":"","short":"ICLAA 2023","website":"https://carams.in/events/iclaa2023","content":"The theme of the conference shall focus on but not limited to Classical Matrix Theory and Linear Algebra Nonnegative Matrices and Special Matrices Matrices and Graphs Combinatorial Matrix Theory Matrix Methods in Statistics Linear Statistical Inference Matrices in Error Analysis and its Applications Matrix and Graph Methods in Applied Sciences This conference is in sequel to the conferences CMTGIM 2012, ICLAA 2014, ICLAA 2017, and ICLAA 2020(21) held in Manipal during January 2012, December 2014, December 2017, and December 2021, respectively. Research presented in the conference will get an opportunity of the possible publication in one of the special issues in the following publications, subject to acceptance after the standard peer review process adopted by the journal/publisher. Indian Journal of Pure and Applied Mathematics AKCE International Journal of Graphs and Combinatorics, Taylor & Francis Papers by nonparticipants are also welcome for submitting the articles which are in the focus of conference. Due to the limitation of the number of articles in the special issue, qualified articles presented in the conference are considered with priority. Best Paper Award To encourage research and motivate young researchers, the best paper award competition will be conducted under the following three themes: Theme 1: Matrix Theory, Special Matrices, and their applications Theme 2: Matrix Methods in Statistics, Linear Statistical Inference, and Applications Theme 3: Matrix Methods in Graphs, Generalized Inverses, and Matrices over different Algebraic Structures Eligibility: Full research articles (need not be original) on any of the above-mentioned themes are invited from the researchers (presenting authors) belonging to any of the following categories: Category 1: UG/PG Students and Ph.D. Scholars within 1 year of Ph.D. registration Category 2: Any researcher with age less than 35 years (DOB on/after December 21, 1988) The presenting authors are required to submit No Objection Certificate from the coauthors, along with the paper. All original papers selected for presentations are eligible for the further review process. Authors may opt not to publish the presented paper in the special issues related to ICLAA 2023.","date_start":"2023-12-18","date_end":"2023-12-21","important_dates":{"abstract":"","full":"2023-11-15","notification":"","final":""},"topics":["Physical Science & Math","Mathematics"],"location":{"virtual":"","full":["Manipal","India"],"name":"","street":"","city":"Manipal","state":"","ZIP":"","country":"India"},"organizers":["CARAMS, Manipal Academy of Higher Education, Manipal"],"societies":[],"indexes":[],"emails":[]}