{"name":"International Conference \"Play, Masks and Make-believe: Ritual Representations\"","series":"","short":"","website":"https://masks.lcir.co.uk","content":"Through the centuries, humans have often shaped their social life by fictional moments and by taking part in fictional events: carnivals, representations, role plays, society plays, structured and semi-structured collective and singular moments where strictly coded contexts organize specific worlds and cultural dimensions. Play, in its wide acception and in its nature of artificial and coded mechanism, reflects historically the symbolic work by which human societies have elaborated, explained and organized the world. Play, fiction, representation and human performance are crucial moments in which categories such as reckoning, planning, ability, strategy, but also turbolence, improvisation, discard and change, are concerned. By organizing fictional moments, plays, rituals and collective experiences, humans bet on the meaning of their social groups. In play and representation, as liminal moments, social groups define relationships, roles, functions and identities. Inside representational and fictional performances, 'normal' time is suspended and a new space of experience is defined. Liminal situations produce the possibility of changes, of new and different symbolic experiences. By exploring the nature of play and of fictional moments of representation, this conference aims to shape a deeper look into different aspects of an anthropology of performance. A focus will be put on how different discourses, disciplines and art forms interact in the definition of a dynamics of social representations where human experience can be analyzed and discussed. Proposals are welcome from different research fields such as Literary Studies, Film Studies, History of Theatre, Psychoanalys, Anthropology, Art History, Philosophy, Historiography and Sociology. Papers are invited on topics related, but not limited, to: Theatre, historical perspectives on representation, representations in time Carnival Rituals of remembrance as social representations Ritual forms of representation Art forms as social moments of rituality Masks and masquerades Cultural history of representation Anthropology of experience Time, rituality and representation Rituals and collectivity Sacred representations Representation in society, representation as a social act Anthropology of performance: meaning and social aspects of representation Symbolic meanings in representations. Paper proposals up to 250 words and a brief biographical note should be sent to: masks@lcir.co.uk.","date_start":"2023-12-09","date_end":"2023-12-10","important_dates":{"abstract":"","full":"2023-11-05","notification":"","final":""},"topics":["Arts & Humanities","Art History"],"location":{"virtual":"","full":["London/Online","United Kingdom"],"name":"","street":"","city":"London/Online","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["masks@lcir.co.uk"]}