{"name":"33rd Pharmacovigilance 2023","series":"","short":"","website":"https://virtueinsight.com/event/pharmacovigilance-2023","content":"33rd Pharmacovigilance 2023 02nd November 2023, Hotel Kohinoor Continental, Mumbai, India Our conference provides the foundation for strong strategic planning and practical decision-making in your pharmacovigilance programs. This year’s conference will address the current thinking on predicting and assessing risks such as drug-induced liver injury, and the assessment of expectedness of serious adverse reactions during clinical development. Experts will present approaches and engage in dialogs around more extensive and impactful uses of real world data and generation of RWE for safety assessments. A full-day will be devoted to the development, implementation, and assessment of risk management strategies for drugs approved in multiple regions. SPONSORS: Clinevo Technologies, ClinChoice, Vizen Life Sciences, COGNIFAI SOLUTIONS Conference Sponsor & Exhibition Stall – Should you wish to Sponsor, or purchase a Exhibition Stall (Booth) or a paid Speaker Slot, you can simply email your interest and queries DELEGATE REGISTRATION: Please contact Email - kavitha@virtueinsight.co.in or Call - +91 9361957193 / +91 44 24762472 • Super Early Bird Discount Price (Valid until 15th Sep 2023) - INR 10,000 + GST (18%) per delegate • Early Bird Discount Price (Valid until 18th Oct 2023) - INR 13,000 + GST (18%) per delegate • Standard Price (Valid from 19th Oct 2023) - INR 15,000 + GST (18%) per delegate KEY SPEAKERS: • MAYUR PARMAR, Deputy Collector, Prant Officer & SDM, Government of Gujarat, Drugs Inspector, FDA • RAMESH JAGANNATHAN, VP Clinical Research & Pharmacovigilance, Bharat Serums and Vaccines • GEETA SHANBHAG, Vice President - Pharmacovigilance & Medico-Regulatory Affairs, Ipca Laboratories • VIPIN SETHI, AVP, Global Head – Pharmacovigilance, Cadila • VAIBHAV SALVI, Director and Head - Clinical Study Unit, India & South East Asia, Sanofi • RISHI JAIN, Director Medical Affairs, Medical Information & PV, AbbVie • ASHISH GAWDE, Country Medical Director, Bayer • KABIL KALATHINGAL, Joint Director, Head of Vigilance Competence Center, Fresenius Kabi • SAKSHI SHRIVASTAVA DESAI, Associate Director International Pharmacovigilance Strategy Realization, Johnson & Johnson • JEROZE DALAL, Head of Clinical Operations, Governance & Risk Management, GSK • DILIP PAWAR, Head - Medical Affairs & Pharmacovigilance, Unichem Laboratories • MILIND ANTANI, Leader, Pharma and Healthcare, Nishith Desai Associates • JAMAL BAIG, Multi Country Safety Head, Sanofi • SATISH SETHI, Head Global PV Operations & SERM Surveillance Operations, Glenmark • AMIT PANDEY, Executive Vice President & General Counsel, GSK • SONICA SACHDEVA BATRA, Associate VP, Enterprise Medical, Head - Regulatory Solutions, Indegene • BABITA KIRODIAN, Country Pharmacovigilance Lead, Amgen • DEEPA ARORA, Chief Executive Officer, CLINEXEL Life Sciences • UJWALA NAIK, Country Safety Head, Johnson & Johnson • INDU NAMBIAR, Head Pharmacovigilance, Boehringer Ingelheim • GIRISH SANE, Section Head PV, Macleods Pharmaceuticals • ANUJA JAWALE, Associate Director, Strategic Engagement & Vendor Management, Organon • CHITRA BARGAJE, Sr. GM, Head, Drug Safety & Risk Management, Lupin • ROSHAN PAWAR, Head Medical Affairs, Alkem Laboratories • JOYDEEP SENGUPTA, Senior Manager & Site Head, Sun Pharmaceutical • CHETANRAJ BHAMARE, Dy. QPPV (Asst GM) - Clinical Research & PV, Serum Institute of India • RAHUL SOMANI, Sr. General Manager-Medical Affairs & PV, Alkem Laboratories • ASHWANI PANDITA, GM Quality Management & Training, Global CRO, Glenmark • NAVEEN CHHABRA, Global Medical Safety Physician, Novartis • APARNA PRABHUNE, Assistant General Manager – Regulatory Affairs, Wockhardt • NIDHI VAISH DAS, Manager Drug Safety, Roche • GURPREET SINGH, VP Global Head of Pharmacovigilance, Freyr • RANJIT BARSHIKAR, CEO, QBD International, United Nations Adviser Plus more joining soon KEY THEMES DISCUSSED: • Pharmacovigilance market trends: Critique & Ways Forward • Unique challenges in signal detection for vaccines • New Era of PV: Future Challenges & Opportunities • Patient Centricity - Prioritising patient in patient safety • Managing Pharmacovigilance Audits & Inspections • Quality, Safety & Signal Detection – Best practice • AI and automation in PV? – Recent improvements – Impact & role of Technology • Ensure the patient safety and quality of products concurrently – What are the ways? • Digital Adverse event monitoring and Electronic Health Records – Risks and benefits? • Potential analysing of safety and risk signals – How technology makes difference? • Planning for future - Risk management and strategies in PV • Proper communication between - Sponsor – Site – CRO - Patients • Benefits and challenges of implementing RWD and RWE • Key regulatory updates that can impact the PV. Changes that can increase patient’s safety • Drug regulations changes – How do companies and CRO’s handle? • Lessons learnt from the pandemic • Be part of a major networking opportunity WHO SHOULD ATTEND: CEO’s, CTO’s, CIO’s, Presidents, VPs, Directors, Heads, Managers, Scientific Advisors, Consultants of: Pharmacovigilance, Pharmacoepidemiology, Pharmacogenomics, Drug/Product Safety, Drug Development, Information and Clinical Data Management, Clinical Pharmacology, Clinical Safety, Periodical safety update Reports, Risk Management, Research & Development, Quality Assurance, Patient Safety, Signal Detection, Safety Surveillance, Outcomes Research, Data Analysis, Epidemiology, Medical Affairs, Regulatory Affairs and Compliance, Information technology, Sales and Marketing Get more from the event, with a broader scope bringing the whole communications value chain together. Enjoy and make the best out of our dedicated networking time, meet the leading international vendors showcasing the products of tomorrow in the virtual exhibition area. Expand your knowledge of the latest business models and strategies in the high-level conference.","date_start":"2023-11-02","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Mumbai","Maharashtra","India"],"name":"","street":"","city":"Mumbai","state":"Maharashtra","ZIP":"","country":"India"},"organizers":["Clinevo Technologies, ClinChoice, Vizen Life Sciences, COGNIFAI SOLUTIONS"],"societies":[],"indexes":[],"emails":["kavitha@virtueinsight.co.in"]}