{"name":"The 2nd International Conference on Internet Technology and Educational Informatization","series":"","short":"ITEI 2022","website":"http://www.icitei.com","content":"Internet technology connects different devices through the wide area network of computer network. It not only speeds up the transmission speed of information and broadens the access to information, but promotes the development of different software applications, and changes people's life and learning style. Educational informatization refers to the process of using modern information technology comprehensively and deeply in the field of education to promote educational reform and development. The development of educational informatization has brought about great changes in educational forms and learning methods, which have a great impact on traditional educational thoughts, concepts, modes, contents and methods. Education informization is an important part of national informatization, which has great significance for deepening education reform and improving education quality. Internet technology is the prerequisite for educational informatization to be realized. The development and popularization of Internet technology has also played a positive role in promoting the development of educational informatization. In order to make further research in this field, The 2nd International Conference on Internet Technology and Educational Informatization(ITEI 2022) will be held on December 23-25, 2022 in Harbin, China. ITEI 2022 will focus on the latest research on Internet Technology and Educational informatization. Experts, scholars, researchers and relevant practitioners from all over the world will gather together to share research results, discuss hot issues, and provide participants with the most cutting-edge technical information, so that they can understand the industry development and the latest technology, And broaden their research horizons. We warmly invite you to join ITEI 2022 and look forward to your participation. Publication All papers, both invited and contributed, will be reviewed by two or three experts from the committees. After a careful reviewing process, all accepted papers of ITEI 2022 will be submitted for indexing by EI Compendex and Scopus. ITEI 2022 is to publish latest & high-quality research works on Educational and Information Technology in theoretical and practical aspects. Authors are solicited to contribute to the special issue by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances. All papers are reviewed using a single-blind review process: authors declare their names and affiliations in the manuscript for the reviewers to see, but reviewers do not know each other's identities, nor do the authors receive information about who has reviewed their manuscript.","date_start":"2022-12-23","date_end":"2022-12-25","important_dates":{"abstract":"","full":"2022-12-18","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","computer technology"],"location":{"virtual":"","full":["Harbin","China"],"name":"","street":"","city":"Harbin","state":"","ZIP":"","country":"China"},"organizers":["ITEI 2022"],"societies":[],"indexes":[],"emails":[]}