{"name":"RECSO EnviroSpill","series":"","short":"","website":"https://www.recsoenvirospill.org","content":"RECSO EnviroSpill2022 provides a dedicated platform for professionals from major industries to discuss, debate, share knowledge, and experience on different technologies in the field of oil spill. The second edition of RECSO EnviroSpill which will be held in the Kingdom of Bahrain from 11 - 13 October 2022 under the esteemed patronage of His Excellency Dr. Mohamed bin Mubarak Bin Daina, Minister of Oil & Environment and Special Envoy for Climate Affairs, Kingdom of Bahrain. The event will be exclusively hosted by Ministry of Oil The main theme of the event is Sustainable Clean Seas with emphasis on three pillars which are Readiness, Response, and Resilience. In addition, the primary discussion of the event will be upon Oil & Chemical Spill, Spill Technology, Emergency Response in Marine, Environment, Marine Life, Aqua Environment, Offshore Vessels. RECSO EnviroSpill brings together a variety of audience from different sectors to share and learn new technologies and methods to prevent, prepare, and protect the environment from Oil and Chemical Spill. Attending the event offers the opportunity to meet and greet industry's most knowledgeable and prominent personalities. In addition to exploring business opportunities while engrossing in meeting industry thought leaders from all across the globe. The event provides a practical guidance and supervision on new technologies by engaging face to face with subject matter experts. Moreover, update yourself on the current and imperative technologies and its implementation while exploring new initiatives and related technologies of the industry.","date_start":"2022-10-11","date_end":"2022-10-13","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Engineering & Technology","Polymer/Petroleum","chemical"],"location":{"virtual":"","full":["Manama","Bahrain"],"name":"","street":"","city":"Manama","state":"","ZIP":"","country":"Bahrain"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}