{"name":"Global MilSatCom 2023","series":"","short":"","website":"https://go.evvnt.com/1810700-0?pid=4868","content":"Make sure you don't miss out on this opportunity to join forward-thinking SATCOM experts, and you'll leave the conference empowered with the tools and knowledge to better support your organisations strategy. It's taking place in just a couple of weeks. 1000+ Attendees | 80+ Conference Sessions | 45+ Nations in Attendance | 35 Exhibition Stands | 4 Topic-led Streams | 3 Evening Receptions MilSatCom globally has become more important than ever due to advances in technology, strengthened partnerships and the increasing threat from hostile actors, on the ground and in orbit. Access to the best intelligence is a critical strategic priority for nations to ensure their warfighting capability. Global MilSatCom Conference and Exhibition provides just that. \\* NEW The Best Line-Up of Speakers Ever! You will gain access to the widest variety of nations, at the most senior level. New for 2023 – India, South Africa, Portugal and Peru. \\* NEW Streamed Agenda Graduate Space Careers Stream: Focusing on developing future space talent, this unique conference stream will be attended by over 150 university students – supported by the SAE Foundation. - Content Driven Streams: Built on the most pressing topics in MilSatCom: Resilient Architecture and SDA to Enable SATCOM. \\* NEW Official Charity Partner SSAFA, the UK's oldest tri-service charity, will receive a donation from SAE Media Group on every ticket sold. \\* NEW Show Daily Guide You'll get exclusive interviews from keynote speakers and additional content on the hottest topics and latest news, each morning Building upon the success of last year's sell out event, we are thrilled to announce the second edition of the SATCOM On-the-Move Focus Day, as part of Global MilSatCom 2023\\. Recognising the paramount importance of communication on-the-move, this pre-conference event will further empower you to enhance your capabilities in this challenging arena. Here's why you can't afford to miss SATCOM On-The-Move Focus Day: - Access key subject-leaders from the UK, US, and Europe for interactive discussions focused on your challenges. - Build a greater understanding of how the landscape has changed in the last year and the implications this has for you. - Gain vital information into new advancements and emerging trends, that you won't get anywhere else. Who should attend? Connect with those who are shaping the future of MilSatCom in the arena's pre-eminent forum National militaries and government: • Military SATCOM specialists • Equipment procurement officers • Government officials Industry: • Businesses looking to break into the regional market • Established players in the regional market • Developers and innovators in military technology Transnational/Continental/Euro-Atlantic organisations/bodies: • Organisations who wish to equalise allied defence capability • Those looking to establish and build on partnerships URLs: Tickets: https://go.evvnt.com/1810700-2?pid=4868 Brochure: https://go.evvnt.com/1810700-3?pid=4868 Time: 8:50 am - 6:00 pm Venue details: Queen Elizabeth II Centre, Broad Sanctuary, London, England, SW1P 3EE, United Kingdom Prices: General Admission - Book by 30 June (Conference + Focus Day): GBP 2498.00, General Admission - Book by 7 September (Conference + Focus Day): GBP 2698.00, General Admission - Full Price (Conference + Focus Day): GBP 2898.00, Active Military Personnel Rate/Government Personnel Rate - Book by 30 June (Conference + Focus Day): GBP 998.00, Active Military Personnel Rate/Government Personnel Rate - Book by 7 September (Conference + Focus Day): GBP 1198.00, Active Military Personnel Rate/Government Personnel Rate - Full Price (Conference + Focus Day): GBP 1398.00 Speakers: VICE ADMIRAL DR. THOMAS DAUM - Chief of German Cyber and Information Domain Service, Bundeswehr/ German Federal Armed Force, LIEUTENANT GENERAL ELANOR BOEKHOLT - O'SULLIVAN - Deputy Director-General of Policy, The Netherlands Ministry of Defence, LIEUTENANT GENERAL CARLOS ENRIQUE CHAVEZ CATERIANO - Chief of the General Staff, Peruvian Air Force, AIR VICE MARSHAL PAUL GODFREY - Commander, UK Space Command, MAJOR GENERAL PHILIPPE ADAM Commander, French Space Command, CORDELL DELAPENA - Program Executive Officer PEO for Military Communications MilComm and Positioning, Navigation, and Timing PNT, Space Systems Command, USSF, AIR VICE MARSHAL DHANANJAY VASANT KHOT - Director General, Indian Defence Space Agency, MAJOR GENERAL HANS FOLMER - Chief of Staff, NATO Communications and Information Agency (NCI Agency), MAJOR GENERAL KARSTEN STOYE - Head of Civil-Military Coordination Division and Military Advisor to the Director General, EUROCONTROL , MAJOR GENERAL ELMA DE VILLIERS - Chief Director Air Policy and Plans, South African Air Force, DEANNA RYALS - Director, International Affairs, Space Systems Command, USSF, BRIGADIER GENERAL SAMI NURMI - Director of Defence Policy Department, Finnish Ministry of Defence, BRIGADIER GENERAL DENNIS BYTHEWOOD - Commander, Joint Task Force - Space Defense, US Space Command, COLONEL SIMON KIM - Principal of Aerospace School, Education and Training Command, Republic of Korea Air Force, ANGUS STEWART - Head of Space Surveillance, UK Space Agency, CAPTAIN (N) JOSE FREITAS - Head of Space Department, Portuguese Armed Forces General Staff, CAPTAIN (N) PHIL COOPE - Deputy Head, Space, UK Strategic Command , COLONEL CLIFFORD WHITE - Director Space Services, Australian Defence Space Command, COLONEL DAVID PHEASANT - Commander, Space Delta 8, USSF, MICHAEL NICHOLS - Deputy Director, Commercial Satellite Communications Office CSCO, Space Systems Command, United States Space Force","date_start":"2023-11-06","date_end":"2023-11-09","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["SAE Media Group"],"societies":[],"indexes":[],"emails":[]}