{"name":"DigiMarCon India 2023 - Digital Marketing, Media and Advertising Conference & Exhibition","series":"","short":"","website":"https://digimarconindia.in","content":"DigiMarCon India 2023 is your chance to ... – Hear from some of the most audacious and thought-provoking speakers in the digital marketing, media and advertising industry. – Gain insight into emerging strategies, the latest innovative technologies, and best practices to move your business to the next level. – Network with thought leaders, reunite with your peers, and build your professional network. The 3rd annual DigiMarCon India, the Premier Digital Marketing, Media and Advertising Conference & Exhibition in India, returns October 4th and 5th, 2023 to the luxurious Westin Gurgaon New Delhi Hotel in Gurgaon, India. Join your peers in-person or online for 2-days jam-packed with digital marketing best practices, latest trends, practical solutions, strategy, and networking, also check out the next generation of technology & innovation; Internet, Mobile, AdTech, MarTech & SaaS Technology. You’ll also learn the following: Podcast & Webinar Marketing, PR & Cause Marketing, Predictive Analytics & Attribution, Programmatic Advertising, Sales & Marketing Automation, Search Engine Optimization, Shopper Marketing, Marketing & Customer Experience, Social Commerce, Social Media Marketing, UI / UX Design, User-Generated Content, Video Marketing, Viral & Buzz Marketing, Visual & Voice Search, Web Analytics, and much more! Be a part of DigiMarCon India 2023 and discover how to thrive and succeed as a marketer in a rapidly evolving digital world. Top keynotes, case studies, strategy sessions and networking! See why people keep coming back year after year to this must-attend event! Register and secure your seat today. For more details visit https://digimarconindia.in.","date_start":"2023-10-04","date_end":"2023-10-05","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Marketing/Social-Networking","Networking"],"location":{"virtual":"","full":["Gurugram","India"],"name":"","street":"","city":"Gurugram","state":"","ZIP":"","country":"India"},"organizers":["DigiMarCon India"],"societies":[],"indexes":[],"emails":[]}