{"name":"2024 International Conference on Power Electronics and Energy System","series":"","short":"ICPEES 2024","website":"https://www.icpees.org","content":"The conference has the objective of creating an international forum for academics, researchers and scientists from worldwide to discuss worldwide results and proposals regarding to the soundest issues related to power electronics and energy system.The ICPEES organizing committee invites researchers worldwide to submit papers and share the valuable experiences with the scientists from the world. After a careful reviewing process, all accepted papers after proper registration and presentation, will be published in The ICPEES 2024 Conference Proceedings,which will be published by Journal of Physics: Conference Series(Online ISSN: 1742-6596). The proceedings will be submitted to Engineering Village, Scopus, Thomson Reuters (WoS) and other databases for review and indexing. The author should submit the draft version of paper for review before the due submission deadline. Please submit the manuscript via: https://www.morressier.com/call-for-papers/64cb658f26832f0011f1843f Topics of interest for submission include, but are not limited to: Topic A - Power Electronics A01 – New power semiconductor devices A02 – High-frequency converters and power supplies A03 – Novel converter topologies and applications A04 – Matrix and multi-level converters A05 – Power converter control and drive circuits A06 – EMC and power quality A07 – Thermal management and reliability A08 – Passive components and sensors A09 – Converter packaging A10 - EMC and Power Quality A11 - Power Electronics Topology and Control Topic B - Energy systems B01 – New and Renewable Energy Sources B02 – HVDC B03 – Power system and Smart Grids B04 - Microgrids B05 - Power Generation, Transmission and Distribution B06 – Distributed Generation B07 – Energy Management Strategies and Efficient Power Networks B08 – Energy Storage and Fuel Cells (inc. hydrogen) B09 – Energy Systems Resilience and Cyber Security B10 – FACTS B11 – Power Electronic Converters for Energy Systems If you have any question or need any assistance regarding the conference, please feel free to contact us. E-mail: icpees@126.com Tel.: +852-30697939/+86-15756280447","date_start":"2024-03-01","date_end":"2024-03-03","important_dates":{"abstract":"","full":"2024-02-05","notification":"","final":""},"topics":["Engineering & Technology","Renewable Energy/Nuclear"],"location":{"virtual":"","full":["Kuala Lumpur","Malaysia"],"name":"","street":"","city":"Kuala Lumpur","state":"","ZIP":"","country":"Malaysia"},"organizers":["SASE"],"societies":[],"indexes":[],"emails":["icpees@126.com"]}