{"name":"9 th International Conference on Data Mining and Applications","series":"","short":"DMA 2023","website":"https://cosit2023.org/dma/index","content":"9th International Conference on Data Mining and Applications (DMA 2023) May 20 \\~ 21, 2023, Zurich, Switzerland https://cosit2023.org/dma/index Scope &Topics 9th International Conference on Data Mining and Applications (DMA 2023) provides a forum for researchers who address this issue and to present their work in a peer-reviewed forum. Authors are solicited to contribute to the conference by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in Data mining and Applications. Topics of interest include, but are not limited to the following • Data Mining Applications • Data Mining in Modeling, Visualization, Personalization, and Recommendation • Data Mining Systems and Platforms, Efficiency, Scalability, and Privacy • Foundations, Algorithms, Models, and Theory • Mining Text, Semi-Structured, Spatio -Temporal, Streaming, Graph, Web, Multimedia • Knowledge Processing Paper Submission Authors are invited to submit papers through the conference Submission System by February 12, 2023\\. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by Computer Science Conference Proceedings in Computer Science & Information Technology (CS & IT) series (Confirmed). Selected papers from DMA 2023, after further revisions, will be published in the special issues of the following journals  International Journal of Database Management Systems (IJDMS)  International Journal of Data Mining & Knowledge Management Process (IJDKP)  International Journal of Grid Computing & Applications (IJGCA)  Information Technology in Industry (ITII) Important Dates • Submission Deadline : February 12, 2023 • Authors Notification : April22, 2023 • Registration & camera – Ready Paper Due : April29, 2023 Contact Us Here's where you can reach us : dma@cosit2023.org (or) dma\\_conf@yahoo.com For other details: https://cosit2023.org/dma/index Paper Submission Link: https://cosit2023.org/submission/index.php","date_start":"2023-05-20","date_end":"2023-05-21","important_dates":{"abstract":"","full":"2023-02-11","notification":"","final":""},"topics":["Education / Legal / Other","Education","Knowledge Processing"],"location":{"virtual":"","full":["Zurich","Swaziland"],"name":"","street":"","city":"Zurich","state":"","ZIP":"","country":"Swaziland"},"organizers":["9 th International Conference on Data Mining and Applications (DMA 2023)"],"societies":[],"indexes":[],"emails":["dma@cosit2023.org","_conf@yahoo.com"]}