{"name":"13th International Conference on Artificial Intelligence in Music, Sound, Art and Design (EvoMUSART)","series":"","short":"","website":"https://www.evostar.org/2024/evomusart","content":"The 13th International Conference on Artificial Intelligence in Music, Sound, Art and Design (EvoMUSART) will take place on 3-5 April 2024, as part of the evo\\* event. EvoMUSART webpage: www.evostar.org/2024/evomusart/ Submission deadline: 1 November 2023 Conference: 3-5 April 2024 EvoMUSART is a multidisciplinary conference that brings together researchers who are working on the application of Artificial Neural Networks, Evolutionary Computation, Swarm Intelligence, Cellular Automata, Alife, and other Artificial Intelligence techniques in creative and artistic fields such as Visual Art, Music, Architecture, Video, Digital Games, Poetry, or Design. This conference gives researchers in the field the opportunity to promote, present and discuss ongoing work in the area. Submissions must be at most 16 pages long, in Springer LNCS format. Each submission must be anonymized for a double-blind review process. Accepted papers will be presented orally or as posters at the event and included in the EvoMUSART proceedings published by Springer Nature in a dedicated volume of the Lecture Notes in Computer Science series. Indicative topics include but are not limited to: \\* Systems that create drawings, images, animations, sculptures, poetry, text, designs, webpages, buildings, etc.; \\* Systems that create musical pieces, sounds, instruments, voices, sound effects, sound analysis, etc.; \\* Systems that create artefacts such as game content, architecture, furniture, based on aesthetic and/or functional criteria; \\* Systems that resort to artificial intelligence to perform the analysis of image, music, sound, sculpture, or some other types of artistic objects; \\* Systems in which artificial intelligence is used to promote the creativity of a human user; \\* Theories or models of computational aesthetics; \\* Contextualisation of creative AI in cultural, economic, social, political or ecological discourse; \\* Computational models of emotional response, surprise, novelty; \\* Representation techniques for images, videos, music, etc.; \\* Surveys of the current state-of-the-art in the area; \\* New ways of integrating the user in the process (e.g. improvisation, co-creation, participation). We look forward to seeing you in EvoMUSART 2024! The EvoMUSART 2024 organisers Colin Johnson Sérgio M. Rebelo​ Iria Santos (publication chair)","date_start":"2024-04-03","date_end":"2024-04-05","important_dates":{"abstract":"","full":"2023-11-15","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Aberystwyth","United Kingdom"],"name":"","street":"","city":"Aberystwyth","state":"","ZIP":"","country":"United Kingdom"},"organizers":["SPECIES"],"societies":[],"indexes":[],"emails":[]}