{"name":"Modelling and Development of Intelligent Systems","series":"","short":"","website":"https://conferences.ulbsibiu.ro/mdis","content":"The aim of the conference is to bring together computer scientists, mathematicians, researchers and students interested in the topics of the conference. The conference welcomes submissions of original papers on all aspects of modelling and development of intelligent systems ranging from concepts and theoretical developments to advanced technologies and innovative applications. The conference will include Plenary Lectures (30 min), Regular Lectures (20 min), and Short presentation (10 min). All submitted papers will undergo a thorough single - blind peer review; each paper will be reviewed by at least 3 independent experts in the field. Paper acceptance and publication will be judged on the basis of their relevance to the conference topics, clarity of presentation, originality and accuracy of results and proposed solutions. An author can register two (accepted) papers with one registration fee. A post–conference proceedings containing selected refereed, presented and accepted articles, will be published by Springer Verlag in the series Communications in Computer and Information Science (CCIS). CCIS is abstracted/indexed in DBLP, Google Scholar, EI-Compendex, Mathematical Reviews, SCImago, Scopus. CCIS volumes are also submitted for the inclusion in ISI Proceedings. The official language of the conference is English. Topics of interest include, but are not limited to the following: • Evolutionary computing • Grid computing and clustering • Data mining • Ontology engineering • Intelligent systems for decision support • Knowledge based systems • Pattern recognition and model checking • Motion recognition • Hybrid computation for artificial vision • Knowledge reasoning for artificial vision • Geometric modelling and spatial reasoning • Modelling and optimization of dynamic systems • Large scale optimization techniques • Adaptive systems • Multiagent systems • Swarm intelligence • Metaheuristics and applications • Machine Learning • Mathematical models for development of intelligent systems","date_start":"2022-10-28","date_end":"2022-10-30","important_dates":{"abstract":"","full":"2022-08-29","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Artificial intelligence"],"location":{"virtual":"","full":["Sibiu","Romania"],"name":"","street":"","city":"Sibiu","state":"","ZIP":"","country":"Romania"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}