{"name":"2022 3rd International Conference on Modern Education and Information Management","series":"","short":"ICMEIM 2022","website":"https://ais.cn/u/VVNVVz","content":"ICMEIM is to bring together researchers, engineers and practitioners interested in the field of such areas on both theoretical and practical aspects about modern education and information management to communicate and exchange with their research. The conference will provide a platform for researchers to exchange ideas on knowledge, creative, cross-disciplinary approaches, and thoughtful problem-solving solutions, and to find global partners for collaboration. The organizing committee of conference is delighted to invite you to participate in this exciting event, which also paves way for young researchers in acquiring knowledge and information by meeting the experts. Topics of interest for submission include, but are not limited to: Modern Education Education Science Information-based Information Future Information Internet Teaching Internet Study Blended Learning Distance Education and Study Intelligent Learning Environment LTSA Education of the next generation Modernization of Education Management Educational Multimedia Education Technology System Innovative Teaching Technique Education Management Technology Education Software and Hardware Data Mining applied in Education Information Technology applied in the Education Management Information Management Computer Science and the Internet Computer Control and Management Electronic Telecommunications Engineering IT & IS Security IT Education and Security Service Management and Engineering Supported by IT Information Engineering Intelligent Information Processing Business Strategy and Information Systems Information Management and Systems Information Technology applied in the organization Automatic Control Engineering Artificial Intelligence Engineering application All papers, both invited and contributed, will be reviewed by two or three experts from the committees. After a careful reviewing process, all accepted papers of ICMEIM 2022 will be published by conference publishing services (CPS) and submitted to IEEE Xplore, EI Compendex, Scopus for retrieval.","date_start":"2022-09-16","date_end":"2022-09-18","important_dates":{"abstract":"","full":"2022-08-20","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Chengdu","Sichuan","China"],"name":"","street":"","city":"Chengdu","state":"Sichuan","ZIP":"","country":"China"},"organizers":["Sichuan University of light and chemical technology"],"societies":[],"indexes":[],"emails":[]}