{"name":"12th International Conference on Mobile & Wireless Networks (MoWiN 2023)","series":"","short":"","website":"https://ccseit2023.org/mowin/index","content":"12th International Conference on Mobile & Wireless Networks (MoWiN 2023) February 18 \\~ 19, 2023, Dubai, UAE https://ccseit2023.org/mowin/index Scope 12th International Conference on Mobile & Wireless Networks (MoWiN 2023) is dedicated to address the challenges in the areas of wireless & mobile networks. The conference looks for significant contributions to the Wireless & Mobile computing in theoretical and practical aspects. The Wireless & Mobile computing domain emerges from the integration among personal computing, networks, communication technologies, cellular technology and the Internet Technology. The modern applications are emerging in the area of mobile ad hoc networks and sensor networks. This conference is intended to cover contributions in both the design and analysis in the context of mobile, wireless, ad-hoc and sensor networks. The goal of this conference is to bring together researchers and practitioners from academia and industry to focus on advanced wireless & Mobile computing concepts and establishing new collaborations in these areas. Authors are solicited to contribute to the conference by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in the following areas, but are not limited to. Topics Of Interest • Architectures, Protocols, and Algorithms to Cope with Mobile & Wireless Networks • Distributed Algorithms of Mobile Computing • OS and Middleware Support for Mobile Computing and Networking • Routing, Communication Primitives in Ad hoc and Sensor Networks • Data Management and Databases for Mobile Environments • Synchronization and Scheduling Issues in Mobile and Ad hoc Networks • Resource Management in Mobile, Wireless and Ad-hoc Networks • Network Management on Mobile and Wireless Computing • Integration of Wired and Wireless Networks • Broadband Access Networks • Energy Saving Protocols for Ad hoc and Sensor Networks • Complexity Analysis of Algorithms for Mobile Environments • Information Access in Wireless Networks • Algorithms and Modeling for Tracking and Locating Mobile Users • Satellite Communications • Cryptography, Security and Privacy of Mobile & Wireless Networks • Performance of Mobile and Wireless Networks and Systems • Mobile Ad hoc and Sensor Networks • Wireless Multimedia Systems • Service Creation and Management Environments for Mobile/Wireless Systems • Security, Scalability and Reliability Issues • Mobile Internetworking • Intelligent Network Signaling • Mobile VoIP • Mobile Ad hoc and Sensor Networks • Power Management and Control Algorithms • User Interfaces and Systems Design • Nomadic Computing • Wearable Computing and Networking • Recent Trends in Mobile and Wireless Applications Paper Submission Authors are invited to submit papers through the conference Submission System by February 04, 2023 (Final Call). Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by Computer Science Conference Proceedings in Computer Science & Information Technology (CS & IT) series (Confirmed). Selected papers from MoWiN 2023, after further revisions, will be published in the special issue of the following journals • International Journal of Network Security & Its Applications (IJNSA) - ERA, WJCI Indexed • International Journal of Computer Networks & Communications (IJCNC) - ERA, Scopus, WJCI Indexed • International Journal of Wireless & Mobile Networks (IJWMN) - ERA, WJCI Indexed • International Journal of Advanced Smart Sensor Network Systems (IJASSN) • International Journal of Mobile Network Communications & Telematics ( IJMNCT) • International Journal on AdHoc Networking Systems (IJANS) • International Journal of Ad hoc, sensor & Ubiquitous Computing (IJASUC) • Information Technology in Industry (ITII) Important Dates • Submission Deadline : February 04, 2023 (Final Call). • Authors Notification : February 11, 2023 • Registration & Camera-Ready Paper Due : February 13, 2023 Contact Us Here's where you can reach us : mowin@ccseit2023.org or mowinconf@yahoo.com Paper Submission URL : https://ccseit2023.org/submission/index.php","date_start":"2023-02-18","date_end":"2023-02-19","important_dates":{"abstract":"","full":"2023-02-04","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Computer network systems"],"location":{"virtual":"","full":["Dubai","United Arab Emirates"],"name":"","street":"","city":"Dubai","state":"","ZIP":"","country":"United Arab Emirates"},"organizers":["MoWiN"],"societies":[],"indexes":[],"emails":["mowin@ccseit2023.org","mowinconf@yahoo.com"]}