{"name":"2023 International Conference on Biotechnology and Bioengineering (13th ICBB)","series":"","short":"","website":"https://icbb.apaset.edu.pl","content":"Dear Friends and Colleagues, On behalf of the Organizing Committee, it is our great pleasure to welcome you to participate in the [**2023 International Conference on Biotechnology and Bioengineering (ICBB2023)**](https://icbb.apaset.edu.pl/) to be held as a webinar / virtually online during Sept. 28-Oct. 1, 2023\\. Website: <https://icbb.apaset.edu.pl/> **\\[Organizers\\]** ICBB2023 is co-organized by Asia-Pacific Association of Science Engineering and Technology, Institute of Biomolecular Chemistry-National Research Council of Italy, Institute of Bioorganic Chemistry-Polish Academy of Sciences, and Chinese Journal of Biologicals, in collaboration with multiple academic affiliations. **\\[Aims and Topics\\]** ICBB2023 aims to provide an innovative and comprehensive overview of BIOTECHNOLOGY and BIOENGINEERING, a focus will be given to major research advances including: \\- 1\\. Microbiology, virology, cytology and immunology; \\- 2\\. Biological macromolecules, proteins and nucleic acids; \\- 3\\. Biomaterials, biopolymers and bioenergy; \\- 4\\. Biomedicine, biopharmaceuticals, pharmacology and toxicology; \\- 5\\. Agricultural & food science and industrial biotechnology; \\- 6\\. Applications in bioengineering, biomedical engineering & technology and other related fields. **\\[Publications\\]** All accepted abstracts will be included in conference abstract book. After author's extension and peer-review by the committee, selected full papers wil be published in conference proceedings and sent for major scientific databases for indexration. \\- Previous selected abstracts at ICBB2020, 2019, 2018, 2017 had been published in Basic & Clinical Pharmacology & Toxicology (indexed in SCI - Web of Science, Impact factor: 4.080). \\- Accepted full papers ICBB2020, 2019, 2018, 2017 had been published in AIP Conference Proceedings (indexed in CPCI – Web of Science & Scopus). \\- Selected full papers had been published at special issue in Biomolecules (indexed in SCI - Web of Science, Impact factor: 4.082) in 2020/2019, Molecules (indexed in SCI - Web of Science, Impact factor: 3.267) in 2018 & 2017, and Marine Drugs (combined with ICCEMB) in 2016. We look forward to having you join us for this fully online event, please also bring this notice to the attention of any of your colleagues who may be interested in participating in the conference. With best regards, ICBB2023 Organizing Committee Email: icbb@apaset.edu.pl; icbb@apaset.org","date_start":"2023-09-28","date_end":"2023-10-01","important_dates":{"abstract":"","full":"2023-09-15","notification":"","final":""},"topics":["Life Sciences","Biotechnology/ Bioinformatics"],"location":{"virtual":"","full":["Pozzuoli","Italy"],"name":"","street":"","city":"Pozzuoli","state":"","ZIP":"","country":"Italy"},"organizers":[""],"societies":[],"indexes":[],"emails":["icbb@apaset.edu.pl","icbb@apaset.org"]}