{"name":"CHEMICAL DEVELOPMENT & SCALE-UP IN THE FINE CHEMICAL & PHARMACEUTICAL INDUSTRIES","series":"","short":"","website":"https://go.evvnt.com/1162769-3?pid=4868","content":"Chemical process development is generally not taught as part of degree courses in higher education; the conversion of a synthetic route used for making milligram or gram quantities of a chemical into a process for manufacturing multi-kilogram and tonne quantities is typically learnt “on the job” by chemists in industry. For many years, little chemical development work was published in the literature, until the establishment of the Organic Process R & D journal by Dr Trevor Laird (Founder of Scientific Update). Even now, “tricks of the trade” are handed down within individual company organisations, and it can be difficult to gain an awareness of what is involved in chemical development, and of the skills and techniques required to efficiently scale up chemical processes. This three-day course, written and presented by highly experienced process chemists from the pharmaceutical and fine chemical industry, provides a comprehensive overview of this fascinating and important element of the chemical industry. A logical investigative approach to all aspects of chemical development is described, with an abundance of case studies from literature, conferences and private communications. The multi-disciplinary nature of chemical development is emphasised, from the initial interaction with laboratory research scientists to the vital partnership with chemical engineers in the pilot plant and in the production environment. The lectures are interspersed with interactive problem sessions, enabling participants to share in the problem solving and troubleshooting typically experienced during chemical development. Tickets https://go.evvnt.com/1162769-0?pid=4868 Inquiries https://go.evvnt.com/1162769-2?pid=4868 Price: General Admission: EUR 2499.00 Speakers: Dr John Studley, Dr Jonathan Moseley Dates and Time: Starts: Tue, Jun 14, 2022 ( 9:00 AM) and Ends: Thu, Jun 16, 2022 ( 5:00 PM) Venue details: Radisson Blu Royal Hotel, Dublin, Golden Lane, Dublin, County Dublin, D08 VRR7, Ireland","date_start":"2022-06-14","date_end":"2022-06-16","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education","pharmaceutical"],"location":{"virtual":"","full":["Dublin","Ireland"],"name":"","street":"","city":"Dublin","state":"","ZIP":"","country":"Ireland"},"organizers":["Scientific Update Ltd"],"societies":[],"indexes":[],"emails":[]}