{"name":"Innovation in Language Learning International Conference","series":"","short":"","website":"https://conference.pixel-online.net/ICT4LL/index.php","content":"The 16th edition of the Innovation in Language Learning International Conference will take place on 09-10 November 2023\\. The objective of the Conference is to promote transnational cooperation and share good practice in the field of the application of Information and Communication Technologies (ICT) to Language Learning and Teaching. The Innovation in Language Learning Conference is also an excellent opportunity for the presentation of previous and current language learning projects and innovative initiatives. Two days of inspiring sessions in the framework of a highly interactive onsite and online conference experience will be delivered. Enhanced digital contents will give participants greater access to learning, sharing and networking. All accepted papers will be presented on-site and on-line. Interactive Questions and Answers sessions will follow each paper presentation. Poster Presentation Sessions will also be held, on-site and on-line. Networking Opportunities will be organized. Important dates: - 08 June 2023: deadline for submitting abstracts - 22 June 2023: Notification of acceptance / rejection of abstracts - 11 September 2023: deadline for Registration - 10 October 2023: Deadline for final submission of papers - 09-10 November 2023: Conference days All accepted papers will be published in the Conference Proceedings with ISBN, ISSN and DOI codes. The publication will be included in Academia.edu and indexed in Google Scholar. The Proceedings will be sent to be reviewed for inclusion in the Conference Proceedings Citation Index by ISI-Clarivate – Web of Science Contact: conference@pixel-online.net Official website: http://conference.pixel-online.net/ICT4LL/callforpapers.php","date_start":"2023-11-09","date_end":"2023-11-10","important_dates":{"abstract":"","full":"2023-11-09","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature","higher education"],"location":{"virtual":"","full":["Florence","Italy"],"name":"","street":"","city":"Florence","state":"","ZIP":"","country":"Italy"},"organizers":["Pixel"],"societies":[],"indexes":[],"emails":["conference@pixel-online.net"]}