{"name":"World Summit on Immunology","series":"","short":"","website":"https://immunology.synergiasummits.com","content":"It is a great pleasure for us to cordially invite all immunologists, academicians, scholars, students and medical entrepreneurs at the World Summit on Immunology (IMMUNOLOGYSUMMIT2024), which will be held in Edinburgh, Scotland during June 10-12, 2024\\. This year we have adopted the theme \"Novel Developments in Immunology and their role in Pandemic and fighting emerging diseases\". IMMUNOLOGYSUMMIT2024 is a scientific congregation which brings together researchers, scientists, key decision makers, industry professionals in the same physical space for a brief yet intense period of discussion, collaboration, and addressing related problems in research. The conference with major scientific themes of Viral Immunology, Basic Autoimmunity, Tumor Immunology, Immunology Education, Transplantation Immunology, Vaccines and Immunotherapy, Mucosal and Regional Immunology, Immune Mechanisms of Human Disease, Veterinary and Comparative Immunology, Technological Innovations in Immunology and Therapeutic Approaches to Autoimmunity etc., will be discussed at all length scales. We believe worldwide immunologists, academicians, scholars, students and medical entrepreneurs in the field will create huge opportunities by showcasing the growth and breakthrough of immunology and immunotherapy at a time when so many new innovations and challenges are available. Finally, we hope and trust that you will find the conference and your visit to the very beautiful and exciting city of Edinburgh, in June 2024 both valuable and enjoyable! Yours sincerely, Prof. Dr. Alessandra Mortellaro IRCCS San Raffaele Scientific Institute, Italy Conference Chair: IMMUNOLOGYSUMMIT2024","date_start":"2024-06-10","date_end":"2024-06-12","important_dates":{"abstract":"","full":"2024-06-08","notification":"","final":""},"topics":["Medicine & Health","Medical-Speciality"],"location":{"virtual":"","full":["scotland","United Kingdom"],"name":"","street":"","city":"scotland","state":"","ZIP":"","country":"United Kingdom"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}