{"name":"“International Summit on Hematology and Blood disorders” (Hematology 2023)","series":"","short":"","website":"https://magnusconferences.com/hematology-blood/ ","content":"Magnus Group proudly presents its hybrid event “International Summit on Hematology and Blood disorders” (Hematology 2023) which will be hosted at during April 27-29, 2023 and will focus on the theme “Transfusing Innovations and Exploring Emerging Concepts in Hematology.” This two-day hematology meeting will give you the opportunity to talk with renowned haematology experts about fast changing advances in the area, learn about novel therapies for patients, and enhance your overall practise approaches. The hematology congress will assist our attendees and delegates by offering tools and guidance that suit global needs, as well as assist them in the establishment of strong communities to enhance worldwide education, research, and awareness on haematology and blood related disorders. This hematology meeting will provide a global platform for sharing ideas and developing solutions by sharing knowledge across countries and specialties to support the development of best practise, and by working together to provide resources that enable the development of a new generation of advocates, activists, practitioners, and researchers in the global context. Oral and poster presentations, keynote forums, plenary talks, symposiums, and exhibitions are all part of the conference. Reach us at: e-mail: hematology@magnusconference.com Phone:1 (702) 988 2320 WhatsApp: +1 (540) 709 1879 Dates: April 27-29, 2023 Venue: Orlando, United States Website: https://magnusconferences.com/hematology-blood/ Abstract submission: https://magnusconferences.com/hematology-blood/ Registration: https://magnusconferences.com/hematology-blood Social Media Link: Facebook: https://www.facebook.com/HematologyConf/ Twitter: https://twitter.com/Hematology\\_Conf Organiser: Magnus Group LLC - https://www.magnusgroup.org/ Organiser Address: Magnus Group LLC 150 South Wacker Drive #2400 Chicago, IL 60606, USA Hematology Conferences 2023 | Blood Disorders Conference 2023 | Hematology Conference| Blood Disorders Events 2023 | Hematology Meetings| International Hematology Conferences| Blood Conferences 2023| Hematology 2023| Hematology Congress |Blood Congress| Hematology Meetings| Hematology Summit| Hematology Oncology Conferences","date_start":"2023-04-27","date_end":"2023-04-29","important_dates":{"abstract":"","full":"2023-04-20","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["United States"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":[""],"societies":[],"indexes":[],"emails":["hematology@magnusconference.com"]}