{"name":"4th International Conference on Clinical Microbiology and Infectious Diseases","series":"","short":"","website":"https://clinicalmicrobiology.annualcongress.com","content":"Dear Dr., Hope you are in the pink of health and doing fine. Thank you for your email and interest in our 4th International Conference on Clinical Microbiology and Infectious Diseases which is scheduled to be held during Dec 25-26, 2022 in Singapore city, Singapore with a potential theme of “Exploring Innovative Research in Clinical Microbiology”. As per your concern, please find the required details: The conference will be held at “Holiday inn atrium, Singapore”.Conference venue is a 5 star destination with all international amenities and facilities. We are also providing required days of accommodations in the form of “Packages” to interested participants. Please visit the registration page of our website to know the details of packages available. We will be having a total of 85-100 participants’ slots which includes Keynotes, Speakers, Poster presenters, Exhibitors, workshop organizers, symposia, Delegates, YRF (Young researcher’s forum), Special presentations from representatives of reputed Organizations, Research centers and Hospitals. To know more about this conference and available scientific sessions for presentations, please do have a glance at our website: https://clinicalmicrobiology.annualcongress.com/ As you are interested to attend this prestigious event in this regard, do let us know whether you will be delivering any presentation (Keynote/ Speaker/ Poster presentation/Video Presentation/E-Poster Presentation) or willing to attend as Delegate (Viewer) so accordingly we can proceed further. Do let us know if you feel any other information we can provide would be beneficial to you. We will be glad to assist you further. Regards, Mehreen Riya Conference Manager | Euro Microbiology 2022 United Kingdom Email: microbiologyconference21@gmail.com Disclaimer: This information is confidential and is for the use of the intended recipient only. Any improper use of this information is strictly prohibited. If you have received this e-mail in error, please reply to the sender immediately and delete this communication.","date_start":"2022-12-07","date_end":"2022-12-08","important_dates":{"abstract":"","full":"2022-12-01","notification":"","final":""},"topics":["Life Sciences","Microbiology/ Pathology/ Toxicology","microbiology"],"location":{"virtual":"","full":["Online Event","Singapore"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Singapore"},"organizers":[""],"societies":[],"indexes":[],"emails":["microbiologyconference21@gmail.com"]}