{"name":"48th WSAVA Congress and 28th FECAVA Eurocongress, hosted by APMVEAC in Lisbon, partnered with FIAVAC","series":"","short":"","website":"https://go.evvnt.com/1567041-0?pid=4868","content":"WSAVA 2023 is going to be a one-of-a-kind Congress! For the first time, we are organizing simultaneously, the WSAVA World Congress, the FECAVA EuroCongress, the FIAVAC Congress and the APMVEAC National Congress. Planning is well underway, and our team has been busy preparing for an unforgettable experience of learning and exploring with the most up-to-date topics and highly qualified speakers. It is a unique opportunity for our veterinary community to come together to learn, share ideas, and build relationships and friendships with colleagues from all over the world. The Organizing Committee and the APMVEAC invite you to participate in this one-of-a-kind Congress and enjoy a memorable experience appreciating the local culture and attractions of the region. Start planning your attendance now and secure your spot for the 48th WSAVA World Congress 2023 before 26 April to benefit from super early savings and special rates! Super early bird registration deadline: 26 April 2023 We look forward to welcoming you! Obrigado, Emir M. Chaher Local Host Committee Chair URLs: Tickets: https://go.evvnt.com/1567041-2?pid=4868 Facebook: https://go.evvnt.com/1567041-3?pid=4868 Twitter: https://go.evvnt.com/1567041-4?pid=4868 Instagram: https://go.evvnt.com/1567041-5?pid=4868 Date and Time: On Wednesday September 27, 2023 at 8:00 am to Friday September 29, 2023 at 8:00 pm Venue details: Lisbon Congress Centre, 1 Praça das Indústrias, Lisboa, 1300-307, Portugal Price: Visit website for details and savings: EUR 0.00","date_start":"2023-09-27","date_end":"2023-09-29","important_dates":{"abstract":"","full":"2023-06-20","notification":"","final":""},"topics":["Education / Legal / Other","Education","veterinary"],"location":{"virtual":"","full":["Lisboa","Portugal"],"name":"","street":"","city":"Lisboa","state":"","ZIP":"","country":"Portugal"},"organizers":["Kenes Group"],"societies":[],"indexes":[],"emails":[]}