{"name":"6th Annual Pharma Pricing, Reimbursement & Market Access 2022","series":"","short":"","website":"https://www.virtueinsight.com/event/pricing-reimbursement-market-access-usa","content":"6th Annual Pharma Pricing, Reimbursement & Market Access 2022 15th & 16th June 2022, Embassy Suites by Hilton Boston Logan Airport Boston, USA This conference will provide an overview of global pricing, market access systems and cost management techniques, as well as in-depth discussion of some of the most current trends and changes. This Conference will bring together top pharmaceutical, biotechnology and regulatory representatives under one roof that will address the key issues of the industry. It will be studied with the help of case studies and industry experiences. Following a raft of health policy reforms impacting pharmaceutical pricing in almost every major country in the EU. DELEGATE REGISTRATION: Email - kavitha@virtueinsight.co.in or TEL: +44-20 3509 3779 STANDARD PRICE - 1 Delegates US $ 1599 For Group Discounts, Conference Sponsor, Exhibition Stall & Paid Speaker Slot - Please email your interest and queries to kavitha@virtueinsight.co.in KEY SPEAKERS: • RICHARD LINER, Senior Assistant General Counsel, Bayer • MARK MYERS, Director, Healthcare Resources Division, Office of Contract Review & Inspector General, United States Department of Veterans Affairs • JOLIE APICELLA, Assistant, U.S. Attorney’s Office, EDNY • RAHUL GOYAL, Senior Director, UnitedHealth Group • GREG APOSTOL, Vice President and Head of Market Access, Alkermes • MALLORY O’CONNOR, Executive Director, Public Policy, Mallinckrodt Pharmaceuticals • BOXIONG TANG, Executive Director, HEOR, Global Medical Affairs, BeiGene • MARTIN ROST, Senior Director, Market Access (Global), Pfizer • KEREN TENENBAUM, Vice President of Legal & Compliance - U.S, Vifor Pharma • MELVA COVINGTON, Senior Vice President, Research and Patient Outcomes, Curio Digital Therapeutics • KEITH WHITE, Head, Global Market Access, Amylyx Pharmaceuticals • STUART LEVINE, Partner, Chicago Pacific Founders • HEATHER LEIGH FLANNERY, Founder & CEO, Equideum Health • ROBERT POPOVIAN, Chief Science Policy Officer, Global Healthy Living Foundation • AYESHA AZAM, Vice President of Medical Affairs, Patient Access Network (PAN) Foundation • PETER BARSCHDORFF, Vice President, Deallus • VIDYA BREEVELD–DWARKASING, Owner, Keen Access Insights (Former Head of Public Affairs & Market Access, Sanofi Pasteur) • GARY ELLEXSON, VP Corporate Accounts, Supernus Pharmaceuticals • MICHAEL THOMPSON, President & CEO, National Alliance of Healthcare Purchaser Coalitions • ANDREW THORRENS, VP / Head of Market Access (US) and Reimbursement, ImprimisRx • OMAR DABBOUS, VP, Global Health Economics & Outcomes Research & Real World Evidence, AveXis • FANTA WATERMAN, Managing Director, Serrette Brown Research & Consulting • EVERETT CROSLAND, Chief Commercial Officer, Cognito Therapeutics • FABRIZIO GIANFRATE, Professor of Health Economics and Outcome Research - Market Access Independent Consultant - Ex Payer (Italy) KEY THEMES DISCUSSED: • Lessons learnt from the pandemic - Formulating your best market access strategy • Pharma pricing and market access in the US: concepts, components, and future • Prioritising Patients! - Adding value through an innovative patient-centred approach • Importance of working together: Stakeholders- Industry, Payers, Physicians and Patients • Improving patient and market access through the development of targeted value propositions, comprehensive contract assessment • Market access challenges facing the industry • Evidence Generation - The strategic rigor and creativity applied to evidence generation • How can payers and industry work together and importance for the same • Understanding - payers’ perspective • Advocating and collaborating with payers for value in a new era • How price affects market access and learn on how to set prices for optimal access & returns. • Developing risk-sharing reimbursement models and value-based pricing • Patient engagement and adherence within the environment • How to use the data sources and observational research for effective safety analysis • Dwell ahead of regulatory developments & improving your strategies in a cost-effective way • Be part of a major networking opportunity WHO SHOULD ATTEND: Senior Vice Presidents, Vice Presidents, Senior Executives, Global Heads, Heads, Directors, Senior Managers, Managers of: Pricing, Reimbursement, Market Access, Commercial Pricing, Pricing Strategists, Health Economics, Outcomes Research, Regulatory Affairs, Governmental Affairs, Public Affairs, Public Policy Directors, Operations, Governmental bodies, Regulatory bodies Get more from the event, with a broader scope bringing the whole communications value chain together. Enjoy and make the best out of our dedicated networking time, meet the leading international vendors showcasing the products of tomorrow in the co-located exhibition. Expand your knowledge of the latest business models and strategies in the high-level conference.","date_start":"2022-06-15","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal","Healthcare"],"location":{"virtual":"","full":["Boston","Massachusetts","United States"],"name":"","street":"","city":"Boston","state":"Massachusetts","ZIP":"","country":"United States"},"organizers":[""],"societies":[],"indexes":[],"emails":["kavitha@virtueinsight.co.in"]}