{"name":"2024 2nd International Conference on Chemical, Energy Science and Environmental Engineering","series":"","short":"","website":"https://www.cesee.org","content":"\\[Introduction\\] CESEE 2024 is an international forum for the presentation of technological advances and research results in the fields of chemical, energy science and environmental engineering, which is also going to highlight and discuss topics on energy science and environmental engineering in a number of formats like keynote speeches, invited lectures, technical sessions and posters. On behalf of the organizing committee, we warmly invite you to take part in the conference. With your participation and contribution, together, we shall advance the state-of-the-art in the field of chemical,energy and environment engineering and their applications. \\[Publication\\] Papers will be selected through a review process, all accepted papers after proper registration and presentation, will be published in the CESEE 2024 Conference Proceedings, which will be published by IOP Conference Series: Earth and Environmental Science(Online ISSN: 1755-1315). The proceedings will be submitted to Engineering Village, Scopus, Thomson Reuters (WoS) and other databases for review and indexing.. \\[Submission\\] All the submissions should be formatted carefully according to the conference template and follow the conference manuscript requirements to prepare the manuscripts. Also, author need to submit the manuscript for review via submission system before the due submission deadline. For details about submission, please visit at: https://www.cesee.org/submission.html \\[Call for Participants\\] Presenter: For those papers do not want to be published but presenting and discussing at the conference, you can submit an abstract only Listener: CESEE 2024 is open for anyone interested in attending, you can email us to register. \\[Call for Papers\\] Topics of interest for submission include, but not limited to: (For more topics: https://www.cesee.org/cfp.html) Chemical Science and Engineering Heterogeneous Catalysis Molecular catalysis, and biocatalysis Energy Chemical Engineering Green Chemical Technology Polymer Engineering Emission Reduction, Chemical Process Intensification Biological Chemical and Technology Electrochemical Engineering Environmental Chemicals Chemical Thermodynamics and Kinetics Chemical Process System and Information Engineering Chemical Machinery and Equipment Chemical Reaction Energy Science and Engineering Development and Utilization of Clean and Renewable Energy Hydrogen energy Nuclear Energy Engineering Thermal Engineering Thermal and Power Systems Biomass Energy Geothermal Energy Marine Science Ocean Energy Plant Protection Solar Energy Solar electricity and PV applications Soil Science Waste Recycling Energy Wind Energy Environmental Science and Engineering Earth Science Environmental and Resource Science and Technology Atmospheric Environment Environmental Biology Environmental Remediation Technologies Ecological Environment Environmental Management Systems Environmental Analytical Methods Ecology and Biodiversity Conservation Sustainable Development Environmental Ergonomics Water Resources Management \\[Contact\\] If you have any question or need any assistance regarding the conference, please feel free to contact us. Ms.Fiona L. (Conference Secretary) E-mail: cesee\\_conf@163.com Tel.: +852-30697939/+86-15756280447","date_start":"2024-06-21","date_end":"2024-06-23","important_dates":{"abstract":"","full":"2024-05-20","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental"],"location":{"virtual":"","full":["Rome","Italy"],"name":"","street":"","city":"Rome","state":"","ZIP":"","country":"Italy"},"organizers":[""],"societies":[],"indexes":[],"emails":["_conf@163.com"]}