{"name":"FEMINIST ISSUES - in the social-economic structure of the contemporary world","series":"","short":"","website":"https://artpersonality.webs.com","content":"Some fundamental concepts of the current feminist issue will be analyzed:  defining gender identity (including gender selection difficulties, homoeroticism, etc.),  the description of gender stereotypes present both in the education received in the family and at school, through books and toys intended for children, through mass media, through the way society is organized, etc.  analysis of bioethical elements in the case of women's bodies (eg: fertility, sterilization, adoption, abortion, etc.).  presentation of the metamorphoses of the role structure in the modern family, interpersonal communication in the case of couples;  the influence of religion in defining the status of women in society;  differentiated socialization for women and men;  the obstacles encountered by women in acquiring a professional career, in affirming their professional value;  the problem of domestic violence (the situation of domestic violence in Romania);  measures taken to prevent domestic violence, methods of intervention and support at the social and legal level.  the status of refugee women (the case of Ukraine, 2022-2023). The papers will be subsequently published in a collective volume at the PERFORMANTICA Publishing House - CNCSIS (academic) recognized publishing house, and will be included in international databases. We invite to participate teachers and researchers, psychologists, psychotherapists, and students interested in this topic. The papers will be published in a collective volume with academic recognition. We offer nominal Diploma of participation. Conference websites: https://artpersonality.webs.com (lb. rom.) https://artpersonality.webs.com/home (lb. engl.) DEADLINES 3 April, 2023 - for sending title and abstract in English (up to 250 words and 3-5 keywords): 10 April, 2023 - acceptance of papers. 28 April, 2023 - for sending full papers (8 to 10 pages, font Times New Roman - 12, format A4, fully justified, margins Normal. Bibliography: author, year, title, editor.) We ask participants to comply with the deadlines for submitting materials. All documents will be sent electronically to the following e-mail: marinela1808@yahoo.com The papers will meet the proposed theme and must not have been previously published.","date_start":"2023-05-26","date_end":"2023-05-27","important_dates":{"abstract":"","full":"2023-04-28","notification":"","final":""},"topics":["Social Sciences","Psychology","FEMINIST"],"location":{"virtual":"","full":["Online Event","Romania"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Romania"},"organizers":["Romanian Academy"],"societies":[],"indexes":[],"emails":["marinela1808@yahoo.com"]}