{"name":"9th International Conference of Managing Value and Supply Chains (MaVaS 2023)","series":"","short":"","website":"https://csty2023.org/mavas/index","content":"9th International Conference of Managing Value and Supply Chains (MaVaS 2023) October 21 \\~ 22, 2023, Sydney, Australia https://csty2023.org/mavas/index Scope & Topics 9th International Conference of Managing Value and Supply Chains (MaVaS 2023) is a peer-reviewed forum for presenting articles that contribute new results in all areas of value and supply chain management. The conference provides a platform to disseminate new ideas and new research, advance theories, and propagate best practices in the management of value and supply chain management, looking across both product and service-based businesses. This will include works based in service management, logistics and distribution, operations management, process management, flow control, and customer service. Authors are solicited to contribute to the conference by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in the areas of value and supply chain management. Topics of interest include, but are not limited to, the following: • Supply Chain Management • Value Chain Management • Analytical Frameworks • Business-to-Business Marketing • Change Management • Channel Management • Cultural Issues • Customer Service • Customer Retention Strategies • Demand Forecasting and Planning • E-Procurement and E-Commerce • Product Innovation and Development • Sourcing Strategies • Supplier Selection • Vendor Management and Selection • Distribution Channels • Economic Issues • Information Technology in Product Distribution • Information Technology in Service Delivery • Knowledge Management • Legal and Regulatory Issues • Logistics Management and Planning (Inbound, Outbound and Reverse Logistics) • Manufacturing Methods and Strategies • Metrics and Measurement • Network Design and Routing • Quality Control and Improvement • Performance Metrics • Purchasing and Procurement Paper Submission Authors are invited to submit papers through the conference Submission System by August 19, 2023.Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by Computer Science Conference Proceedings in Computer Science & Information Technology (CS & IT) series (Confirmed). Selected papers from MaVaS 2023, after further revisions, will be published in the special issues of the following journals • International Journal of Managing Value and Supply Chains (IJMVSC) • International Journal of Managing Public Sector Information and Communication Technologies (IJMPICT) • International Journal of Managing Information Technology (IJMIT) - WJCI Indexed • Information Technology in Industry (ITII) Important Dates • Submission Deadline : August 19, 2023 • Authors Notification :September 22, 2023 • Registration & Camera-Ready Paper Due : September 29, 2023 Contact Us Here's where you can reach us : mavas@csty2023.org or mavasconf@yahoo.com","date_start":"2023-10-21","date_end":"2023-10-22","important_dates":{"abstract":"","full":"2023-08-19","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Sydney","Australia","Australia"],"name":"","street":"","city":"Sydney","state":"Australia","ZIP":"","country":"Australia"},"organizers":[""],"societies":[],"indexes":[],"emails":["mavas@csty2023.org","mavasconf@yahoo.com"]}