{"name":"2024 2nd International Conference On Intelligent Perception And Computer Vision","series":"","short":"","website":"https://www.cipcv.org","content":"\\[Introduction\\] 2024 2nd International Conference on Intelligent Perception and Computer Vision (CIPCV 2024) will be held in Xiamen, China during May 17-19, 2024, which is sponsored by Society of Advanced Science and Engineering (SASE), technically sponsored by Xi'an Jiaotong-Liverpool University and Shanghai Jiao Tong University. The conference has the objective of creating an international forum for academics, researchers and scientists from worldwide to discuss worldwide results and proposals regarding to the soundest issues related to artificial intelligence, computer vision and intelligent perception. \\[Publication\\] Papers will be selected through a review process, all accepted papers after proper registration and presentation, will be included in the CIPCV 2024 Conference Proceedings. The proceedings will be published by Conference Publishing Services (CPS), which will be submitted to Engineering Village, Scopus, Thomson Reuters (WoS) and other databases for review and indexing. \\[Submission\\] All the submissions should be formatted carefully according to the conference template and follow the conference manuscript requirements to prepare the manuscripts. Also, author need to submit the manuscript for review via submission system before the due submission deadline. For details about submission, please visit at: https://www.cipcv.org/submission.html \\[Call for Participants\\] Presenter: For those papers do not want to be published but presenting and discussing at the conference, you can submit an abstract only Listener: CIPCV 2024 is open for anyone interested in attending, you can email us to register. \\[Call for Papers\\] Topics of interest for submission include, but not limited to: (For more topics: https://www.cipcv.org/callforpapers.html) Intelligent Perception Computational Intelligence Soft Computing Artificial Intelligence Intelligent Sensors Intelligent micro nano system Intelligent network Intelligent application Intelligent information processing Intelligent Transportation Intelligent detection Information Perception Genetic/Evolutionary Algorithms Machine Learning Learning and Adaptive Systems Cognitive Modeling Human-Robot Interaction Internet of Things (IoT) Speech recognition Computer Vision Active and robot vision Biometric authentication Knowledge-based recognition Camera networks and vision Face and gesture recognition Structural and syntactic pattern recognition Image feature extraction Machine learning technologies for vision 3D computer vision Action recognition Biometrics, face and gesture Biomedical image analysis Computational photography, photometry Low-level vision and image processing Motion and tracking Detection, categorization, indexing and matching Video: events, activities and surveillan \\[Contact\\] If you have any question or need any assistance regarding the conference, please feel free to contact us. Ms.Fiona L. (Conference Secretary) E-mail: cipcv\\_conf@163.com Tel.: +852-30697939/+86-15756280447","date_start":"2024-05-17","date_end":"2024-05-19","important_dates":{"abstract":"","full":"2024-04-15","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Xiamen","China"],"name":"","street":"","city":"Xiamen","state":"","ZIP":"","country":"China"},"organizers":[""],"societies":[],"indexes":[],"emails":["_conf@163.com"]}