{"name":"3rd Annual Pharma Innovation Tech Congress 2023","series":"","short":"","website":"https://virtueinsight.com/event/pharma-tech-2023","content":"3rd Annual Pharma Innovation Tech Congress 2023 01st November 2023, Hotel Kohinoor Continental, Mumbai, India Virtue Insight is delighted to announce its 3rd Pharma Innovation Tech Congress 2023 to be held on 01st November 2023, Hotel Kohinoor Continental, Mumbai, India. Join our new break-out sessions to deep dive into industry-specific Pharma Innovation Tech and explore real use cases and lessons learned by our customers. DELEGATE REGISTRATION: Please contact Email - kavitha@virtueinsight.co.in or Call - +91 9361957193 / +91 44 24762472 • Super Early Bird Discount Price (Valid until 14th Sep 2023) - INR 8,000 + GST (18%) per delegate • Early Bird Discount Price (Valid until 17th Oct 2023) - INR 10,000 + GST (18%) per delegate • Standard Price (Valid from 18th Oct 2023) - INR 13,000 + GST (18%) per delegate Conference Sponsor & Exhibition Stall – Should you wish to Sponsor, or purchase a Exhibition Stall (Booth) or a paid Speaker Slot, you can simply email your interest and queries KEY SPEAKERS: • MAYUR PARMAR, Deputy Collector, Prant Officer & SDM, Government of Gujarat, Drugs Inspector, FDA • KULBHUSHAN GUPTA, Sr. VP, Global Head Operations Strategy & Excellence, Dr. Reddy’s Laboratories • SANJAY SHARMA, Senior VP & Head Manufacturing Science & Technology, Zydus Group • ANAND AGARWAL, Senior Vice President, Cipla • KRISHNA SAI. T, Associate Vice President, Biocon • RAMANARAYANA PARHI, VP & CIO, Alkem Labs • DEVEN BABRE, Director Analytics & Benchmarking, GSK • SHIVKUMAR IYER, Director Technology Transfer, Cipla • KAVITA LAMROR, Director, Real World Investigator, Digital Function, Sanofi • SAKSHI SHRIVASTAVA DESAI, Associate Director International Pharmacovigilance Strategy Realization, Johnson & Johnson • SHRUTTI DHAR, Head -Medical Affairs Operations and Digital Transformation, Boehringer Ingelheim • RINKESH SHAH, Head of Digital Transformation, Mankind Pharma • MOHIT AGARWAL, Head of Emerging Markets – SFE, Sun Pharmaceuticals • KAMLESH PATEL, Head Medical Affairs & Health Tech, Lupin • GOLDEE PARDESI, Head of Marketing Rural & Trade Operations, Alembic Pharmaceuticals • GOPINATH MADHU, Senior Client Partner, Digital & Technology, Pfizer • VISHVAJIT M. KARANDIKAR, Business Unit (BU) Head -Parenteral Nutrition, Fresenius Kabi • MANGALA KOTNIS, Former Head Regional Medical Affairs (MSL/ FME function), Abbott • SEERA DILEEP RAJU, Senior Manager - ML & AI, MSD • RAJESH PEDNEKAR, Head - Supply Chain, Operations and Strategy, Healthcare SF • RUPESH NEHRA, Senior Manager - Data Science, Pfizer • VISHWAS SOVANI, Director, Pharmawisdom • RANJIT BARSHIKAR, CEO, QBD International, United Nations Adviser • ROHIT CHUGH, General Manager-IT Excellence, Deepak Fertilisers & Petrochemicals (Former Sr. IT Program Mgr, Sun Pharma) Plus more joining soon KEY THEMES DISCUSSED: • Where to from here? Disruptive Economics of upcoming Technology • How do new technologies unlock benefits in drug discovery? • AI & IoT – Challenges, Opportunities and Implementation • How IoT is transforming the Pharmaceutical Industry? • AI in manufacturing – what are the risks to be in mind & benefits in the hand? • Current ways to improve drug development, clinical trials and monitoring through ML • IoMT (Internet of Medical Things) – Framework • Significance of Digitalization in Pharma - Challenges and Opportunities • Addressing main challenges in implementing digitization in pharma • Patient interaction and care - How digital transformation helps? • Pharmaceutical world of tomorrow with AI/ML • Big data to big impact: Big data transforming the pharma industry • RWD and RWE drive in Pharma • Why Big Pharma is betting on Blockchain? • Fighting against counterfeiting medicines– Better usage of blockchain • Identifying disease and diagnosis in the beginning stage – How does real world data help? • Be part of a major networking opportunity WHO SHOULD ATTEND AND WHO YOU’LL MEET: - CIOs, CEOs, CDOs, Vice Presidents, Presidents, Heads, Directors and Team Leaders from the following areas: Pharmaceuticals, Biotech, Artificial Intelligence, Data Science, Blockchain, Machine Learning, IoT, Advanced Analytics, Innovation, Big Data, Deep Learning, BDM, Business Operations, Scientific Affairs, Commercial Affairs, Research & Development Get more from the event, with a broader scope bringing the whole communications value chain together. Enjoy and make the best out of our dedicated networking time, meet the leading international vendors showcasing the products of tomorrow in the co-located exhibition. Expand your knowledge of the latest business models and strategies in the high-level conference.","date_start":"2023-11-01","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["mumbai","India"],"name":"","street":"","city":"mumbai","state":"","ZIP":"","country":"India"},"organizers":[""],"societies":[],"indexes":[],"emails":["kavitha@virtueinsight.co.in"]}