{"name":"2nd International Conference on Computer Science and Information Technology","series":"","short":"COMSCI 2023","website":"https://comsci2023.org","content":"2nd International Conference on Computer Science and Information Technology (COMSCI 2023) July 15-16, 2023, Virtual Conference https://comsci2023.org/ Scope: 2nd International Conference on Computer Science and Information Technology (COMSCI 2023)will act as a major forum for the presentation of innovative ideas, approaches, developments, and research projects in the area computer Science and Information Technology. It will also serve to facilitate the exchange of information between researchers and industry professionals to discuss the latest issues and advancementin the research area CS&IT. Authors are solicited to contribute to the conference by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in the following areas, but are not limited to. Topics of Interest • Artificial Intelligence, Machine, Deep Learning • Big Data , Data mining • Bioinformatics and Algorithms • Blackchain Technology • Control Theory • Big Data, Data Science • Database and Data Mining • Education Technology • Embedded System and Software • Image Processing • Information Technology Management • Internet Computing • Internet of Things (IoT) • Modeling and Simulation • Multimedia, Computer Graphics & Animation • Natural Language Processing • Networking and Communications • Performance Evaluation • Security • Signal Processing • Software Engineering • Web and Internet computing • Wireless, Mobile and Ubiquitous computing • Health & BIO Informatics Paper Submission Authors are invited to submit papers through the conference Submission System by July01, 2023(Final Call). Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by International Journal on Cybernetics & Informatics (IJCI) (Confirmed). Selected papers from COMSCI 2023, after further revisions, will be published in the special issue of the following journal.  International Journal of Advanced Information Technology (IJAIT)  International Journal of Computer Science and Engineering Survey (IJCSES)  Advanced Computing: An International Journal (ACIJ)  International Journal of Information Technology Convergence and services (IJITCS)  International Journal of Computer Science, Engineering and Applications (IJCSEA)  International Journal of Computer Science, Engineering and Information Technology (IJCSEIT) Important Dates • Submission Deadline : July01, 2023(Final Call) • Authors Notification : July 10,2023 • Final Manuscript Due : July12, 2023 Contact Us Here's where you can reach us:comsci@comsci2023.org (or) comsci\\_comsci@yahoo.com","date_start":"2023-07-15","date_end":"2023-07-16","important_dates":{"abstract":"","full":"2023-07-01","notification":"","final":""},"topics":["Arts & Humanities","Languages/Literature"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["Virtual Conference"],"societies":[],"indexes":[],"emails":["comsci@comsci2023.org","_comsci@yahoo.com"]}