{"name":"4th International Conference on Natural Language Processing, Information Retrieval and AI","series":"","short":"NIAI 2023","website":"https://ccseit2023.org/niai/index","content":"4th International Conference on Natural Language Processing, Information Retrieval and AI (NIAI 2023) February 18 \\~ 19, 2023, Dubai, UAE https://ccseit2023.org/niai/index Scope 4th International Conference on Natural Language Processing, Information Retrieval and AI (NIAI 2023) will provide an excellent international forum for sharing knowledge and results in theory, methodology and applications of Natural Language Computing, Information Retrieval and AI. The Conference looks for significant contributions to all major fields of the Natural Language processing and machine learning in theoretical and practical aspects. Topics Of Interest • Artificial Intelligence • Artificial Intelligence, Deep Learning, Machine Learning for NLP • Big Data and Data Mining • Information Retrieval • Machine Translation, Crosslingual and Multilingual applications • Natural Language Processing • Social Media and Social Network Analysis • Spoken Language Processing Speech Generation and Recognition Paper Submission Authors are invited to submit papers through the conference Submission System by February 04, 2023 (Final Call). Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by Computer Science Conference Proceedings in Computer Science & Information Technology (CS & IT) series (Confirmed). Selected papers from NIAI 2023, after further revisions, will be published in the special issue of the following journals • Machine Learning and Applications: An International Journal (MLAIJ) • International Journal of Artificial Intelligence & Applications (IJAIA) • International Journal on Natural Language Computing (IJNLC) Important Dates • Submission Deadline : February 04, 2023(Final Call) • Authors Notification : February 11, 2023 • Registration & Camera-Ready Paper Due : February 13, 2023 Contact Us Here's where you can reach us : niai@ccseit2023.org or niaiconf@yahoo.com Paper Submission URL : https://ccseit2023.org/submission/index.php","date_start":"2023-02-18","date_end":"2023-02-19","important_dates":{"abstract":"","full":"2023-02-04","notification":"","final":""},"topics":["Social Sciences","Linguistics","Natural Language Computing"],"location":{"virtual":"","full":["Dubai","United Arab Emirates"],"name":"","street":"","city":"Dubai","state":"","ZIP":"","country":"United Arab Emirates"},"organizers":["NIAI"],"societies":[],"indexes":[],"emails":["niai@ccseit2023.org","niaiconf@yahoo.com"]}