{"name":"9th International Conference on Data Mining","series":"","short":"DTMN 2023","website":"https://csity2023.org/dtmn/index","content":"9th International Conference on Data Mining (DTMN 2023) September 16 \\~ 17, 2023, Copenhagen, Denmark Scope & Topics 9th International Conference on Data Mining (DTMN 2023) provides a forum for researchers who address this issue and to present their work in a peer-reviewed forum. Authors are solicited to contribute to the conference by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in Data mining and Applications. Authors are solicited to contribute to the conference by submitting articles that illustrate research results, projects, surveying works and industrial experiences. All submissions must describe original research, not published or currently under review for another conference or journal. Topics of interest include, but are not limited to, the following Data Mining Applications Data Mining in Modeling, Visualization, Personalization and Recommendation Data Mining Systems and Platforms, Efficiency, Scalability and Privacy Foundations, Algorithms, Models and Theory Mining Text, Semi-structured, Spatio-temporal, Streaming, Graph, Web, Multimedia Knowledge Processing Paper Submission Authors are invited to submit papers through the conference Submission System by August 26, 2023 . Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by Computer Science Conference Proceedings in Computer Science & Information Technology (CS & IT) series (Confirmed). Selected papers from DTMN 2023, after further revisions, will be published in the special issue of the following journals. International Journal of Database Management Systems (IJDMS) - WJCI Indexed International Journal of Data Mining & Knowledge Management Process ( IJDKP ) - WJCI Indexed International Journal of Web & Semantic Technology (IJWesT) Information Technology in Industry (ITII) Important Dates Submission Deadline : August 26, 2023 Authors Notification : September 09, 2023 Final Manuscript Due : September 12, 2023 Contact Us Here's where you can reach us : dtmn@csity2023.org or dtmncon@yahoo.com","date_start":"2023-09-16","date_end":"2023-09-17","important_dates":{"abstract":"","full":"2023-08-26","notification":"","final":""},"topics":["Engineering & Technology","Mining/Mineral"],"location":{"virtual":"","full":["Copenhagen","Denmark","Denmark"],"name":"","street":"","city":"Copenhagen","state":"Denmark","ZIP":"","country":"Denmark"},"organizers":["DTMN 2023"],"societies":[],"indexes":[],"emails":["dtmn@csity2023.org","dtmncon@yahoo.com"]}