{"name":"International Conference \"Postcolonial Pirandello: Grotesque Plays/Fiction, Postnational Narratives, Ethnic Discourse\"","series":"","short":"","website":"https://pirandello-studies.lcir.co.uk","content":"The annual two-day conference of the Society for Pirandello Studies aims to embrace a wide variety of methods and approaches to Pirandello's œuvre, and to bring together theatre professionals, critics and scholars representing a range of disciplines. Both in-person and online/from-home 20-minute papers are welcome. This year's conference sheds light on Pirandello's awareness of colonialist/nationalist hegemony and its relation to more recent practices of (fiction/theatre) storytelling. Possible topics include but are not limited to: Pirandello's work critiquing war and fascism despite his formal membership to the latter; Pirandello's theatrical and literary representation of national and ethnic identity/-ties; Pirandello's uncovering of colonial discourse & hegemony at play in the north/south and mainland/island (Sicily) cultural narratives; Pirandello's metafiction: narratology, theory and practice; Pirandello's influence on later theories of metafiction; Metafiction and neighbouring categories, such as Romantic mise-en-abyme, the absurd, and the grotesque; Characters in twenty-first-century literature, cinema, and other media; Authorship, umorismo, and gender; Metafiction and authorship across disciplines, including sociological, psychological and anthropological perspectives.","date_start":"2023-10-21","date_end":"2023-10-22","important_dates":{"abstract":"","full":"2023-06-16","notification":"","final":""},"topics":["Arts & Humanities","Art History","interdisciplinary"],"location":{"virtual":"","full":["Birkbeck","University of London","United Kingdom"],"name":"","street":"","city":"Birkbeck","state":"University of London","ZIP":"","country":"United Kingdom"},"organizers":["Society for Pirandello Studies Annual Conference in collaboration with London Centre for Interdi"],"societies":[],"indexes":[],"emails":[]}