{"name":"\"Loneliness\" 4th International Interdisciplinary Conference","series":"","short":"","website":"https://www.inmindsupport.com/loneliness-conference","content":"ABOUT CONFERENCE: What makes us happy and content in our life? Some people may point to fabulous fame, fortune, or money. Some may say that the key to happiness are interpersonal relationships. But what if someone is alone? Is loneliness really disastrous? Are there any benefits of loneliness? Can loneliness become an epidemic? In order to answer such questions, during our conference we will have to concentrate on many particular issues. Thus, we are interested in all aspects of loneliness in the past and in the present-day world. The conference is intended as an interdisciplinary event. Hence, we invite researchers representing various academic disciplines: sociology, psychology, psychiatry, philosophy, anthropology, gender studies, literary studies, theatre studies, film studies, consciousness studies, social policy, cognitive sciences, history, and others. The aim of our conference is to provide opportunities for researchers from a range of disciplines and countries to share their research, create an academically challenging and productive space for discussion, and enable them to establish long-lasting, ever-growing scientific networks and contacts with professionals in other countries and institutions. We will be happy to hear from both experienced scholars and young academics at the beginning of their careers, as well as doctoral and graduate students. We also invite all persons interested in participating in the conference as listeners, without giving a presentation. For all details please visit our website: https://www.inmindsupport.com/loneliness-conference Conference email: lonelinessconference@gmail.com Deadline for proposals: 15 August 2022","date_start":"2022-09-12","date_end":"2022-09-13","important_dates":{"abstract":"","full":"2022-08-25","notification":"","final":""},"topics":["Social Sciences","Psychology","Sociology, Social Sciences"],"location":{"virtual":"","full":["Online Event","Poland"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Poland"},"organizers":["InMind Support"],"societies":[],"indexes":[],"emails":["lonelinessconference@gmail.com"]}