{"name":"InsurTech Spring Conference","series":"","short":"","website":"https://insurtech.dryfta.com/eid/112/pid/77","content":"Welcome to the InsurTech Spring Conference 2023, where insurance professionals from around the world gather to explore the latest trends and innovations in the insurance industry. This year's conference will be held at Pier 60 in New York City, a premier location right on the Hudson River. Our keynote speakers include industry thought leaders and top executives from leading InsurTech companies, who will share their insights and experiences on how technology is transforming the insurance industry. In addition to keynote presentations, the conference will feature panel discussions, breakout sessions, and open networking, allowing attendees to engage with their peers and exchange ideas. Some topics that will be covered at the conference include embedded insurance, becoming a trusted advisor, using third-party data, collaboration across the value chain, and the impact of digital distribution on the traditional insurance model. Attendees will also have the chance to visit the Expo, a showcase of the latest products and services from top InsurTech companies and emerging vendors. This is an excellent opportunity for insurance professionals to discover new technologies and solutions that can help them stay ahead of the curve in an increasingly competitive market. In addition to the conference program, attendees will have the opportunity to participate in a variety of social and networking events, including a welcome reception and networking lunches. These events provide the perfect platform for attendees to make new connections and build relationships with their peers. Don't miss out on this exciting opportunity to stay on the cutting edge of the insurance industry. Register now for the InsurTech Spring Conference 2023 and join us in New York City for two days of learning, networking, and discovery. We hope to see you there!","date_start":"2023-03-29","date_end":"2023-03-30","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Business","Economics","Insurance"],"location":{"virtual":"","full":["New York","United States"],"name":"","street":"","city":"New York","state":"","ZIP":"","country":"United States"},"organizers":[""],"societies":[],"indexes":[],"emails":[]}