{"name":"\"Cosmopolitanism and World Citizenship\" International Conference","series":"","short":"","website":"https://cosmopolitanism.lcir.co.uk","content":"Cosmopolitanism is, at the same time, a complex and continuously changing academic concept and real-life practice: historically long-standing and highly contemporary, progressive and future-oriented yet still considered in large parts utopian, deeply individual and yet highly socially and politically influential. Adding to this complexity, it is in recent times ever more debated across a multitude of academic disciplines, ranging from anthropology and sociology, across cultural and literary studies, and over world history to philosophy, up to political science, economics, international relations and even arts. From its origins with the Greek Stoics in the 2nd century BCE, it continues to fascinate academics, politicians, travelers, artists and dreamers alike. From its original context and meaning of “kosmou politês” (that was however limited to Ancient Greece’s male and free citizens), it has become a universal testament of the world’s peoples desires and hopes for planetary conviviality and shared humanity, while its conceptual underpinnings and practical ramifications have been used as tools to change the world – or to make the best efforts in trying. As just one contemporary example, in 1948 Gary Davis, a former United States pilot, became the first and maybe most famous voluntarily stateless person when entering the American embassy in Paris in 1948, renouncing his American citizenship and declaring himself a citizen of the world, before establishing the ‘World Government of World Citizens’, even issuing related documents such as passports. Hence this conference animates approaches of conceptualizing, and aspires to find novel ways of practicing world citizenship and cosmopolitanism, from any suitable disciplinary angle. Potential topics of interest include, but are not limited to the following: Multiculturalism, cultural diversity and awareness, Social and individual multiculturalism, Cultural pluralism and democratic values, The politics of multiculturalism, Multiculturalism in literature and art, Comparative multiculturalisms, Psychology of multiculturalism, Multiculturalism and cosmopolitanism, Multiculturalism in education, Multiculturalism, immigration and integration, Reflections of multiculturalism in the media, Multicultural rights, freedoms and pressures, Social justice and multiculturalism, Multiculturalism, religion and secularism, National and regional multiculturalism, Multiculturalism and conflict resolution, European and American multiculturalism, Multiculturalism between philosophy and reality, The history and future of multiculturalism.","date_start":"2023-05-20","date_end":"2023-05-21","important_dates":{"abstract":"","full":"2023-03-31","notification":"","final":""},"topics":["Social Sciences","Sociology","Sociology, Social Sciences"],"location":{"virtual":"","full":["London/Online","United Kingdom"],"name":"","street":"","city":"London/Online","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":[]}