{"name":"International Journal on Cloud Computing: Services and Architecture","series":"","short":"IJCCSA","website":"https://airccse.org/journal/ijccsa/index.html ","content":"International Journal on Cloud Computing: Services and Architecture (IJCCSA) ISSN : 2231 - 5853 \\[Online\\] ; 2231 - 6663 \\[Print\\] https://airccse.org/journal/ijccsa/index.html Scope & Topics: Cloud computing helps enterprises transform business and technology. Companies have begun to look for solutions that would help reduce their infrastructures costs and improve profitability. Cloud computing is becoming a foundation for benefits well beyond IT cost savings. Yet, many business leaders are concerned about cloud security, privacy, availability, and data protection. To discuss and address these issues, we invite researches who focus on cloud computing to shed more light on this emerging field. This peer-reviewed open access Journal aims to bring together researchers and practitioners in all security aspects of cloud-centric and outsourced computing, including (but not limited to): Topics of interest include, but are not limited to, the following: • Cloud Application, Infrastructure and platforms • Design Tool for Cloud Computing • Cloud Business • Service-Oriented Architecture in Cloud Computing • Cloud based, Parallel Processing • Virtualization on Platforms in the Cloud • Location Based Services, Presence, Availability, and Locality • Mobile Clouds for new millennium, mobile devices • Social Clouds (Social Networks in the Cloud) • Maintenance and Management of Cloud Computing • Cloud Computing Architecture • Cloud Applications in Vertical Industries • Cloud storage and file systems • Networks within cloud systems, the storage area, and to the outside • Virtualization in the context of cloud computing platforms • System integration, virtual compute clusters • Consolidation • NoSQL data stores • Performance, SLA management and enforcement • Resource provisioning • Security techniques for the Cloud • Energy management and programming environments • Data storage and management in Cloud computing • Case Studies and Theories in Cloud Computing • The Open Cloud: Cloud Computing and open source • Edge and Internet-of-Things (IoT) • Big Data and blockchain applications • AI / ML in Cloud Computing Paper Submission: Authors are invited to submit papers for this journal through Email: ijccsa@aircconline.com or through Submission System. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this Journal. Important Dates: • Submission Deadline : July 02, 2022 • Notification : August 02, 2022 • Final Manuscript Due : August 10, 2022 • Publication Date : Determined by the Editor-in-Chief Contact Us: Here's where you can reach us : ijccsajournal@airccse.org or ijccsa@aircconline.com","date_start":"2022-08-12","date_end":"2022-08-13","important_dates":{"abstract":"","full":"2022-07-09","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","data mining"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":[""],"societies":[],"indexes":[],"emails":["ijccsa@aircconline.com","ijccsajournal@airccse.org"]}