{"name":"2023 International Conference on Power, Grid and Energy Storage","series":"","short":"PGES 2023","website":"http://www.icpges.org","content":"Important information: The conference website: www.icpges.org Conference time: May 26 -28, 2023 Venue: Kunming, China Deadline: May 23-25, 2023 Notification of acceptance/rejection: within 1 week after submission Bibliography: EI Compendex, Scopus The conference profile: The International Conference on Power, Grid and Energy Storage 2023 (PGES 2023) will be held in Kunming, China on 26-28 May 2023\\. The meeting will be over power, power grid and the latest research achievements in the field of energy storage, such as, from institutions of higher learning, scientific research institutes, enterprises and institutions at home and abroad experts, professors, scholars, engineers and so on to provide a share professional experience, expand the professional network, face to face to new ideas and show the research results of the international platform, To explore the key challenges and research directions in this field, with a view to promoting the development and application of theories and technologies in this field in universities and enterprises, as well as establishing business or research connections for participants and seeking global partners for future careers. The main purpose of this conference is to provide an authoritative international exchange platform for researchers in related fields, so as to promote good academic exchanges among scholars in related fields. It also provides partners from all over the world to build collaborations in business and research.","date_start":"2023-06-16","date_end":"2023-06-18","important_dates":{"abstract":"","full":"2023-05-31","notification":"","final":""},"topics":["Engineering & Technology","Electrical/ Electronic","Power Systems"],"location":{"virtual":"","full":["HangZhou","China"],"name":"","street":"","city":"HangZhou","state":"","ZIP":"","country":"China"},"organizers":["AEIC Academic Exchange Center"],"societies":[],"indexes":[],"emails":[]}