{"name":"14th Annual Clinical Trials Summit 2023","series":"","short":"","website":"https://virtueinsight.com/event/14th-annual-clinical-trials-summit-2023","content":"14th Annual Clinical Trials Summit 2023 23rd & 24th May 2023, Hotel Kohinoor Continental, Mumbai, India 14th Annual Clinical Trials Summit 2023 will provide a platform to discuss on the futuristic advancements in Clinical Trials and clinical research. This event opens discussion of timely topics of mutual theoretical and practical interest for clinical trial investigators who are developing new drugs and biologics. This ground breaking platform continues the conversation between business, academics, patient advocacy, and regulatory agencies to discuss new methods and solutions to statistical challenges relevant to the design and analysis of Clinical Trials collaboratively in the real world. It is high time that we look into innovative strategies, new technologies, effective and quality collaborations to address these issues, which can cater to the needs of the patient and the industry. Please contact me at E-mail - kavitha@virtueinsight.co.in or Call +91 9361957193 SPONSORS: Principal Partner: Clinical Research Network Silver Partner: Cognizant SIP, ClinPro Research, Exhibitors: Clinevo Technologies, Medclinica, We have more sponsorship opportunities available for the event, which gives you an opportunity to speak and create brand awareness. DELEGATE REGISTRATION: Super Early Bird Price (Valid Till 24th March 2023) – INR 11,000 + GST (18%) per delegate Early Bird Price (Valid Till 4th May 2023) – INR 15,000 + GST (18%) per delegate Standard Price - INR 18,000 + GST (18%) per delegate","date_start":"2023-05-23","date_end":"2023-05-24","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal","Pharma Conference| Pharma Confer"],"location":{"virtual":"","full":["Mumbai","India"],"name":"","street":"","city":"Mumbai","state":"","ZIP":"","country":"India"},"organizers":["Clinical Research Network, Cognizant SIP, ClinPro Research, Clinevo Technologies, Medclinica,"],"societies":[],"indexes":[],"emails":["kavitha@virtueinsight.co.in"]}