{"name":"\"Freedom and Authenticity\" 4th International Interdisciplinary Conference","series":"","short":"","website":"https://www.inmindsupport.com/freedom-conference","content":"ABOUT CONFERENCE: ​Since the postmodern movements such as Pop and hyperrealist art or literary genres ̶ New Journalism and creative non-fiction questioned the status of the real and the imitated, the concept of authenticity has called for a constant reevaluation. Walter Benjamin’s 1935 assumption that “the presence of the original is the prerequisite to the concept of authenticity” has been called into question with the corporate and advertising practice continually rebranding the concept of authenticity to suit mass consumers’ needs. Why is it then that within the contemporary culture, with modes of expressions such as irony, cynicism and sarcasm strongly present, the notions of authenticity and freedom are still heavily linked with spiritual awakening and happiness? To what extent do authenticity, individuality and freedom function as mere commercial products and advertising slogans? Have they over time become shallow romantic ideals or do they still hold the substance to be discovered and implemented into one’s line of thinking and living? What makes freedom and authenticity creatively attractive to artists, thinkers and spiritual teachers? Can authenticity be defined, measured, conceptualized in the contemporary context of relativism? What are the main dynamics between freedom and authenticity? During the conference, we strive to discuss the contemporary status of authenticity and freedom, their interrelationship and their association with concepts such as sincerity, individuality, vulnerability, creativity and many others. ​We invite researchers representing various academic disciplines: art, film studies, literature, theatre studies, media studies, anthropology, psychology, sociology, politics, cognitive studies, to name a few. ​Different forms of presentations are encouraged, including case studies, theoretical inquiries, personal reflections, problem-oriented arguments, comparative analyses and creative expressions. We will be happy to hear from experienced scholars and young academics, doctoral and graduate students, as well as professionals from various disciplines. We also invite all persons interested in participating in the conference as listeners, without giving a presentation. Deadline for proposals: 10 August 2022 For all details please vistit our website. Conference email: conferencefreedom@gmail.com","date_start":"2022-08-25","date_end":"2022-08-26","important_dates":{"abstract":"","full":"2022-08-10","notification":"","final":""},"topics":["Social Sciences","Sociology","interdisciplinary"],"location":{"virtual":"","full":["Online Event","Poland"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Poland"},"organizers":["InMind Support"],"societies":[],"indexes":[],"emails":["conferencefreedom@gmail.com"]}