{"name":"TECHSPO San Diego 2023 Technology Expo (Internet ~ Mobile ~ AdTech ~ MarTech ~ SaaS)","series":"","short":"","website":"https://techsposandiego.com","content":"Where Business, Tech and Innovation Collide in San Diego! TECHSPO San Diego 2023 is your chance to … – Check out exhibitors showcasing the next generation of technology & innovation. – Be inspired, amazed and educated on how these evolving technologies will impact your business for greater growth. – Interact with technology enthusiasts, build your network and reunite with your peers. The 3rd annual TECHSPO San Diego, two-day technology expo returns May 22nd and 23rd, 2023 to the luxurious Marriott Marquis San Diego Marina Hotel in San Diego, California. TECHSPO San Diego brings together some of the best developers, brands, marketers, technology providers, designers, innovators and evangelists looking to set the pace in our advanced world of technology. Watch exhibitors showcase the next generation of advances in technology & innovation, including; Internet, Mobile, AdTech, MarTech and SaaS technologies. Be prepared to be inspired, amazed and educated on how these evolving technologies will impact your business for greater growth. As part of TECHSPO San Diego is a limited attendance event, DigiMarCon California 2023 Digital Marketing, Media and Advertising Conference (https://digimarconcalifornia.com). If the conference is where the learning, theory and inspiration happens, then the TECHSPO floor is where the testing, networking and product interaction takes place. For complete details visit https://techsposandiego.com","date_start":"2023-05-22","date_end":"2023-05-23","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Information technology systems (IT)"],"location":{"virtual":"","full":["San Diego","California","United States"],"name":"","street":"","city":"San Diego","state":"California","ZIP":"","country":"United States"},"organizers":["TECHSPO San Diego"],"societies":[],"indexes":[],"emails":[]}