{"name":"2023 2nd International Conference on New Energy, Energy Storage and Power Engineering","series":"","short":"NESP 2023","website":"http://www.icnesp.com","content":"Conference Information Website：http://www.icnesp.com/ Conference Date：April 21-23，2023 Venue：Kaifeng, China Paper submission deadline: Feburary 21, 2023 Submission：https://www.ais.cn/attendees/index/MAJIJZ Publication： JPCS press.(ISSN:1742-6596) Topics: Other topics related to Energy Storage Technology and Power System Keynote speakers Prof. Kok-Keong Chong, Universiti Tunku Abdul Rahman, Malaysia, Prof. Pierluigi Siano , University of Salerno, ltaly Prof ZY Dong, Fellow IEEE, Nanyang Technological University, Singapore Prof. Wei Li, ASME Fellow, Zhejiang University, China Prof. Guihua Tang, Xi'an Jiao Tong University，China Prof. Xuebin Wang, Xi'an Jiao Tong University, China Prof. Yingjia Zhang, Xi'an Jiaotong University, China A.Prof. Farhad Shahnia, Murdoch University, Australia A.Prof. Boyu Qin, Xi'an Jiao Tong University, China Publication All papers will be reviewed by two or three expert reviewers from the conference committees. After a careful reviewing process, all accepted papers of NESP 2023 will be published in the Journal of Physics: Conference Series and they will be submitted to EI Compendex and Scopus for indexing. submitted to EI Compendex, and Scopus for indexing. Registration Package A: Only Attendance Package B: Abstract Submission+Oral Presentation Package C: Abstract Submission+Poster Presentation Package D: Full Paper Publicaiton+Oral/Poster Presentation+Attendance Topics Electrochemical energy storage device Thermal energy storage Mechanical energy storage Wind energy storage Hydrogen storage Inductive energy storage Pumped storage power generation Capacitor storage system Energy storage material New Solar cell Fuel cell Capacitors, supercapacitors Lithium battery Lithium ion battery Sodium-ion battery Lithium sulfur batteries Power system Smart grid Power electronics Distributed generation Power transmission Electrical component network Power transmission and distribution system and equipment Energy Internet Micro-grid Tidal, wave, ocean, river and hydroelectric systems Power systems and automation Power quality protection and electromagnetic compatibility Contact Conference Secretary: Nico Bu Tel：17760758061(Wechat) QQ：2155401923 E-mail: contact\\_nesp@163.com","date_start":"2023-04-21","date_end":"2023-04-23","important_dates":{"abstract":"","full":"2023-02-21","notification":"","final":""},"topics":["Engineering & Technology","Electrical/ Electronic","Electrical & Electronic Engineering"],"location":{"virtual":"","full":["Kaifeng Henan","China"],"name":"","street":"","city":"Kaifeng Henan","state":"","ZIP":"","country":"China"},"organizers":["AEIC学术交流中心"],"societies":[],"indexes":[],"emails":["_nesp@163.com"]}