{"name":"International Conference on Computational Science & Applications","series":"","short":"COMSAP 2023","website":"https://comsap2023.org","content":"International Conference on Computational Science & Applications (COMSAP 2023) December 30 \\~ 31, 2023, Virtual Conference https://comsap2023.org/ Scope &Topics International Conference on Computational Science & Applications (COMSAP 2023) Computational science is interdisciplinary fields in which mathematical models are combined with scientific computing methods to study of a wide range of problems in science and engineering. Modelling and simulation tools find increasing applications not only in fundamental research, but also in real-world design and industry applications. The goal of this conference is to bring together researchers and practitioners from academia and industry to focus on understanding modern Computational research trends and applications to establishing new collaborations in these areas. Authors are solicited to contribute to the conference by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in the areas of Computational Science &Applications. Topics of interest include, but are not limited to, the following • AI, Machine Learning and Scientific Computing • Architectures and Computation Models, Compiler, Hardware and OS Issues • Computational Sciences (Biology, Chemistry, Mathematics, Physics, Humanities, Forensics, Sociology etc.) • Education in Computational Science • Hybrid Computational Methods • Large Scale Scientific Instruments • Medical and Biomedical Computational Science • Memory system, I/O, Tools, Programming Environment and Language Supports • Modeling, Algorithms and Simulations • Parallel, Distributed and High Performance Computing • Problem Solving • Quantum Computing • Scientific Computing • Visualization and Virtual Reality to Computational Science Paper Submission Authors are invited to submit papers through the conference Submission System by September 09, 2023\\. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by International Journal on Cybernetics & Informatics (IJCI) Selected papers from COMSAP 2023, after further revisions, will be published in the special issues of the following journals • International Journal on Computational Science & Applications (IJCSA) • International Journal in Foundations of Computer Science & Technology (IJFCST) • International Journal of Computational Science and Information Technology (IJCSITY) • International Journal on Information Theory (IJIT) • Advanced Computational Intelligence: An International Journal (ACII) • International Journal on Natural Language Computing (IJNLC) • Information Technology in Industry (ITII) Important Dates • Submission Deadline : September 09, 2023 • Authors Notification : October 05, 2023 • Registration & Camera-Ready Paper Due : October 13, 2023 Contact Us Here's where you can reach us: comsap@comsap2023.org (or) comsap\\_conf@yahoo.com","date_start":"2023-12-30","date_end":"2023-12-31","important_dates":{"abstract":"","full":"2023-09-09","notification":"","final":""},"topics":["Business","Information-Technology"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":["COMSAP 2023"],"societies":[],"indexes":[],"emails":["comsap@comsap2023.org","_conf@yahoo.com"]}