{"name":"4th Global Congress on CLIMATE CHANGE","series":"","short":"GCCC 2024","website":"https://global-climatechange.com","content":"Innovinc International takes immense pleasure to extend our warm welcome to invite all participants from all over the world to attend 4th Global Congress on Climate Change(GCCC-2024) during September 9-10, 2024 at Lisbon, Portugal. which will entail lively debates, prompt keynote presentations, Oral talks, Poster presentations, Workshops and Networking opportunities around a core of plenary and concurrent sessions based on essential topics on Climate Change. GCCC-2024 aims at gathering professionals, academia, and industry experts in Climate change and creates a unique platform to showcase and discuss the challenges and the latest technologies in dealing the Climate change. This includes interactive keynote lectures, oral and poster sessions, and panel discussions with respect to recent innovations and achievements in a specific field of the subject. Join us on 9–10 September, 2024 for cutting-edge technical sessions, outstanding professional education, and inclusive networking opportunities that will broaden your knowledge and connect you to our diverse community. Thousands of your peers are making plans to attend GCCC-2024 to find the tools, confidence, and connections they need to advance their knowledge and their careers. We invite all interested researchers, scientists and students to participate in our meeting Find out how you can become a speaker or sponsor of this event by contacting Conference Coordinator and Chair John Karen: climatechange@innovinc.org,Tel: +1-408-352-1010 We look forward to welcoming You to GCCC-2024 at Lisbon, Portugal.","date_start":"2024-09-09","date_end":"2024-09-10","important_dates":{"abstract":"","full":"2024-09-09","notification":"","final":""},"topics":["Physical Science & Math","Atmospheric/Meteorology"],"location":{"virtual":"","full":["Lisbon","Portugal"],"name":"","street":"","city":"Lisbon","state":"","ZIP":"","country":"Portugal"},"organizers":["Innovinc"],"societies":[],"indexes":[],"emails":["climatechange@innovinc.org"]}