{"name":"2nd Edition of Virology World Conference","series":"","short":"","website":"https://virology.magnusconferences.com","content":"Magnus Group is thrilled to invite you to its “2nd Edition of Virology World Conference” (VIROLOGY 2023) slated on June 21-22, 2023 in Rome, Italy. This premier event enlightens on the theme “Combating Global Pandemics through Virology Research & Innovations.” The summit will be highlighting recent advancements and technologies currently in use as well as those being developed on futuristic technologies for further virus research. The virology global consortium will be an excellent opportunity to network, discover, and connect with professionals in the field of infectious diseases. The virology congress invites experts from all prestigious universities, research institutions including researchers, virologist, microbiologists, academicians, scientists and industry key players to showcase their recent research and novel ideas on all aspects of this rapidly expanding field of virology and allied fields. This virology conference is a two-day scientific event comprises plenary talks, keynote sessions and oral and poster presentations. It is set up in such a way that it allows attendees to meet people from both industry and academics and form a scientific network between them. The congress will have plenary talks, symposiums, keynote sessions, and presentations which will provide provocative hypotheses and suggestions for new research directions in all aspects of virology and allied fields. International Virology Conference | Virology Conference | Virology Conferences | Virology Hybrid Conferences | Virology Online Conference | Virology Workshops Reach us at: Contact Email: virology@magnusconference.com Phone: +1 (702) 988-2320 WhatsApp: +1 (540) 709 1879 Dates: June 21-22, 2023 Venue: Rome, RM, Italy Website: https://virology.magnusconferences.com/ Abstract submission: https://virology.magnusconferences.com/submit-abstract Registration: https://virology.magnusconferences.com/register","date_start":"2023-06-21","date_end":"2023-06-22","important_dates":{"abstract":"","full":"2023-06-21","notification":"","final":""},"topics":["Life Sciences","Microbiology/ Pathology/ Toxicology","Animal sciences"],"location":{"virtual":"","full":["Rome","Italy"],"name":"","street":"","city":"Rome","state":"","ZIP":"","country":"Italy"},"organizers":["Maguns Group LLC"],"societies":[],"indexes":[],"emails":["virology@magnusconference.com"]}