{"name":"6th International Conference on Mechanical Engineering & Applications","series":"","short":"MEAP 2023","website":" https://meap2023.org","content":"6th International Conference on Mechanical Engineering & Applications (MEAP 2023) October 07 \\~ 08, 2023, Virtual Conference Scope & Topics 6th International Conference on Mechanical Engineering & Applications (MEAP 2023) will provide an excellent international forum for sharing knowledge and results in theory, methodology and applications impacts and challenges of Mechanical Engineering. The conference documents practical and theoretical results which make a fundamental contribution for the development of Mechanical Engineering. The aim of the conference is to provide a platform to the researchers and practitioners from both academia as well as industry to meet and share cutting-edge development in the field. Topics of interest include, but are not limited to, the following Advances AeroSpace Technology Artificial Intelligence and Expert Systems CAD/CAM, Automation, Control & Robotics Design and Reliability of Mechanical Systems Design Tools, Cutting Tool Material and Coatings Education in Mechanical Engineering Energy Conservation, Renewable Energy Techniques Fluid Dynamics, Bio-fuels and Fuel Cells Heat Transfer Industrial Applications Logistics and Supply Chain Management Machinability of Materials, Composite Materials Manufacturing Processes Mechanics Non-Traditional Machining processes Operations Management Reliability and Maintenance Engineering Thermodynamics Total Quality Management and Quality Engineering Transportation Systems Tribology Paper Submission Authors are invited to submit papers through the conference Submission System by September 09, 2023\\. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by International Journal of Recent Advances in Mechanical Engineering (IJMECH) (Confirmed). Selected papers from MEAP 2023, after further revisions, will be published in the special issue of the following journals. Mechanical Engineering: An International Journal (MEIJ) Advanced Energy: An International Journal (AEIJ) Mechatronics and Applications: An International Journal (MECHATROJ) Advances in Materials Science and Engineering : An International Journal (MSEJ) Contact Us Here's where you can reach us : meap@meap2023.org (or) meapconference@gmail.com","date_start":"2023-10-07","date_end":"2023-10-08","important_dates":{"abstract":"","full":"2023-09-09","notification":"","final":""},"topics":["Engineering & Technology","Mechanical/Industrial"],"location":{"virtual":"","full":["Online Event",""],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":""},"organizers":[""],"societies":[],"indexes":[],"emails":["meap@meap2023.org","meapconference@gmail.com"]}