{"name":"46th International Conference on Boundary Elements and other Mesh Reduction Methods","series":"","short":"","website":"https://www.wessex.ac.uk/conferences/2023/bem-mrm-46","content":"The annual conference on Boundary Elements and other Mesh Reduction Methods (BEM/MRM) which started in 1978, now in its 46th version, is to take place at Daytona Beach Campus of Embry-Riddle Aeronautical University. The meetings since 1978 have produced a collection of edited volumes in which the major developments in the field have been represented. This valuable series has been offered in digital form since 1993, with all papers available Open Access in the Wessex Institute’s eLibrary website (www.witpress.com/elibrary), where they can be easily accessed and downloaded for free. Since starting in 1978 the Conference has attracted high quality papers that report further advances in techniques that reduce or eliminate the type of meshes associated with finite elements or finite differences, for instance. Theoretical advances and new foundations have been reported at the Conference for more than 40 years, helping to expand the range of applications as well as the type of materials in response to industrial and professional requirements. This ability to evolve is reflected in the history of the Conference which has ensured the success of the meetings as well as the establishment of a community of stakeholders. As design, analysis and manufacture become more integrated the chances are that the users will be less aware of the capabilities of the analytical techniques that are at the core of the process. This reinforces the need to retain expertise in certain specialised areas of numerical methods, such as BEM/MRM, to ensure that all new tools perform satisfactorily in the integrated process. The maturity of BEM since 1978 has resulted in a substantial number of industrial applications which demonstrate the accuracy, robustness and easy use of the technique. Their range still needs to be widened, taking into account the potentialities of the Mesh Reduction techniques in general. This well-established conference acts as a forum to discuss new ideas and critically compare results before the solution and tools are released to end users. The meeting welcomes all stakeholders interested in the methods and particularly the participation of young researchers. Their new contributions have been the principal reason why the conference has continued to evolve.","date_start":"2023-05-15","date_end":"2023-05-17","important_dates":{"abstract":"","full":"2023-03-31","notification":"","final":""},"topics":["Business","Information-Technology","Energy Engineering"],"location":{"virtual":"","full":["Daytona Beach","United States"],"name":"","street":"","city":"Daytona Beach","state":"","ZIP":"","country":"United States"},"organizers":["Wessex Institute"],"societies":[],"indexes":[],"emails":[]}