{"name":"Amputation Prevention Symposium (AMP) Europe","series":"","short":"","website":"https://go.evvnt.com/1802820-0?pid=4868","content":"Brought to you by HMP Global and GTGL Global Events Ltd, AMP Europe is an expansion of the Amputation Prevention Symposium (AMP), the flagship meeting taking place annually in August in Chicago and now in its 13th year. AMP is an unrivaled CME meeting focused on the prevention and treatment of critical limb ischemia (CLI), a global public health epidemic. The goal of AMP Europe is the same as AMP in Chicago: to save limbs and save lives. Guiding the European program will be a team of multidisciplinary specialists, who bring together other leading CLI experts from across the world to provide participants with a practical and clinically relevant educational experience focused on CLI prevalence, diagnosis, treatment (surgical, endovascular, and medical management), and post-revascularization monitoring. The congress will be tailored to the specific needs of the healthcare systems throughout Europe and beyond, and renowned faculty will give participants the opportunity to gain insight and perspective on CLI advances from around the world. Visit europe.amptheclimeeting.com for more information, to register, and/or if you're interested in sponsorship/exhibiting opportunities. Time: 08:00 - 14:50 Prices: Physician / Fellow Advance Rate: EUR 650.00, Nurse / Technologist / Other Allied Health Professional Advance Rate: EUR 400.00, Resident / Student Advance Rate: EUR 200.00, Industry Advance Rate: EUR 650.00 Speakers: Prof. Jos C. van den Berg, Prof. Marianne Brodmann, Dr. Marco Manzi, Prof. Thomas Zeller, Dr. Vlad Alexandrescu, Dr. Robert E. Beasley, Prof. Theodosios Bisdas, Dr. Gonçalo Cabral, Dr. Edward Choke, Dr. Koen Deloose, Dr. Jean Paul de Vries, Prof. Walter Dorigo, Dr. Alejandro Fabiani, Prof. Yann Goueffic, Prof. Andrew Holden, Dr. Michael Lichtenberg, Prof. Bruno Migliara, Dr. Richard Neville, Dr. Lorenzo Patrone, Dr. Mark Portou, Dr. John Rundback, Prof. Nicolaas Schaper, Prof. Bruno Scheller, Dr. Konstantinos Stavroulakis, Dr. Cagdas Unlu, Dr. Daniel A.F. van den Heuvel, Dr. Bret N. Wiechmann Venue details: DoubleTree by Hilton Amsterdam Centraal Station, 4 Oosterdoksstraat, Amsterdam, Noord-Holland, 1011 DK, Netherlands","date_start":"2023-10-18","date_end":"2023-10-20","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Amsterdam","Noord","Holland","Netherlands"],"name":"","street":"","city":"","state":"","ZIP":"","country":""},"organizers":["HMP Global/GTGL Global Events Ltd"],"societies":[],"indexes":[],"emails":[]}