{"name":"17th Biosimilars Congregation 2022","series":"","short":"","website":"https://virtueinsight.com/event/biosimilars","content":"17th Biosimilars Congregation 2022 13th December 2022, Hotel Kohinoor Continental, Mumbai, India Virtue Insight is delighted to invite you to attend the 17th Biosimilars Congregation 2022 conference, to be held on 13th December 2022, Hotel Kohinoor Continental, Mumbai, India. It brings together scientists, researchers and CROs from around the world. At 17th Biosimilars Congregation 2022 meet your target audiences from around the world focused on learning about biologics and biosimilars. This conference would be your single best opportunity to reach the largest assemblage of participants from the biologics and biosimilars community. SPONSORS: Silver Partner - CLINEXEL LIFE SCIENCES Exhibitor - CLINCHOICE Conference Sponsor, Exhibition Stall & Paid Speaker Slot - Please email your interest and queries to kavitha@virtueinsight.co.in or call - + 91 9361957193 / +91 44 24762472 DELEGATE REGISTRATION: E-mail - kavitha@virtueinsight.co.in or Call - + 91 9361957193 / +91 44 24762472 Standard Price - INR 10,000 + GST (18%) per delegate KEY SPEAKERS: • MUKESH KUMAR, Senior Vice President & Head, Clinical R&D, Cipla • ASHOK KUMAR, President – Centre for Research & Development, Ipca Laboratories • SATISH KOLTE, VP – Global Engineering & Project Head, Sun Pharma • SHALIGRAM RANE, Vice President & Site Head Quality, Lupin • RAHUL GUPTA, Sr. Vice President, Regulatory Affairs, USV • SANJEEV GUPTA, Vice President - Advanced Biotech Lab, Ipca Laboratories • SAMIR KULKARNI, Head, Biological Sciences and Biotechnology, Institute of Chemical Technology • KETAKI SABNIS-PRASAD, Assistant Director & Head Development Quality Assurance Biotech, Lupin • SHAHU INGOLE, General Manager, Head Medical Affairs, Wockhardt • MOHIT AGARWAL, Head of Emerging Markets – SFE, Sun Pharma • VENKAT NATARAJAN, Heading Access Initiatives, Pfizer • HARSHAD KOTHAWADE, Director, Head of Regulatory Management & Trade Compliance India, South East Asia, ANZ, Merck KGaA • DEEPA ARORA, Chief Executive Officer, CLINEXEL Life Sciences • RAJKUMAR MALAYANDI, Head Biopharmaceutics & Clinical Pharmacokinetics, Abbott • AKSHAYA ODAK, Head - Regulatory (Biotech), Lupin • SANTOSH JADHAV, Deputy General Manager - Quality Control, Bharat Serums and Vaccines • SHALU KASLIWAL, Group Lead- Medical Sciences, Biologics, Dr. Reddy’s Laboratories • SWEETY MATHEW, Regulatory Professional- Global Regulatory, Affairs: CMC Rare Diseases, Novo Nordisk • SEEMA BHANDARKAR, Global Program Manager Biosimilar Operations, Biocon • APARNA PRABHUNE, Asst General Manager Regulatory Affairs, Wockhardt • VISHWAS SOVANI, Founder Director, Pharmawisdom • PRASHANT BODHE, Director, CliniSearch • SAKHARAM GARALE, Founder & CEO, Renovare Healthcare Solutions • ROSHAN PAWAR, Associate General Manager, Alkem Laboratories • GAURAV AGARWAL, New Product Introduction Project Manager, Abbott • KAVYA KADAM, Consultant Global Clinical Trials Plus more joining soon KEY THEMES DISCUSSED: • Analyzing the current situation and future trends in development of biosimilars • Identifying the best market practices for Biosimilars • Global commercialization strategies: How to strategically build a global biosimilars portfolio? • Future of Interchangeability – What has to be done? • Reference product and the biosimilars – How to maintain the relationship? • What are the current market trends affecting the biosimilar? Especially under post-pandemic • New product and existing product strategies to maintaining sustainability in biosimilars • Fresh trends in background, objective and approach towards patent rights • Challenging patent rights on reference product • Analytics - How will it help to make things better in product development? • Ensuring the balance between product development and patient safety • Effect of potential strategies on development of interchangeability and generics • Scalable, faster, efficient biosimilars processes – Better ways • Interchangeability and switching biosimilar: Regulatory’s view • Clinical-phase-appropriate regulatory compliance in the development of biosimilars • Be part of a major networking opportunity WHO SHOULD ATTEND AND WHO YOU’LL MEET: CSOs, CMOs, Vice Presidents, Presidents, Heads, Directors, Team Leaders, and Senior Scientists from the following roles: Biopharmaceuticals/Biotherapeutics, Follow on Biologics/Follow on Proteins, Biologics/Biotechnology/ Bio generics, Legal Affairs, Intellectual Property, Health Economics, Pricing and Reimbursement, Clinical Immunology, Principal Scientist, Chief Scientific Officer, Process Control and Analytical Technologies, Analytical Characterisation, Regulatory Compliance, Pharmacovigilance, Drug Safety & Risk Management, Quality Affairs/ Quality Control, New Product Development, Process Science, Portfolio Management, Research & Development, Business Development, Business Operations, Scientific Affairs, Commercial Affair Get more from the event, with a broader scope bringing the whole communications value chain together. Enjoy and make the best out of our dedicated networking time, meet the leading international vendors showcasing the products of tomorrow in the co-located exhibition. Expand your knowledge of the latest business models and strategies in the high-level conference.","date_start":"2022-12-13","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal","stem cell biomaterials"],"location":{"virtual":"","full":["Mumbai","India"],"name":"","street":"","city":"Mumbai","state":"","ZIP":"","country":"India"},"organizers":["Clinexel, Clinchoice"],"societies":[],"indexes":[],"emails":["kavitha@virtueinsight.co.in"]}