{"name":"World Conference On Multidisciplinary Research & Innovation","series":"","short":"WCMRI","website":"https://wcmri.org/index.php","content":"For two thousand years, the advancement of knowledge has taken a path of increasing specialisation. Man has approached the comprehension of the world through the deconstructing of it into much smaller fragments that have given rise to all the disciplines that exist today along with their respective subdisciplines in order to be able to foretell, or at least explain, the behaviour of nature, humanity, and society. One of the primary motives of the World Conference on Multidisciplinary Research & Innovation (WCMRI-2022) to be held in Singapore on the 28th & 29th of October 2022 is to spur unique discoveries in terms of countering conventional challenges faced in everyday engineering activities and technologies. Technology is progressing at a very fast pace, which currently is weighing heavily on the earth's bounty of natural resources and causing serious damage to the environment. The price for this large-scale and mass expansion in all forms of daily life is being paid for in the form of climate change. Today, dangerous pollution levels and global environmental degradation endanger the very existence of life on our planet. Now, more than ever, there is an urgent need for professionals from all sectors of engineering and science to come together and work together to find sustainable solutions to sustain economic growth without harming the environment in any way whatsoever.","date_start":"2022-10-28","date_end":"2022-10-29","important_dates":{"abstract":"","full":"2022-06-20","notification":"","final":""},"topics":["Engineering & Technology","Mechanical/Industrial","Robotics"],"location":{"virtual":"","full":["Online Event","Singapore"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Singapore"},"organizers":["Institute for Engineering Research and Publication (IFERP)"],"societies":[],"indexes":[],"emails":[]}