{"name":"2nd International Nursing, Midwifery And Allied Health Congress 2023","series":"","short":"","website":"https://bhinmac.ae","content":"This year's themes, \"Empower. Excel. Sustain\" reflect our shared vision for advancing the nursing, midwifery and allied health professions in the face of ever-evolving global healthcare challenges. As we gather to exchange knowledge, share experiences, and learn from one another, we will be reminded of the vital roles that nurses, midwives and allied health professionals play in providing compassionate, high-quality care to patients worldwide. This conference is designed to empower YOU, the dedicated professionals at the forefront of patient care, to excel in your practice and sustain your commitment to improving health outcomes for all. Over the 3 days of the Congress, you will receive a rich and diverse program featuring renowned keynote speakers, thought-provoking panel discussions, enlightening workshops, a Youth Forum and engaging poster presentations. Our aim is to provide an inclusive platform for all attendees to engage in meaningful dialogue, foster collaboration, and gain practical and academic insights for application in your professional lives. In addition to the educational and networking opportunities, we encourage you to experience the vibrant culture, history, and hospitality of Abu Dhabi. The city offers a unique blend of tradition and modernity that is sure to leave a lasting impression. We look forward to meeting you all in person and embarking on this exciting journey of shared learning and growth. Together, we can create a brighter future for the nursing, midwifery and allied health professions. This is an event not to be missed! URLs: Tickets: https://go.evvnt.com/1931603-0?pid=4868 Brochure: https://go.evvnt.com/1931603-2?pid=4868 Facebook: https://go.evvnt.com/1931603-4?pid=4868 Instagram: https://go.evvnt.com/1931603-5?pid=4868 LinkedIn: https://go.evvnt.com/1931603-6?pid=4868 YouTube: https://go.evvnt.com/1931603-7?pid=4868 Prices: Early Bird Registration ( Till 15th September ): AED 400.00, Standard Registration: AED 600.00 Category: Conferences | Science, Health and Medicine | CME (Continuing Medical Education) Date and Time: 9th November 2023 at 8:30 am to 11th November 2023 at 6:00 pm Venue details: Abu Dhabi National Exhibition Centre, Abu Dhabi, United Arab Emirates","date_start":"2023-11-09","date_end":"2023-11-11","important_dates":{"abstract":"","full":"2023-11-09","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Abu Dhabi","United Arab Emirates"],"name":"","street":"","city":"Abu Dhabi","state":"","ZIP":"","country":"United Arab Emirates"},"organizers":["MENA Conference LLC , Abu Dhabi, UAE"],"societies":[],"indexes":[],"emails":[]}