{"name":"5th Annual Pharma Packaging, Labelling, Serialisation, Track & Trace 2023","series":"","short":"","website":"https://virtueinsight.com/event/5th-annual-pharma-packaging-labelling-serialisation-track-trace-2023-2","content":"5th Pharma Packaging, Labelling, Serialisation, Track & Trace 2023 02nd August 2023, Hotel Kohinoor Continental, Mumbai, India After another successful year, a special thank you to all our attendees from our previous Pharma Packaging and Labelling Conference. Virtue Insight is delighted to announce the 5th Annual Pharma Packaging, Labelling, Serialization, Track & Trace 2023 conference to be held on 10th August 2023, Kohinoor Continental Hotel, Mumbai, India. The 2023 agenda looks at ongoing regulations, end-to-end artwork, sustainability, serialization, e-labelling and patient safety. Top pharmaceutical companies, biotechs, CMOs and regulatory bodies and many more will come together to share their insights into compliant packaging and labelling implementation. Please contact me at E-mail - kavitha@virtueinsight.co.in or Call +91 9361957193 DELEGATE REGISTRATION: Early Bird Price (Valid Till 22nd June 2023) - INR 11,000 + GST (18%) per delegate Standard Price (Valid From 23rd June 2023) - INR 15,000 + GST (18%) per delegate We have more sponsorship opportunities available for the event, which gives you an opportunity to exhibit/booth/speak and create brand awareness. Please revert to this email for more about details. FIRST PHASE OF CONFIRMED SPEAKERS: • TRIPTI NAKHARE, Associate VP Regulatory Affairs & Packaging Development, FDC Limited • VIPUL JAIN, Associate Director - SCM Integrated Business Planning, Cipla • NEETTA MOHIT, Regional Director -Regulatory Affairs and I&D, Abbott • CHANDI PRASAD RAVIPATI, Head - Packaging Development, Aurobindo Pharma • PRABIR DAS, Head of Packaging Technical Services, OSD (India), Mylan Laboratories (Pharma Packaging Professional, 1st PG Batch, IIP) • PRADEEP NAGALKAR, Head of Quality Control, Haffkine Biopharmaceutical • AMIT KALE, Associate VP Sourcing & Supply Chain, Reliance Retail • GIRIJESH SRIVASTAVA, Global Supply Chain Manager, Sun Pharma • KUMARESAN. M, Head Of Information Technology, Unichem Laboratories • BHANUPRIYA M. MUNTA, Head - Packaging Development, Shalina Laboratories • SHREEKANT BANKHELE, Sr. Manager Regulatory & Packaging Development, Novartis • SEERA DILEEP RAJU, Senior Manager - ML & AI, MSD • ASHOK KUMAR BHATTACHARYA, Former Executive Director, Takeda • RAJESH PEDNEKAR, Head - Supply Chain, Operations and Strategy, Healthcare SF • MANOJ CHITNIS, VP (Corporate Quality Head), J.B. Chemicals • SHIVAJI CHAKRABORTY, Asst. General Manager, Fresenius Kabi • PRADEEP DHARGALKAR, Former Head of Packaging Development, Unichem Laboratories • SUDIPTO BASU, GM, Head of SCM & Procurement, Virbac • KAUSTUBH KULKARNI, Senior Manager - Packaging Development, Wockhardt • PRIYESH MISTRY, Former Asst. General Manager – QA, Ajanta Pharma • GAURAV BHATIA, GM, Supply Chain, Reliance Retail • VISHWAS SOVANI, Director, Pharma Wisdom Plus more joining soon KEY THEMES DISCUSSED: • Solving the complex challenges in pharmaceutical packaging, labeling and artwork • Primary & Secondary Packaging: Playing with innovations & latest developments. • Fight the Fakes - Track & Trace, Serialization • One serialized barcode, unlock its many values in your supply chain • Technology - Transparency, trust, and technology: The future of Pharma • Getting ready for Industry 4.0 • Supply Chain Disruption: Fighting Counterfeit Products • Solving the global supply chain crisis with anti-counterfeit technology • Global End-to-End Tracking Labelling Technological Features • Planning for 2025: How can the suppliers be prepared for authenticity on delivered products? • Pharmaceutical companies to introduce end-to-end monitoring solutions • Transparency, trust, and technology: The future of the labeling for life sciences • Addressing the transformation of the way we manufacture goods and the digitization of production • A platform to hear the consumer’s opinion to share ideas and what worked • Global regulatory compliance: Major packaging and labeling developments • Meeting your needs while complying with regulatory requirements • How the pharma industry is keeping up with changing packaging & labelling regulations? • Be part of a major networking opportunity WHO SHOULD ATTEND AND WHO YOU’LL MEET CEO’s, Senior Vice Presidents, Vice Presidents, Senior Executives, Heads, Directors, Managers, Advisors, Strategists andAnalysts of: Pharmaceutical companies, Biotech companies , Artwork, Serialisation/Track and Trace – Solution Providers, Brand Protection/Enforcement/security/Integrity and Management companies, Design Regulatory Affairs, Quality, Product Development Materials Handling/Management, Product Information Operations, Licensing, Marketing and Sales Patient Compliance, Materials, Warehouse, Engineering Lean Production, Procurement, Purchase/Facilities Manufacturing Technology, Supply chain and Logistics, Government, Payers, Insurance companies. Get more from the event, with a broader scope bringing the whole communications value chain together. Enjoy and make the best out of our dedicated networking time, meet the leading international vendors showcasing the products of tomorrow in the co-located exhibition. Expand your knowledge of the latest business models and strategies in the high-level conference.","date_start":"2023-08-02","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal"],"location":{"virtual":"","full":["Mumbai","Maharashtra","India"],"name":"","street":"","city":"Mumbai","state":"Maharashtra","ZIP":"","country":"India"},"organizers":[""],"societies":[],"indexes":[],"emails":["kavitha@virtueinsight.co.in"]}