{"name":"USPTO Partners with LA NPDT to Host One-Day Patents and Trademarks Boot Camp","series":"","short":"","website":"https://go.evvnt.com/2013556-0?pid=4868","content":"Intellectual property protection is a crucial aspect of innovation, whether it's safeguarding a groundbreaking product idea with a patent or securing your brand identity with a trademark. To provide individuals with the knowledge and skills needed to excel in these areas, the United States Patent and Trademark Office (USPTO) has partnered with LA NPDT to host the \"USPTO One-Day Patents and Trademarks Boot Camp.\" This exceptional event will take place on November 2nd (patents) and 3rd (trademarks), from 9:00 am to 5:00 pm each day. The best part? It's absolutely free to attend, and participants can choose to engage with either patents, trademarks, or both aspects of intellectual property. The two-day program will provide a deep dive into the worlds of patents and trademarks, led by seasoned USPTO experts. Participants will gain comprehensive insights into the patent and trademark application processes and the significance of protecting intellectual property. The event will culminate with attendees receiving an official certificate of completion, recognizing their expertise in patent and trademark protection. This unique opportunity is open to a diverse audience, including entrepreneurs, business owners, students, and faculty members. Whether you're a visionary entrepreneur with an innovative product idea or a business owner looking to safeguard your brand, this boot camp has something valuable to offer you. Plus, the option to participate in either patents, trademarks, or both provides attendees with unparalleled flexibility. Space is limited, so early registration is strongly encouraged. Date and Time: On Thursday November 02, 2023 at 9:00 am to Friday November 03, 2023 at 5:00 pm Venue details: Andress Artist and Entrepreneur Center, 717 Crockett Street, Shreveport, Louisiana, 71101, United States Price: Free: USD 0.00","date_start":"2023-11-02","date_end":"2023-11-03","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education","Marketing & Advertising"],"location":{"virtual":"","full":["Shreveport","Louisiana United States"],"name":"","street":"","city":"Shreveport","state":"","ZIP":"","country":"Louisiana United States"},"organizers":["LA New Product Development Team"],"societies":[],"indexes":[],"emails":[]}