{"name":"Global Conference on Aging and Gerontology","series":"","short":"","website":"https://www.agconf.org","content":"The field of aging and gerontology is a fascinating mix of such areas as medicine, psychology, social science, public health, and numerous others. As a result, this discipline is as dynamic as it gets – there is always a new challenge, a new technique, a new angle, or an unexpected finding to look into. The Global Conference on Aging and Gerontology that will take place on 24-26 May 2024 in the cosmopolitan city of Munich will assemble some of the brightest minds in academia – both established scholars and researchers, as well as aspiring academics – to zoom in on some of the most pressing challenges and developments in the field. This leading academic gerontology conference 2024 is designed to maximize learning and networking opportunities for all attendees. That’s why the program features presentations that were carefully selected by the scientific committee for their adherence to the strict requirements of quality, authenticity, and relevancy. Networking sessions and a free guided tour of Munich will provide the participants with plenty of opportunities to interact with one another, learn of various academic and research grants, identify collaboration options, and inspire each other. We hope to see many of you in person in May. However, if you are not able to make it to Munich, we’d love to have you join the conference as a virtual delegate or presenter. Geographical bounds do not define the learning opportunities of this event, nor do they define the scope and depth of the network that results from it.","date_start":"2024-05-24","date_end":"2024-05-26","important_dates":{"abstract":"","full":"2024-05-03","notification":"","final":""},"topics":["Social Sciences","Other","Gerontology","Social Sciences"],"location":{"virtual":"","full":["Munich","Germany"],"name":"","street":"","city":"Munich","state":"","ZIP":"","country":"Germany"},"organizers":["Acavent"],"societies":[],"indexes":[],"emails":[]}