{"name":"Amputation Prevention Symposium (AMP) Europe","series":"","short":"","website":"https://go.evvnt.com/2217911-0?pid=4868","content":"Brought to you by HMP Global and GTGL Global Events Ltd, AMP Europe is an expansion of the Amputation Prevention Symposium (AMP), the flagship meeting taking place annually in August in Chicago and now in its 14th year. AMP is an unrivaled CME meeting focused on the prevention and treatment of critical limb ischemia (CLI), a global public health epidemic. The goal of AMP Europe is the same as AMP in Chicago: to save limbs and save lives. Guiding the European program will be a team of multidisciplinary specialists, who bring together other leading CLI experts from across the world to provide participants with a practical and clinically relevant educational experience focused on CLI prevalence, diagnosis, treatment (surgical, endovascular, and medical management), and post-revascularization monitoring. The congress will be tailored to the specific needs of the healthcare systems throughout Europe and beyond, and renowned faculty will give participants the opportunity to gain insight and perspective on CLI advances from around the world. Visit europe.amptheclimeeting.com for more information, to register, and/or if you're interested in sponsorship/exhibiting opportunities. YouTube: https://go.evvnt.com/2217911-2?pid=4868 Time: 8:00 am - 3:00 pm Venue details: Amsterdam Marriott Hotel, 12 Stadhouderskade, Amsterdam, Noord-Holland, 1054 ES, Netherlands Prices: Physician / Fellow Early Rate: EUR 650.00, Nurse / Technologist / Other Allied Health Professional Early Rate: EUR 400.00, Resident / Student Early Rate: EUR 250.00, Industry Early Rate: EUR 750.00 Speakers: Prof. Jos C. van den Berg, Prof. Marianne Brodmann, Dr. Jihad A. Mustapha, Prof. Thomas Zeller","date_start":"2024-09-30","date_end":"2024-10-02","important_dates":{"abstract":"","full":"2024-06-28","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["Amsterdam","Noord","Holland Netherlands"],"name":"","street":"","city":"Amsterdam","state":"Noord","ZIP":"","country":"Holland Netherlands"},"organizers":["HMP Global/GTGL Global Events Ltd"],"societies":[],"indexes":[],"emails":[]}