{"name":"2025 IEEE 21st International Conference on Automation Science and Engineering","series":"","short":"","website":"https://2025.ieeecase.org","content":"About CASE 2025 The IEEE International Conference on Automation Science and Engineering (CASE) is the flagship automation conference of the IEEE Robotics and Automation Society (RAS) and constitutes the primary forum for cross-industry and multidisciplinary research in automation. Its goal is to provide broad coverage and dissemination of foundational research in automation among researchers and practitioners. CASE 2025 will be held on August 18 – August 21, 2025, in Los Angelos, California, USA. The conference will focus on Secured and Trustworthy Automation: Automation systems such as collaborative robotics, self-operating systems and vehicles, smart manufacturing, healthcare, farming, transportation & logistics, and smart cities, increasingly rely on secured and trustworthy automation. Research is needed to overcome vulnerability and bias due to imperfect system design, data collection, machine learning, or control. The conference will cover a wide range of topics on Systems, Automation, Autonomous Systems, Discrete Event Systems, Smart Cities, Robotics, Building Automation, Automation in Meso, Micro and Nano-scale, Big Data, Machine Learning, Information and Communication Technologies, etc. CASE 2025 invites special session and workshop/tutorial proposals, regular papers, industry papers and presentation-only papers related to the conference topics. We look forward to seeing you in Los Angelos, California, USA! Conference venue: Millennium Biltmore Downtown Los Angeles, California, USA","date_start":"2025-08-18","date_end":"2025-08-21","important_dates":{"abstract":"","full":"2025-06-14","notification":"","final":""},"topics":["Engineering & Technology","Mechanical/Industrial","Cad/Cam, Automation & Robotics","Robotics"],"location":{"virtual":"","full":["Los Angeles","CA United States"],"name":"","street":"","city":"Los Angeles","state":"","ZIP":"","country":"CA United States"},"organizers":["IEEE Robotics & Automation Society"],"societies":[],"indexes":[],"emails":[]}