{"name":"\"Memory and Trauma\" International Conference","series":"","short":"","website":"https://memory.lcir.co.uk/memory-trauma","content":"Memory and trauma are two deeply interconnected phenomena that have captivated the attention of scholars and professionals across various disciplines. Understanding the complex interplay between these two elements is essential for comprehending how individuals, communities, and societies cope with and recover from traumatic experiences. The International Conference on \"Memory and Trauma\" provides a platform for in-depth exploration of these and other aspects of memory and trauma. Through interdisciplinary dialogue, we aim to advance our understanding of how memory influences and is influenced by traumatic experiences, fostering resilience, healing, and justice for individuals and communities affected by trauma. The conference invites scholars, researchers, and practitioners from around the world to submit their research proposals for an interdisciplinary exploration of the complex relationship between memory and trauma. It aims to foster critical discussions and offer a platform for sharing innovative research, insights, and perspectives on how memory shapes and is shaped by traumatic experiences. Conference Themes: Historical Trauma: Examining the intergenerational transmission of trauma, collective memory, and the impact of historical events on individuals and communities. Psychological and Neurological Aspects: Investigating the cognitive and psychological processes involved in the formation and retrieval of traumatic memories, as well as the neurological underpinnings of trauma-related disorders. Narrative and Representation: Analyzing the role of literature, art, film, and other forms of cultural expression in representing and processing traumatic memories. Social and Cultural Dimensions: Exploring how memory and trauma intersect with identity, gender, ethnicity, and other social and cultural factors. Therapeutic Approaches: Discussing therapeutic interventions, including psychotherapy, art therapy, and other modalities, for individuals and communities affected by trauma. Legal and Ethical Considerations: Examining the legal and ethical implications of memory and trauma, including issues related to testimonies, justice, and accountability.","date_start":"2024-12-07","date_end":"2024-12-08","important_dates":{"abstract":"","full":"2024-07-15","notification":"","final":""},"topics":["Arts & Humanities","Philosophy","Memory Studies","Interdisciplinary"],"location":{"virtual":"","full":["London/Online","United Kingdom"],"name":"","street":"","city":"London/Online","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":[]}