{"name":"8th International Conference on Modern Research in Education, Teaching and Learning","series":"","short":"","website":"https://www.icmetl.org","content":"Get ready for an exciting journey into the world of education at the 8th International Conference on Modern Research in Education, Teaching, and Learning, happening in Bangkok, Thailand from November 8th to 10th, 2024! Our Organizing Committee is pulling out all the stops to make this event unforgettable for attendees. Expect a mix of in-person engagement and live-streamed virtual sessions, ensuring that everyone can participate and connect, no matter where they are. And hey, who doesn’t love a freebie? We’re offering complimentary city tours to all participants. Whether you’re presenting your latest research or simply joining us to soak up knowledge, there’s something for everyone. And if you’re worried about getting your work out there, fret not! All registered papers have the chance to be published in our Conference Proceedings or top-notch international journals, recognized by heavy hitters like SCOPUS, DOAJ, and more. In-person participants and speakers will get a Letter of Invitation after registration, so you can secure your spot and make your travel plans with confidence. Don’t forget those deadlines: October 21, 2024: Paper submission deadline June 25, 2024: Early bird registration deadline August 26, 2024: Early registration deadline October 29, 2024: Late registration deadline So mark your calendars, spread the word, and get ready to connect with fellow educators, researchers, and industry professionals at this exceptional event. See you in Bangkok!","date_start":"2024-11-08","date_end":"2024-11-10","important_dates":{"abstract":"","full":"2024-10-21","notification":"","final":""},"topics":["Education / Legal / Other","Education","Deep Learning","Teaching"],"location":{"virtual":"","full":["Bangkok","Thailand"],"name":"","street":"","city":"Bangkok","state":"","ZIP":"","country":"Thailand"},"organizers":["Acavent"],"societies":[],"indexes":[],"emails":[]}