{"name":"The 8th International conference on Modern Approaches in Humanities and Social Sciences","series":"","short":"","website":"https://www.icmhs.org","content":"Welcome to the 8th International Conference on Modern Approach in Humanities and Social Sciences (ICMHS). Taking place on 26-28 July 2024 in Dublin, Republic of Ireland, a conference on social sciences and humanities is more than an academic conference. It’s an opportunity to source feedback on your research, to get published in internationally recognized academic journals, and to explore the city of Dublin on a free tour. We invite you to join us for three days of learning and networking. You are guaranteed to leave the event with a suitcase full of knowledge and inspiration. With +30 countries present at the event, this is a unique opportunity to understand the challenges your peers are facing and come up with creative solutions. See you in Dublin! Conference Themes and Topics The Conference on social sciences and humanities is seeking submissions related to the following conference topics: Social Sciences, Humanities and Language and Literature. Other related tracks and topics will also be considered. Submitted abstracts will be evaluated by the Scientific Committee. All submissions should report original and previously unpublished research results no matter the type of research paper you are presenting. Manuscripts should meet the format set by the Conference committee and are subject to review. Detailed instructions and full paper submission guidelines will be emailed within a few weeks following the conference","date_start":"2024-07-26","date_end":"2024-07-28","important_dates":{"abstract":"","full":"2024-07-05","notification":"","final":""},"topics":["Social Sciences","Other","Humanities","Social Sciences"],"location":{"virtual":"","full":["Dublin","Ireland"],"name":"","street":"","city":"Dublin","state":"","ZIP":"","country":"Ireland"},"organizers":["ACAVENT"],"societies":[],"indexes":[],"emails":[]}