{"name":"THE Arab Universities Summit | 3-5 December 2024 | Amman, Jordan","series":"","short":"","website":"https://go.evvnt.com/2549872-0?pid=4868","content":"The THE Arab Universities Summit 2024 will focus on the leading role of higher education institutions in supporting the future development of societies across the region. The summit will convene thought-leaders and strategists from higher education, government and industry to discuss how the economic, societal and environmental challenges facing Arab countries can be addressed through the output of greater applicable research, new technologies and innovations, and increased equity and access for learners. Through keynotes, panel discussions and case studies, we will identify how cross-sector partnerships, enhanced skills provision and greater cultural diversity can ensure that the higher education sector is equipped to drive profound educational transformation and support the progress of local and regional communities. Key agenda themes: - Addressing regional challenges through the application of research and innovation - Enhancing employability through vocational skills and collaboration - Broadening equity and access through partnerships and community engagement For more details about partnership opportunities, kindly contact us on partner@timeshighereducation.com URL: Tickets: https://go.evvnt.com/2549872-2?pid=4868 Time: 8:00 AM - 7:00 PM Venue details: University of Jordan, Queen Rania St, Amman, Amman Governorate, Jordan Prices: SUMMIT + AWARDS | University | Super early bird: GBP 199.00, SUMMIT + AWARDS | Corporate: GBP 649.00","date_start":"2024-12-03","date_end":"2024-12-05","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education","Education"],"location":{"virtual":"","full":["Amman","Amman Governorate Jordan"],"name":"","street":"","city":"Amman","state":"","ZIP":"","country":"Amman Governorate Jordan"},"organizers":["Times Higher Education"],"societies":[],"indexes":[],"emails":["partner@timeshighereducation.com"]}