{"name":"Student Success US 2024","series":"","short":"","website":"https://go.evvnt.com/2552715-0?pid=4868","content":"Student Success US 2024 will convene higher education leaders from across the US to take a 360-degree view of student success. From defining and measuring student success, to innovative tools for providing personalized support, the event will facilitate debates about some of the most pressing issues facing administrators at colleges and universities across the country. Attendees will explore how to engage the whole campus in student success initiatives and share examples of successful collaboration. The agenda will include case studies sharing solutions to common challenges and showcasing the latest tools and partnerships. Hosted in partnership with the University of Tennessee, Knoxville, Student Success US 2024 is designed for higher education professionals working in student engagement, academic affairs and advising and careers services. Teams across the entire campus will benefit from panel discussions, workshops and intimate networking sessions to facilitate conversations between departments. URL: Tickets: https://go.evvnt.com/2552715-1?pid=4868 Time: 5:00 PM - 4:00 PM Venue details: The University of Tennessee, Knoxville, Student Union, 1502 Cumberland Avenue, Knoxville, Tennessee, 37996, United States Prices: University: USD 299.00, Corporate: USD 599.00 Speakers: Donde Plowman, Chancellor University of Tennessee, Knoxville, Courtney Brown, Vice president of strategic impact and planning, Lumina Foundation, Erica Clark, Director of student innovation and entrepreneurship, University of Texas at San Antonio, Chotsani Williams, West Assistant vice president of diversity, equity, inclusion and belonging, Adelphi University, David Walden, Director of the Counseling Center, Hamilton College, Bridget Yuhas, Executive Director of the Institute for Well-being, Butler University","date_start":"2024-10-28","date_end":"2024-10-30","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education","Highered"],"location":{"virtual":"","full":["Knoxville","Tennessee United States"],"name":"","street":"","city":"Knoxville","state":"","ZIP":"","country":"Tennessee United States"},"organizers":["Times higher Education"],"societies":[],"indexes":[],"emails":[]}