{"name":"2nd Global Conference on Gender Studies","series":"","short":"","website":"https://www.genderconf.org","content":"Gender studies is an interdisciplinary field that draws on gender, feminist, and queer theories to offers updated knowledge about gendered practices, norms, and discourses. The 2nd Global Conference on Gender Studies will engage participants from across the globe in the exploration of multidisciplinary topics such as social construction and role of gender within various societies, the meaning of gender and sex in the past and modern societies, women’s contemporary and historical experiences, and the multiple social identities. The conference will include an intensive program, in the form of oral, virtual and poster presentations covering a very wide range of topics. In addition to this, participants will have an amazing opportunity to expand their academic networks during the sessions and the free city tour. The Organizing Committee will offer the participants a city tour free of charge, so learn about Copenhagen city. All accepted and registered papers will be published with ISBN numbers in soft form. All papers have publication opportunities in various indexed international journals: SCOPUS, DOAJ, EBSCO, GOOGLE SCHOLAR, COPERNICUS, and conference proceedings. The LGBTCONF will return as an in-person event in Copenhagen in Nov 2024 & also include the live-stream Virtual component for those who cannot join physically but wish to learn, connect, and network. Delegates can attend & present their papers either in person or online from wherever they are in the world. An Invitation Letter will be issued and sent after registration and payment of the registration fee.","date_start":"2024-11-01","date_end":"2024-11-03","important_dates":{"abstract":"","full":"2024-10-15","notification":"","final":""},"topics":["Social Sciences","Gender/Sexuality","Gender Studies (And Womens)","Women's Studies"],"location":{"virtual":"","full":["Copenhagen","Denmark"],"name":"","street":"","city":"Copenhagen","state":"","ZIP":"","country":"Denmark"},"organizers":["Acavent"],"societies":[],"indexes":[],"emails":[]}