{"name":"9th International Conference on Recent Trends in Mechanical Engineering","series":"","short":"RTME 2024","website":"https://rtme2024.org/ ","content":"9th International Conference on Recent Trends in Mechanical Engineering (RTME 2024) January 13 \\~ 14, 2024, Virtual Conference https://rtme2024.org/ SCOPE 9th International Conference on Recent Trends in Mechanical Engineering (RTME 2024) is an international forum for sharing knowledge and results in theory, methodology and new advances and research results in the fields of Automation and Engineering. The conference will bring together researchers and practitioners from both academia as well as industry to meet and share cutting-edge development in the field. The Conference welcomes significant contributions in all major fields of the Automation in theoretical and practical aspects. TOPICS OF INTEREST • Operations Management • Logistics and Supply Chain Management • Reliability and Maintenance Engineering • Total Quality Management and Quality Engineering • Artificial Intelligence and Expert Systems • Non-Traditional Machining processes • Machinability of Materials, Composite Materials Tribology • Design Tools, Cutting Tool Material and Coatings • Energy Conservation, Renewable Energy Techniques • Fluid Dynamics, Bio-fuels, Fuel Cells • CAD/CAM, Automation & Robotics • Advances of Aero space Technology • Transportation Systems Paper Submission Authors are invited to submit papers through the conference Submission System by December 30, 2023\\. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by International Journal on Bioinformatics & Biosciences (IJBB) series (Confirmed). Selected papers from RTME 2024, after further revisions, will be published in the special issue of the following journals Mechanical Engineering: An International Journal (MEIJ) International Journal of Advances in Biology (IJAB) Advanced Energy: An International Journal (AEIJ) Mechatronics and Applications: An International Journal (MECHATROJ) Advances in Materials Science and Engineering: An International Journal (MSEJ) IMPORTANT DATES • Submission Deadline: December 30, 2023 • Authors Notification: January 05, 2024 • Registration & Camera-Ready Paper Due: January 059, 2024 Contact Us Here's where you can reach us : rtme@rtme2024.org%or rtmeconfe@gmail.com","date_start":"2024-01-13","date_end":"2024-01-14","important_dates":{"abstract":"","full":"2023-12-30","notification":"","final":""},"topics":["Engineering & Technology","Electrical/ Electronic"],"location":{"virtual":"","full":["Online Event","Australia"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Australia"},"organizers":["RTME"],"societies":[],"indexes":[],"emails":["rtme@rtme2024.org","rtmeconfe@gmail.com"]}