{"name":"12th International Conference on Computational Science and Engineering","series":"","short":"CSE 2024","website":"https://cse2024.org","content":"12th International Conference on Computational Science and Engineering (CSE 2024) August 24 \\~ 25, 2024, Dubai, UAE https://cse2024.org/ Scope 12th International Conference on Computational Science and Engineering (CSE 2024) focuses on Complex systems, information and computation using mathematics and engineering techniques. This conference will act as a major forum for the presentation of innovative ideas, approaches, developments, and research projects in the area of Computation theory and applications. It will also serve to facilitate the exchange of information between researchers and industry professionals to discuss the latest issues and advancement in the area of advanced Computation and its applications will be covered during the conference. We expect that the conference and its publications will be a trigger for further related research and technology improvements in this important subject. The topics suggested by this conference can be discussed in term of concepts, surveys, state of the art, research, standards, implementations, running experiments, applications and industrial case studies. Authors are invited to submit complete unpublished papers, which are not under review in any other conference or journal in the following, but not limited to. Topics of Interest • Artificial Intelligence • Algorithms and Data Structures • Automata Theory • Big Data • Blockchain • Cloud Computing • Computational Complexity, Economics, Geometry • Computational Physics & Biology • Computational Science and Applications • Cryptography • Data Mining • Deep Learning • Information Theory • Internet of Things (IoT) • Machine Learning • Natural Language Processing • Networks & Communications • Parallel and Distributed Computing • Probabilistic Computation • Program Semantics and Verification • Quantum Computation • Robotics • Security • Signal & Image Processing • Software Engineering • Software Automation, Software as a Service (SaaS) • Theoretical Computer Science and Algebra Paper Submission Authors are invited to submit papers through the conference Submission System by August 10, 2024\\. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by Computer Science Conference Proceedings in Computer Science & Information Technology (CS & IT) series (Confirmed). Selected papers from CSE 2024, after further revisions, will be published in the special issue of the following journals • International Journal of Computer Science & Information Technology (IJCSIT) - INSPEC, WJCI Indexed • International Journal of Computer Science and Engineering Survey (IJCSES) • International Journal of Computer Science, Engineering and Information Technology (IJCSEIT) • Advanced Computing: An International Journal (ACIJ) • Information Technology in Industry (ITII) Important Dates • Submission Deadline : August 10, 2024 • Authors Notification : August 19, 2024 • Registration & Camera-Ready Paper Due : August 21, 2024 Contact Us Here's where you can reach us : cse@cse2024.org or cse\\_conference@yahoo.com Submission System: https://cse2024.org/submission/index.php","date_start":"2024-08-24","date_end":"2024-08-25","important_dates":{"abstract":"","full":"2024-08-10","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Engineering Science Technology","Engineering"],"location":{"virtual":"","full":["Dubai","Dubai United Arab Emirates"],"name":"","street":"","city":"Dubai","state":"","ZIP":"","country":"Dubai United Arab Emirates"},"organizers":["CSE 2024"],"societies":[],"indexes":[],"emails":["cse@cse2024.org","_conference@yahoo.com"]}