{"name":"World Congress on Pharmaceutics & Novel Drug Delivery Systems","series":"","short":"","website":"https://frigateconferences.com/pharma","content":"We are glad to welcome participants from around the globe to our upcoming “World Congress on Pharmaceutics & Novel Drug Delivery Systems” during November 14-15 2024 in Dubai, UAE. Frigate Conferences Specializes in executing successful conferences across the globe for the dissemination of knowledge among eminent scientists, researchers, institutions, and associations. Our scientific events help in bringing a massive change to the global health industry and in ensuring that future generations benefit from the diffusion of knowledge gained through such fruitful events. The conference invites Directors, Group Leaders, Professors, Associate Professors, Lecturers, Research Associates, Scientists, Investigators, and business delegates from Leading Universities, Pharmaceutical companies, Formulation Scientists, Medical Devices, Researchers, Health care professionals, across the globe to provide a better podium, interconnecting the latest research, technological developments in the arena as well as therapeutic aspects. Participating at the Novel Drug Delivery International conference will be an excellent opportunity to meet eminent personalities in the fields of pharmaceutics and learn about the latest technological advancements in Novel Drug Delivery systems. The scientific program includes Keynote & Plenary talks, Video Presentations, Poster Presentations, and E-Posters. Furthermore, oral communications of (post)doctoral junior scientists will be considered. It is the goal of the organizers to make this meeting an event of scientific excellence, attractive to both industrial and academic scientists in Pharmaceutical & Drug Delivery systems of Relevant Fields. Feel free to contact us for any further assistance/queries, Thanks & Regards Name: Jessica Jones | Project Manager Email: pharma@frigateevents.com Phone: +44-208 095 0177","date_start":"2024-11-14","date_end":"2024-11-15","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal","Pharmacology & Pharmaceuticals","Pharmacology & Pharmaceuticals"],"location":{"virtual":"","full":["Dubai","Dubai United Arab Emirates"],"name":"","street":"","city":"Dubai","state":"","ZIP":"","country":"Dubai United Arab Emirates"},"organizers":["Frigate Conference"],"societies":[],"indexes":[],"emails":["pharma@frigateevents.com"]}