{"name":"APIEx Symposium 2024 - A Focus on Valuation in Dispute Contexts","series":"","short":"","website":"https://apiex.org/events/events-calendar/eventdetail/54/-/apiex-symposium-2024-a-focus-on-valuation-in-dispute-contexts-28-nov-2024-1-00pm-6-00pm-gmt-8","content":"As the complexity of disputes has increased, the rigour and sophistication with which Courts and Tribunals assess valuations has also become more intense. APIEx is delighted to host a half day Symposium dedicated to valuations and supported by the Institute of Valuers and Appraisers, Singapore (IVAS), the Intellectual Property Office of Singapore (IPOS) and the International Valuation Standards Council (IVSC). The first session will look at the use of valuation standards in the context of disputes. There will be a presentation by the IVSC and the panel will provide insights to the potential benefits of applying International Valuation Standards. In the second session, our panel of practitioners will take an in-depth analysis of the information that could and should be used in a valuation. Following on from the APIEx Seminar “Ex Ante & Ex Post Assessments of Damages - Crystal Balls Vs. Rearview Mirrors? (19 Sept 2024)”, the panel will focus on the use of information after the valuation date and the circumstances where this may be appropriate. The final panel will discuss the valuation of intellectual property and explore the unique challenges and strategies to deploy in disputes, including the appropriate measure of damages where the terms of the IP protection has been breached and the guidelines which can be followed.","date_start":"2024-11-28","date_end":"","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["One Marina Boulevard","Singapore Singapore"],"name":"","street":"","city":"One Marina Boulevard","state":"","ZIP":"","country":"Singapore Singapore"},"organizers":["Asia Pacific Institute of Experts"],"societies":[],"indexes":[],"emails":[]}