{"name":"Pharmacovigilance UK & EU 2025","series":"","short":"","website":"https://virtueinsight.com/event/pharmacovigilance/#event-sponsors-partners","content":"37th Pharmacovigilance UK & EU 2025 “Ensuring safer drugs to market. Latest developments in PV” 12th & 13th February 2025, Sheraton Skyline, Heathrow, London This event will bring together top pharmaceutical, biotechnology and regulatory representatives under one roof that will address the key issues of the industry. Take a chance and make it count by attending our event to network with your peers, exchange expertise and experiences, and arm yourself with the latest information to take your department to the next level. Get more from the event, with a broader scope bringing the whole communications value chain together. Enjoy and make the best out of our dedicated networking drinks time, meet the leading international vendors showcasing the products of tomorrow in the co-located exhibition. Please contact Kavitha at E-mail - kavitha@virtueinsight.co.in or call +44 20 3509 3779 DELEGATE REGISTRATION: SUPER EARLY BIRD PRICE (Valid Till 15th November 2024) 1 Delegate @ £799 + VAT Group Discount @ £1598 + VAT (3 Delegates for the price of 2) EARLY BIRD PRICE (Valid from 16th November – 13th January 2024) 1 Delegate @ £999 + VAT Group Discount @ £1998 + VAT (3 Delegates for the price of 2) STANDARD PRICE (Valid from 14th January 2024) 1 Delegate @ £1299 + VAT Group Discount @ £2598 + VAT (3 Delegates for the price of 2) SPONSORS: Gold Sponsor - Cencora Pharmalex Silver Sponsor - HM Global Pharmacovigilance Consulting We have sponsorship opportunities available for the event, which gives you an opportunity to speak/exhibit, and create brand awareness. Here you can have a dedicated networking time, meet the leading international vendors and expand your knowledge of the latest business models. Please email to kavitha@virtueinsight.co.in for more details. KEY SPEAKERS: • FABIO DE GREGORIO, VP, Head of Drug Safety Europe, Shionogi Europe • ZINA SADEQ, Director, Regional PV & Alliance Management, Amicus Therapeutics • ROHAN MANE, Director, Safety Risk Management Centre of Excellence, Pfizer • VALENTINA MANCINI, Senior Director Pharmacovigilance, QPPV, Shionogi Europe • ABIDALI FAZAL, Safety Science Director, Roche • ERIKA BARBAROSIE, Associate Director Compliance R&D Quality, Gilead Sciences • MICHAEL BEAN, Senior Director, Regulatory Compliance, Johnson & Johnson • TANUJA HALADY, Senior Medical Director, Head of GPS Oncology Group III, Merck KGaA • TEA BABIC, Director, PV Audits and Inspections, Teva • EA MARIE HOLST, Director, Pharmacovigilance Compliance, Novo Nordisk • LEONARDO PEREIRA, Safety Director, Roche • YVONNE NANCIU, Country Head Pharmacovigilance Deputy EU QPPV, Bayer • STEPHANIE MILLICAN, Head of Immunology, Biocompatibility & Non-clinical Safety & Surveillance Group, MHRA • SABINE POLTERMANN, Head of Country Patient Safety Switzerland, Bristol-Myers Squibb • JOHN SOLOMON, Head of Pharmacovigilance - UK & Ireland, Sanofi • BEGUM BENLI PEKER, Head of Patient Safety Netherlands & EU Hub, Bristol-Myers Squibb • MINHAJ OBEIDULLAH, Global Head Governance & Risk, Novartis • LEA GALOVIC, Associate Director, Risk Management, Global Patient Safety & PV, Teva • MIRCEA CIUCA, Global Head Medical Safety, Organon • PAV RISHIRAJ, Director, Head of Pharmacovigilance, Ipsen • SUMIT MUNJAL, Global Head of Medical Safety, Otsuka Pharmaceuticals • RAJ BHOGAL, Sr. Director, R&D Business Strategy & Operations, Jazz Pharmaceuticals • ILARIA GRISONI, Exec Dir, Head of EU/INT PV & QPPV Office and EEA QPPV, Jazz Pharmaceuticals • MARK DANIELS, Director, Safety Physician, Medical Safety, Jazz Pharmaceuticals • RICHARD JELLEY, Sr Dir, Global Regulatory Strategy, Jazz Pharmaceuticals • CLAIRE BEGGS, Executive Director, Regulatory Affairs, INSPIRE, Jazz Pharmaceuticals • RAJ HANVESAKUL, Executive Director, Therapeutic Area Lead, Hematology/Oncology, Jazz Pharmaceuticals • TERESA SARAGOCA, Director, Regulatory Affairs & Technical Manager, ITALFARMACO • SUZANNE FONCIN, Head of Safety Analysis & Writing, UCB • PHILLIP EICHORN, Global Head of Drug Safety, Amryt Pharma • YUUNG YUUNG YAP, Head Legal Pharma Operations, Vifor Pharma • HEATHER MURPHY, Founder and CEO, HMGlobal Pharmacovigilance Consulting • RUDI SCHEERLINCK, Safety Strategy Lead – Oncology, Merck Group • MARGHERITA D’ANTUONO, EU-UK QPPV, Piramal • PETAR GJORGIEV, Global Safety Lead, Regeneron • PHILIP JONES, Disease Area Cluster Lead, CVMWH, SSRM, WMS, Pfizer • MARIANNE MOUNIR, Senior Global System Auditor, Bayer • SANJEEV SRIVASTAV, Signal Management Lead, BioNTech • ALEXANDER ROUSSANOV, International Partner, Life Sciences & Privacy, Arnold & Porter • SANDY EISEN, Chief Medical Officer, CNS Consult Plus more joining soon KEY THEMES DISCUSSED: • Market Trends - Critique & Ways Forward • Challenges / Opportunities • Patient Safety • RMP / REMS • Safety & Signal Detection • Automation in PV • Regulatory • Medical Devices • Impact of Technology AI, ML • Audits & Inspection • RWE / RWD • Outsourcing WHO SHOULD ATTEND: CEO’s, CTO’s, CIO’s, Presidents, VPs, Directors, Heads, Mgr’s, Scientific Advisors, Consultants of: Pharmacovigilance, Pharmacoepidemiology, Pharmacogenomics, Drug/Product Safety, Drug Development, Information & Clinical Data Management, Clinical Pharmacology, Clinical Safety, PSURs, RMP / REMS, RWE / RWD, Research & Development, Quality Assurance, Patient Safety, Signal Detection, Safety Surveillance, Outcomes Research, Data Analysis, Epidemiology, Medical Affairs, Regulatory Affairs & Compliance, Information technology, Sales & Marketing Get more from the event, with a broader scope bringing the whole communications value chain together. Enjoy and make the best out of our dedicated networking time, meet the leading international vendors showcasing the products of tomorrow in the co-located exhibition. Expand your knowledge of the latest business models and strategies in the high-level conference.","date_start":"2025-02-12","date_end":"2025-02-13","important_dates":{"abstract":"","full":"2025-02-11","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal","Pharmacology & Pharmaceuticals","Drug Development & Safety"],"location":{"virtual":"","full":["London","London United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"London United Kingdom"},"organizers":["Cencora Pharmalex, HM Global Pharmacovigilance Consulting"],"societies":[],"indexes":[],"emails":["kavitha@virtueinsight.co.in"]}