{"name":"Narratives of Displacement International Conference \"From Homeland to Hostland: Interdisciplinary Insights into Identity and Belonging”","series":"","short":"","website":"https://narrativesofdisplacement.lcir.co.uk","content":"The conference seeks to explore the narratives of displacement and to demonstrate the validity of a cross-disciplinary approach which brings together the historical, cultural, social and literary expertise in the handling of text. The conference will particularly focus on time and space representations and on treatment of the theme of cultural ambivalence and identity conflict. The subject of displacement will be regarded as both a migration, voluntary or forced, and a sense of being socially or culturally “out of place”. Papers are invited on topics related, but not limited, to: migrations and deportations (expatriation, expulsion, exile, etc.) journeys, pilgrimages, missions mobility and place rootlessness and taking root foreignness and indigeneity (re)settlement and (non)residence nomadism and place attachment hotels, guesthouses, shelters multiculturalism, interculturalism, transculturalism strangerhood and neo-cosmopolitanism Submissions may be proposed in various formats, including: Individually submitted papers (organised into panels by the committee) Panels (3-4 individual papers) Posters The conference aims to bring together scholars from different fields. We invite proposals from various disciplines including history, philosophy, sociology, anthropology, culture studies, media studies, political science, law, architecture, tourism, religious studies, literature, linguistics, psychology, etc. Paper proposal forms should be submitted to displacement@lcir.co.uk.","date_start":"2024-10-25","date_end":"2024-10-27","important_dates":{"abstract":"","full":"2024-07-15","notification":"","final":""},"topics":["Arts & Humanities","Philosophy","Interdisciplinary","Social Sciences"],"location":{"virtual":"","full":["Palma de Mallorca (Spain) /Online","Spain"],"name":"","street":"","city":"Palma de Mallorca (Spain) /Online","state":"","ZIP":"","country":"Spain"},"organizers":["London Centre for Interdisciplinary Research in collaboration with the University of Balearic Isla"],"societies":[],"indexes":[],"emails":["displacement@lcir.co.uk"]}