{"name":"37th Annual Selected Topics in Internal Medicine","series":"","short":"","website":"https://go.evvnt.com/2496297-0?pid=4868","content":"Mayo Clinic's Selected Topics in Internal Medicine (STIM) is a postgraduate course designed to update general internists, internist-subspecialists, family medicine specialists, and other primary healthcare professionals on selected internal medicine topics. Some of the most common problems encountered in clinical practice are represented. Course focus is clinical pearls and practice updates. Presentations are made by experts from various disciplines in internal medicine and faculty members are available during breaks to answer questions and to discuss cases with course participants. Upon completion of this activity, participants should be able to: Summarize recent updates, clinical studies, and new guidelines that impact practice in general medicine. Describe updated practice and clinical practice strategies. Describe management options for diabetes and evidence for new diabetic agents. Attendance at any Mayo Clinic course does not indicate or guarantee competence or proficiency in the skills, knowledge or performance of any care or procedure(s) which may be discussed or taught in this course. Fairmont Orchid 1 North Kaniku Drive Kamuela, HI 96743 United States Time: 7:00 AM - 12:00 PM Venue Details: Fairmont Orchid - Hawaii, 1 North Kaniku Drive, Waimea, Hawaii, 96743, United States Prices: General Admission Live: USD 1299.00, Point-of-Care Hands-on Pre-Course Workshop: USD 375.00, Hospital Medicine Pre-Course Workshop: USD 325.00 Speakers: Christopher (Chris) R. Stephenson, M.D., John B. Bundrick, M.D.","date_start":"2025-01-27","date_end":"2025-01-31","important_dates":{"abstract":"","full":"2024-06-24","notification":"","final":""},"topics":["Medicine & Health","Other"],"location":{"virtual":"","full":["Waimea","Hawaii United States"],"name":"","street":"","city":"Waimea","state":"","ZIP":"","country":"Hawaii United States"},"organizers":["Mayo Clinic School of Continuous Professional Development"],"societies":[],"indexes":[],"emails":[]}