{"name":"3rd International Conference on Social Sciences and Humanities in the 21st Century","series":"","short":"ICSH21","website":"https://www.icsh21.org","content":"Description Humanities and Social Sciences Conference 2025 Dates: May 23-25, 2025 Location: Munich, Germany Venue: Steigenberger Hotel München, Berliner Strabe 85, Munich, Germany Why Attend the 3rd International Conference on Social Sciences and Humanities in the 21st Century (ICSH21) 2025? Join us in Munich for ICSH21 2025, a premier event in a city known for its academic excellence and vibrant cultural scene. This conference is a must-attend for those eager to engage with thought leaders in the field of social sciences. ICSH21 provides a unique platform for presenting research, learning from peers, and expanding your professional network through meaningful interactions and collaborations. Key Highlights Connect with Global Experts: Attend presentations, panel discussions, and workshops led by leading researchers, scholars, and policymakers from across the globe. This is your opportunity to gain insights from and engage with those shaping the future of social sciences. Flexible Presentation Formats: Whether you’re presenting in person, virtually, or as a poster, ICSH21 2025 offers options to fit your preference. Listeners are welcome to join in and contribute to discussions without presenting. Networking Opportunities: Forge valuable connections with academics, practitioners, and fellow researchers from around the world. This conference creates the perfect environment to establish lasting collaborations and discover new research directions. Cultural Immersion in Munich: Experience the rich culture and history of Munich, the vibrant capital of Bavaria. Known for its art, science, and innovation, Munich offers a perfect backdrop to enjoy the conference while exploring one of Germany’s most dynamic cities. Publishing Opportunities: Presenters will have the chance to publish their research in the conference proceedings, complete with ISBN and DOI, and submit their work for consideration in peer-reviewed journals and edited volumes. Important Deadlines Abstract Submission Deadline: May 2, 2025 Notification of Acceptance: Within 7-14 days of submission Early Bird Registration Deadline: November 26, 2024 Early Registration Deadline: February 12, 2025 Late Registration Deadline: May 12, 2025 Conference Dates: May 23-25, 2025 Participation Options Oral Presenter: Share your research findings with an audience and engage in lively Q&A sessions. Poster Presenter: Display your research visually in an interactive format, allowing for more informal discussions. Virtual Presenter: Can’t make it to Munich? Present remotely via our online platform, ensuring your work reaches an international audience. Listener: Attend sessions, absorb new knowledge, and network with fellow attendees without the need to present.","date_start":"2025-05-23","date_end":"2025-05-25","important_dates":{"abstract":"","full":"2025-05-02","notification":"","final":""},"topics":["Social Sciences","Anthropology / Archaeology"],"location":{"virtual":"","full":["Munich","Germany"],"name":"","street":"","city":"Munich","state":"","ZIP":"","country":"Germany"},"organizers":["ACAVENT"],"societies":[],"indexes":[],"emails":[]}