{"name":"The 9th International Conference on New Energy and Future Energy Systems","series":"","short":"NEFES 2024","website":"http://www.intergridconf.org","content":"Hosted by Széchenyi István University, the 9th International Conference on New Energy and Future Energy Systems (NEFES 2024) will be held from July 29 – August 1, 2024, in Győr, Hungary. Based on the successful practices of the past eight events, NEFES 2016 in Beijing, NEFES 2017 in Yunnan, NEFES 2018 in Shanghai, NEFES 2019 in Macau, NEFES 2020, NEFES 2021 and NEFES 2022 Online via Microsoft Teams, NEFES 2023 in Matsue (Japan), NEFES 2024 will continue to provide a forum to bring together researchers, scientists, engineers, academics and graduate students from all over the world to present their latest research result and new ideas in terms of new energy and future energy systems. The series of plenary speeches, oral and poster presentations, workshops, discussions and networking events will keep participants engaged in learning and making new connections at NEFES 2024\\. Situated halfway along the road between Budapest and Vienna, Győr, with its 130,000 inhabitants, is one of the most fortuitously situated cities in Hungary. Close to the western border, located at a meeting point of major highways, railways, and three rivers (the Danube, Rába and Mosoni-Duna), Győr has for centuries been a strategic point between East and West for travellers in Cenral Europe. Győr is both modern - with a dynamic industrial base producing an impressive one tenth of the country’s exports - and ancient - the newly restored Baroque downtown of Győr is considered to be a cultural jewel. Notably, Győr is home to the Audi Hungaria Motor Company. Established in Győr since 1993, the Audi plant now ranks as the largest automotive plant in the world, developing and manufacturing engines for the parent company AUDI AG and other companies of the Volkswagen Group. Researchers and practitioners are encouraged to submit original, unpublished contributions. The topics of interest include but are not limited to new energy resources, advanced energy technology, energy management, smart grid, energy control and storage, new energy materials. Brief Conference Program: July 29th, 2024 (Monday) Registration July 30th, 2024 (Tuesday) Welcome and Keynote Speeches, Poster/Oral Presentations July 31st, 2024 (Wednesday) Invited & Oral Presentations August 1st, 2025 (Thursday) Field Visit Contact Information: Tel: +86-18071410263 Wechat: NEFESCONFERENCE Email: nefes@academicconf.com; nefes@intergridconf.org","date_start":"2024-07-29","date_end":"2024-08-01","important_dates":{"abstract":"","full":"2024-05-31","notification":"","final":""},"topics":["Engineering & Technology","Renewable Energy/Nuclear","Energy Conservation","Energy, Clean, Renewable"],"location":{"virtual":"","full":["Gyor","Hungary"],"name":"","street":"","city":"Gyor","state":"","ZIP":"","country":"Hungary"},"organizers":["Széchenyi István University"],"societies":[],"indexes":[],"emails":["nefes@academicconf.com","nefes@intergridconf.org"]}