{"name":"the 3rd Global Summit and Expo on Materials Science and Nanoscience","series":"","short":"GSEMSN2024","website":"https://www.thescientistt.com/2024/materials-science-nanoscience","content":"Dear Colleagues, It is a great pleasure to announce that The Scientistt will host the 3rd Global Summit and Expo on Materials Science and Nanoscience (GSEMSN2024) will be held in Bern, Switzerland during October 21-23, 2024\\. GSEMSN2024 aims to bring together the renowned researchers, scientists and scholars to exchange ideas, to present sophisticated research works and to discuss hot topics in the field and share their experiences on all aspects of Materials Science and Nanoscience. The GSEMSN2024 will be a 3 days event that means to gather the key players of the materials science and nanoscience community and related sectors. This event is launched with the aims to become an established event, attracting global participants, intent on sharing, exchanging and exploring new avenues of Materials Science and Nanoscience-related scientific and commercial developments. A wide-ranging scientific program consisting of plenary lectures, keynote lectures, Invited lectures, parallel sessions, as well as poster sessions for young scientists covering all topics in Materials Science and Nanoscience will be scheduled. This conference provides a wonderful opportunity for you to enhance your knowledge about the newest interdisciplinary approaches in Materials Science and Nanoscience. Moreover, the conference offers a valuable platform to create new contacts in the field of Materials Science and Nanoscience, by providing valuable networking time for you to meet great personnel in the field. We look forward to seeing you at GSEMSN2024 in Bern, Switzerland.","date_start":"2024-10-21","date_end":"2024-10-23","important_dates":{"abstract":"","full":"2024-04-22","notification":"","final":""},"topics":["Engineering & Technology","Material/Nanotechnology"],"location":{"virtual":"","full":["Bern","Bern Switzerland"],"name":"","street":"","city":"Bern","state":"","ZIP":"","country":"Bern Switzerland"},"organizers":["The Scientistt"],"societies":[],"indexes":[],"emails":[]}