{"name":"Pharma Anti-Counterfeiting, Serialisation & Supply Chain Security 2024","series":"","short":"","website":"https://virtueinsight.com/event/anti-counterfeiting-serialisation-supply-chain-security","content":"13th Annual Pharma Anti-Counterfeiting, Serialisation & Supply Chain Security 2024 06th & 07th February 2024, Sheraton Skyline, Heathrow, London This conference overviews and integrates the business and technical problems that pharmaceutical companies should be aware of in order to fight the major global problem of counterfeit medicines. In addition to discussion of the problems, this conference addresses serialisation, track and trace analytical techniques scientists use to detect counterfeits and identifying solutions to the threat of counterfeit medical products. Conference Sponsorship/Exhibit/Booth/Branding/Paid Speaking opportunities available. Please contact Kavitha at E-mail - kavitha@virtueinsight.co.in or call +44 20 3509 3779 DELEGATE REGISTRATION: SUPER EARLY BIRD PRICE (Valid Till 04th December) 1 Delegate @ £599 + VAT Group Discount @ £1198 + VAT (3 Delegates for the price of 2) EARLY BIRD PRICE (05th December 2023 - 10th Jan 2024) 1 Delegate @ 799 + VAT Group Discount @ 1598 + VAT (3 Delegates for the price of 2) STANDARD PRICE ( From 11th Jan 2024 ) 1 Delegate @ £1299 + VAT Group Discount @ £2598 + VAT (3 Delegates for the price of 2) KEY SPEAKERS: • LUIS PEREZ, Country Attache for UK, FDA Office of Criminal Investigations • SCOTT HUFFMAN, Associate Director, Forensics & Innovative Technologies, Bristol - Myers Squibb • JYRKI SYVAERI, Corporate Director Supply Chain Integrity, Boehringer Ingelheim • AYSE BAKER, VP of Corporate Regulatory Affairs, Corcept Therapeutics • MICHEL RUEGG, Associate Director, Supply Chain Management, MSD • HEIKO TREFZGER, Senior Business Analyst & Product Manager, Roche • MONIKA DERECQUE-POIS, Founder, Cetan (Former President, EMVO | European Medicines Verification Org) • JONATHAN BUISSON, Head of Public Affairs, Europe, Alliance Healthcare • MIKE ISLES, Executive Director, European Alliance for Access to Safe Medicines • SONIA QUEIROS, COO, European Medicines Verification Organisation (EMVO) • ANDREW MASTERSON, PIPCU Disruptions and Engagement Lead, City of London Police • VINEET KHANNA, Former Senior Vice President, Global Head of Supply Chain, Nestle • CAMERON MCKINNELL, Head of Tech - Supply Chain, Strategy, External Manufacturing, GSK • NEHA MEHTA, Regulatory CMC Facilitator, Novartis • WILFRID ROGE, Manager, Global Anti-Counterfeiting, Servier • DEMET TAZEGUL, Supply Chain Manager, Sanovel Pharmaceuticals • VLADIMIR SAPUNDZHIEV, Software Architect for Track & Trace Solutions, Sopharma • STEVEN USTEL, Anti-Piracy & Brand Protection Strategist, Stobbs • HALA JAWAD, Elected South East Regional PDA Union Rep, The PDA Union • LINCOLN TSANG, Partner, Ropes & Gray Plus more joining soon KEY THEMES DISCUSSED: • The latest on pharmaceutical counterfeiting - How pharma is fighting counterfeit drugs now? • Supply Chain Challenges in Pharmaceutical Manufacturing Companies • Pharmaceutical Anti-Counterfeiting: Combating the Real Danger from Fake Drugs • Market analysis – EU, US and RoW markets • Fraudulent pharmaceuticals: The legacy of anti-counterfeit packaging - So what’s the solution? • Securing the future – The new way forward for Pharma Supply Chain • Fight the FAKE – Protect Public • Impact of Technology – AI, Big Data, Blockchain • Fight against pharma counterfeiting must go deeper - How to fight this plague? • Packaging Techniques – Protecting your products • Understanding Pharmaceutical Serialisation Track and Trace: Enhancing Visibility and Safety • Protecting your brand and its reputation • Prioritising and protecting patients - Protecting Patients • Serialisation: The Next Frontier for Packaging Security and Traceability • Comparing the DSCSA and the EU/FMD • Utilize social media to educate the consumer to identify counterfeit drugs • How counterfeit medicines penetrate the legitimate supply chain • EU and USA: government policies & strategies - Comparing with RoW • Regulatory Perspective – Recent updates and Global developments • How can companies and gov work closely and together and its importance • Network in our combined exhibition and catering area Get more from the event, with a broader scope bringing the whole communications value chain together. Enjoy and make the best out of our dedicated networking time, meet the leading international vendors showcasing the products of tomorrow in the co-located exhibition. Expand your knowledge of the latest business models and strategies in the high-level conference.","date_start":"2024-02-06","date_end":"2024-02-07","important_dates":{"abstract":"","full":"2024-02-05","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal","Supply Chain Management (Logistics)","Pharmacology & Pharmaceuticals"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Colorcon"],"societies":[],"indexes":[],"emails":["kavitha@virtueinsight.co.in"]}