{"name":"13th International Conference on Research in Behavioral and Social Sciences","series":"","short":"","website":"https://www.icrbs.org/registration","content":"ICRBS returns for its 13th edition, reaffirming its status as a premier event in behavioral and social sciences. Over the past decade, it has evolved into a pivotal conference for professionals in these fields, aiming to enhance the learning environment for all participants. The conference covers a diverse array of significant topics, exploring the latest concepts, advancements, and challenges within these disciplines. The scientific committee, composed of esteemed academics and researchers, meticulously selects and organizes all conference topics. They maintain rigorous standards to ensure the quality and relevance of each submission, employing a double-blind peer-review process for academic integrity and authenticity. Each presentation will feature a Q&A session to foster detailed discussions, provide insights into specific research aspects, and propose innovative application strategies. Participants can also enjoy a complimentary one-day guided tour of the host city, combining cultural exploration with informal networking opportunities. Accepted abstracts will appear in the Conference Abstract Book, which will have an ISBN for reference. Full papers may be considered for publication in recognized international journals or as chapters in a book. Participants will also receive a certificate acknowledging their participation. Furthermore, attendees are invited to enjoy a complimentary one-day guided tour of the host city, providing an opportunity to discover its architecture and cultural highlights while engaging in informal networking.","date_start":"2025-12-06","date_end":"","important_dates":{"abstract":"","full":"2025-05-23","notification":"","final":""},"topics":["Social Sciences","Sociology","Humanities","Political Science"],"location":{"virtual":"","full":["Vienna","Vienna Austria"],"name":"","street":"","city":"Vienna","state":"","ZIP":"","country":"Vienna Austria"},"organizers":["https://acavent.com/"],"societies":[],"indexes":[],"emails":[]}