{"name":"The 11th International Conference on New Findings in Humanities and Social Sciences","series":"","short":"","website":"https://www.hsconf.org","content":"Prepare yourself for an enlightening experience at the 11th International Conference on New Findings in Humanities and Social Sciences, slated to unfold in the vibrant city of Bangkok, Thailand from November 8th to 10th, 2024! We’ve got a variety of options lined up to ensure this event is both enriching and memorable for all our attendees. First up, we’re treating participants to complimentary city tours. Take a break from the conference hustle and explore the beauty and culture of Bangkok—it’s on us! Now, let’s talk about getting your research out there. Whether you’re presenting a paper or just soaking up knowledge, we’ve got you covered. All registered papers will have the chance to be published in our Conference Proceedings or renowned international journals, with indexing on platforms like SCOPUS, DOAJ, and more. Can’t make it to Bangkok in person? No problem! We’re offering live-streamed virtual sessions so you can still join the conversation from anywhere in the world. From thought-provoking discussions on sociology and anthropology to deep dives into politics, law, and philosophy, there’s something for everyone at this event. Whether you’re passionate about communication studies, psychology, or language and literature, you’ll find like-minded individuals eager to connect and collaborate. As a special perk, in-person participants and speakers will receive a Letter of Invitation after registration, making it easier to plan your trip and secure your spot at this exceptional event. So mark your calendars and get ready to build connections with academic giants, researchers, industry professionals, and more. See you in Bangkok!","date_start":"2024-11-08","date_end":"2024-11-10","important_dates":{"abstract":"","full":"2024-10-21","notification":"","final":""},"topics":["Social Sciences","Other","Humanities","Social Sciences Research"],"location":{"virtual":"","full":["Bangkok","Thailand"],"name":"","street":"","city":"Bangkok","state":"","ZIP":"","country":"Thailand"},"organizers":["Acavent"],"societies":[],"indexes":[],"emails":[]}