{"name":"18th South-Eastern European Economic Research Workshop 19-20 November 2024, Bank of Albania, Tirana, Albania","series":"","short":"","website":"https://www.bankofalbania.org/Shtypi/Njoftimet_per_shtyp/Thirrje_per_aplikime_Workshop-i_XVIII_i_Kerkimeve_Ekonomike_te_Evropes_Juglindore_Tirane_19-20_nentor_2024.html","content":"The main aim of this workshop is to bring together central bankers, academics, market practitioners and policymakers from the SEE region and around the world to present and discuss their latest empirical research in economics and finance. The workshop aims to develop long-term collaborative relationships and encourage interaction among participants in their fields of interests. In line with our tradition, the workshop is open to multidisciplinary research and welcomes theoretical and empirical contribution on central bank relevant topics. Suggested topics:  Global challenges for domestic monetary and fiscal policy in an uncertain inflation and interest rate environment.  Supply, demand and the economy wide structural changes in post-pandemic economies and their policy implications.  The role of digitalization and innovation in transforming financial markets, risks and opportunities.  Income, wealth and inflation inequality, their implications for central bank policies.  Demographics and labor market structural changes and their impact on monetary and fiscal policies.  Transition towards sustainable practices, role of financial market and central bank. How to measure the impact and optimize CB policies?  Housing market risks, macro financial stability and the role of monetary and macro prudential policies.  Currency composition of international reserves, experiences from developed developing countries.","date_start":"2024-11-19","date_end":"2024-11-20","important_dates":{"abstract":"","full":"2024-09-20","notification":"","final":""},"topics":["Business","Economics","Banking","Economics & Econometrics"],"location":{"virtual":"","full":["Tirana","Albania Albania"],"name":"","street":"","city":"Tirana","state":"","ZIP":"","country":"Albania Albania"},"organizers":["Bank of Albania"],"societies":[],"indexes":[],"emails":[]}