{"name":"FOOD AND MEMORY 3rd International Interdisciplinary Conference (online)","series":"","short":"","website":"https://www.inmindsupport.com/food-and-memory","content":"onference online (via Zoom platform) ABOUT CONFERENCE: ​Researchers have long confirmed the importance of studying food-related issues in the past and in the present-day world. During our interdisciplinary conference, we are going to concentrate on the relationships between food and memory. In what sense – and in what circumstances – can food be regarded as an identity-building factor? What role does it play in shaping our individual and collective memories? How can food studies deepen our knowledge on the social and cultural aspects of our lives? Why are food memories so often related to important experiences of individuals and societies? We would like to discuss these and many other questions from a broad perspective, referring to the anthropological, psychological, sociological, historical, and esthetical research on food and memory. That is why we invite researchers representing various academic fields: anthropology, history, psychology, psychoanalysis, psychiatry, sociology, politics, philosophy, economics, law, memory studies, consciousness studies, literary studies, theatre studies, film studies, migration studies, gender studies, postcolonial studies, medical sciences, and cognitive sciences, to name w few. Different forms of presentations are encouraged, including case studies, theoretical inquiries, personal reflections, problem-oriented arguments, and comparative analyses. We will be happy to hear from both experienced scholars and young academics at the beginning of their careers, as well as doctoral and graduate students. We also invite all persons interested in participating in the conference as listeners, without giving a presentation. Our repertoire of suggested topics includes but is not restricted to: ​1\\. Individual experiences: Food memories Individual food preferences Food and identity “You are what you eat” Food and emotions Food and affects Food and abjection Food and sickness Food and mental health Food and the materiality of memory Food and nostalgia Food and/as trauma Food and ecstasy Food and/as epiphany Food in dreams 2\\. Interpersonal experiences: Food and love Food and sex Food and caregiving Food and poisoning Food as a tool of communication 3\\. Collective experiences: Food, memory and tradition Food habits Food ceremonies and rituals Food taboos Food and religions Food and language Food symbolism Food and cultural/social identity Culinary nationalisms Multiculturalism of contemporary cuisines Food and fashion Food and social status Food and inequalities Food and genocides Postmemory of food 4.Esthetical experiences: Food and memory in literature, film, theatre and visuals arts Food-related literary and cinematic genres Food in the media Food esthetics in popular culture Good taste ​Please submit abstracts (no longer than 300 words) of your proposed 20-minute presentations, together with a short biographical note, by 05 June 2024 to: conferencememory@gmail.com The conference language is English. Note: As our online conference will be international, we will consider the different time zones of our Participants. The conference will be held virtually via Zoom. Different forms of presentations (also posters) are available","date_start":"2024-06-27","date_end":"2024-06-28","important_dates":{"abstract":"","full":"2024-06-05","notification":"","final":""},"topics":["Social Sciences","Sociology","Life Sciences (Nature)","Health And Environment"],"location":{"virtual":"","full":["Online Event","Poland"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Poland"},"organizers":["University of Gdańsk, Poland"],"societies":[],"indexes":[],"emails":["conferencememory@gmail.com"]}