{"name":"Pharmacovigilance UK & EU 2024","series":"","short":"","website":"https://virtueinsight.com/event/pharmacovigilance","content":"34th Pharmacovigilance 2024 30th & 31st January 2024, SHERATON SKYLINE HOTEL LONDON HEATHROW, London, UK Virtue Insight is glad to invite people to attend as a delegate/sponsor for 34th Pharmacovigilance 2024 which is happening on 30th & 31st January 2024, London, UK. Please contact Kavitha at E-mail - kavitha@virtueinsight.co.in or call +44 20 3509 3779 DELEGATE REGISTRATION: Super Early (till 23rd Oct 2023) 1 Delegate - £799 + VAT 3 Delegates - £ 1598 + VAT Early Bird (24th Oct 2023 – 26th Dec 2023) 1 Delegate - £999 + VAT 3 Delegates - £ 1998 + VAT Standard (from 27th Dec 2023) 1 Delegate - £1299 + VAT 3 Delegates - £ 2598 + VAT SPONSORS: We have sponsorship opportunities available for the event, which gives you an opportunity to speak/exhibit, and create brand awareness. Here you can have a dedicated networking time, meet the leading international vendors and expand your knowledge of the latest business models. Please email to kavitha@virtueinsight.co.in for more details. KEY SPEAKERS: • KHAUDEJA BANO, Vice President, Combination Product Quality, Amgen • FABIO DE GREGORIO, Vice President, Head of Drug Safety Europe, Shionogi Europe • SUMIT MUNJAL, Vice President, Global Patient Safety Evaluation, Takeda Pharmaceuticals • TANUJA HALADY, Senior Medical Director, Head of GPS Oncology Group III, Merck KGaA • GEORGIA GAVRIILIDOU, Associate General Counsel (Executive Director), Amgen • JOHN SOLOMON, Head of Pharmacovigilance - UK & Ireland, Sanofi • YVONNE NANCIU, Country Head Pharmacovigilance, Bayer • PAV RISHIRAJ, Director, Head of Pharmacovigilance, Ipsen • MIJAL CHAVDA, Senior Director, Global Head of GxP Inspections & GVP Quality, Kyowa Kirin • RAJ BHOGAL, Sr. Director, R&D Business Strategy & Operations, Jazz Pharmaceuticals • VALENTINA MANCINI, Senior Director Pharmacovigilance, QPPV, Shionogi Europe • MICHAEL BEAN, Senior Director, BioResearch Regulatory Compliance, Johnson & Johnson • ALINA TUDOR, Senior Director, Pharmacovigilance, Kyowa Kirin International • PETAR GJORGIEV, Medical Director & Safety Risk Lead, Pfizer • JUDY BARRETTO, Global Process Owner, Signal Management Director, Roche • EVI MATHIOU, Legal, Compliance & Quality Director, Novo Nordisk • MARIANA CALZADA MIJANGOS, CHC Country Safety Head, Sanofi • YUUNG YUUNG YAP, Head Legal Pharma Operations, Vifor Pharma • DNYANESHWAR SANAP, EU/UK QPPV, Head Regional Pharmacovigilance, Glenmark • JOHN POUSTIE, EMEA Director Pharmacovigilance and UK QPPV, Haleon • MARIJA BRIEDE, Head of Pharmacovigilance, QPPV, Grindeks • DARIUS-JEAN NAMDJOU, Head of Regulatory Affairs & Pharmacovigilance, Immunic Therapeutics • FATIMA YOUSEF GHETHAN, Quality Culture & Implementation Manager, Executive Administration of Quality & Patient Safety, Makkah Healthcare Cluster (UAE) • DANIELA DI COSMO, Senior Safety Advisor, Global Safety, Ferring Pharmaceuticals • DIMITRIS ZAMPATIS, Global Program Safety Lead, Sandoz • GAURI UTTURKAR, Patient Safety Physician, UCB • GURPREET SINGH, Vice President, Global Head of Pharmacovigilance, Freyr • KAPIL BHUTADA, Senior Director, Inozyme Pharma • MARIA BEATRICE PANICO, Principal Consultant, Scendea • ALEXANDER ROUSSANOV, International Partner, Life Sciences and Privacy, Arnold & Porter Plus more joining soon KEY THEMES DISCUSSED: • Market trends and the way forward - Future of pharmacovigilance • Pharmacovigilance: What comes next for the industry? • Current Challenges & Opportunities in Pharmacovigilance - Pragmatic Approaches • Collaboration among all the parties (industry, regulators, patients, healthcare professionals, WHO, etc • Rethinking relationship between Sponsor, Site, CRO & Patients – Working together • Impact of Technology (AI / ML) • Quality, Safety, Signal Detection - Traditional and innovative approaches • Outsourcing Pharmacovigilance: Benefits of a Specialized Safety Partner • Pharmacovigilance & Risk Management - Current Status & Future Needs • Plan, develop and implement the PV Audit strategy plan • Medical devices – Increasing safety perspective • Prioritising patients in quest to achieve Patient Safety • Regulatory - EU and UK Regulations & Guidelines in Pharmacovigilance • Best practices & the way forward • Be part of a major networking opportunity Get more from the event, with a broader scope bringing the whole communications value chain together. Enjoy and make the best out of our dedicated networking time, meet the leading international vendors showcasing the products of tomorrow in the co-located exhibition. Expand your knowledge of the latest business models and strategies in the high-level conference.","date_start":"2024-01-30","date_end":"2024-01-31","important_dates":{"abstract":"","full":"2021-01-28","notification":"","final":""},"topics":["Business","Industry-Specific","Pharmacology & Pharmaceuticals","Drug Development & Safety"],"location":{"virtual":"","full":["London","United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Brookwood Global, Freyer"],"societies":[],"indexes":[],"emails":["kavitha@virtueinsight.co.in"]}