{"name":"The New Wave of AI in Healthcare 2024","series":"","short":"","website":"https://www.nyas.org/shaping-science/events/ai-in-healthcare","content":"In the rapidly evolving landscape of modern healthcare, novel digital health solutions featuring machine learning and artificial intelligence (AI) tools are transforming research, diagnostics, therapeutics, and patient and healthcare provider experiences. Staying informed of the latest technological advances can be challenging due to the speed of innovation. In collaboration with the Academy, the Windreich Department of Artificial Intelligence and Human Health at the Icahn School of Medicine at Mount Sinai will showcase the latest advances in AI- and data-driven technologies in healthcare in the second annual symposium. At “The New Wave of AI in Healthcare 2024,” leaders in the field will deliver cutting-edge keynote and plenary lectures, alongside poster presentations from early career investigators and students, on the latest innovations in the field. The symposium will also provide ample networking opportunities that pave the way for collaboration and discovery. Researchers across disciplines and sectors can advance their work in a contemporary venue in the heart of NYC, designed to foster dialogue and collaboration, propelling the field forward. Sign up today — registrations for last year’s symposium sold out! We invite abstract submissions for poster presentations, short poster pitches, and travel fellowship awards for early-career investigators. Submit an abstract and be part of a dynamic symposium at the forefront of AI in healthcare research. The deadline for submission is March 5, 2024\\. Presentation topics include -Large-scale Foundation Models for Healthcare -AI Ethics and Governance -Next-Generation Deep Learning for Healthcare -Digital Health -Machine Learning in Data-Driven Research in Healthcare Location: 345 Park Avenue South, NYC 10010","date_start":"2024-05-01","date_end":"2024-05-02","important_dates":{"abstract":"","full":"2024-04-16","notification":"","final":""},"topics":["Medicine & Health","Public-Health","Artificial Intelligence","Healthcare"],"location":{"virtual":"","full":["New York","New York United States"],"name":"","street":"","city":"New York","state":"","ZIP":"","country":"New York United States"},"organizers":["Icahn School of Medicine at Mount Sinai"],"societies":[],"indexes":[],"emails":[]}