{"name":"The 2024 14th International Conference on Business and Economics Research","series":"","short":"ICBER 2024","website":"http://www.icber.org","content":"Publication Information: Option 1: International Journal of Trade, Economics and Finance (IJTEF) Submissions will be peer-reviewed by conference committees, and accepted papers will be published in the International Journal of Trade, Economics and Finance. Abstracting/ Indexing: ProQuest, Crossref, Electronic Journals Library, EBSCO, and Ulrich's Periodicals Directory ISSN: 2010-023X (Print) Frequency: Bimonthly DOI: 10.18178/IJTEF IJTEF Template Download Link:http://www.ijtef.org/IJTEF\\_template.doc Option 2: Journal of Economics, Business and Management (JOEBM) Submissions will be peer-reviewed by conference committees, and accepted papers will be published in the Journal of Economics, Business and Management. Abstracting/ Indexing: CNKI, Electronic Journals Library, Ulrich's Periodicals Directory, MESLibrary, Google Scholar, and Crossref. ISSN: 2301-3567 (Print) Frequency: Quarterly DOI: 10.18178/JOEBM JOEBM Template Download Link:http://www.joebm.com/JOEBM\\_template.doc Conference Special Issue：International Journal of Services and Standards (IJSS) Selected papers will be recommended to the IJSS after successful registration and proper extension (at least 50% new content). For conference papers, please include the statement “This article is a revised and expanded version of a paper entitled \\[title\\] presented at \\[name, location and date of conference\\]” in the online system when you submit your manuscript, using the \"Notes for the Editor\" field. Abstracting/ Indexing: Scopus (Elsevier), Google Scholar, Academic OneFile (Gale), cnpLINKer (CNPIEC), DBLP Computer Science Bibliography, Expanded Academic ASAP (Gale) ISSN online: 1740-8857 ISSN print: 1740-8849 Guest Editors: Prof. Xiaodong Qiu, Beijing Jiaotong University, China and Prof. Ping Yin, Beijing Jiaotong University, China Link: https://www.inderscience.com/index.php More information, Please visit: http://icber.org/index.html","date_start":"2024-07-19","date_end":"2024-07-21","important_dates":{"abstract":"","full":"2024-06-05","notification":"","final":""},"topics":["Business","Economics","Business Management","Economics & Business Management"],"location":{"virtual":"","full":["Beijing","China"],"name":"","street":"","city":"Beijing","state":"","ZIP":"","country":"China"},"organizers":["Beijing University of Technology"],"societies":[],"indexes":[],"emails":[]}