{"name":"Pharma Regulatory Summit 2024","series":"","short":"","website":"https://virtueinsight.com/event/pharma-regulatory-2024","content":"7th Annual Pharma Regulatory 2024 21st March 2024, Hotel Kohinoor Continental Hotel, Mumbai, India The 7th Annual Pharma Regulatory Summit 2024 congregates foremost global pharmaceutical industry professionals and regulators to share their insights on technologies, approaches, and solutions that will drive innovation and quality for the medicines delivered to patients worldwide. This interactional setting with expert-led regulatory and industry presentations, and forums will ensure pharmaceutical industry professionals are expedient to develop and apply ingenious solutions in today’s global regulatory environment. Please contact me for Sponsor / Delegate at E-mail - kavitha@virtueinsight.co.in or M: +91 9361957193 SPONSORSHIP: We have more sponsorship opportunities available for both the events, which gives you an opportunity to exhibit/booth/speak and create brand awareness. Please email your interest and queries to kavitha@virtueinsight.co.in DELEGATE REGISTRATION: • Super Early Bird Discount Price (Valid till 20th January 2024) – INR 12,000 + GST (18%) per delegate • Early Bird Discount Price (21st January 2024 – 03rd March 2024) – INR 12,000 + GST (18%) per delegate • Standard Price (Valid from 04th March 2024) - INR 17,000 + GST (18%) per delegate KEY SPEAKERS: • MAYUR PARMAR, Drugs Inspector (Deputy Collector, Gujarat Government), FDA • AMIT PANDEY, Executive Vice President & General Counsel, GSK • PRABIR KUMAR PAL, Senior Vice President - Quality & Compliance, Alkem Laboratories • MUKESH KUMAR, Senior VP & Head, Clinical R&D, Cipla • PRATIK SHAH, Vice President - Medical Affairs, Bharat Serums and Vaccines • RASHMI HEDGE, Executive Vice President – Medical, GSK • GEETA SHANBHAG, VP - Pharmacovigilance & Medico-Regulatory Affairs, Ipca Laboratories • RAHUL GUPTA, Vice President, Regulatory Affairs, USV • BIJENDER MISHRA, Chief Information Security Officer (CISO), Alkem Laboratories • YASHMIN SHENOY, Senior Director - Regulatory Affairs, Sanofi • MILIND ANTANI, Leader, Pharma and Healthcare, Nishith Desai Associates • KEDAR SUVARNAPATHAKI, Director - Regulatory Affairs, Johnson & Johnson • DEVEN BABRE, Former Director Analytics & Benchmarking, GSK • HARSHAD KOTHAWADE, Director, Head of Regulatory Management & Trade Compliance India, South East Asia, ANZ, Merck Group • VAIBHAV SALVI, Director & Head – Clinical Study Unit, India and South East Asia, Sanofi • PRIYA CHATTERJEE, Head Regulatory Affairs - South Asia, Bayer • DILIP PAWAR, Global Head - Medical Affairs and Pharmacovigilance, Unichem Laboratories • POOJA THAKUR, Associate Director, Regulatory Intelligence & Reporting, Advanz Pharma • MARTINA GOMES, Head, Reg Affairs – CH, Bayer • AKSHAYA S. ODAK, Head Regulatory Affairs (Biotech), Lupin • SADANAND KULKARNI, Head- Medical, Regulatory, Vigilance & Quality South Asia, Fresenius Kabi • MAYUR MAYBHATE, Head Medical Affairs, Alkem Laboratories • GIRISH SANE, Section Head PV, Macleods Pharmaceuticals • JEGAN ISRAEL, Head of Quality & Compliance (General Manager), Zydus Group • KAVITA LAMROR, Partner, RWE & Digital Transformation, Maxis Clinical Sciences • SWEETY MATHEW, Regulatory Professional, RA CMC Biotech & Rare Disease, Novo Nordisk • NEELU GOEL, Regulatory Affairs - Head Business continuity & Compliance, Sun Pharma • APARNA PRABHUNE, Asst General Manager Regulatory Affairs, Wockhardt Plus more joining soon KEY THEMES DISCUSSED: • Current regulatory framework – contemporary developments at a glance - Making the best out of the situation • Outlining major legal challenges currently faced – Ways to cross these barriers • ‘One Quality One Standard’ - Proposal for linking State & Central Drug Regulatory bodies for their innovative processes • RWE / RWD - How it could be used to support regulatory decision-making • Current regulatory compliance issues & opportunities for regulatory authorities & industry • Impact of technology - How do digital applications conflict with the legal & regulatory landscape? • Recent Clinical development - Recent regulatory updates – The new normal • Remote trials – finally the reality – Regulations • Overcoming the main challenges of filing variations in India • \"Engaging Patients for Patient Safety\", \"Elevate the Voice of Patients\" • Evolving Predicaments in Regulations of Medical Devices • India, An Emerging Pivot for Biosimilars - A detailed glimpse into current streamlines & guidance • Drug Licensing & advancing approaches – proposal of exclusive bills for drug dealing authority • Quality audits to ensure compliance with regulatory requirements • Replacement of the surviving act by The New Drugs, Medical Devices and Cosmetics Bill, 2023 • Overcoming key challenges with product registration in India • Outlining key requirements for filing variations in India • Practical guidance for drug registration compliance in India • Navigating the best regulatory pathway for successful drug approval • Be part of a major networking opportunity WHO SHOULD ATTEND AND WHO YOU’LL MEET: This conference is specifically designed for pharma, biotech, CRO’s, Government and Regulators, Hospitals/Trial Sites, Technology & Solution Providers and medical device professionals responsible for: Regulatory Affairs, Regulatory Writing/Medical Writing/Publishing / Information/ Submissions, Document and eRecords Management, Drug Safety, Business Operations/Processing, Labelling, Clinical Trials Management/Data, Clinical Data, Outsourcing/Clinical Outsourcing/Vendor Management, Product Development, Quality Assurance/Quality Control,Patient recruitment companies, Government- Department of health, Non-profit organizations/ Association, Consultants. Get more from the event, with a broader scope bringing the whole communications value chain together. Enjoy and make the best out of our dedicated networking time, meet the leading international vendors showcasing the products of tomorrow in the co-located exhibition. Expand your knowledge of the latest business models and strategies in the high-level conference.","date_start":"2024-03-21","date_end":"","important_dates":{"abstract":"","full":"2024-03-20","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal","Pharmacology & Pharmaceuticals"],"location":{"virtual":"","full":["Mumbai","Maharashtra India"],"name":"","street":"","city":"Mumbai","state":"","ZIP":"","country":"Maharashtra India"},"organizers":["contact kavitha@virtueinsight.co.in"],"societies":[],"indexes":[],"emails":["kavitha@virtueinsight.co.in"]}