{"name":"Pharmacovigilance USA 2024","series":"","short":"","website":"https://usa-canada.virtueinsight.com/event/pharmacovigilance","content":"35th Pharmacovigilance USA 2024 02nd - 03rd May 2024, The Conference Center at Waltham Woods, Waltham (Boston-MA) After the successful journey of a series of 34 Pharmacovigilance conferences, Virtue Insight is proud to announce its 35th Pharmacovigilance 2024\\. We have been delivering the conference through close collaboration with the industry leaders for more than a decade. For the 2024 edition, the agenda includes a host of new and exciting features. Take a chance and make it count by attending this conference to network with your peers, exchange expertise and experiences, and arm yourself with the latest information to take your department to the next level. Please contact me for Sponsor / Exhibit / Booth / Delegate at E-mail - kavitha@virtueinsight.co.in or Call - +44 20 3509 3779 SPONSORSHIP: Silver Sponsor - Qinecsa We have more sponsorship opportunities available for the event, which gives you an opportunity to exhibit/booth/speak and create brand awareness. Please email to kavitha@virtueinsight.co.in for more details. DELEGATE REGISTRATION: Super Early Bird Price - Valid Till 04th March 2024 01 Delegate - $999 3 Delegates for the price of 2 - $1998 Early Bird Discount Price (Valid till 05th March 2024 - 8th April 2024) 01 Delegate - $1299 3 Delegates for the price of 2 - $2598 Standard Price (From 9th April 2024) 01 Delegate - $1499 3 Delegates for the price of 2 - $2998 KEY SPEAKERS: • MARIETTE BOERSTOEL - STREEFLAND, SVP, Worldwide Patient Safety Officer, Bristol-Myers Squibb • ELENA YURENEVA, Executive Director, Head of Medical Safety & Risk Management, Alnylam Pharmaceuticals • KHAUDEJA BANO, Vice President, Combination Product Quality, Amgen • WILLIAM A. BLUMENTALS, Sr. Director, Head of Pharmacoepidemiology, Sanofi • LINDA LUM, Director, Global Pharmacovigilance & Epidemiology, Bristol-Myers Squibb • RENA PANDIT, Executive Director, Global Patient Safety Head of PV Compliance & Training, Amgen • COLLEEN WALSH, VP, Global Patient Safety Operations, Alnylam Pharmaceuticals • KEELE WURST, Senior Director and Head, Safety Science, Epidemiology, GSK • SUZANNE MARINELLO, Senior Director, Risk Management & Patient Support Strategy, Chinook Therapeutics • TEODORA DOHERTY, Global Medical Safety (GMS), Medical Safety Officer, Janssen Research & Development • DAVID LILIENFELD, VP, Drug Safety & Pharmacovigilance, Elevar Therapeutics • CARMIT STRAUSS, Executive Director, Head of Risk Management and Organ Toxicity, Takeda Pharmaceuticals • BILL HADDOCK, VP, Pharmacovigilance & R&D Quality, Ovid Therapeutics • SUZANNE GUIDERA, Executive Director Pharmacovigilance Operations, Jazz Pharmaceuticals • BRIAN DREYFUS, Senior Director -Solid Tumor Oncology Epidemiology, Bristol-Myers Squibb • RAMONA BURRESS, Senior Director, Head of Patient Engagement & Insights, Takeda Pharmaceuticals • VIKALP KHARE, Director, Otsuka Pharmaceuticals • LAURA RAY RN, Director, Signal Detection Process Lead, Bristol-Myers Squibb • ANKA G. EHRHARDT, Director, Cell-Based Assays / Analytical Research & Development, Merck • LIN CHUNG, Director, Global Scientific and Regulatory Documentation, Bristol-Myers Squibb • RICHARD WOLF, Executive Director, PV Operations, CSL Behring • NANCY DUBOIS, Head of Global Patient Safety US, Merck-EMD Serono • HUMAIRA QURESHI, President, Qinecsa Solutions • NIRJHAR CHATTERJEE, Senior Medical Director, Global Safety Lead, Global Patient Safety Evaluation, Takeda Pharmaceuticals • SHARON REID, Director of Risk Management Center of Excellence, Pfizer • BEN LOCWIN, Vice President, Project Solutions, Black Diamond Networks • JAMES BUCHANAN, President, Covilance • KARTHIK BABU, CHC Global PV Operations Head, Sanofi • LINA OGBU, Medical Director Patient Safety & Pharmacovigilance, Arcus Biosciences • YILONG JIA, Senior Manager, Pharmacovigilance Informatics, Sunovion Pharmaceuticals • MAHA SAAD, Senior Director Drug Safety & Pharmacovigilancem, Atara Biotherapeutics • JESSICA VAUGHN, Attorney at Law, Wiley Rein • KELLY GEORGE, Director, Regulatory Policy and Intelligence, PwC • TAXIARCHIS BOTSIS, Assistant Professor, The Johns Hopkins University Plus more joining soon FOCUSES ON: • Creating a future ready Pharma Organisation • Pharmacovigilance: Emerging Markets - What comes next for the PV industry? • New Era of PV’s Challenges / Opportunities - Turning strategy into execution • Real World Data to Real World Evidence • Quality, Safety Evaluation & Signal Detection – Important Considerations - Analise to Adapt • Develop an aggregate safety assessment planning (ASAP) process – It’s importance • Pathways and programs for patient stakeholders to engage with FDA • Proper communication between - Sponsor – Site – CRO – Patients • PharmaTech – Modern technologies in pharmacovigilance - The way forward • AI, ML, & Blockchain - Benefits, challenges & future directions / Use in patient safety • Managing Pharmacovigilance Audits & Inspections • Automation in Pharmacovigilance: A Closer look at use cases • The What, Why, and How - Reduce Barriers and move towards prioritising patients • Next generation pharmacovigilance for enhanced patient safety • PV and Outsourcing - How to evaluate and implement sourcing alternatives? • Risk Management – Planning for a risk free tomorrow • Risk Evaluation and Mitigation Strategies (REMS): Lessons to learn today • Regulatory Updates – Transforming regulatory strategy to meet the evolving landscape • Best practices and lessons learnt - Moving forward positively • Be part of a major networking opportunity WHO SHOULD ATTEND: CEO’s, CTO’s, CIO’s, Presidents, VPs, Directors, Heads, Managers, Scientific Advisors, Consultants of: Pharmacovigilance, Pharmacoepidemiology, Pharmacogenomics, Drug/Product Safety, Drug Development, Information and Clinical Data Management, Clinical Pharmacology, Clinical Safety, Periodical safety update Reports, Risk Management, Research & Development, Quality Assurance, Patient Safety, Signal Detection, Safety Surveillance, Outcomes Research, Data Analysis, Epidemiology, Medical Affairs, Regulatory Affairs and Compliance, Information technology, Sales and Marketing. Get more from the event, with a broader scope bringing the whole communications value chain together. Enjoy and make the best out of our dedicated networking time, and meet the leading international vendors showcasing the products of tomorrow in the co-located exhibition. Expand your knowledge of the latest business models and strategies at the high-levelconference.","date_start":"2024-05-02","date_end":"2024-05-03","important_dates":{"abstract":"","full":"2024-05-01","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal","Drug Development & Safety","Pharmacology & Pharmaceuticals"],"location":{"virtual":"","full":["Boston","MA United States"],"name":"","street":"","city":"Boston","state":"","ZIP":"","country":"MA United States"},"organizers":["Qinecsa"],"societies":[],"indexes":[],"emails":["kavitha@virtueinsight.co.in"]}