{"name":"15th International Conference on Wireless, Mobile Network & Applications (WiMoA 2023)","series":"","short":"","website":"https://iccsea2023.org/wimoa/index","content":"15th International Conference on Wireless, Mobile Network & Applications (WiMoA 2023) December 23 \\~ 24, 2023, Sydney, Australia https://iccsea2023.org/wimoa/index Scope & Topics 15th International Conference on Wireless, Mobile Network & Applications (WiMoA 2023) is dedicated to address the challenges in the areas of wireless, mobile network issues & its applications. The Conference looks for significant contributions to the Wireless & Mobile computing in theoretical and practical aspects. The Wireless & Mobile computing domain emerges from the integration among Personal Computing, Networks, Communication Technologies, Cellular Technology and the Internet Technology. The modern applications are emerging in the area of Mobile ad hoc networks and Sensor Networks. This Conference is intended to cover contributions in both the design and analysis in the context of mobile, wireless, ad-hoc and sensor networks. The goal of this Conference is to bring together researchers and practitioners from academia and industry to focus on advanced wireless & Mobile computing concepts and establishing new collaborations in these areas. Authors are solicited to contribute to the conference by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in the following areas, but are not limited to. Topics of interest include, but are not limited to, the following:  Algorithms and Modeling for Tracking and Locating Mobile Users  Architectures, Protocols, and Algorithms to Cope with Mobile & Wireless Networks  Broadband Access Networks  Complexity Analysis of Algorithms for Mobile Environments  Cryptography, Security and Privacy of Mobile & Wireless Networks  Data Management on Mobile and Wireless Computing  Distributed Algorithms of Mobile Computing  Energy Saving Protocols for Ad Hoc and Sensor Networks  Information Access in Wireless Networks  Integration of Wired and Wireless Networks  Integration of Wired and Wireless Systems  Mobile Ad Hoc and Sensor Networks  Mobile Applications, Location-Dependent and Sensitive Applications  Nomadic Computing, Applications and Services Supporting the Mobile User  OS and Middleware Support for Mobile Computing and Networking  Performance of Mobile and Wireless Networks and Systems  Recent Trends in Mobile and Wireless Applications  Resource Management in Mobile, Wireless and Ad-Hoc Networks  Routing, and Communication Primitives in Ad Hoc and Sensor Networks  Satellite Communications  Service Creation and Management Environments for Mobile/Wireless Systems  Synchronization and Scheduling Issues in Mobile and Ad Hoc Networks  Wireless & Mobile Issues Related to OS  Wireless Multimedia Systems Paper Submission Authors are invited to submit papers through the conference Submission System by December 09,2023 (final call ).Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by Computer Science Conference Proceedings in Computer Science & Information Technology (CS & IT) series (Confirmed). Selected papers from WiMoA 2023, after further revisions, will be published in the special issues of the following journals  International Journal of Network Security & Its Applications (IJNSA) - ERA, WJCI Indexed  International Journal of Wireless & Mobile Networks (IJWMN) - ERA, WJCI Indexed  International Journal of Grid Computing & Applications (IJGCA)  International Journal of UbiComp (IJU)  International Journal of Ad hoc, sensor & Ubiquitous Computing (IJASUC)  International Journal of Advanced Smart Sensor Network Systems (IJASSN)  International Journal on AdHoc Networking Systems (IJANS)  Information Technology in Industry (ITII) Important Dates  Submission Deadline :December 09,2023( final call)  Authors Notification : December 15,2023  Registration & Camera-Ready Paper Due : December 19,2023 Contact Us Here's where you can reach us : wimoa@iccsea2023.org or wimoa@yahoo.com","date_start":"2023-12-23","date_end":"2023-12-24","important_dates":{"abstract":"","full":"2023-12-09","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics"],"location":{"virtual":"","full":["Sydney","Australia","Australia"],"name":"","street":"","city":"Sydney","state":"Australia","ZIP":"","country":"Australia"},"organizers":["cs&it"],"societies":[],"indexes":[],"emails":["wimoa@iccsea2023.org","wimoa@yahoo.com"]}