{"name":"2nd World Conference on Gender and Women's Studies","series":"","short":"GWSCONF","website":"https://www.gwsconf.org","content":"Join us at the 2nd World Conference on Gender and Women's Studies (GWSCONF) and be part of a transformative experience in the vibrant city of Manchester! GWSCONF is the premier platform for individuals seeking unique perspectives on a wide range of themes in the field of gender and women's studies. Taking place from October 18th to 20th, GWSCONF2024 promises to be an event that will empower, inspire, and shape the global discourse on gender equality and women's rights. This conference offers an exceptional opportunity to: • Establish new connections • Share your knowledge • Contribute to the global conversation Immerse yourself in an interactive environment where learning takes center stage, where you can share your own experiences and insights, and where you can network with a diverse and global group of peers. Whether you participate as a speaker or an attendee, Gender and Women's Conference 2024 guarantees a wealth of learning and networking opportunities. Your research and contributions will have a chance to shine, as all papers presented will be considered for publication in the Conference Proceedings, complete with an ISBN and a unique DOI number. Additionally, selected papers may be featured in renowned indexed international journals such as SCOPUS, Web of Science, DOAJ, EBSCO, Google Scholar, and Copernicus. GWSCONF 2024 offers both in-person and virtual options to accommodate all participants. While we encourage your physical presence to fully engage in the conference, the live-stream virtual component ensures that no one is left behind. Additionally, for international attendees, GWSCONF 2024 provides the opportunity to obtain an invitation letter to support your visa application, ensuring a smooth and hassle-free journey to join us at the conference. Join us and put your work in the spotlight, expand your network, learn from leading experts, and contribute to the advancement of gender and women's studies. Don't miss this opportunity to be part of something extraordinary while exploring the history and charm of the beautiful city of Manchester. We look forward to welcoming you to GWSCONF 2024!","date_start":"2024-10-18","date_end":"2024-10-20","important_dates":{"abstract":"","full":"2024-10-04","notification":"","final":""},"topics":["Social Sciences","Gender/Sexuality","Women's Studies","Gender Studies (And Womens)"],"location":{"virtual":"","full":["Manchester","United Kingdom"],"name":"","street":"","city":"Manchester","state":"","ZIP":"","country":"United Kingdom"},"organizers":["Proud Pen"],"societies":[],"indexes":[],"emails":[]}