{"name":"International Conference on Computational Creativity – Workshop CFP","series":"","short":"","website":"https://computationalcreativity.net/iccc24","content":"The 15th International Conference on Computational Creativity is soliciting proposals for workshops and tutorials to be held in association with the main ICCC conference. We welcome proposals for half-day, full-day and one-and-a-half-day workshops and tutorials on any aspect of computational creativity research whose focus area complements the topics discussed in the main conference. Workshops offer a great opportunity to exchange ideas, and a chance to drive broader adoption of your systems and methods. We welcome a diversity of formats, from academic workshops (with a process of peer review for submitted papers, managed by the workshop organisers) to traditional tutorials, as well as hands-on and practical workshops. Please feel free to contact the organisers to discuss the possibilities further. Topics can range from anything between theoretical or computational aspects of computational creativity, social and ethical implications, and/or focused artistic showcases. In the past, workshops at ICCC have covered a wide variety of focused areas and this is part of the strength of a workshop series. We will prioritise workshops that have a clear focus area, rather than a more general application area. This is to create a workshop program that is complementary to the conference. Please notice that all workshops will be academically self-contained: they should have their own organising committee and conduct their own peer review managed entirely by the workshop organisers. All peer-reviewed full papers of workshops accepted at ICCC’24 will be jointly published as a separate part of the conference proceedings or as part of CEUR-WS workshop proceedings. The venue has several rooms appropriate for a range of different types of workshops: including classic lecture rooms and showcase rooms with up to 8 projectors perfect for more artistically directed workshops/tutorials.","date_start":"2024-06-17","date_end":"2024-06-21","important_dates":{"abstract":"","full":"2024-01-14","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Computer Science","Interdisciplinary"],"location":{"virtual":"","full":["Jönköping","Sweden"],"name":"","street":"","city":"Jönköping","state":"","ZIP":"","country":"Sweden"},"organizers":["Association for Computational Creativity"],"societies":[],"indexes":[],"emails":[]}