{"name":"2nd International Conference on Information Technology, Control and Automation","series":"","short":"ITCAU 2024","website":"https://csitai2024.org/itcau/index","content":"2nd International Conference on Information Technology, Control and Automation (ITCAU 2024) December 28 \\~ 29, 2024, Dubai, UAE https://csitai2024.org/itcau/index Scope & Topics 2nd International Conference on Information Technology, Control and Automation (ITCAU 2024) is a peer-reviewed conference that publishes articles which contribute new results in all areas of Information Technology (IT), Control Systems and Automation Engineering. The conference focuses on all technical and practical aspects of IT, Control Systems and automation with applications in real-world engineering and scientific problems. The goal of this conference is to bring together researchers and practitioners from academia and industry to focus on information technology, control engineering, automation, modeling concepts and establishing new collaborations in these areas. Authors are invited to contribute to this conference by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in Information Technology, Control Systems and Automation. Topics of interest include, but are not limited to, the following: • Adaptive control • Applications of modelling in science and engineering • Automation systems • Computer controlled systems • Computer vision • Computational biology • Control devices and instruments • Control theory • Data mining • Design system and algorithm • Embedded systems • Fault detection and isolation • Flight control and surveillance systems • Genetic algorithms and evolutionary computing • Guidance control systems • Industry, military, space applications • Information technology • Information systems • Intelligent systems • Linear control systems • Mathematical modelling and control • Measurement systems • Multimedia systems • Networked control systems • Neural networks and fuzzy logic • Nonlinear control systems • Optimization theory • Optimal control • Process control and instrumentation • Robotics • Robust control • Scientific computing • Signal and Image Processing • Simulation • Soft computing techniques • Stochastic control and filtering • Systems and automation • System identification and control Paper Submission Authors are invited to submit papers through the conference Submission System by October 26, 2024\\. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by Computer Science Conference Proceedings in Computer Science & Information Technology (CS & IT) series (Confirmed). Selected papers from ITCAU 2024, after further revisions, will be published in the special issues of the following journals • International Journal of Instrumentation and Control Systems (IJICS) • International Journal of Control Theory and Computer Modeling (IJCTCM) • International Journal of Information Technology, Control and Automation (IJITCA) • International Journal of Chaos, Control, Modelling and Simulation (IJCCMS) • International Journal of Information Technology, Modeling and Computing (IJITMC) Important Dates • Submission Deadline : October 26, 2024 • Authors Notification : December 07, 2024 • Registration & Camera-Ready Paper Due : December 16, 2024 Contact Us Here's where you can reach us : itcau@csitai2024.org or itcau\\_conf@yahoo.com Submission System URL: https://csitai2024.org/submission/index.php","date_start":"2024-12-28","date_end":"2024-12-29","important_dates":{"abstract":"","full":"2024-10-26","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Information Technology Systems (It)","Cad/Cam, Automation & Robotics"],"location":{"virtual":"","full":["","United Arab Emirates"],"name":"","street":"","city":"","state":"","ZIP":"","country":"United Arab Emirates"},"organizers":["ITCAU 2024"],"societies":[],"indexes":[],"emails":["itcau@csitai2024.org","_conf@yahoo.com"]}