{"name":"Max Planck Society and Max Planck Law: Future of law","series":"","short":"","website":"https://www.mpg.de/en","content":"Time: 01:00 PM - 06:00 PM (Local Time Germany) Location: Max Planck Institute for Innovation and Competition, Marstallplatz 1, 80539 München Host: Max Planck Society and Max Planck Law Contact: info@law.mpg.de What impact will technology and digitalization have on the law? Is artificial intelligence a game changer? If so, what role can – or must – the law play? What legal questions does the climate crisis raise? How should the welfare state respond to the pressing social problems of our time? Join researchers from the Max Planck Law network to discuss these current and future challenges for legal studies at the #FUTUREOFLAW BarCamp. The #FUTUREOFLAW BarCamp is a unique opportunity for undergraduate and graduate students in and around Munich studying law or an adjacent field. Join researchers from the Max Planck Law network to discuss tomorrow’s important topics and learn from the cutting-edge research currently underway at the Max Planck Society’s various institutes for legal studies. We look forward to meeting and engaging with you. Please register! https://law.mpg.de/event/futureoflaw-barcamp-2024/#register-form Max Planck Law is a network of the nine Max Planck Institutes engaging in legal research. We are united by intra- and interdisciplinary openness and a strong focus on comparative and transnational research questions. Together, we run one of the world’s largest programs for doctoral students and postdocs in law.","date_start":"2024-11-07","date_end":"","important_dates":{"abstract":"","full":"2024-11-15","notification":"","final":""},"topics":["Education / Legal / Other","Law/Legal-Studies","Law And Legal Studies"],"location":{"virtual":"","full":["Munich","Germany"],"name":"","street":"","city":"Munich","state":"","ZIP":"","country":"Germany"},"organizers":["Max Planck Society and Max Planck Law"],"societies":[],"indexes":[],"emails":["info@law.mpg.de"]}