{"name":"International Conference “The Aesthetics of Decay: Creative Modes of Destruction”","series":"","short":"","website":"http://aesthetics.decay.lcir.co.uk","content":"Decay and destruction have long been sources of fascination, inspiration and contemplation in artistic and cultural contexts. From the crumbling ruins of ancient civilizations to the ravages of time on natural landscapes, from the haunting beauty of abandoned spaces to the transformative power of decay in artistic expression, this conference aims to explore the creative potential of decay and destruction across diverse disciplines and perspectives. Topics may include, but are not limited to: The representation of decay in arts, literature, film, and media Destruction as a creative act Urban decay and industrial landscapes Ruins and abandoned spaces Decay as a metaphor for social, political, and cultural decline Decay and memory: nostalgia, melancholy, and the passage of time Digital or technological decay and the aesthetics of obsolescence Environmental decay and ecological crisis The politics and ethics of decay: decay as resistance, decay as renewal Creative practices of destruction and renewal in architecture and design The aesthetics of abandoned spaces and the beauty of imperfection Decay as a psychological complexity and a physical inevitability We invite submissions of abstracts for paper and poster presentations that critically engage with the theme of the aesthetics of decay from various perspectives.","date_start":"2024-11-29","date_end":"2024-12-01","important_dates":{"abstract":"","full":"2024-07-15","notification":"","final":""},"topics":["Arts & Humanities","Philosophy","Interdisciplinary","Cultural Psychology"],"location":{"virtual":"","full":["Madeira (Portugal) / Online","Portugal"],"name":"","street":"","city":"Madeira (Portugal) / Online","state":"","ZIP":"","country":"Portugal"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":[]}