{"name":"International Conference on the Integration of Constraint Programming, Artificial Intelligence, and Operations Research","series":"","short":"","website":"https://sites.google.com/view/cpaior2024","content":"The 21st International Conference on the Integration of Constraint Programming, Artificial Intelligence, and Operations Research will be held in Uppsala, Sweden, from May 28 to May 31, 2024\\. Full info at: https://sites.google.com/view/cpaior2024/ The aim of the conference is to promote a space where researchers from Constraint Programming (CP), Artificial Intelligence (AI), and Operations Research (OR) present innovative techniques, new applications, and original cutting-edge ideas, thereby encouraging researchers from one area to learn from the others. Of particular interest to the conference are papers that integrate concepts and methodologies from these different fields, either proposing interesting new techniques for complex/practical problems or expanding our theoretical insights and cross-field understanding. However, high-quality original papers from a single area are welcome when also relevant to the other communities involved. The conference also strongly encourages regular papers or experience reports showcasing CP/AI/OR techniques on challenging real-world applications. The program committee invites submissions that include, but are far from limited to, the following topics: -- New methodologies in the interface between predictive and prescriptive pipelines, such as machine learning techniques applied to tackle optimization problems and, conversely, CP/OR techniques to address AI and machine learning tasks. -- Novel relaxation and inference methods based on constraint propagation, polyhedral techniques/cutting planes, convex/second-order conic optimization, graph-based algorithms, dynamic programming, and decision diagrams for optimization. -- New search perspectives involving enumeration/branch-and-bound strategies, innovative decomposition techniques (e.g., based on column generation/Benders), intelligent backtracking, incomplete search, and learning-based heuristics. -- Advanced integrated methods that expose new model transformations, communication strategies across MIP/CP/SAT solvers, distributed solution techniques, and solver selection (e.g., portfolio approaches). -- Innovative models and applications of CP/AI/OR techniques. -- Implementation or evaluation of CP/AI/OR techniques and optimization systems. Submissions are of two types: regular papers (submitted for publication and presentation) and extended abstracts (submitted for presentation only). The conference will recognize a distinguished paper award and a student paper award. \\*\\*\\* Instructions for Regular Papers \\*\\*\\* Regular papers present original unpublished work and can be of two types: -- long papers (at most 15 pages plus references) -- short papers (at most 8 pages plus references) Both long and short papers will undergo rigorous review and are subject to the same criteria of quality. Both types are also eligible for the distinguished paper or student paper award. Short papers are particularly encouraged for interesting and novel work in progress, for which the practical or theoretical relevance is not yet fully identified. The conference proceedings will be published in the Springer Lecture Notes in Computer Science (LNCS) series. All regular papers should be prepared and submitted in the format used for that series (LNCS instructions). Submission schedule for regular papers (both long and short): -- Abstracts: November 27, 2023 (AoE: anywhere on Earth) -- Full papers: December 4, 2023 (AoE) -- Rebuttal phase: January 15 – 18, 2024 (AoE) -- Notification: February 1, 2024 \\*\\*\\* Instructions for Extended Abstracts \\*\\*\\* Extended abstracts should be one or two pages in length and may present preliminary work or work already published in other outlets. The extended abstracts are submitted for presentation only (if accepted), and will not be formally published in the LNCS conference volume. A collection of the accepted extended abstracts will be published on the conference website. A submission representing work submitted or published in another outlet should state that outlet. Extended abstracts will be reviewed to ensure appropriateness for the conference. Submission schedule for extended abstracts: -- Extended abstracts: March 6, 2024 (AoE) -- Notification: April 3, 2024 \\*\\*\\* Submission Process \\*\\*\\* All regular papers and extended abstracts are to be submitted electronically in PDF format by following the instructions at EasyChair: https://easychair.org/conferences/?conf=cpaior2024\\. For any queries on the submission process, please contact the Program Chair Bistra Dilkina at cpaior2024@gmail.com .","date_start":"2024-05-28","date_end":"2024-05-31","important_dates":{"abstract":"","full":"2023-11-27","notification":"","final":""},"topics":["Physical Science & Math","Mathematics","Computer Engineering","Artificial Intelligence"],"location":{"virtual":"","full":["Uppsala","Sweden"],"name":"","street":"","city":"Uppsala","state":"","ZIP":"","country":"Sweden"},"organizers":["Quantum Technologies Group at Carnegie Mellon"],"societies":[],"indexes":[],"emails":["cpaior2024@gmail.com"]}