{"name":"Register for Software Architecture Conference 2024","series":"","short":"","website":"https://softwarearchitecture.live","content":"Third Edition Discover the latest strategies shaping software architecture. Join us as we explore innovative approaches for designing robust and resilient architectures in today’s dynamic digital landscape. Revolutionize your software development journey with the newest trends and techniques. Subscribe to C# Corner YouTube Channel (https://youtube.com/csharpcorner1) for more live shows and conferences like this. About The Event Learn The Newest Strategy of the Software Architecture. https://www.youtube.com/live/xGrO5D2cGbw Keynote Speakers -Bill Wolff Software Architect and Microsoft MVP -Rodrigo Díaz Concha Microsoft Regional Director | 16x Microsoft MVP (Azure & Developer Technology 33 Speakers speaking from all over the world Speakers 2024 Andres Sacco Technical Leader - TravelX Mohamed Ayoub Alouane CTO Academy at Adservio Chad Stewart Founder of TechIsHiring Nick Ruffilo Technology Manager at Ingram Content Group Rashmi Venugopal Senior Software Engineer, Netflix Lukas Vileikis Author, Security Evangelist & Database Expert Mahesh Chand Founder CSharpCorner Rishit Bhatia Senior Product Manager, .NET/C# Driver Siri Varma Vegiraju Software Engineer, Microsoft Aroh Shukla Regional Microsoft Cloud Architecture Lead (Manufacturing Industry) Naga Santhosh Reddy Vootukuri Software Engineering Manager - Microsoft Rijwan Aansari Microsoft & C# Corner MVP | Full Stack .Net Expert Yevgen Nebesov Independent Systems Architecture Consultant Marek Piasecki CEO & CTO of Madmaniak OÜ Alvin Ashcraft Sr. Content Developer, Microsoft Bill Wolff Software Architect and Microsoft MVP Koushik Sundar Vice President - Citi Soham Dasgupta Cloud Solution Architect Sandip Devarkonda Field CTO Madhu Patel AI Engineer at MCN Solutions Abhay Dutt Paroha Software Team Leader Edward Pollack Data Architect Alexander von Zitzewitz Founder and CEO of hello2morrow, Inc. Joseph Guadagno VP of IT at RT² & Microsoft MVP Jose Luis Latorre Millas Microsoft MVP & Software Architect Blaize Stewart​ Architect at Xebia​ Nikolay Sivko Founder & CEO @ Coroot Amira Bedhiafi Microsoft MVP Data Platform Egor Karitskii Head of IT Infrastructure at Wildberries Peter De Tender Business Program Manager at Microsoft Lucas Cariello Massena CTO, Cloud Solutions Architect, and Devprime Advocate Tural Suleymani Chief Software Engineering Consultant & C# Corner MVP Rodrigo Díaz Concha Microsoft RD and MVP","date_start":"2024-08-14","date_end":"2024-08-16","important_dates":{"abstract":"","full":"2025-05-05","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Software Engineering","Computer Science"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["C# Corner"],"societies":[],"indexes":[],"emails":[]}