{"name":"2nd International Conference on Computer Science, Engineering and Artificial Intelligence","series":"","short":"CSEAI 2024","website":"https://cseai2024.org/index","content":"2nd International Conference on Computer Science, Engineering and Artificial Intelligence (CSEAI 2024) May 11-12, 2024, Virtual Conference https://cseai2024.org/ Scope & Topics 2nd International Conference on Computer Science, Engineering and Artificial Intelligence (CSEAI 2024) will provide an excellent international forum for sharing knowledge and results in theory, methodology and applications of Computer Science, Computer Engineering and AI. The Conference looks for significant contributions to all major fields of the Computer Science, Engineering and AI in theoretical, practical aspects. The aim of the conference is to provide a platform to the researchers and practitioners from both academia as well as industry to meet and share cutting-edge development in the field. Authors are solicited to contribute to the Conference by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in the following areas, but are not limited to. Topics of interest include, but are not limited to, the following • Artificial Intelligence • Big Data • Computer Architecture and Real Time Systems • Database and Data Mining • Deep Learning • Dependable, Reliable and Autonomic Computing • Distributed and Parallel Systems & Algorithms • DSP / Image Processing/Pattern Recognition/Multimedia • Embedded System and Software • Internet of Things (IoT) • Machine Learning & Applications • Mobile and Ubiquitous Computing • Modeling and Simulation • Multimedia Systems and Services • Networking and Communications • NLP • Parallel and Distributed Systems • Security / Network security / Data Security / Cyber Security / Cryptography / Blockchain • Signal Processing / Image Processing/ Pattern Recognition / Multimedia • Bioinformatics • Soft Computing (AI, Neural Networks, Fuzzy Systems, etc.) • Software Engineering • Web and Internet Computing Paper Submission Authors are invited to submit papers through the conference Submission System by May 04, 2024(Final Call). Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by International Journal on Cybernetics & Informatics (IJCI) (Confirmed). Selected papers from CSEAI 2024, after further revisions, will be published in the special issue of the following journals. • Advanced Computing: An International Journal (ACIJ) • International Journal of Distributed and Parallel systems (IJDPS) • International Journal of Advanced Information Technology (IJAIT) • International Journal of Information Technology Convergence and Services (IJITCS) • Information Technology in Industry (ITII)- ESCI(WOS) Indexed Important Dates Second Batch : (Submissions after April 07, 2024) • Submission Deadline : May 04, 2024(Final Call) • Authors Notification : May 10, 2024 • Registration & Camera-Ready Paper Due : May 11, 2024 Contact Us Here's where you can reach us : cseai@cseai2024.org (or) cseaiconf@yahoo.com \\*\\*\\*\\*\\* The invited talk proposals can be submitted to cseai@cseai2024.org","date_start":"2024-05-11","date_end":"2024-05-12","important_dates":{"abstract":"","full":"2024-05-04","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Artificial Intelligence","Big Data Mining & Analysis"],"location":{"virtual":"","full":["Online Event","Australia"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Australia"},"organizers":["International Conference on Antennas, Microwave and Microelectronics Engineering (AMiMi 2024)"],"societies":[],"indexes":[],"emails":["cseai@cseai2024.org","cseaiconf@yahoo.com"]}