{"name":"LEAP HR: Higher Education 2025","series":"","short":"","website":"http://go.evvnt.com/2691260-0?pid=4868","content":"Mark your calendars for the return of LEAP HR: Higher Education taking place from January 27-29 in a brand-new location of Atlanta, GA! For the 7th year running, we will be uniting a community of the most future focused HR leaders for 3 days of unparalleled strategic dialogue. With an agenda designed by and for senior leaders working within higher education institutions, joining our LEAP community is your best chance to connect with like-minded leaders looking to overcome the same critical people challenges as you. Senior leaders from leading institutions of all types and sizes across the US will be sharing their best practice strategies. Join us in 2025 to uncover 20+ case studies with practical solutions to help rebrand your HR function and create genuine campus communities to attract and retain top talent while trialling new AI technologies to boost efficiency and decrease costs. Prices: Higher Education Institutions Pricing - Conference + Pre-Conference Focus Day: USD 3197.00, Higher Education Institutions Pricing - Conference Only: USD 2399.00, Solution Provider Pricing - Conference + Pre-Conference Focus Day: USD 5097.00, Solution Provider Pricing - Conference Only: USD 3699.00 Speakers: Amanda Bailey, Vice President Human Resources, Boston University, Cheryl Gochis, Vice President Human Resources, Baylor University, Cynthia Glass, Vice President Human Resources Management and Labor Relations, Fashion Institute of Technology, Dave Barnett, Chief Administrative Officer, DeVry University, Dr. Candy McCorkle Vice President of Diversity and Inclusion, Western Michigan University, Dr. Shanita Williams Vice President of People Experience and Inclusion. Southern New Hampshire University, Dr. Sheraine Gilliam, Vice President and Chief HR Officer, Stevens Institute of Technology, Gaston Reinoso, Chief Human Resources Officer, Associate Vice President and Vice Chancellor, University of Houston, Imogen Henderson, Head of Event Content, Leap HR, Jose Villalba, Vice President Diversity and Inclusion, Chief Diversity Officer, Wake Forest University, Julie Wood, Chief People Officer, Colby College, Kelli Murray, Executive Vice President for Strategy and Chief Administrative Officer, Barnard College, Lori Erickson, Assistant Vice President Human Resources, East Tennessee State University, Lynne Adams, Associate Vice President and Chief Human Resources Officer, University of Maryland, Baltimore County, Mackenzie Jordan Johnson, Assistant Vice President Learning and Organizational Development, Howard University, Meagan Decker, Associate Vice President Human Resources, Northern Arizona University, Melanie Murtha, Senior Director Employee Experience, Stevens Institute of Technology, Ramona Agrela, Chief Human Resources Officer and Vice Chancellor, UC Irvine, Tasha Hall, Assistant Vice President People Strategies and Planning, Howard University, Tim Danielson, Associate Vice Chancellor and Chief Human Resources Officer, University of North Carolina, Warren Petty, Ed.D., Vice President and Chief Human Resources Officer, Howard University Time: 12:00 pm to 2:20 pm","date_start":"2025-01-27","date_end":"2025-01-29","important_dates":{"abstract":"","full":"2025-06-27","notification":"","final":""},"topics":["Education / Legal / Other","Education","Higher Education"],"location":{"virtual":"","full":["Atlanta","Georgia United States"],"name":"","street":"","city":"Atlanta","state":"","ZIP":"","country":"Georgia United States"},"organizers":["Hanson Wade"],"societies":[],"indexes":[],"emails":[]}