{"name":"TECHSPO New York 2024 Technology Expo (Internet ~ Mobile ~ AdTech ~ MarTech ~ SaaS)","series":"","short":"","website":"https://techsponyc.com","content":"\"Where Business, Tech and Innovation Collide in NYC! TECHSPO New York 2024 is your chance to … – Check out exhibitors showcasing the next generation of technology & innovation. – Be inspired, amazed and educated on how these evolving technologies will impact your business for greater growth. – Interact with technology enthusiasts, build your network and reunite with your peers. The 10th annual TECHSPO New York, two-day technology expo returns May 16th and 17th, 2024 to the luxurious New York Marriott at the Brooklyn Bridge Hotel in New York City, NY. TECHSPO New York brings together some of the best developers, brands, marketers, technology providers, designers, innovators and evangelists looking to set the pace in our advanced world of technology. Watch exhibitors showcase the next generation of advances in technology & innovation, including; Internet, Mobile, AdTech, MarTech and SaaS technologies. Be prepared to be inspired, amazed and educated on how these evolving technologies will impact your business for greater growth. As part of TECHSPO New York is a limited attendance event, DigiMarCon East 2024 Digital Marketing, Media and Advertising Conference (https://digimarconmiddleeast.com). If the conference is where the learning, theory and inspiration happens, then the TECHSPO floor is where the testing, networking and product interaction takes place. For complete details visit https://techsponyc.com.\"","date_start":"2024-05-16","date_end":"2024-05-17","important_dates":{"abstract":"","full":"2024-05-15","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Information Technology Systems (It)","Software Engineering"],"location":{"virtual":"","full":["New York City","New York United States"],"name":"","street":"","city":"New York City","state":"","ZIP":"","country":"New York United States"},"organizers":["TECHSPO New York"],"societies":[],"indexes":[],"emails":[]}