{"name":"Second and Final Call - (SCOPUS / ISI) SOAS GLOCAL African Assembly on Linguistic Anthropology 2024","series":"","short":"","website":"https://glocal.soas.ac.uk/afala2024/cfp","content":"Theme Code and Commodification, as the New Decolonization Ikhodi kanye Nempahla, njenge-Decolonization Entsha The African context is complex, with a cultural diversity that far exceeds its geographical expanse. These diverse cultural scapes throughout the African continent and African diaspora globally overlap, yet so do African languages, dialects, sociolects, and genres. The infinitely diverse semiotics of these languages complexify that which is already complex. Central to this complexity of African languages, language varieties, and ethnoscapes, is the ubiquitous mixing of language and cultural codes, which form the materiality of African identities. Sociocultural code-mixing can be contested, yet language code-mixing is widely seen as mandatory, to embody progressive, liberal, and anti-conformist African ideologies. Speakers language code mixing ubiquitously across African contexts, creating a commodity with which to legitimize emergent identities, in acts of decolonization, subverting essentialist representation of an old and new African cultural heritage and language practices, while drawing on millennia of transition and transformation. Through the complexity of language code mixing, the speaker seeks to commodify cultural affordances, and in the process, to decolonize both region and mindset, as an interrogation of colonialist ideologies, and as a critical act of cultural and linguistic liberation. Such a liberation continuously re-emerges in the uniqueness of every African linguistic code, as a situated performance through which to reinvent each language variety as a fluid language scape. The mixing of language and cultural code is now a normative practice across African contexts, as vital to African politics of identity, and yet, it is complexified by new mobilities, technologies, migration, modalities, rewritten historiographies, colonized cum decolonized ideologies, scholarship, and so forth. This complexity of African cultural and linguistic practice makes for a fertile ethnography. Through the tools of linguistic cultural anthropology, then, we can reframe such an ethnography of the commodification of code and cultural context, to ground understandings of the decolonization of Africa.","date_start":"2024-12-04","date_end":"2024-12-07","important_dates":{"abstract":"","full":"2024-10-21","notification":"","final":""},"topics":["Social Sciences","Linguistics","Linguistic Anthropology","African Studies"],"location":{"virtual":"","full":["Pretoria","Gauteng South Africa"],"name":"","street":"","city":"Pretoria","state":"","ZIP":"","country":"Gauteng South Africa"},"organizers":["University of South Africa and GLOCAL at SOAS University of London"],"societies":[],"indexes":[],"emails":[]}