{"name":"International Conference on Humanities, Art and Social Studies","series":"","short":"HAS 2024","website":"https://has2024.org/index","content":"International Conference on Humanities, Art and Social Studies (HAS 2024) April 13 \\~ 14, 2024, Virtual Conference https://has2024.org/ Scope International Conference on Humanities, Art and Social Studies (HAS 2024) will provide an excellent international forum for sharing knowledge and new research results in all areas of humanities, art and social science. The conference focuses aims to promote interdisciplinary studies in humanities and social science and become the leading conference in humanities and social science in the world. The goal of this conference is to bring together researchers and practitioners from academia and industry to focus on areas of literary and social studies for a cross cultural exploration and subsequent innovation of subjects concerned and establishing new collaborations in these areas. Authors are solicited to contribute to this conference by submitting articles for the development of humanities and social science fields. The conference documents practical and theoretical results which make a fundamental contribution for the development of humanities, art and social studies. Topics of interest • Business studies • Communication studies Geography • Corporategovernance • Criminology, Cross-cultural studies Science, International relations • Culture and Ethics Studies • Demography, Development studies • Economics Linguistics Literature • Economics, Ethics, Geography, History • Education • Gender and Sexuality Studies • History theatre & dance • Humanities and social science such as anthropology • Industrial relations, Information • Language and Linguistics • Law, Linguistics, Library science • Literature • Media studies, Methodology • Paralegal, Performing arts(music) • Performing Art • Philosophy • Political science, Philosophy • Psychology, Population Studies • Public administration • Religion • Religious studies • Social welfare, Sociology • Visual Arts • Women studies and so on Archaeology Paper Submission Authors are invited to submit papers through the conference Submission System by April 06, 2024(Final Call). Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by International Journal of Information Science & Techniques (IJIST) series(Confirmed). Selected papers from HAS 2024, after further revisions, will be published in the special issue of the following journals. • International Journal of Advanced Information Technology (IJAIT) • Informatics Engineering, an International Journal (IEIJ) • International Journal of Education (IJE) • International Journal of Business Information Systems Strategies (IJBISS) Important Dates • Submission Deadline : April 06, 2024(Final Call) • Authors Notification : April 08, 2024 • Final Manuscript Due: April 12, 2024 Contact Us Here's where you can reach us : has@has2024.org or hasconf@gmail.com Submission Link : https://has2024.org/submission/index.php","date_start":"2024-04-13","date_end":"2024-04-14","important_dates":{"abstract":"","full":"2024-04-06","notification":"","final":""},"topics":["Engineering & Technology","Architectural/Environmental","Medical Education"],"location":{"virtual":"","full":["Online Event","Australia"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Australia"},"organizers":["International Conference on Humanities, Art and Social Studies (HAS 2024)"],"societies":[],"indexes":[],"emails":["has@has2024.org","hasconf@gmail.com"]}