{"name":"SupraBio 2024 International Symposium on SupraBiomolecular Systems, 8th edition","series":"","short":"","website":"https://premc.org/conferences/suprabiomolecular-systems","content":"The recent Nobel Prize attributed to Katalin Karikó and Drew Weissman for their discoveries concerning nucleoside base modifications that enabled the development of effective mRNA vaccines illustrates the immense potential of nanotechnology-based mRNA assemblies. Thus, recent developments in the field of biomolecular sciences have shown the scientific impact of the resulting systems to contribute to a wide spectrum of scientific disciplines, ranging from fundamental bioorganic chemistry to soft matter, and from chemistry to biology and medicine. SupraBio 2024 will focus on future directions and frontiers of fundamental research involving Biomolecules (Nucleic acids) and Bioconjugates self-assembly. Supramolecular systems involving biomolecules offer efficient approaches for numerous biomedical investigations and applications (novel therapeutic approaches, drug delivery, tissue engineering, etc). In the future, these promising systems will very likely provide tools for the development of advanced technologies in the field of biomedical applications. This 8th edition of the SupraBio focuses on the transversal nature of supramolecular and biomolecular systems, by offering an international forum on the latest advances in the field from basic to applied research. The symposium will be attended by around 200 leading international academic experts in the field of supra-molecular and biomolecular chemistry and biology. This edition will be widely open to students and the Graduate Program SITH is a partner of this event.","date_start":"2024-04-15","date_end":"2024-04-17","important_dates":{"abstract":"","full":"2024-02-09","notification":"","final":""},"topics":["Medicine & Health","Medical-Speciality","Materials Engineering And Nanotechnology","Polymer Chemistry"],"location":{"virtual":"","full":["Bordeaux","Gironde France"],"name":"","street":"","city":"Bordeaux","state":"","ZIP":"","country":"Gironde France"},"organizers":["/"],"societies":[],"indexes":[],"emails":[]}