{"name":"66th London International Youth Science Forum July 2025","series":"","short":"","website":"https://go.evvnt.com/2686127-0?pid=4868","content":"66th LONDON INTERNATIONAL YOUTH SCIENCE FORUM (LIYSF), July 2025 The annual London International Youth Science Forum (LIYSF) is a two-week summer course hosted at the renowned research university Imperial College London. Nobel prize winners and leading global scientists lecture to students through out. Students get the opportunity to visit world renowned researh labs across the UK. Our aim is to unite outstanding talent from all nations and provide a deeper insight into science and its applications for the benefit of all humankind. LIYSF President is Professor Clare Elwell of University College London and Royal Patron HRH The Princess Royal. LIYSF attracts 500 of the globe's leading young scientists, aged from 16-21 and visiting from over 80 countries. Along with an active social calendar and a focus on cultural education and forming lasting friendships, the program includes lectures, demonstrations from leading scientists and visits to industrial sites, research centres, scientific institutions, world-class laboratories and universities. The 66th LIYSF is held 23rd July to 6th August 2025 and applications are invited now for students are passionate in STEM aged 16-21 years old. The participation charge is £395 for the VIRTUAL online only progamme and £3,295 per student for the inclusive on-campus programme (including all accommodation, meals, science programme and visits for 15 days). Applications are open now and through until the end of May. For more information, visit www.liysf.org.uk URLs: Tickets: https://go.evvnt.com/2686127-2?pid=4868 Brochure: https://go.evvnt.com/2686127-4?pid=4868 Inquiries: https://go.evvnt.com/2686127-5?pid=4868 Date and Time: Wednesday, 23 July 2025 at 10:00 to Wednesday, 06 August 2025 at 10:00 Venue details: Imperial College London, Exhibition Road, London, England, SW7 2AZ, United Kingdom Price: Participation Fee/Charge: GBP 3295.00 Speakers: Professor Kevin Fenton CBE, Professor Kelly Chibale, Professor Sir Steven Cowley, Professor Freya Blekman, Professor Clare Elwell, Dr Jason Nurse","date_start":"2025-07-23","date_end":"2025-08-06","important_dates":{"abstract":"","full":"2024-10-31","notification":"","final":""},"topics":["Education / Legal / Other","Education"],"location":{"virtual":"","full":["London","England United Kingdom"],"name":"","street":"","city":"London","state":"","ZIP":"","country":"England United Kingdom"},"organizers":["London International Youth Science Forum CIC"],"societies":[],"indexes":[],"emails":[]}