{"name":"THE University Impact Forum- Climate Action | 11-12 September 2024 | Baku, Azerbaijan","series":"","short":"","website":"https://go.evvnt.com/2559891-2?pid=4868","content":"As Azerbaijan gears up to host COP29, THE is delighted to be holding the Climate Action Impact Forum in Baku in September 2024\\. The forum will convene an international array of university leaders, policymakers and industry trailblazers to assess how climate change is shaping the lived experiences of almost every individual, with current students and subsequent generations bearing the brunt of current and anticipated environmental disruption. Through diverse panel discussions and bespoke data masterclasses curated around SDG 13, delegates will receive first-hand knowledge from leading voices in the sector on how to bolster their research outcomes and institutional efforts. They will also have the opportunity to expand their network of colleagues who share their ambitions for expedited climate action. This single-track programme will focus on how universities must play a pivotal role in meeting the needs of these cohorts by making climate action a core institutional objective. Agenda themes: - Why the success of the UN's SDGs depends on SDG 13 (Climate action), and the role universities can play in supporting this - How universities can use their research outputs to put climate action at the core of their strategies - How universities can act as players to bring together key stakeholders to address climate change consequences - How universities can support under-represented groups in the fight against climate change - How universities can use their student pool to support the greenifying of industry and jobs URLs: Tickets: https://go.evvnt.com/2559891-0?pid=4868 Website: https://go.evvnt.com/2559891-3?pid=4868 Time: 2:00 PM - 5:15 PM Venue details: Azerbaijan State Oil and Industry University, 16/21 Azadliq Ave, Baku, Azerbaijan Prices: Early bird ticket: USD 149.00, Corporate: USD 249.00 Speakers: Fuat Keyman, Vice-president and director Istanbul Policy Center, Sabancı Universitesi, David Kereselidze, Co-founder and governing board member, New Vision University, Julia Carlow, Associate head of sustainability, American University of Sharjah, Josep M Vilalta, Director Global University, Network for Innovation, Katie Normington, Chief executive officer and vice-chancellor, De Montfort University, Nargiz Hajiyeva, Country director, British Council Azerbaijan, Samir Mammadov, Country representative Azerbaijan, United Nations Global Compact","date_start":"2024-09-11","date_end":"2024-09-12","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education","Energy And Sustainability"],"location":{"virtual":"","full":["Baku","Azerbaijan"],"name":"","street":"","city":"Baku","state":"","ZIP":"","country":"Azerbaijan"},"organizers":["Times Higher Education"],"societies":[],"indexes":[],"emails":[]}