{"name":"NCTE Annual Convention (#NCTE24) | Nov 21-24, Boston, MA","series":"","short":"","website":"https://go.evvnt.com/2579511-2?pid=4868","content":"Experience the foremost gathering for English language arts and literacy educators at the NCTE 2024 Annual Convention. This event offers a unique opportunity to participate in over 1,000 sessions led by industry experts, providing insights and inspiration to elevate your teaching. Network with educators from across the USA, enjoy diverse social and cultural events, and explore a wide array of publisher booths in the Exhibit Hall. Celebrate the achievements of your peers at the awards ceremony, and connect with a community of professionals who understand your challenges and share your dedication. Don't miss the chance to be part of this vibrant community at the NCTE Annual Convention in Boston, Massachusetts. As an added benefit, becoming an NCTE member makes you eligible for a USD $130 savings on early bird rates by registering before 16 October 2024, making this valuable experience even more accessible. URLs: Tickets: https://go.evvnt.com/2579511-0?pid=4868 Website: https://go.evvnt.com/2579511-2?pid=4868 Website: https://go.evvnt.com/2579511-3?pid=4868 Date and Time: On Thursday November 21, 2024 at 8:00 am to Sunday November 24, 2024 at 5:00 pm Venue details: Boston Convention and Exhibition Center, 415 Summer Street, Boston, Massachusetts, 02210, United States Category: Conferences | Education | Training Prices: NCTE Member (Early bird registration rate): USD 350.00, NCTE Member (Regular registration rate after Oct. 16): USD 450.00, Non-Member (Early bird registration rate): USD 480.00, Non-Member (Regular registration rate after Oct. 16): USD 540.00, Student - Members and non-members of NCTE (Early bird registration rate): USD 155.00, Student - Members and non-members of NCTE (Regular registration rate after Oct. 16): USD 175.00, Emeritus (Early bird registration rate): USD 175.00, Emeritus (Regular registration rate after Oct. 16): USD 200.00, Group Rate - 10 or more, per person (Early bird registration rate): USD 360.00, Group Rate - 10 or more, per person (Regular registration rate after Oct. 16): USD 475.00","date_start":"2024-11-21","date_end":"2024-11-24","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education"],"location":{"virtual":"","full":["Boston","Massachusetts United States"],"name":"","street":"","city":"Boston","state":"","ZIP":"","country":"Massachusetts United States"},"organizers":["NCTE Events"],"societies":[],"indexes":[],"emails":[]}