{"name":"8th International Conference on Materials Science and Engineering","series":"","short":"","website":"https://mse2024.org","content":"8th International Conference on Materials Science and Engineering (MSE 2024) May 11-12, 2024, Virtual Conference https://mse2024.org/ Scope 8th International Conference on Materials Science and Engineering (MSE 2024) will provide an excellent international forum for sharing knowledge and results in theory, methodology and applications impacts and challenges of Materials Science and Engineering. Authors are solicited to contribute to the Conference by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in the following areas, but are not limited to.. Topics of interest include, but are not limited to, the following • Art Conservation Science • Biomaterials, tissue engineering • Ceramics • Composites • Corrosion • Diffraction studies • Energy • Fracture of materials • Magnetic Materials • Materials for Electronics and Photonics • Materials Synthesis & Processing • Materials Theory, Computation, and Design • Mechanical Properties • Metals and Alloys • Nano materials, Nano particulates and Nano composites • Polymers • Self-Assembly • Solar Energy • Surfaces and Interfaces Paper Submission Authors are invited to submit papers through the conference Submission System by May 04,2024(Final Call). Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by International Journal of Advances in Materials Science and Engineering (IJAMSE) series (Confirmed). Selected papers from MSE 2024, after further revisions, will be published in the special issue of the following journals • International Journal of Advances in Materials Science and Engineering (IJAMSE) Important Dates • Submission Deadline: May 04, 2024(Final Call) • Authors Notification: May 09, 2024 • Registration & camera - Ready Paper Due May 10, 2024 Contact us Here's where you can reach us: mse@mse2024.org or mseconference123@gmail.com","date_start":"2024-05-11","date_end":"2024-05-12","important_dates":{"abstract":"","full":"2024-05-04","notification":"","final":""},"topics":["Engineering & Technology","Material/Nanotechnology","Material Science","Material Sciences"],"location":{"virtual":"","full":["Online Event","Australia"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Australia"},"organizers":["MSE 2024"],"societies":[],"indexes":[],"emails":["mse@mse2024.org","mseconference123@gmail.com"]}