{"name":"FOE 2025 | The Future of Education 15th Edition, International Conference On June 25 - June 27","series":"","short":"","website":"https://go.evvnt.com/2723180-2?pid=4868","content":"FOE 2025 | The Future of Education 15th Edition, International Conference The 15th Edition of the International Conference The Future of Education takes place: on 25 June 2025 | Online Event on 26 – 27 June 2025 |in Florence (Italy) The Conference brings together teachers, researchers, practitioners and project managers from all over the world to share findings, expertise and experience about innovative teaching and learning methodologies. Onsite participants are welcome in Florence for two full days of thought-provoking sessions, integrated by endless networking opportunities and social events. Online participants can contribute with asynchronous or synchronous online presentations. The latter will be delivered on 25 June via the Conference Virtual Platform. Call for Papers – Abstract submission Deadline: https://conference.pixel-online.net/FOE/callforpapers.php Presentation Modalities: - Onsite: Oral presentation, Poster Presentation - Online: Oral presentation, Asynchronous Presentation, Virtual Poster During the Conference: - All accepted papers will be presented onsite and online. - Questions and Answers sessions will follow each paper presentation. - Poster presentation sessions will be held onsite and online. - Networking opportunities will be organized. All accepted papers will be included in the Conference Proceedings e-book published with ISBN, ISSN and DOI codes. The publication will be sent to be reviewed for inclusion Web of Science and SCOPUS. The publication will also be included in Academia.edu and indexed in Google Scholar. Contact: foe@pixel-online.net Call for Papers: https://conference.pixel-online.net/FOE/callforpapers.php Video: https://youtu.be/GV3-gxOwFYo Valeria Gargiani - Pixel Conferences Secretariat Grand Hotel Mediterraneo, Lungarno del Tempio 44, Florence (Italy) Pixel International Conferences URLs: Tickets: https://go.evvnt.com/2723180-0?pid=4868 Website: https://go.evvnt.com/2723180-2?pid=4868 Date and Time: On Wednesday June 25, 2025 at 9:00 am to Friday June 27, 2025 at 6:00 pm Venue details: FH55 Grand Hotel Mediterraneo, 44 Lungarno del Tempio, Firenze, 50121, Italy Category: Conferences | Education Price: Free: USD 0.00","date_start":"2025-06-25","date_end":"2025-06-27","important_dates":{"abstract":"","full":"2025-01-22","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education"],"location":{"virtual":"","full":["Firenze","Italy"],"name":"","street":"","city":"Firenze","state":"","ZIP":"","country":"Italy"},"organizers":["Pixel International Conferences"],"societies":[],"indexes":[],"emails":["foe@pixel-online.net"]}