{"name":"16th International Conference on Applications of Graph Theory in Wireless Ad hoc Networks and Sensor Networks (GRAPH-HOC 2024)","series":"","short":"","website":"https://cseit2024.org/graphhoc/index","content":"16th International Conference on Applications of Graph Theory in Wireless Ad hoc Networks and Sensor Networks (GRAPH-HOC 2024) July 27 \\~ 28, 2024, London, United Kingdom https://cseit2024.org/graphhoc/index Scope 16th International Conference on Applications of Graph Theory in Wireless Ad hoc Networks and Sensor Networks (GRAPH-HOC 2024) will provide an excellent international forum for sharing knowledge and results in theory, methodology and applications of Computer Science, Engineering and Information Technology. The Conference looks for significant contributions to all major fields of the Computer Science and Information Technology in theoretical and practical aspects. The aim of the conference is to provide a platform to the researchers and practitioners from both academia as well as industry to meet and share cutting-edge development in the field. Topics of interest include, but are not limited to, the following • Algorithms for Scheduling and Resource Allocation Problems Algorithms for Topology Control and Power Assignment • Applications of Random Graph Theory in Ad Hoc Networks and Sensor Networks • Approximation Heuristics for NP-complete problems related to Ad Hoc Networks • Connectivity Analysis under Different Mobility Models • Data Gathering Algorithms and Protocols for Sensor Networks • Distributed extensions of centralized graph theoretic routing algorithms • Evacuation Routing Algorithms and Protocols for Vehicular Ad Hoc Data Gathering Algorithms • Secure Routing Algorithms and Protocols Based on Graph Theory Paper Submission Authors are invited to submit papers through the conference Submission System by March 30, 2024\\. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by Computer Science Conference Proceedings in Computer Science & Information Technology (CS & IT) series (Confirmed). Selected papers from GRAPH-HOC 2024, after further revisions, will be published in the special issue of the following journals. • International Journal of Ad hoc, sensor & Ubiquitous Computing (IJASUC) • International Journal of Advanced Smart Sensor Network Systems (IJASSN) • International Journal on AdHoc Networking Systems (IJANS) • Information Technology in Industry (ITII) Important Dates • Submission Deadline: March 30, 2024 • Authors Notification: May 30, 2024 • Registration & Camera-Ready Paper Due: June 07, 2024 Contact Us Here's where you can reach us: graphhoc@cseit2024.org (or) graphhoc\\_confe@yahoo.com For more details, please visit: https://cseit2024.org/graphhoc/index Submission Link: https://cseit2024.org/submission/index.php","date_start":"2024-07-27","date_end":"2024-07-28","important_dates":{"abstract":"","full":"2024-03-30","notification":"","final":""},"topics":["Engineering & Technology","Other","Networks"],"location":{"virtual":"","full":["United Kingdom","United Kingdom"],"name":"","street":"","city":"United Kingdom","state":"","ZIP":"","country":"United Kingdom"},"organizers":["GRAPH-HOC 2024"],"societies":[],"indexes":[],"emails":["graphhoc@cseit2024.org","_confe@yahoo.com"]}