{"name":"NPSE 2025 | New Perspectives in Science Education 14th Edition - International Conf","series":"","short":"","website":"https://go.evvnt.com/2535199-6?pid=4868","content":"The 14th Edition of the International Conference New Perspectives in Science Education will take place: on 19 March 2025 | Online Event on 20-21 March 2025 |in Florence (Italy) The event brings together teachers, researchers, practitioners and project managers from all over the world to share findings, expertise and experience about innovative science teaching and learning methodologies. Important dates: - 9 October 2024: abstracts submission deadline - 22 January 2025: papers submission (possibility to extend) - 19 March 2025: Conference day of the ONLINE EVENT - 20/21 March 2025: Conference days of the ONSITE EVENT IN FLORENCE (ITALY) Onsite participants are welcome in Florence for two full days of thought-provoking sessions, integrated by endless networking opportunities and social events. Online participants can contribute with asynchronous or synchronous online presentations. The latter will be delivered on 19 March via the Conference Virtual Platform. During the Conference: - All accepted papers will be presented onsite and online. - Questions and Answers sessions will follow each paper presentation. - Poster presentation sessions will be held onsite and online. - Networking opportunities will be organized. All accepted papers will be included in the Conference Proceedings e-book published with ISBN, ISSN and DOI codes. The publication will be sent to be reviewed for inclusion Web of Science and SCOPUS. The publication will also be included in Academia.edu and indexed in Google Scholar. Contact: science@pixel-online.net Call for Papers: http://conference.pixel-online.net/NPSE/callforpapers.php Video: https://youtu.be/EtINTHNZyjE URLs: Tickets: https://go.evvnt.com/2535199-0?pid=4868 YouTube: https://go.evvnt.com/2535199-2?pid=4868 Twitter: https://go.evvnt.com/2535199-3?pid=4868 Facebook: https://go.evvnt.com/2535199-4?pid=4868 LinkedIn: https://go.evvnt.com/2535199-5?pid=4868 Time: 9:00 AM - 7:00 PM Venue details: FH55 Grand Hotel Mediterraneo, 44 Lungarno del Tempio, Firenze, Toscana, 50121, Italy Price: General Admission: EUR 250.00","date_start":"2025-03-20","date_end":"2025-03-21","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Education / Legal / Other","Education","Education","Higher Education"],"location":{"virtual":"","full":["Firenze","Toscana Italy"],"name":"","street":"","city":"Firenze","state":"","ZIP":"","country":"Toscana Italy"},"organizers":["Pixel International Conferences"],"societies":[],"indexes":[],"emails":["science@pixel-online.net"]}