{"name":"SOAS GLOCAL and Wenner-Gren Foundation Workshop: Applying for an Engaged Research Grant","series":"","short":"","website":"https://glocal.soas.ac.uk/wg-workshops/#tab_workshop-1---23-feb,-2024n","content":"Proposal Writing for the Wenner-Gren Foundation: Applying for an Engaged Research Grant Host and Organized by The Wenner-Gren Foundation and GLOCAL at SOAS University of London Purpose and Structure The Wenner-Gren Foundation is committed to playing a leadership role in anthropology. We help anthropologists advance anthropological knowledge, build sustainable careers, and amplify the impact of anthropology within the wider world. Date: September 27, 2024 Registration: https://us02web.zoom.us/webinar/register/WN\\_moHrsl\\_8SD-8zUDUJE4qyA#/registration Sessions 1 - Time: 09:00 - 10:30 AM EST or 02:00 - 3:30 PM UTC Session 2 - Time: 09:00 - 10: 30 PM EST or 02:00 - 03:30 AM UTC (Next day/Sep, 28) Contact Person: Nhan Huynh Meeting Email: glocal@soas.ac.uk Workshop Website: https://glocal.soas.ac.uk/wg-workshops/#tab\\_workshop-1---23-feb,-2024n Workshop In this third workshop, we will discuss the Foundation’s support for engaged research. The past few years have forced anthropologists to reckon with their discipline’s history and the nature of the relationships they forge through their research. Anthropologists are now asking themselves hard and increasingly sophisticated questions about the ethical implications of the work they do. The best way to advance knowledge in anthropology is to draw on new sources of insight. The best way to ensure anthropological research has an impact is to make sure projects are meaningful for everyone involved. By supporting projects that are collaborative from the get-go, the Wenner-Gren Foundation hopes to demonstrate the value of this new approach to research for the field more generally. Join the Foundation’s president, Danilyn Rutherford, and her colleagues at the Foundation, for a workshop designed for applicants for the Engaged Research Grant. We will describe the program’s objectives, go over the criteria of evaluation, and offer tips on writing a winning proposal. In advance of the session, we will distribute excerpts from successful proposals to illustrate what it takes to answer the application questions in a convincing and compelling way. This will be a hands-on session with plenty of time for questions. #anthropology #Linguistics #Sociolinguistics #HigherEducation #Anthropological Linguistics #WennerGrenFoundation #AcademicEvent #Workshop #Webinar","date_start":"2024-09-27","date_end":"","important_dates":{"abstract":"","full":"2024-09-26","notification":"","final":""},"topics":["Social Sciences","Linguistics","Social Sciences Research","Linguistic Anthropology"],"location":{"virtual":"","full":["Online Event","United States"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United States"},"organizers":["Wenner-Gren Foundation and GLOCAL Unit at SOAS University of London"],"societies":[],"indexes":[],"emails":["glocal@soas.ac.uk"]}