{"name":"Clinical Trials Summit 2024","series":"","short":"","website":"https://virtueinsight.com/event/clinical-trials-2024","content":"15th Annual Clinical Trials Summit 2024 29th & 30th May 2024, Mumbai - India 15th Annual Clinical Trials Summit 2024 will provide a platform to discuss on the futuristic advancements in Clinical Trials and clinical research. This multidisciplinary program involves broad participation of people from Clinical Trials community who are focused on learning more about clinical research, Clinical Trials planning & management. This event opens discussion of timely topics of mutual theoretical and practical interest for clinical trial investigators who are developing new drugs and biologics. This groundbreaking platform continues the conversation between business, academics, patient advocacy, and regulatory agencies to discuss new methods and solutions to statistical challenges relevant to the design and analysis of Clinical Trials collaboratively in the real world. It is high time that we look into innovative strategies, new technologies, effective and quality collaborations to address these issues, which can cater to the needs of the patient and the industry. Please contact me for Sponsor /Exhibit/ Booth/Delegate at E-mail - kavitha@virtueinsight.co.in or M: +91 9361957193 DELEGATE REGISTRATION: Super Early Bird Price ( Valid until 3rd April 2024) - INR 14,000 + GST (18%) per delegate Early Bird Price ( Valid from 4th April 2024 – 10th May 2024) - INR 14,000 + GST (18%) per delegate Standard Price ( Valid from 5th April 2024)- INR 19,000 + GST (18%) per delegate SPONSORS: Exhibitor - Clinical Research Network India We have more sponsorship opportunities available for the event, which gives you an opportunity to exhibit/booth/speak and create brand awareness. Please email your interest to kavitha@virtueinsight.co.in KEY SPEAKERS: • MAYUR PARMAR, Drugs Inspector (Deputy Collector, Gujarat Government), FDA • SUYOG MEHTA, VP & Head - Medical Affairs & Clinical Research, India & Emerging Markets, Sun Pharma • ANIL KUKREJA, VP - Medical Affairs & Regulatory, AstraZeneca • SANDESH SAWANT, VP Medical Affairs & Head - Clinical Trials, Cipla • RAMESH JAGANNATHAN, Vice President, Medical Affairs, Bharat Serums and Vaccines • SHALINI MENON, Country Medical Director, South Asia, Sanofi • ANIRBAN ROY CHOWDHURY, AVP & Head- Global CoE for Clinical Data Management Biostatistics & Clinical Operations, Sun Pharma • VAIBHAV SALVI, Director & Head – Clinical Study Unit, India & South East Asia, Sanofi • RASHMI HEGDE, VP Medical Affairs, GSK • SHIRAZ KANDAWALLA, Associate Director Regulatory Affairs, Ferring Pharmaceuticals • VIPIN SETHI, Asst Vice President, Cadila • CHIRAG TRIVEDI, Global Head, Clinical Study Units (CSU) Early Operational Strategy, Sanofi • MILIND ANTANI, Leader, Pharma and Healthcare, Nishith Desai Associates • ANITHA K, Global Head Operations, GDO Data Operations, Novartis • YASMIN SHENOY, Director-Regulatory Affairs, Sanofi • ANUP PINGLE, Medical Director - Global Health Access, GSK • MUKESH GORI, Director ESP Engagement PV & PS, Novartis • DIVAKAR KOLLI, Director - Development Quality Assurance, Cipla • SUCHITA MORE, Associate Director Medical Affairs, MSD • ASHWANI PANDITA, GM Quality Management & Training, Global Clinical Research Operations, Glenmark Pharmaceuticals • VIVEK GUPTA, Associate Director - Strategic Engagements & Vendor Management - Clinical & Medical Affairs, Organon • SAKSHI SHRIVASTAVA DESAI, Associate Director International PV Strategy Realization, Johnson & Johnson • DILIP PAWAR, Director & Head Clinical Development and Medical Affairs, Unichem Laboratories • KAMLESH PATEL, Head - Medical Regulatory Clinical Research & Health Tech, Lupin • ROSHAN PAWAR, Head Medical Affairs, Alkem Laboratories • KEDAR NAYAK, Head - Clinical Development, GSK • INDU NAMBIAR, Head PV, Local Patient Safety Lead, Boehringer Ingelheim • SADANAND KULKARNI, Head - Medical, Regulatory, Vigilance & Quality (South Asia), Fresenius Kabi • DEVEN BABRE, Former Director Analytics & Benchmarking, GSK • RENUKA NEOGI, Head & Deputy General Manager – Global Clinical Quality Management, Sun Pharma • PRIYA CHATTERJEE, Head Regulatory Affairs - South Asia, Bayer Pharmaceuticals • VISHVAJIT M. KARANDIKAR, Business Unit (BU) Head -Parenteral Nutrition, Fresenius Kabi • NISHITH VYAS, Associate Director, R&D Strategic Sourcing and Vendor Management, Organon • GOPINATH MADHU, Senior Client Partner, Digital & Technology, Pfizer • SANKET NEWALE, Head Medical Affairs & Business Compliance, Wockhardt • MAYUR MAYBHATE, Head Medical Affairs, Alkem Laboratories • GODHULI CHATTERJEE, Senior Medical Advisor, India-South East Asia, Sanofi • INDRANIL PURKAIT, Senior GM -Medical Affairs, Ipca Laboratories • KAVITA LAMROR, Partner, RWE & Digital Transformation, Maxis Clinical • SHRADDHA BHANGE, Senior Medical Safety Lead, Sandoz • PRAVIN GHADGE, AVP and Head - India clinical research, Sun Pharma Laboratories • SEERA DILEEP RAJU, Senior Manager - ML & AI, MSD • KUSHAL SARDA, GM & Head, Medical Affairs, Clinical Research & PV, Shalina Healthcare • VISHWAS SOVANI, Founder Director, Pharmawisdom • VANDAN TRIPATHI, Sr Brand Manager (Digital), Cipla Plus more joining soon KEY THEMES: • Clinical Trials – Market Analysis: Opportunities & Challenges • Why Decentralisation is the future of Clinical Trials? • Decentralisation - Sustaining DCT adoption in a challenging economic environment • Challenges and risks for launching decentralized trials • Prioritising patients – Always placing patients first • Improving collaboration & transparency: The need for strong sponsor-vendor relationships • Clinical Trial Supply - What’s the new way forward? • Innovative methods for Clinical trial design • Inspection readiness - What to expect when you’re inspected? • Rising opportunities & challenges for a successful clinical trial management • How RWE / RWD is transforming Clinical Trials? Challenges & Opportunities? • Technology & Innovation – Impacts & Improvements on Patient Experience • Explore the Impact of DCT on clinical development & the evolution of audits • Creating an effective clinical trial site management • Outsourcing in clinical trials: How to build successful partnerships? • Collaborations between CROs and the Pharmaceutical Industry • Data Integrity and Data Management • End-to-end strategic partnership & managing communication gap in CROs • Ratification - New Drugs and Clinical Trial Rules 2023 • What regulatory changes & developments can help in advancement of Clinical Trials in India • Be part of a major networking opportunity WHO SHOULD ATTEND: CIOs, CEOs, CDOs, Vice Presidents, Presidents, Heads, Directors and Team Leaders from the following areas: Clinical Research & Development, Clinical Research Services, Clinical Operations, Clinical Data Management, Clinical IT, Clinical Trials , Medical Affairs, Regulatory Affairs, Compliance, Quality control / Assurance/GCP, Clinical Study Design, Safety Surveillance, Subject Recruitment, E-Clinical System Get more from the event, with a broader scope bringing the whole communications value chain together. Enjoy and make the best out of our dedicated networking time, meet the leading international vendors showcasing the products of tomorrow in the co-located exhibition. Expand your knowledge of the latest business models and strategies in the high-level conference.","date_start":"2024-05-29","date_end":"2024-05-30","important_dates":{"abstract":"","full":"2024-05-28","notification":"","final":""},"topics":["Medicine & Health","Pharmaceutical / Medicinal","Clinical Research","Clinical Pharmacology"],"location":{"virtual":"","full":["Mumbai","Maharashtra India"],"name":"","street":"","city":"Mumbai","state":"","ZIP":"","country":"Maharashtra India"},"organizers":["Clinical Research Network India"],"societies":[],"indexes":[],"emails":["kavitha@virtueinsight.co.in"]}