{"name":"35th DAAAM International Symposium, 2024","series":"","short":"","website":"https://daaam.info","content":"2nd Call (DAAAM 2024) is announced for 35th DAAAM Int. Symposium - Online Edition (24th-25th October 2024) 23rd DAAAM Scientific Book 2024 13th DAAAM International Doctoral School - Invited Lectures 3rd DAAAM International Advanced Robotics School (ARS-2024) Deadline for 2nd Call: 2024-09-27 Take advantage of the \"early bird\" discount\" DAAAM 2024 - Online Conference! Dear Authors, the 35th International DAAAM Symposium - 2024 will take place as a virtual online edition, hosted by Vienna University of Technology, Vienna, Austria, EU. We are indexed in Scopus | We are happy to tell you that the Proceedings of the 34th International DAAAM Symposium, 2023 has been indexed in Scopus! Please inform your colleagues. All papers are cross-referenced and are permanently accessible on the Internet over CrossRef for free of charge download. Curran Proceedings - New York is publishing on demand the book form of the proceedings. The book copy is available for purchase (for you and/or your library) at a significant DAAAM member discount here (https://www.proceedings.com/72396.html) . DAAAM Symposium - Virtual Online Edition | Encouraged by the huge success of previous virtual DAAAM Symposiums, we are proudly informing you that the preparations for DAAAM Week 2024 and the 35th DAAAM International Symposium are running excellent. The 35th DAAAM Symposium will be held online and hosted by Vienna University of Technology, Vienna, Austria, EU, under the auspices of Danube Rectors´ Conference during the period 24th-25th October 2024\\. We are looking forward seeing you online. More info about the symposium is available here (https://daaam.info/symposium/) .","date_start":"2024-10-24","date_end":"2024-10-25","important_dates":{"abstract":"","full":"2024-09-27","notification":"","final":""},"topics":["Engineering & Technology","Mechanical/Industrial","Automation Science","Robotics"],"location":{"virtual":"","full":["Online Event","Austria"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Austria"},"organizers":["DAAAM International Vienna"],"societies":[],"indexes":[],"emails":[]}