{"name":"The (SCOPUS/ISI) SOAS GLOCAL African Assembly on Linguistic Anthropology 2024","series":"","short":"","website":"https://glocal.soas.ac.uk/afala2024","content":"The GLOCAL AFALA 2024 theme, Code and Commodification, as the new Decolonization Ikhodi kanye Nempahla, njenge-Decolonization entsha describes a process deeply connected to the commodification of language and cultural identities throughout African regions, as fertile climates for Linguistic Anthropological attention. Here, the GLOCAL AFALA 2024 invites work that addresses the decolonization of African contexts through the complex appropriation of language and cultural code. To this, the conference selection committee invites abstracts and proposals addressing the contribution of cultural and linguistic mixing to the current decolonization of Africa, that is, the pinpointing of truths on identity, ethnicity, and nation, and a culturally complex Africa. While proposals and submissions must adhere to the theme Code and Commodification, as the new Decolonization, submissions can diversify the conversation through the complexity of the conference strands. The University of South Africa, hosting the GLOCAL AFALA 2024 in Pretoria, South Africa, is one of an interchanging series of annual hosts, and in this way, the GLOCAL global network expands to involve institutions worldwide. We thus welcome you to the AFALA 2024, the Annual African Assembly on Linguistic Anthropology in South Africa, and to the AFALA as a whole. ● Professor Nompumelelo Zodwa Radebe ● Chair African Assembly on Linguistic Anthropology, the GLOCAL AFALA 2024 ● Chair Department of Anthropology and Archaeology University of South Africa","date_start":"2024-12-04","date_end":"2024-12-07","important_dates":{"abstract":"","full":"2024-10-21","notification":"","final":""},"topics":["Social Sciences","Linguistics","Anthropology","Linguistics"],"location":{"virtual":"","full":["Pretoria","Gauteng South Africa"],"name":"","street":"","city":"Pretoria","state":"","ZIP":"","country":"Gauteng South Africa"},"organizers":["University of South Africa and GLOCAL at SOAS University of London"],"societies":[],"indexes":[],"emails":[]}