{"name":"International Social Sciences Conference","series":"","short":"","website":"https://issconf.org","content":"Calling all social scientists! The International Social Sciences Conference (ISSCONF) is your chance to delve into the latest trends and groundbreaking developments shaping the field. Held from October 4th to 6th, 2024, in the vibrant city of Brussels, Belgium, ISSCONF brings together a diverse community of researchers, scholars, educators, and scientists from around the world. Engage in stimulating discussions and gain fresh perspectives by interacting with leading minds in the social sciences. ISSCONF provides a platform to share your unique research findings and expertise, fostering collaboration and driving innovation within the field. You will also gain valuable insights from keynote speeches by renowned social scientists who will address pivotal topics shaping the future of the field. After the conference you have the chance to share your groundbreaking work with a global audience through publication opportunities in prestigious Scopus-indexed journals or get your research included in the conference proceedings with ISSN and DOI numbers, ensuring its lasting impact. ISSCONF will offer a complimentary guided tour (in-person attendees only), giving participants an opportunity to immerse in the rich history and culture of Brussels along with peers and colleagues. Last but not least, an official invitation letter will be issued for those who require a visa to facilitate your travel arrangements. Join us in Brussels or participate virtually! ISSCONF offers flexible options to meet your needs and preferences. Register today and become part of ISSCONF 2024!","date_start":"2024-10-04","date_end":"2024-10-06","important_dates":{"abstract":"","full":"","notification":"","final":""},"topics":["Social Sciences","Anthropology / Archaeology","Social Sciences","Education And Social Sciences"],"location":{"virtual":"","full":["Brussels","Belgium"],"name":"","street":"","city":"Brussels","state":"","ZIP":"","country":"Belgium"},"organizers":["Acavent"],"societies":[],"indexes":[],"emails":[]}