{"name":"ICBER 2024 : 2024 14th International Conference on Business and Economics Research","series":"","short":"","website":"https://www.icber.org","content":"Full Name: The 2024 14th International Conference on Business and Economics Research Abbreviation: ICBER 2024 Time: July 19-21, 2024 Venue: Beijing University of Technology, Beijing, China Conference official Website: http://www.icber.org/ The 14th International Conference on Business and Economics Research (ICBER 2024) will be held in Beijing University of Technology, Beijing, China during July 19-21, 2024\\. ICBER 2024 is organized by Beijing University of Technology, Technical supported by University of Wisconsin-Whitewater, USA and University of Saint Joseph, Macau, China. ICBER 2024 is a three-days event, which will provide an excellent international platform for the academicians, researchers, and industrial experts from around the world to share their research findings with the global experts. The event is also an opportunity for PhD students in this area to moot their dissertation works to a global audience. The key intention of this seminar is to provide opportunity for the global participants to share their ideas and experience in person with their peers expected to join from different parts of the world. In addition, this gathering will help the delegates to establish research and/or business relations and linkage for future collaborations in their career path. We hope that the outcome of this seminar will lead to significant contributions towards creation of new knowledge. The conference committee invites submissions of applied or theoretical research as well as of application-oriented papers on all the topics of ICBER. Papers submitted to ICBER 2024 are double blind peer reviewed by technical committee members and reviewers. About Beijing University of Technology Beijing University of Technology (simplified Chinese: 北京工业大学; traditional Chinese: 北京工業大學; pinyin: Běijīng Gōngyè Dàxué), also called Beijing Polytechnic University or Bei Gong Da (北工大), is recognized as one of the Project 211 universities. The University has established a multidisciplinary academic structure, offering a variety of programs and is involved in diversified research in the fields of Science, Engineering, Economics, Management, Liberal Arts, and Law. It is a Chinese Ministry of Education Double First Class Discipline University, with Double First Class status in certain disciplines. Keynote Speaker Assoc. Prof. Siew H. Chan, University of North Georgia, USA Dr. Siew H. Chan is an Associate Professor at the University of North Georgia, USA. Dr. Chan has embedded experimental tasks in computerized programs and designed research instruments to examine various behavioral research issues in the fields of accounting, business, and information systems. She has published one book chapter and 25 articles in journals such as Decision Sciences, Information and Management, International Journal of Information Management, Computers in Human Behavior, Journal of Information System, etc. All her published articles are listed on the Australian Business Deans Council journal list and cited in research articles. Dr. Chan is the Editor-in-Chief for International Journal of Services and Standards (IJSS) and served as the Research Topic Editor for Frontiers in Psychology. She is currently on the editorial board of International Journal of Accounting and Information Management. Dr. Chan has received several visiting research scholar grants from the government and universities in Asia. She also received a research fellowship from a prestigious institution in Asia. Further, Dr. Chan has received several invitations from institutions in Asia to conduct research workshops for faculty and doctoral students. She has conducted research workshops on behavioral research methods, psychological theories for potential research possibilities, from an interesting research question to successful publication, etc. In addition, she has taught several doctoral seminars at institutions in Asia and served as an external examiner for a doctoral dissertation at a research institution in Canada. Call For Papers \\*ECONOMICS Aggregate Demand & Supply Applied Economics Budget Deficits & Public Debt Comparative Economics Compound Interest Consumer Credit Econometrics Economic Development Economic Growth Economic Institutions \\*MARKETING Affiliate Marketing Brand Equity Community Management Content Marketing Customer Relationship Management Digital Branding Display Advertising Email Marketing Influencer Marketing Social Media & Services \\*BUSINESS Product Development Branding Business Administration Business Law Project Management Public-Private Partnerships Risk Management Sales & Marketing Corporate Communications Business Leadership More topics, please kindly check: http://www.icber.org/cfp.html Publication Information Option 1: International Journal of Trade, Economics and Finance (IJTEF) Submissions will be peer-reviewed by conference committees, and accepted papers will be published in the International Journal of Trade, Economics and Finance. Abstracting/ Indexing: ProQuest, Crossref, Electronic Journals Library, EBSCO, and Ulrich's Periodicals Directory ISSN: 2010-023X (Print) Frequency: Bimonthly DOI: 10.18178/IJTEF IJTEF Template Download Link:http://www.ijtef.org/IJTEF\\_template.doc Option 2: Journal of Economics, Business and Management (JOEBM) Submissions will be peer-reviewed by conference committees, and accepted papers will be published in the Journal of Economics, Business and Management. Abstracting/ Indexing: CNKI, Electronic Journals Library, Ulrich's Periodicals Directory, MESLibrary, Google Scholar, and Crossref. ISSN: 2301-3567 (Print) Frequency: Quarterly DOI: 10.18178/JOEBM JOEBM Template Download Link:http://www.joebm.com/JOEBM\\_template.doc Conference Special Issue：International Journal of Services and Standards (IJSS) Selected papers will be recommended to the IJSS after successful registration and proper extension (at least 50% new content). For conference papers, please include the statement “This article is a revised and expanded version of a paper entitled \\[title\\] presented at \\[name, location and date of conference\\]” in the online system when you submit your manuscript, using the \"Notes for the Editor\" field. Abstracting/ Indexing: Scopus (Elsevier), Google Scholar, Academic OneFile (Gale), cnpLINKer (CNPIEC), DBLP Computer Science Bibliography, Expanded Academic ASAP (Gale) ISSN online: 1740-8857 ISSN print: 1740-8849 Guest Editors: Prof. Xiaodong Qiu, Beijing Jiaotong University, China and Prof. Ping Yin, Beijing Jiaotong University, China Link: https://www.inderscience.com/index.php More information, Please visit: http://icber.org/index.html Submission Guidelines Full Paper (Publication & Presentation) 1\\. Not only your paper will be published in journal, but also be granted a chance for presentation 2\\. Follow the template when preparing your full paper. Abstract (Oral Presentation only, without publication) 1\\. You'll give an oral presentation at the conference if your abstract is accepted, but your paper will NOT be published. 2\\. Follow the template when preparing your abstract. Abstract Template Download Link: http://www.icber.org/Abstract%20Template.doc） Submission Method Please submit your full paper or abstract via http://confsys.iconf.org/submission/icber2024 Conference Brief Program Friday, July 19, 2024 10:00-17:00 Registration & Material Collecting 14:00-17:00 Zoom Testing (Online Presenters Only) Saturday, July 20, 2024 09:00-09:30 Operning Ceremony 09:30-12:10 Keynote Speeches 12:10-13:30 Lunch Break 13:30-18:00 Parallel Sessions 18:30-20:00 Welcome Banquet Sunday, July 21, 2024 09:30-12:00 Invited Speeches 13:30 -18.00 Parallel Sessions 18:30-20:00 Banquet Contact Us Conference Secretary: Ms. Roselyn Luo Phone: +86-15102825034 Email: icber@academic.net Working Hours: Monday-Friday 09:30-18:00","date_start":"2024-07-19","date_end":"2024-07-21","important_dates":{"abstract":"","full":"2024-05-20","notification":"","final":""},"topics":["Business","Finance","Business And Economics","Ecommerce"],"location":{"virtual":"","full":["Beijing","China"],"name":"","street":"","city":"Beijing","state":"","ZIP":"","country":"China"},"organizers":["Beijing University of Technology"],"societies":[],"indexes":[],"emails":["icber@academic.net"]}