{"name":"2024 Singapore Conference on Applied Psychology ‘LIVE’","series":"","short":"","website":"https://scap.ear.com.sg","content":"Who else wants an in-person conference? 2024 Singapore Conference on Applied Psychology ‘LIVE’ (SCAP 2024) 5-6 December 2024 Holiday Inn Singapore Atrium, Singapore Now is the best time to plan your trip to Singapore, one of the most Instagrammable places on earth! We’re pleased to announce that the 2024 Singapore Conference on Applied Psychology (SCAP 2024), organized by East Asia Research and supported by the Charles Sturt University & Singapore University of Technology and Design, will be a hybrid conference happening in Singapore from December 5-6, 2024! Learn from the masters of Applied Psychology at the premier conference for the global Applied Psychology community. The theme for SCAP 2024 is “Psychological Well-being”. We invite researchers and practitioners from all fields of psychology research and practice to present and discuss recent innovations, trends, concerns, practical challenges encountered and the solutions adopted in the field of Applied Psychology, with a special focus on ‘Psychological Well-Being’. This can include clinical and non-clinical psychological well-being and we encourage submissions that cross disciplines, for example psychological well-being in education and the workplace. Join us for SCAP 2024 at Holiday Inn Singapore Atrium, Singapore and walk away with powerful knowledge that will empower you to forge the path for the future of Applied Psychology. Limited seating may apply. ‘BUY TICKET’ now. Don’t wait – this rate won’t last long! SCAP Keynote Speakers: Dr. Brian Moore, Lecturer, Educational Psychology, School of Education, Charles Sturt University, Australia Dr. Samuel Chng, Head of Urban Psychology Lab, Lee Kuan Yew Centre for Innovative Cities, Singapore University of Technology and Design Publish in the Conference Book, ‘Applied Psychology Readings Book Subtitle: Selected Papers from Singapore Conference on Applied Psychology’, by Springer Nature Pte Ltd (2022, 2021, 2017, 2016 edition). All accepted abstracts will be published in ‘Singapore Conference on Applied Psychology 2024 Programme & Abstract Book’. 2022 edition is SCOPUS indexed! Enquiries: anthonytan@ear.com.sg Web address: https://scap.ear.com.sg Sponsored by: East Asia Research, Charles Sturt University and Singapore University of Technology and Design P.S. If you are representing an Association or an Institute of Higher Learning and would like to be a conference partner, please get in touch with us. Many benefits await you when joining us!","date_start":"2024-12-05","date_end":"2024-12-06","important_dates":{"abstract":"","full":"2024-07-11","notification":"","final":""},"topics":["Social Sciences","Psychology","Psychology","Behavioral Psychology"],"location":{"virtual":"","full":["Singapore","Singapore Singapore"],"name":"","street":"","city":"Singapore","state":"","ZIP":"","country":"Singapore Singapore"},"organizers":["East Asia Research, Charles Sturt University and Singapore University of Technology and Design"],"societies":[],"indexes":[],"emails":["anthonytan@ear.com.sg"]}