{"name":"2025 the 14th International Conference on Educational and Information Technology","series":"","short":"ICEIT 2025","website":"https://www.iceit.org","content":"Publication: 1\\. Accepted papers will be published into conference proceedings by IEEE. The proceedings will be submitted and reviewed by the IEEE Xplore and Ei Compendex and Scopus after the conference. View ICEIT IEEE History: http://www.iceit.org/history.html 2\\. Springer LNET Edited Volume (Lecture Notes in Educational Technology) Selected papers from Track 2 - Educational Models and Methods & Track 3-Inclusive Learning will be included in the Edited Volume ‘Exploring Innovations in Educational Technology’, which has been accepted by Springer. Final publication will be subject to the manuscript review by Springer. Those papers will be sent to indexing databaes like: Scopus, ACM Digital Library, ERIC, INSPEC, Norwegian Register for Scientific Journals and Series, SCImago. 3\\. SCIE & Scopus Journal Selected registered papers will be recommended and invited to publish an extended version on the following journals. Please make sure you have added at least 30-40% of a new contents. a. Education Science Abstracting/Indexing: Scopus, ESCI (Web of Science), Educational Research Abstracts, PscyInfo, and other databases. Journal Rank: JCR - 一区 Q1 (Education and Educational Research) / CiteScore - 一区 Q1 (Education) b. SCPE (Abstracting/Indexing: Scopus, EBSCO, dblp, CiteFactor, etc...) c. IJIET (Abstracting/Indexing: Scopus (CiteScore 2023: 2.8), INSPEC (IET), UGC-CARE List (India), CNKI, EBSCO, Google Scholar)","date_start":"2025-03-14","date_end":"2025-03-16","important_dates":{"abstract":"","full":"2025-02-01","notification":"","final":""},"topics":["Engineering & Technology","Computer/Informatics","Educational Technology","Information Science"],"location":{"virtual":"","full":["Guangzhou","China"],"name":"","street":"","city":"Guangzhou","state":"","ZIP":"","country":"China"},"organizers":["South China Normal University, China"],"societies":[],"indexes":[],"emails":[]}