{"name":"International Conference : \"Identity and Otherness in Film\" (Film Studies)","series":"","short":"","website":"https://www.lcir.co.uk","content":"Over the course of the 20th century and into the 21st, cinema, television, and related media have become increasingly central both to individual lives and to the lives of peoples, groups, and nations. Cinema has become a major form of cultural expression and films both reflect and influence the attitudes and behaviour of people, representing their tensions and anxieties, hopes and desires and incarnating social and cultural determinants of the era in which they were made. Cinema as a whole has historically offered a rich setting for understanding cultural interaction, however it functions within certain political and ideological limits. It offers fascinating source material for an examination of what, in the modern world, we understand as \"otherness\", the cinematic \"Other\" being constructed in terms of race, ethnicity, class, religion, gender or sexual orientation. This conference aims to consider film studies from a variety of critical, theoretical, and analytical approaches and to focus on how \"self-other\" relations are represented. Papers are invited on topics related, but not limited, to: Post-colonial discourses in the cinema Representations of femininity and masculinity Nationalism and multiculturalism Inclusiveness and belonging Orientalism vs globalisation Cinematic representation of the exotic Horror films and depiction of the supernatural Portrayal of homelessness and poverty Depicting environmental otherness The conference is addressed to academics, researchers and professionals with a particular interest related to the conference topic. Proposals up to 250 words should be sent to: film@lcir.co.uk","date_start":"2025-02-01","date_end":"2025-02-02","important_dates":{"abstract":"","full":"2024-09-15","notification":"","final":""},"topics":["Arts & Humanities","Other","Film & Cinema","Cultural Studies"],"location":{"virtual":"","full":["Online Event","United Kingdom"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"United Kingdom"},"organizers":["London Centre for Interdisciplinary Research"],"societies":[],"indexes":[],"emails":["film@lcir.co.uk"]}