{"name":"16th International Conference on Grid Computing (GridCom 2024)","series":"","short":"","website":"https://iccsea2024.org/gridcom/index","content":"16th International Conference on Grid Computing (GridCom 2024) November 16 \\~ 17, 2024, Zurich, Switzerland https://iccsea2024.org/gridcom/index Scope & Topics 16th International Conference on Grid Computing (GridCom 2024) Service-oriented computing is a popular design methodology for large scale business computing systems. Grid computing enables the sharing of distributed computing and data resources such as processing, networking and storage capacity to create a cohesive resource environment for executing distributed applications in service-oriented computing. Grid computing represents more business-oriented orchestration of pretty homogeneous and powerful distributed computing resources to optimize the execution of time consuming process as well. Grid computing have received a significant and sustained research interest in terms of designing and deploying large scale and high performance computational in e-Science and businesses. The objective of the meeting is to serve as both the premier venue for presenting foremost research results in the area and as a forum for introducing and exploring new concepts. Authors are solicited to contribute to the conference by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in the following areas, but are not limited to. Topics of interest include, but are not limited to, the following • Algorithms and Bioinformatics • Applications, Including E-Science and E-Business Applications • Architectures and Fabrics • Distributed and Large-Scale Data Access and Management • Core Grid Infrastructure • Peer to Peer Protocols in Grid Computing • Network Support for Grid Computing • Monitoring, Management and Organization Tools • Networking and Security • Performance Measurement and Modelling • Metadata, Ontology, and Provenance • Middleware and Toolkits for Grid Computing • Computing and Programming Models • Programming Tools and Environments • Distributed Problem Solving • Creation and Management of Virtual Enterprises and Organizations • Information Services • Resource Management, Scheduling, and Runtime Environments • Scientific, Industrial and Social Implications • QoS and SLA Negotiation • Grid Economy and Business Models • Autonomic and Utility Computing on Global Grids • Cluster and Grid Integration Issues • Web Services, Semantic Grid and Web 2.0 • Grid related Applications Paper Submission Authors are invited to submit papers through the conference Submission System by August 03, 2024\\. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by The proceedings of the conference will be published by Computer Science Conference Proceedings in Computer Science & Information Technology (CS & IT) series (Confirmed). Selected papers from GridCom 2024, after further revisions, will be published in the special issue of the following journals. • International Journal of Computer Networks & Communications (IJCNC) - Scopus, ERA, WJCI Indexed • International Journal of Grid Computing & Applications (IJGCA) • International Journal of Distributed and Parallel systems (IJDPS) • Information Technology in Industry (ITII) Important Dates • Submission Deadline : August 03, 2024 • Authors Notification : August 31, 2024 • Final Manuscript Due : September 17, 2024 Contact Us Here's where you can reach us ; gridcom@iccsea2024.org (or) gridcomconf@yahoo.com Submission System ; https://iccsea2024.org/submission/index For More Information Please Visit ; https://iccsea2024.org/gridcom/index","date_start":"2024-11-16","date_end":"2024-11-17","important_dates":{"abstract":"","full":"2024-08-03","notification":"","final":""},"topics":["Education / Legal / Other","Education","Signal Or Image Processing","Image Processing"],"location":{"virtual":"","full":["Online Event","Swaziland"],"name":"","street":"","city":"Online Event","state":"","ZIP":"","country":"Swaziland"},"organizers":["gridcom"],"societies":[],"indexes":[],"emails":["gridcom@iccsea2024.org","gridcomconf@yahoo.com"]}